{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 23\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97748\nArtículo 34.  Resolución de concesión.\n1.  La resolución de la concesión de las ayudas, se llevará a efecto dentro de los seis \nmeses siguientes a la finalización del plazo de presentación de solicitudes, si perjuicio de \nla interrupción durante el período de evaluación al que se refiere el artículo 24.1.\n2.  Las puntuaciones obtenidas por los solicitantes en cada uno de los criterios tenidos \nen cuenta para la selección podrán consultarse en la aplicación informática disponible en \nInternet para la presentación de solicitudes a través del acceso como usuario y con la \nclave asignada, respetándose en todo caso la Ley de Protección de Datos Personales.\n3.  La documentación de las solicitudes desestimadas o denegadas podrá retirarse \npor los interesados en el plazo de tres meses a partir de la publicación en el Boletín Oficial \ndel Estado de la resolución de concesión de becas; pasado ese plazo, aquellas solicitudes \nque no se hayan recogido serán destruidas.\n4.  La adjudicación de las ayudas correspondientes a renuncias de los beneficiarios \nincluidos en la relación provisional, se producirá en el orden establecido en la relación de \nsuplentes, a la vista de la financiación disponible y teniendo en cuenta los recursos que \npudieran resultar favorables.\nCAPÍTULO IV\nMemorias anuales de seguimiento de las ayudas\nEl seguimiento anual de las ayudas se realizará mediante la presentación de memorias \nanuales de conformidad con las siguientes normas:\nArtículo 35.  Plazo de presentación y documentación de seguimiento.\n1.  Los beneficiarios de ayudas presentarán las memorias anuales correspondientes \nde seguimiento de cada ejercicio ante los organismos de adscripción, en el mes de enero \nsiguiente al del año al que se refiera la memoria y estos los remitirán a la Dirección General \nde Política Universitaria, en el plazo máximo de quince días.\n2.  Las memorias de seguimiento se presentarán en el formulario de solicitud \nnormalizado, disponible en la página Web http://web.educación.es. Deberá presentarse \ncon la firma original de interesado y VºBº del representante legal del organismo o entidad \nde adscripción de la ayuda, en la Dirección General de Política Universitaria por el \nprocedimiento indicado en el artículo 22.2, acompañada de la siguiente documentación:\na)  Memoria en la que se especifiquen las actividades realizadas en su programa de \nformación docente e investigadora especificando las actividades realizadas al margen de \nlas académicas del doctorado (con una extensión máxima de 1000 palabras), incluyendo \nel aprovechamiento de los estudios realizados en el curso 2008-2009.\nb)  Certificación académica de los resultados académicos del curso anterior, incluyendo \nsegún los casos, créditos superados, las calificaciones obtenidas, la obtención del DEA, \ncertificado de haber sido admitido al período de investigación o título de Máster durante el \ncurso académico anterior.\nc)  Informe del director de la tesis doctoral, en sobre cerrado y con el VºBº del Director \ndel programa, en el que se hará constar expresamente los progresos realizados en la \nformación investigadora o desarrollo como investigador durante el último año de disfrute \nde la ayuda. En los casos de régimen jurídico de contrato, se indicará el grado exacto de \ndesarrollo de la tesis doctoral y se hará una estimación del tiempo necesario para su \nfinalización.\nd)  Currículum vitae actualizado del beneficiario de la ayuda.\ne)  Los beneficiarios de ayudas concedidas que formalizaron la matrícula en el \ndoctorado por la ordenación del Real Decreto 56/2005 y que presentaron la matrícula en \nal menos 60 créditos del máster, deberán presentar la matrícula para el curso 2009-2010 \nen el programa de doctorado para el que fueron admitidos y del que el máster constituía \nsu parte formativa y cuya certificación presentaron con la documentación de la solicitud.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "00c424bb-4c49-4fd8-99e5-53eb274c6576"
}