{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 5\n1. Ontology and the Lexicon\n5\nin languages such as German and Dutch; additional word-recognition procedures\nwill always be needed.\nAt the level of word sense, there are also regularities in the polysemy of words.\nFor example, the senses of the word book include both its sense as a physical object\nand its sense as information-content: The book fell on the ﬂoor; The book was excit-\ning. (A problem for natural language processing, which need not concern us here,\nis that both senses may be used at once: The exciting book fell on the ﬂoor.) In fact,\nthe same polysemy can be seen with any word denoting an information-containing\nobject, and if a new one comes along, the polysemy applies automatically: The DVD\nfell on the ﬂoor; The DVD was exciting. There are many such regularities of poly-\nsemy; they have been codiﬁed in Pustejovsky’s (1995) theory of the generative\nlexicon. Thus it is possible to write rules that generate new lexical entries reﬂecting\nthese regularities; if we add an entry for DVD to the lexicon as an information-\ncontaining object, then the other sense may be generated automatically (Buitelaar\n1998). (A fortiori, the theory of the generative lexicon says that a purely enumera-\ntive lexicon—one that is just a list of pre-written entries—can never be complete,\nbecause the generative rules always permit new and creative uses of words.)\n1.3 Word senses and the relationships between them\nMost of the issues in the relationship between lexicons and ontologies pertain to the\nnature of the word senses in the lexicon and to relationships between those senses—\nthat is, to the semantic structure of the lexicon.\n1.3.1 Word senses\nBy deﬁnition, a word sense, or the “meaning” of a word, is a semantic object—a\nconcept or conceptual structure of some kind, though exactly what kind is a matter\nof considerable debate, with a large literature on the topic. Among other possibil-\nities, a word sense may be regarded as a purely mental object; or as a structure\nof some kind of primitive units of meaning; or as the set of all the things in the\nworld that the sense may denote; or as a prototype that other objects resemble\nto a greater or lesser degree; or as an intension or description or identiﬁcation\nprocedure—possibly in terms of necessary and sufﬁcient conditions—of all the\nthings that the sense may denote.\nWord senses tend to be fuzzy objects with indistinct boundaries, as we have seen\nalready with the example of open in section 1.1.1 above. Whether or not a person\nmay be called slim, for example, is, to some degree, a subjective judgement of the\nuser of the word. To a ﬁrst approximation, a word sense seems to be something like\na category of objects in the world; so the word slim might be taken to denote exactly\nthe category of slim objects, with its fuzziness and its subjectivity coming from the\nfuzziness and subjectivity of the category in the world, given all the problems that\nare inherent in categorization (Ref to the chapter in the book that talks about\n",
  "speaker": "SYSTEM",
  "uuid": "01a75d05-0f1a-4d87-a66c-d3e4c2c538e5"
}