{
  "message": "SYSTEM: Instrucciones_para_rellenar_el_curriculum_abreviado_CVA.pdf: Página 1\n \n1 de 2 / Instrucciones para rellenar el currículum abreviado \n \nCURRÍCULUM ABREVIADO (CVA) \n \n \n \n \n \n \n \n \n \n \n \nEl documento de currículum abreviado (CVA) está preparado para que pueda rellenarse en \nel formato establecido como obligatorio en las convocatorias: letra Times New Roman o Arial \nde un tamaño mínimo de 11 puntos; márgenes laterales de 2,5 cm; márgenes superior e \ninferior de 1,5 cm; y espaciado mínimo sencillo.  \n \nLa extensión máxima del documento (apartados A, B y C) no puede sobrepasar \nlas 4 páginas. Es obligatorio rellenar los tres apartados. \n \nParte A. DATOS PERSONALES  \n \nResearcher ID (RID) es una comunidad basada en la web que hace visibles las \npublicaciones de autores que participan en ella. Los usuarios reciben un número de \nidentificación personal estable (RID) que sirve para las búsquedas en la Web of Science. \nLos usuarios disponen de un perfil donde integrar sus temas de investigación, sus \npublicaciones y sus citas. \nAcceso: Web of Science > Mis herramientas > Researcher ID \n \nCódigo ORCID es un identificador compuesto por 16 dígitos que permite a los \ninvestigadores disponer de un código de autor inequívoco que les permite distinguir \nclaramente su producción científico-técnica. De esta manera se evitan confusiones \nrelacionadas con la autoría de actividades de investigación llevadas a cabo por \ninvestigadores diferentes con nombres personales coincidentes o semejantes. \nAcceso: www.orcid.org \n \nSi no tiene Researcher ID o código ORCID, no rellene estos apartados. \n \nA.3. Indicadores generales de calidad de la producción científica \nSe incluirá información sobre el número de sexenios de investigación y la fecha del último \nconcedido, número de tesis doctorales dirigidas en los últimos 10 años,  citas totales, \npromedio de citas/año durante los últimos 5 años (sin incluir el año actual), publicaciones \ntotales en primer cuartil (Q1), índice h. Adicionalmente, se podrán incluir otros indicadores \nque el investigador considere pertinentes. \n \nPara calcular estos valores, se utilizarán por defecto los datos recogidos en la Web of \nScience de Thomson Reuters. Cuando esto no sea posible, se podrán utilizar otros \nindicadores, especificando la base de datos de referencia. \n \nParte B. RESUMEN LIBRE DEL CURRÍCULUM (máximo 3500 caracteres, incluyendo \nespacios en blanco) \n \nDescriba brevemente su trayectoria científica, los principales logros científico-técnicos \nobtenidos, los  intereses y objetivos científico-técnicos a medio/largo plazo de su línea de \ninvestigación. Indique también otros aspectos o peculiaridades que considere de importancia \npara comprender su trayectoria. \n \nSi lo considera conveniente, en este apartado se puede incluir el mismo resumen del CV \nque se incluya en la solicitud, teniendo en cuenta que este resumen solo se utilizará para el \nproceso de evaluación de este proyecto, mientras que el que se incluye en la solicitud podrá \nser difundido. \n \n \nINSTRUCCIONES PARA RELLENAR EL CVA \nAVISO IMPORTANTE \n  \nEn virtud de lo establecido en la convocatoria NO SE ACEPTARÁ EL CURRÍCULUM \nABREVIADO que no se presente en este formato. EL CURRÍCULUM ABREVIADO DEL \nINVESTIGADOR PRINCIPAL no será subsanable. \n",
  "speaker": "SYSTEM",
  "uuid": "02e50582-211b-4217-bf8f-e1a0af1264fc"
}