{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 91\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 91 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nThe inventory of candidates of data sources to be included in the FSDAS was carried out in task \nT7.2 within the WP7, and reported in the deliverable D7.2.1. Such inventory was the starting point \nto select the data sets.  \nThe objective is to create ontologies related with biological species (data came from the Reference \nTables (RT) and managed by the Reference Tables Management system (RTMS); and that is used \nto access statistical data, that is timeseries).  \nTimeseries data is fundamental to any research about fishery; therefore, this type of data \nconstitutes a core part of the FSDAS. All data stored in the RTMS and used to access timeseries \nmust be included in the corresponding ontologies; on the other hand, all timeseries must continue \nto be available to query (cf. [37] for a broader view of the user requirements concerning the \nontology life cycle and FSDAS). In this scenario we concentrate on the part of the RTMS data that \nconcerns the biological species.  \nIn this phase of the project the FAO team only deal with single ontologies (as opposed to \nnetworked ontologies); therefore, this scenario only covers the creation of single ontologies.  \nThe FAO team have proceeded in the following way:  \n1. Study of the domain. First of all, the FAO team studied the material available on biological \nspecies that was provided by the biologists in charge of the maintenance of the list of species \nof global interest. Then, the FAO team went over the relevant factsheets of the CWP Handbook \nof Fishery Statistical Standards collected by the Coordinating Working Party on Fishery \nStatistics (CWP); the FAO team also studied data gathered by the ASFIS list (Aquatic Science \nand Fisheries Information System) and by the associated classification systems.  \n2. Interviews with the domain experts. After having obtained a general overview of the domain, \nthe FAO team interviewed the biologists; the aim of such interviews was to understand the \nnature and the dynamics of the ASFIS list, that is, which is the connection with the statistical \ndata provided to FAO by its member countries, how often member countries need to make a \nchange in the list, where such a need comes from, who performs the changes and how. These \ninterviews were intended to shed some light on the life cycle of the reference data in the \ncontext of the actual statistical.  \n3. Interviews with the information system experts. These people are in charge of the \nmaintenace of the RTMS system. They periodically update the RTMS by converting the list \nformat used by the biologists into the relational database, which is more suitable for accessing \nthe reference data and which it is used to access the timeseries. The FAO team carried out \nthese interviews with the aim of understanding the life cycle of the reference data in the context \nof real applications and actual use.  \n4. Model designed. The first two models for the ontologies based on biological species were \ncreated after an in-depth study of the data available from the RTMS (step 1). The FAO team \nused Protégé 3.1.1 to create and edit these ontologies, applying the FAO team’s knowledge of \ncommon methodogies and best practices for creating ontology (e.g. Ontology 101). The FAO \nteam wrote the corresponding documentation in which some pros and cons were analyzed. \nThen it was decided that the actual decision of selecting one model over the other was to be \nmade on the basis of: a) good modeling; b) efficiency in actual use of the ontology; and c) \nefficiency in getting the data to populate the ontology. The first conceptualization activity was \nmade before the actual implementation of the ontology; afterwards, an iterative process (further \nstudy of the data and conceptualization) followed. It must be added that the ontology was \nimplemented in English (i.e., class and property names).  \n5. Study the DB to populate the models. This phase was carried out by studying the available \ndocumentation that describes the structure of the database of the RTMS (from now on DB) and \nthen making a number of interviews and conversations with the information experts working \nwith the DB and adding finally the knowledge previously gained about the domain. The data \nabout biological species is very hierarchical in that species are grouped into Families, which \n",
  "speaker": "SYSTEM",
  "uuid": "04abfe12-7f8e-4618-90a6-a2ec3d794745"
}