{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 35\nBÚSQUEDA \n \n35 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nlos estados son configuraciones del tablero en las que, como mucho, aparecen n \nreinas (pudiendo no aparecer ninguna: el estado inicial). Tenemos n2 reglas que \nconsisten en poner una reina en cada una de las casillas, siendo las únicas \nprecondiciones el que no haya ya una reina en esa casilla y que todavía queden \nreinas disponibles (o dicho de otro modo: que en el tablero aparezcan menos de n \nreinas). En esta situación es claro que se puede llegar a una configuración de más \nde un modo, pero que no podemos encontrar ciclos dirigidos (puesto que cada \naplicación de una regla aumenta el número de reinas en el tablero y nunca quitamos \nreinas). Si el espacio de estados es un grafo dirigido acíclico no aparecerán \nproblemas de no terminación de la ejecución como los evocados en los dos casos \nanteriores. Sin embargo, si en el sistema de producción no se toman las \nprecauciones adecuadas, un mismo estado (y todo el subgrafo de sus \ndescendientes) puede ser explorado en muchas ocasiones con el consiguiente \nperjuicio en la eficiencia (en tiempo y en espacio) del sistema. \nPor último, si el espacio de estados es un grafo dirigido acíclico en el que a cada \nestado se puede llegar sólo de una manera tenemos el caso de un árbol de estados. \nEsta es la estructura combinatorial más sencilla y la que produce menos problemas \nal realizar la búsqueda en ella. Para encontrar un ejemplo, pensemos en la misma \nrepresentación para el problema de las n reinas que hemos dado en el caso del \ngrafo dirigido acíclico. La única modificación es que ahora para que una regla sea \ndisparada es necesario que haya una y exactamente una reina en cada una de las \nfilas precedentes a la de la casilla que corresponde a la regla (o que el tablero esté \nvacío en el caso de reglas correspondientes a casillas de la primera fila). Esta ligera \nmodificación hace que el espacio de estados sea un árbol, lo que simplifica \nconsiderablemente la labor de búsqueda de una solución. Este ejemplo muestra \nclaramente que la fase de diseño conceptual es la más importante para conseguir un \nsistema de producción eficaz. \nEs claro que un sistema de producción que considere los espacios de estados más \ngenerales (los que corresponden a grafos no dirigidos) funcionará correctamente \npara aquellos espacios más especializados. Sin embargo, en ocasiones, cuestiones \nde eficiencia aconsejan que las estrategias de control se particularicen para \nespacios de estados que son árboles o grafos dirigidos acíclicos. \nOtras clasificaciones de los espacios de estados se refieren a su simplicidad, su \nfinitud o infinitud, y a la existencia de pesos en los arcos. \nComenzando de nuevo por el final, los espacios de estados con pesos en las aristas \naparecen en sistemas de producción en los que el disparo de las reglas se supone \n",
  "speaker": "SYSTEM",
  "uuid": "0506fa15-f286-40ed-9c8b-ef97530e898d"
}