{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 9\nhe hadn't, so he said he hadn't. Ever after that Schelkunoff said, ``You set your deadlines; you can change\nthem.''\n\f\nOne lesson was sufficient to educate my boss as to why I didn't want to do big jobs that displaced\n\u001c\nexploratory research and why I was justified in not doing crash jobs which absorb all the research\n\b\ncomputing facilities. I wanted instead to use the facilities to compute a large number of small problems.\n\u0007\nAgain, in the early days, I was limited in computing capacity and it was clear, in my area, that a\n\u0004\n``mathematician had no use for machines.'' But I needed more machine capacity. Every time I had to tell\nsome scientist in some other area, ``No I can't; I haven't the machine capacity,'' he complained. I said ``Go\n\u0006\ntell \n\f\nyour\n(\n Vice President that Hamming needs more computing capacity.'' After a while I could see what was\nhappening up there at the top; many people said to my Vice President, ``Your man needs more computing\n\u001a\ncapacity.'' I got it!\n\u0007\nI also did a second thing. When I loaned what little programming power we had to help in the early days of\ncomputing, I said, ``We are not getting the recognition for our programmers that they deserve. When you\n\u0007\npublish a paper you will thank that programmer or you aren't getting any more help from me. That\n\u000f\nprogrammer is going to be thanked by name; she's worked hard.'' I waited a couple of years. I then went\n\u000f\nthrough a year of BSTJ articles and counted what fraction thanked some programmer. I took it into the boss\n\f\nand said, ``That's the central role computing is playing in Bell Labs; if the BSTJ is important, that's how\n\t\nimportant computing is.'' He had to give in. You can educate your bosses. It's a hard job. In this talk I'm\n\u001e\nonly viewing from the bottom up; I'm not viewing from the top down. But I am telling you how you can get\n\u000e\nwhat you want in spite of top management. You have to sell your ideas there also.\n\nWell I now come down to the topic, ``Is the effort to be a great scientist worth it?'' To answer this, you must\n\u0019\nask people. When you get beyond their modesty, most people will say, ``Yes, doing really first-class work,\n\t\nand knowing it, is as good as wine, women and song put together,'' or if it's a woman she says, ``It is as\n\t\ngood as wine, men and song put together.'' And if you look at the bosses, they tend to come back or ask for\n\u0017\nreports, trying to participate in those moments of discovery. They're always in the way. So evidently those\nwho have done it, want to do it again. But it is a limited survey. I have never dared to go out and ask those\n\nwho didn't do great work how they felt about the matter. It's a biased sample, but I still think it is worth the\n\nstruggle. I think it is very definitely worth the struggle to try and do first-class work because the truth is, the\n\u0006\nvalue is in the struggle more than it is in the result. The struggle to make something of yourself seems to be\n\u0005\nworthwhile in itself. The success and fame are sort of dividends, in my opinion.\n\nI've told you how to do it. It is so easy, so why do so many people, with all their talents, fail? For example,\nmy opinion, to this day, is that there are in the mathematics department at Bell Labs quite a few people far\nmore able and far better endowed than I, but they didn't produce as much. Some of them did produce more\nthan I did; Shannon produced more than I did, and some others produced a lot, but I was highly productive\n\f\nagainst a lot of other fellows who were better equipped. Why is it so? What happened to them? Why do so\n\t\nmany of the people who have great promise, fail?\nWell, one of the reasons is drive and commitment. The people who do great work with less ability but who\n\u0019\nare committed to it, get more done that those who have great skill and dabble in it, who work during the\n\t\nday and go home and do other things and come back and work the next day. They don't have the deep\n \ncommitment that is apparently necessary for really first-class work. They turn out lots of good work, but we\n\u0007\nwere talking, remember, about first-class work. There is a difference. Good people, very talented people,\n\nalmost always turn out good work. We're talking about the outstanding work, the type of work that gets the\n\t\nNobel Prize and gets recognition.\n\u0011\nThe second thing is, I think, the problem of personality defects. Now I'll cite a fellow whom I met out in\nIrvine. He had been the head of a computing center and he was temporarily on assignment as a special\nassistant to the president of the university. It was obvious he had a job with a great future. He took me into\n\t\nhis office one time and showed me his method of getting letters done and how he took care of his\n\u001a\ncorrespondence. He pointed out how inefficient the secretary was. He kept all his letters stacked around\n\u0007\nthere; he knew where everything was. And he would, on his word processor, get the letter out. He was\n\f\nbragging how marvelous it was and how he could get so much more work done without the secretary's\n\u001d\ninterference. Well, behind his back, I talked to the secretary. The secretary said, ``Of course I can't help\n\u001e\nhim; I don't get his mail. He won't give me the stuff to log in; I don't know where he puts it on the floor. Of\ncourse I can't help him.'' So I went to him and said, ``Look, if you adopt the present method and do what\n\u0007\n",
  "speaker": "SYSTEM",
  "uuid": "057674d9-9043-4809-a7aa-8584b88a8379"
}