{
  "message": "SYSTEM: MasterUPM_O%26SW-english.pdf: Página 5\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nEvaluation\nStudents have two ways of passing this subject. They can either take one or the other \n1. Continuous evaluation by:  \na. doing the weekly coursework. 12 assignments  (50% of the final mark) \nb. presenting a final work that compiles the coursework carried out and incorporates the \ncorrections and suggestions  proposed by the teachers during the tutorial sessions. This \npresentation will take place in an oral session in class, with all students. (50% of the final \nmark) Date to be fixed. \n \n2. Final exam in February \n2. Final exam in February \n \n \n• \nFor those students that fail, they will have another chance in September. Requirements to pass: \nFinal work compiling the different assignments (100%) \n• \nFor those students that fail, they will have another chance in September. Requirements to pass: \nFinal work compiling the different assignments (100%) \n \nThere is no exam in June \nThere is no exam in June \n \n• • \nNo assignments have been proposed. \nUnit 14. Applications \n• \nNo specific assignment has been proposed. \n• \nGroup work: Students will establish relations among the different ontologies built in the \ndifferent groups. If there are several ontologies of the same domain, they will propose \ntechniques to evaluate them. \nUnit 13. Semantic \nWeb Services \n• \nUse the R20 language to overlay two DBs with the ontology built.  \n• \nPerform at least 10 queries in each DB. \n• \nIdentify the advantages of R20 and ODEMapster \n• \nReport on the usability of the employed tools.\nUnit 12. Semantic access to \ndistributed DBs \n• \nAnnotate texts, web pages and multimedia documents using the ontology already built and \nsome annotation tools (eg.,  GATE, MnM, M-OntoMat-Annotizer, Armadillo, AKTive media)  \n• \nReport on the usability of the employed tools. \nUnit 11. Annnotation \n• \nUsing the NeOn Toolkit localization tools, translate the ontology into another language, at least. \nUnit 3.  Multilingalism in \nontologies \n• \nDo mappings between two of the ontologies of the same domain selected in lesson 4. \n• \nDo mappings between ontological and non-ontological resources.  \nUnit 10. Alignments and \nMappings \n• \nReuse non-ontological esources (lexicons, thesauri, etc.) identified in lesson 2 and transform \nthem in ontological resources by re-engineering processes. \n• \nReuse the ontological resources identified in lesson 4 and carry out re-engineering processes, if \nnecessary, in order to use them with the selected ontology editor.  \n• \nIntegrate these resources with the ontology in the ontology editor in order to provide a new \nversion of the ontology. \nUnit 9. Reusing, reingeneering \nand learning  \n• \nSpecify the domain ontology to be built, with great detail. \n• \nUse the specifications to improve the ontology built with the editor mentioned in lesson 6.  \nUnit 8. Ontology Specification \nactivities \nSpecific assignments\nUnits \nCon formato: Inglés (Reino\nUnido)\n",
  "speaker": "SYSTEM",
  "uuid": "05961168-ce9e-4f4b-9d85-32e13efc166e"
}