{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 59\nBÚSQUEDA \n \n59 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n \n;; Sin embargo, si el grafo posee ciclos dirigidos y no hay solucion \n;; el algoritmo de busqueda entrara en un bucle infinito. \n \n;(defun expandir-estado (estado) \n;  (case estado \n;    (i '(b a)) \n;    (a '(d c)) \n;    (b '(f e)) \n;    (e '(g)) \n;    (c '(i)) \n;    (g '(f)) \n;    (otherwise (list ))))  ;; Atencion: si se evalua esto y a continuacion \n                            ;; (busqueda) se colgara \n \n3.5. Búsqueda en grafo. \nEl programa que aparece recogido en el apartado anterior puede ser particularizado \npara adaptarse sin dificultad a cualquier sistema de producción. \nEjercicios. \n• \nParticularizar el programa anterior para que resuelva el problema de las n reinas, \ncon la representación que hace que el espacio de estados sea un árbol. \n• \nParticularizar el programa anterior para el problema de las garrafas de vino, con \nla representación con la que venimos trabajando. \n• \nParticularizar el programa anterior para el problema del granjero, el lobo, el \ncarnero y la lechuga. En este caso habrá que elegir en primer lugar una \nrepresentación para el problema. \nSi se ejecuta la búsqueda con el resultado del ejercicio (2) anterior y se mantiene la \ndefinición de informacion-proceso-busqueda dada en el fichero search.lsp, \nse comprobará que, pese a que la solución es alcanzada, el número de veces que \nun mismo estado es examinado (en particular, el estado inicial) es enorme. Para \nevitar este derroche se puede considerar una nueva versión del esquema genérico \nde búsqueda en el que los estados ya examinados son almacenados en una lista \nllamada (de estados) CERRADOS. Cuando se expande un estado sólo dan lugar a \nnuevos nodos aquellos estados que no aparezcan en ABIERTOS o que no estén en \nCERRADOS. Nótese que ABIERTOS es una lista de nodos (mientras que \nCERRADOS es una lista de estados), por lo que lo que habrá que comprobar es que \nun estado no es igual a ninguno de los estados asociados a los nodos ABIERTOS. \n",
  "speaker": "SYSTEM",
  "uuid": "0639ca72-e22f-414a-bd7f-221a37a0d1e5"
}