{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 19\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 19 of 124\nmentioned. This method does not keep the provenance information of the resource, and therefore,\nthe resultant ontology does not keep the reference to the non-ontological resource.\nThe deﬁned transformation protocols are\n– TM1, which considers semantic interpretation of the ISO 15926-2 components straightforward;\nbasically, one ISO 15926-2 component corresponds to exactly one OWL primitive. TM1 is most\nappropriate if a one-to-one mapping is desired.\n– TM2, which considers extended semantic interpretation; it also takes into account the semantics\nof each instance of the components; basically, one ISO 15926-2 component corresponds to sev-\neral OWL primitives and viceversa. TM2 is most appropriate if the transformation is performed to\ntake advantage of the reasoning facilities provided by OWL, thus adding functionality not natively\npresent in ISO 5926-2.\nThe transformation protocols manage a single ontology. The ontology components generated are\nclasses, attributes, and relations. The resultant ontology is expressed in OWL DL.\nMethods for Transforming Folksonomies into Ontologies\nThe two main methods for transforming folksonomies are T-ORG [ASC07], by Abbasi et al., and [MDA07a]\nby Maala et al. Next we describe both of them.\n• Abbasi et al. [ASC07] present a mechanism to transform a set of tags of a given folksonomy into\ninstances of an existing ontology.\nHowever, they do not mention at all the implementation of the\nresource.\nThe purpose of this method is to organize resources by classifying their tags into concepts of the\nontology. This process is done by selecting concepts from single or multiple ontologies related to\nthe required categories. The authors use lexico-syntactic patterns and Google API for searching\nthe appropriate categories of the tags. This method follows the approach to transforming the re-\nsource content into instances of an existing ontology, and their authors have implemented the\nT-ORG tool, described in section 2.4, to support this method. However, the method does not tackle\nthe internal data model of the folksonomy. On the other hand, how the resource data is repre-\nsented and accessed for the transformation is not described. This method does not keep the re-\nsource provenance information, therefore, the resultant ontology does not keep the reference to the\nnon-ontological resource. The method employs an ad-hoc wrapper for discovering the conversions\nbetween the ontologies and the tags. This method consists in\n– Selecting the ontology. The user selects the ontologies relevant to the categories. Concepts\nfrom these ontologies are used as categories. The authors rely on Swoogle8 for the selection of\nontologies.\n– Pruning and reﬁning the ontology. Ontologies must be pruned and reﬁned for the desired cate-\ngories. Unwanted concepts are pruned, whereas redundant and conﬂicting concepts are reﬁned,\nand missing concepts are added to the given ontology.\n– Classifying the tags. The authors propose a new classiﬁcation algorithm for classifying the tags,\nnamely, the T-KNOW algorithm. This algorithm classiﬁes the tags into categories using its pattern\nlibrary (lexico-syntactic patterns), and categories extracted from a given ontology and Google\nsearch results.\n– Browsing the resources. After classifying each tag, resources may be browsed according to the\ncategories assigned to their tags.\n8http://swoogle.umbc.edu\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "07197772-24ac-45e3-8593-0700ea52155c"
}