{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 82\nBÚSQUEDA \n \n82 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nsignificará que el algoritmo terminará sin encontrar solución. Si a igual valor \nheurístico permitimos seguir, una meseta significa que el valor heurístico no nos \nproporciona ninguna información y nos encontramos con una búsqueda ciega no \nexhaustiva que, por supuesto, es bastante inoperante en general (si se trata de \nuna búsqueda en árbol y el espacio de estados es un grafo es posible que se \ncaiga en bucles infinitos). \n• \nCrestas: existe una única dirección en la que el valor heurístico va siendo cada \nvez mejor (o igual), pero en esa dirección no se encuentra ningún estado \nobjetivo. Puede terminar en un máximo local, o tener un efecto muy similar al de \nla meseta. \nPodemos decir que los métodos de escalada irrevocables limitan sensiblemente el \nespacio de búsqueda, pero no ofrecen garantías de resultar eficaces. \nUna variante que permite recuperar las características de completitud y \nexhaustividad consiste en mezclar las ideas de la escalada con la búsqueda en \nprofundidad. Recordemos que en la búsqueda en profundidad (y en la búsqueda en \nanchura) los nodos de igual profundidad se ordenan arbitrariamente. En el método \nde escalada en profundidad los nodos de igual profundidad son ordenados poniendo \nal comienzo los más prometedores (eso significa que, siguiendo nuestras \nconvenciones, los nuevos nodos serán ordenados crecientemente).  \nEjercicios. \n1) Siguiendo los mismos convenios de los últimos ejercicios enunciados, defínase \nexpandir-nodo de modo que se implemente la búsqueda de escalada en \nprofundidad. Escríbanse las versiones en árbol y en grafo. \n2) Compárese el proceso de búsqueda en profundidad, en anchura, en escalada \nsimple, en escalada por la máxima pendiente y en escalada en profundidad en el \nproblema del tren, con un ejemplo concreto. \n3) Mismo ejercicio que (2), pero con el 8-puzzle y con las distintas heurísticas. \nCon esta nueva versión, la búsqueda heurística vuelve a ser exhaustiva y completa: \nsi existe solución encuentra una, aunque no necesariamente una de longitud \nmínima. Por otra parte, vuelve a requerir tanto espacio, en el peor caso, como la \nbúsqueda en profundidad. La única diferencia con ella es que la dirección de la \nbúsqueda es regida por el valor heurístico de los nuevos nodos. En cuanto a la \ncomparación con las escaladas irrevocables, la versión de escalada en profundidad \nsiempre supera los máximos locales, las mesetas y las crestas. Sin embargo, al \n",
  "speaker": "SYSTEM",
  "uuid": "076ef57d-8da3-4cf9-998d-6dad396390af"
}