{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 16\n4. Arasu, A., Babcock, B., Babu, S., Cieslewicz, J., Datar, M., Ito, K., Motwani, R.,\nSrivastava, U., Widom, J.: Stream: The stanford data stream management system.\nIn Garofalakis, M., Gehrke, J., Rastogi, R., eds.: Data Stream Management. (2006)\n5. Abadi, D.J., Ahmad, Y., Balazinska, M., Cetintemel, U., Cherniack, M., Hwang,\nJ.H., Lindner, W., Maskey, A.S., Rasin, A., Ryvkina, E., Tatbul, N., Xing, Y.,\nZdonik, S.: The Design of the Borealis Stream Processing Engine. In: CIDR 2005.\n(2005)\n6. Galpin, I., Brenninkmeijer, C.Y., Jabeen, F., Fernandes, A.A., Paton, N.W.: Com-\nprehensive optimization of declarative sensor network queries. In: SSDBM 2009.\n(2009) 339–360\n7. Madden, S.R., Franklin, M.J., Hellerstein, J.M., Hong, W.: TinyDB: an acquisi-\ntional query processing system for sensor networks. ACM Trans. Database Syst.\n30(1) (2005) 122–173\n8. Bolles, A., Grawunder, M., Jacobi, J.: Streaming SPARQL - extending SPARQL\nto process data streams. In: ESWC 08. (2008) 448–462\n9. Barbieri, D.F., Braga, D., Ceri, S., Grossniklaus, M.: An execution environment for\nC-SPARQL queries. In: EDBT 2010, Lausanne, Switzerland (March 2010) 441–452\n10. Le-Phuoc, D., Hauswirth, M.:\nLinked open data in sensor data mashups.\nIn:\nSSN09. (2009) 1–16\n11. Page, K., Roure, D.D., Martinez, K., Sadler, J., Kit, O.:\nLinked sensor data:\nRESTfully serving RDF and GML. In: SSN09. (2009) 49–63\n12. Sequeda, J., Corcho, O.: Linked stream data: A position paper. In: SSN09. (2009)\n148–157\n13. Lenzerini, M.: Data integration: a theoretical perspective. In: PODS ’02. (2002)\n233–246\n14. Golab, L., ¨Ozsu, M.T.: Issues in data stream management. SIGMOD Record 32(2)\n(June 2003) 5–14\n15. Brenninkmeijer, C.Y., Galpin, I., Fernandes, A.A., Paton, N.W.: A semantics for a\nquery language over sensors, streams and relations. In: BNCOD ’08. (2008) 87–99\n16. Arasu, A., Babu, S., Widom, J.: The CQL continuous query language: semantic\nfoundations and query execution. The VLDB Journal 15(2) (June 2006) 121–142\n17. Kossmann, D.: The state of the art in distributed query processing. ACM Comput.\nSurv. 32(4) (2000) 422–469\n18. P´erez, J., Arenas, M., Gutierrez, C.: Semantics and complexity of SPARQL. ACM\nTrans. Database Syst. 34(3) (2009) 1–45\n19. Calvanese, D., De Giacomo, G., Lembo, D., Lenzerini, M., Rosati, R.: DL-Lite:\nTractable description logics for ontologies. In: AAAI 2005. (2005) 602–607\n20. Poggi, A., Lembo, D., Calvanese, D., Giacomo, G.D., Lenzerini, M., Rosati, R.:\nLinking data to ontologies. J. Data Semantics 10 (2008) 133–173\n21. Lubyte, L., Tessaris, S.: Supporting the development of data wrapping ontologies.\nIn: 4th Asian Semantic Web Conference. (December 2009)\n22. Erling, O., Mikhailov, I.: RDF support in the Virtuoso DBMS. In: Conference on\nSocial Semantic Web. Volume 113 of LNI., GI (2007) 59–68\n23. Chandrasekaran, S., Cooper, O., Deshpande, A., Franklin, M.J., Hellerstein, J.M.,\nHong, W., Krishnamurthy, S., Madden, S.R., Reiss, F., Shah, M.A.: TelegraphCQ:\ncontinuous dataﬂow processing. In: SIGMOD ’03. (2003) 668–668\n24. Yao, Y., Gehrke, J.: The cougar approach to in-network query processing in sensor\nnetworks. SIGMOD Rec. 31(3) (2002) 9–18\n25. Harris, S., Seaborne (eds), A.: SPARQL 1.1 query language. Working draft, W3C\n(2010)\n16\n",
  "speaker": "SYSTEM",
  "uuid": "08ea8df6-175e-46d5-9472-f98d949e5ea2"
}