{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 12\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n- \nDescargado el documento en PDF con la lista completa de categorías y definiciones, \nademás del CDWA Lite, que es un esquema XML para describir registros comunes \npara obras de arte y materiales relacionados a cultura basado en el estándar CDWA.  \n2.5 Recursos lingüísticos \nLos recursos lingüísticos como los diccionarios, lexicones y tesauros son recursos útiles porque \ncontienen descripciones de conceptos y relaciones entre ellos. Además aportan informaciones \nsintácticas y semánticas importantes para la construcción de una ontología. \nEl lexicón es el \"diccionario\" en el que se registran las palabras que conoce un hablante. Es la \nnoción abstracta que abarca todo el vocabulario de una lengua, tal como puede concebirse en el \ncerebro de todos los hablantes de esa lengua, con toda la información sintáctica y semántica \nasociada a cada entrada (el lexicón del español, en cuanto opuesto al del gallego, vasco o \ncatalán, por ejemplo).  \nLos diccionarios indican las distintas acepciones de un término y permiten su expansión con \nsinónimos. El diccionario es un objeto concreto, cuaderno manuscrito, libro impreso, archivo \nde ordenador, etc., que consultamos cuando queremos ampliar, comprobar, etc., algunos \nsegmentos de nuestro propio léxico. \nPor otro lado, un tesauro es una lista de palabras estructurada utilizada para normalizar una \nterminología. Además se utiliza un tesauro para ayudar en la indexación y recuperación de la \ninformación dentro de una base de datos que utiliza la misma terminología. Un tesauro puede \nestablecer los estándares para toda la información dentro de un tema en particular, incluso \ncuando maneja conjunto de datos procedentes de diferentes organizaciones. Así que los \ntesauros son una fuente de conceptos y relaciones entre ellos adecuada en el momento de \ndefinir una ontología. \nLa ontologías y los tesauros han adquirido una importancia capital debido a que “existe la \nnecesidad de describir la semántica de un dominio de forma que el humano lo entienda y que \npueda ser procesado por el ordenador” [MEERSMAN et al 2002]. \n2.5.1 Diccionarios y Lexicones \nLos diccionarios y lexicones encontrados contienen varias definiciones y relaciones entre \nconceptos relativos a arte. Así, los podemos utilizar como base para la identificación de \nconceptos (clases o recursos) dentro del dominio del arte y además identificar posibles \nrelaciones entre los conceptos identificados. \n1. ArtLex Art Dictionary \n- \nhttp://www.artlex.com/ \n- \nTipo: Lexicón. \n- \nPublicado por: Michael R. Delahunt. \n- \nDescripción: ArtLex es un diccionario de términos de arte para artistas, \ncoleccionistas, estudiantes y educadores en producciones artísticas, cristianismo, \n \n12\n",
  "speaker": "SYSTEM",
  "uuid": "0b3563c4-60b8-40be-a0c0-47ec6f5b720f"
}