{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 2\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n \nPROTOCOLO DE VIAJES DEL OEG \n \n \n \nA) MEDIDAS DE RACIONALIZACIÓN DEL GASTO  \nLos miembros del OEG, en la medida de lo posible, observarán las siguientes normas con el fin de \nracionalizar el gasto total en viajes del Grupo: \n \nA1. Reserva del alojamiento y del medio de desplazamiento  \n1. Tan pronto como se tenga conocimiento de la realización del viaje, cada miembro debe proceder a \nreservar tanto el alojamiento como el medio de desplazamiento (avión, tren...), con objeto de evitar el \nincremento de los precios que tiene lugar generalmente en las reservas de fecha próxima a la fecha de \nsalida del viaje. \n \n2. Como novedad, desde mayo de 2.010 el importe de las facturas de alojamiento, en ningún caso \npodrá superar el resultado de multiplicar la dieta de alojamiento para el país correspondiente, por el \nnúmero de días que se pernocte en dicho país. De forma que antes de proceder a la reserva del \nalojamiento, los miembros calcularán el importe máximo que pueden gastar en este concepto \natendiendo al número de noches que vayan a permanecer en el destino, y a la tabla de la wiki que fija \nel importe diario de la dieta de alojamiento para los distintos destinos). La O.T.T. no pagará el exceso \nde la/s factura/s de alojamiento consignadas en la declaración de gastos, respecto de las dietas de \nalojamiento.  \n \n3. Una vez calculado el importe máximo para el alojamiento, se procederá a la reserva del alojamiento \ny del medio de desplazamiento. EN TODO CASO, Los gatos deben ser aprobados por Asun u Oscar \nsi los billetes de avión superan los 300 euros o si el hotel supera los 75 euros en habitación individual \nó 140  en habitación compartida. \n \n4. En aquellos casos en que, por circunstancias excepcionales, las reservas se realicen durante los 15 \ndías que preceden a la fecha de salida, se deberá enviar un correo electrónico a Asun u Óscar, con \ncopia a José Alberto, informando de esta contingencia así como de la/s causa/s de la misma y bajo \nningún concepto se puede incurrir en gastos si éstos no están autorizados.  \n \n5. Además, hay que cumplimentar la hoja previaje, que debe ser presentada en el L-5001 en horario de \natención (de 11 a 12 de la mañana), al menos con quince días de antelación. En aquellos casos en los  \n",
  "speaker": "SYSTEM",
  "uuid": "0be450d7-42f6-49aa-8d57-f8ca61a64abc"
}