{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 29\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n34\n2. DESCRIPCIÓN Y ANÁLISIS DE LAS BASES DE DATOS\nLa búsqueda, introducción y revisión de los registros del directorio de bases de datos\nde la Administración General del Estado se ha basado en una distribución de registros por\nministerios.\nSe redactó un procedimiento normalizado de trabajo en el que se definieron los crite-\nrios de descripción y análisis de las bases de datos, así como las reglas de introducción\nde la información en cada campo de los bloques de información que definiremos a conti-\nnuación. \nLos campos de descripción de las bases de datos inicialmente utilizados por el equipo\nde investigación se englobaron en los siguientes bloques:\n!\nDATOS DE IDENTIFICACIÓN\n!\nCARACTERÍSTICAS DE LA INFORMACIÓN\n!\nCONSULTA DE LA INFORMACIÓN\n!\nCONTENIDO-MATERIA\n!\nOTROS\nDescribimos a continuación todos los campos que el equipo de investigación cumpli-\nmentó para la descripción de las bases de datos de la fase a la que nos estamos refiriendo.\nEn el apartado siguiente se presentará únicamente la selección de campos que el equipo de\ninvestigación decidió finalmente que aparecieran en el directorio de esta publicación. \nDATOS DE IDENTIFICACIÓN\nDirección Web:\nDirección Web\nde acceso\nadicional:\nTítulo:\nURL de acceso a la base de datos desde el Ministerio de referencia.\nEjemplo: \nhttp://www.mapa.es/es/ministerio/pags/biblioteca/plagas/consulta.asp\nURL de acceso a la base de datos desde Ministerios/Organismos adicio-\nnales.\nEjemplo:\nhttp://www.cultura.mecd.es/cine/MC/FE/Biblioteca/Coleccion.html\nSe ha hecho constar sólo el título de la base de datos, no la mención de res-\nponsabilidad que aparece en el campo siguiente “Organismo responsable”,\nsalvo en aquellos casos en que el título por sí mismo resulta confuso o\nambiguo.\nEjemplo: Archivo gráfico del Ministerio de Defensa.\nBASES DE DATOS  1/1/04  03:39  Página 34\n",
  "speaker": "SYSTEM",
  "uuid": "0dd9caa5-dea3-43fe-a7d0-9a9273308e51"
}