{
  "message": "SYSTEM: Marcos.pdf: Página 25\nFacultad de Informática. Universidad Politécnica de Madrid\n© Asunción Gómez Pérez\nMarcos\nConstruir una BC formalizada en marcos que represente el Sistema Periódico (SP). Tras la \netapa de conceptualización se sabe que:\na)\nLos elementos del SP se clasifican en los siguientes grupos: Metales, No Metales, Semi-Metales y \nlos Gases Notables, a excepción del Hidrógeno que no tiene un grupo bien definido. Además se \nsabe que, el Hidrógeno, los Metales, los no-metales y los semi-metales reaccionan con otros \nelementos, mientras que los otros no.\nb) Los elementos metales se pueden clasificar en dos grupos: Metales de No Transición, que a su vez \nengloba a los Alcalinos y Alcalinotérreos; y los Metales de Transición, que comprenden la primera \ny segunda serie de transición y a los Lantánidos y Actínidos, también llamados primera y segunda \nserie de transición interna.\nc)\nLa clasificación de los no metales no está tan bien definida como en la clase de los metales. Sin \nembargo, existe un grupo bien diferenciado que es el de los Halógenos.\nd) Los elementos del SP sólo pertenecen a un único grupo. A saber:\n*Los Alcalinos son el grupo Ia (Li, Na, K, Rb, Cs, Fr)\n*Los Alcalino-Térreos son el grupo IIa (Be, Mg, Ca, Sr, Ba, Ra)\n*La primera serie de transición interna son los grupos de los Lantánidos (Ce, Pr, Nd, Pm, Sm, Eu, Gd, Tb, Dy, \nHo, Er, Tm, Yb, Lu)\n*Los Actínidos (Th, Pa, U, Np, Am, Cm, Br, Cf, Es, Fm, Md, No, Lw)\n*Forman la primera serie de trnsición los elementos del cuarto período (Sc, Ti, V, Cr, Mn, Fe, Co, Ni, Cu, Zn), y \nla segunda serie de transición los del quinto período (Y, Zr, Nb, Mo, Tc, Ru, Rh, Rd, Ag, Cd).\n*El elemento La no tiene un grupo bien definido dentro de los Metales de Transición.\n*Los Halógenos son el grupo VIIb: (F, CI, Br, I, At). El resto de elementos (C, N, O, P, S), pertenecen al resto \nde No-Metales.\n*El grupo VIII (He, Ne, Ar, Kr, Xe, Rn) son los gases nobles.\nEjercicio del sistema periodico\n",
  "speaker": "SYSTEM",
  "uuid": "0e5b395e-a231-4231-81a0-64b9ed9e7f52"
}