{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 38\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 38 de 42 \n49. Mihindukulasooriya N, Poveda-Villalón M, Raúl García-Castro and Asunción Gómez-\nPérez. An RDF Dataset Description Model for Expressing Vocabulary Usage Patterns. \nW3C Smart Descriptions & Smarter Vocabularies Workshop (SDSVoc). Pp: 4. \nAmsterdam, 30 noviembre 2016 \n50. Mihindukulasooriya N., Rizzo G., Troncy R., Corcho O., García-Castro R. A Two-Fold \nQuality Assurance Approach for Dynamic Knowledge Bases: The 3cixty Use Case. \nJoint Proceedings of the 5th Workshop on Data Mining and Knowledge Discovery \nmeets Linked Open Data and the 1st International Workshop on Completing and \nDebugging the Semantic Web co-located with ESWC 2016. Paulheim H., Lehmann J., \nSvátek V,, Knoblock C., Horridge M., Lambrix P., Parsia B. Volumen 1586. PP: 1-12. \nMayo 2016. CEUR Workshop Proceedings. ISSN: 1613-0073 \n51. Omatu S; Ali Selamat; Grzegorz Bocewicz; Pawe¿ Sitek; Izabela Ewa Nielsen; Julián \nAlberto Garcia-Garcia; Javier Bajo Perez. Distributed Computing and Artificial \nIntelligence, 13th International Conference. Springer Verlag, 2016. ISBN 978-3-319-\n40162-1 \n52. Parkkila Vandenbussche J., Filip Radulovic, Daniel Garijo, María Poveda-Villalón, Jouni \nIkonen, \nJari \nPorras, \nAsunción \nGómez-Pérez. \nAn \nontology \nfor \nvideogame \ninteroperability. Multimedia Tools and Applications. 1573-7721. Springer US, 2016. \n53. Priyatna P, Alonso-Calvo R, Paraíso S, Padrón-Sánchez G, Corcho O. R2RML-based \nAccess and Querying to Relational Clinical Data with Morph-RDB. 8th International \nConference on Semantic Web Applications and Tools for Life Sciences (SWAT4LS \n2015). CEUR Vol 1546. Cambridge. Diciembre 2015 \n54. Radulovic, Nandana Mihindukulasooriya, Raúl García-Castro, Asunción Gómez-Pérez. \nA comprehensive quality model for Linked Data. Semantic Web Journal. 21p. 2017 \n55. Rico M., Mihindukulasooriya N., Gomez-Perez A. Data-driven RDF property semantic-\nequivalence detection using NLP techniques. 20th International Conference on \nKnowledge Engineering and Knowledge Management (EKAW2016). Vol. 10024. Pp. \n797-804. Bolonia, 19 noviembre 2016 \n56. Rodríguez Doncel V, Cristiana Santos, Pompeu Casanovas Romeu, Asunción Gómez \nPérez. Legal Aspects of Linked Data: the European Framework. Computer Law & \nSecurity Review. 32 - 6, pp. 799 - 813. Elsevier, 12/2016. \n57. Santana-Perez I., Rafael Ferreira da Silva, Mats Rynge, Ewa Deelman, María S. Pérez-\nHernández, Oscar Corcho. Reproducibility of execution environments in computational \nscience using Semantics and Clouds. Future Generation Computer Systems, Available \nonline 8 January 2016, ISSN 0167-739X \n58. Santos C, Víctor Rodríguez Doncel, Pompeu Casanovas Romeu, Leon van der Torre. A \nEuropean Framework for Regulating Data and Metadata Markets. \"CEUR 1750, Proc. \nof the PRIVON2016, ISSN: 1613-0073\". \n59. Suárez-Figueroa MC, A. Gómez-Pérez, M. Fernández-López. Scheduling ontology \ndevelopment projects. Data & Knowledge Engineering, ISSN: 0169-023X. Vol. 102. Pp. \n1-21. Marzo 2016. \n60. Villegas M, Maite Melero, Núria Bel and Jorge Gracia. Leveraging RDF Graphs for \nCrossing Multiple Bilingual Dictionaries. 10th Language Resources and Evaluation \nConference (LREC'16) Portorož (Slovenia), ISBN 978-2-9517408-9-1. ELRA. Pp. 868-\n876. Mayo 2016 \n2.4 \nDetalle de tesis doctorales de los últimos cinco años \nDesde el año 2000, se han defendido 36 tesis doctorales (9 premios extraordinarios de tesis y \n12 menciones europeas/internacionales). Además se han defendido más de 100 Proyectos \nfinales de carrera y tesis de máster. A continuación se enumeran las 28 tesis defendidas en los \núltimos 7 años: \n1. Daniel Vila Suero. A framework for ontology-based library data generation, access and \nexploitation. Directores Jorge Gracia del Río y Asunción Gómez Pérez. ETSI Informáticos. \nUniversidad Politécnica de Madrid. Julio 2016. Mención Internacional. \n2. Gabriel Villarrubia González. New Platform for Intelligent Context-based Distributed \nInformation Fusion. Univ. de Salamanca. Febrero 2016. \n3. María Poveda Villalón. A Reuse-based Lightweight Method for Developing Linked Data \nOntologies and Vocabularies. Directores María del Carmen Suárez de Figueroa Baonza y \n",
  "speaker": "SYSTEM",
  "uuid": "11272eaf-a8f5-4da8-9c38-852bb128d5ef"
}