{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 9\n1. Ontology and the Lexicon\n9\nError implies a straying from a proper course and suggests guilt as may lie in failure to take\nproper advantage of a guide . . .\nMistake implies misconception, misunderstanding, a wrong but not always blameworthy\njudgment, or inadvertence; it expresses less severe criticism than error.\nBlunder is harsher than mistake or error; it commonly implies ignorance or stupidity, some-\ntimes blameworthiness.\nSlip carries a stronger implication of inadvertence or accident than mistake, and often, in\naddition, connotes triviality.\nLapse, though sometimes used interchangeably with slip, stresses forgetfulness, weakness,\nor inattention more than accident; thus, one says a lapse of memory or a slip of the pen,\nbut not vice versa.\nFaux pas is most frequently applied to a mistake in etiquette.\nBull, howler, and boner are rather informal terms applicable to blunders that typically have\nan amusing aspect.\nFig. 1.1. An entry (abridged) from Webster’s New Dictionary of Synonyms (Gove 1973).\nrelating to errors and mistakes in English, French, German, and Japanese, for exam-\nple, do not line up neatly with one another or translate directly (Edmonds and Hirst\n2002); one cannot use these word senses to build an ontology of errors.\nThese observations have led to the proposal (Edmonds and Hirst 2000, 2002)\nthat a ﬁne-grained hierarchy is inappropriate as a model for the relationship be-\ntween the senses of near-synonyms in a lexicon for any practical use in tasks such\nas machine translation and other applications involving ﬁne-grained use of word\nsenses. Rather, what is required is a very coarse-grained conceptual hierarchy that\nrepresents word meaning at only a very coarse-grained level, so that whole clusters\nof near-synonyms are mapped to a single node: their core meaning. Members of\na cluster are then distinguished from one another by explicit differentiation of any\nof the peripheral concepts that are involved in the ﬁne-grained aspects of their de-\nnotation (and connotation). In the example above, blunder might be distinguished\non a dimension of severity, while faux pas would be distinguished by the domain in\nwhich the mistake is made.\n1.4.2 Gaps in the lexicon\nA lexicon, by deﬁnition, will omit any reference to ontological categories that are\nnot lexicalized in the language—categories that would require a (possibly long)\nmulti-word description in order to be referred to in the language. That is, the words\nin a lexicon, even if they may be taken to represent categories, are merely a subset\nof the categories that would be present in an ontology covering the same domain.\nIn fact, every language exhibits lexical gaps relative to other languages; that is,\nit simply lacks any word corresponding to a category that is lexicalized in some\nother language or languages. For example, Dutch has no words corresponding to the\nEnglish words container or coy; Spanish has no word corresponding to the English\nverb to stab ‘to injure by puncturing with a sharp weapon’; English has no single\n",
  "speaker": "SYSTEM",
  "uuid": "15efe059-37b7-417d-a1f2-31e3b719016b"
}