{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 1\nDynaLearn exercises  \n1 \n \nAssignment 1: Tree & Shade \nThe goal of this assignment is to create a qualitative model that describes the growth of \na tree in time and the effects this growth has on the shaded area that this tree produces. \nThe model is kept a simple as possible, as the aims are to be familiarised with the \nmodel ingredients from which a qualitative model is built, and to learn to use the \nqualitative reasoning and modelling software DynaLearn. The following model \ningredient types are covered in this assignment: \n• Entity \n• Quantity (with value: magnitude and, derivative) \n• Quantity space \n• Scenario \n• Model fragment types: Static & Process \n• Influence (= direct influence) \n• Proportionality (= indirect influence) \n• Correspondence \nConsider a growing tree that casts a shadow on the ground. Assume that the tree \nalways grows (ignoring the need for water, sunlight, air and minerals). The size of the \nshadow depends on the size of the tree. This is a dynamic feature: the shaded area \nincreases when the tree becomes bigger. Indirectly, the growth of the tree causes the \nshaded area to increase. \n \nStep 1: Entity Hierarchy \nThe model implementation starts with the definition of the key objects within the system. \nIn this case this is the tree. In order to keep the model simple, we ignore other possible \nobjects in the system, like the sun, the forest the tree is located in, or the amount of \nminerals in the soil. \nDo the following: \n• Add an entity Tree to the entity hierarchy  \n \nStep 2: Quantities and Quantity Spaces \nQuantities describe the changeable features of entities. The possible values a quantity \ncan have are described in a quantity space. The Tree in our system, which grows and \nproduces shade, has three important quantities, namely: \n• the size of the Tree (Size); \n• the area of shade caused by the Tree (Shade); and, \n• the rate at which the Tree grows (Growth rate). \nEach of the above quantities has to have an associated quantity space. For the Size of \nthe Tree, three qualitative values are possible: Small, Medium and Large. Since the \nShade depends on the Size of the Tree, it is logical to choose the same quantity space \nfor that quantity. Finally, there is either no growth, or some positive amount of growth. \nTherefore, the possible qualitative values for the Growth rate are: Zero and Plus. The \nquantities and their quantity spaces are summarised in Table 1. \n \n",
  "speaker": "SYSTEM",
  "uuid": "161ca8bc-5a39-4a61-979c-42de0bea1124"
}