{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 4\n2\nExecutive Summary\nThis LT‐Innovate report provides a comprehensive survey of the state of the Language Technology (LT) mar‐\nket in Europe today and projections for the next five years. It is divided into six parts, covering global trends\nin the ICT ecosystem, an analysis of specific trends in the LT industry, an exploration of innovation options\nfor European LT companies, and a detailed account of the three strategic technology segments of speech\ninteraction, multilingual communication and translation, and intelligent content that make up the LT market.\nMobile communications, cloud service models and social media are transforming the way citizens, compa‐\nnies and public administrations act in the digital world. This report identifies three deep trends driving next‐\ngeneration ICT that will open up significant opportunities for LT: \n• Unified Communication: cross‐platform, multimodal and multilingual. Mobile connectivity and service\nunification across devices and platforms will offer business and consumer users seamless communica‐\ntions\n• Unified Information Access: in any language and across languages. This will remove barriers to content\nand enable integrated messaging, conferencing, collaboration, content ‐ and data‐sharing based on\nintelligent content and applications, multilingual and interactive systems and technologies.\n• Unified User Experience, based on natural interaction with machines and processes, in any language.\nThis will remove barriers to the access, use and understanding of information from large volumes of\nunstructured, semi‐structured, and structured data.\nLT is the critical enabling technology for each of these fundamental trends and stands to benefit from the\nemerging interconnections between interaction (speech), information processing (intelligent content) and\nautomatic translation in a multilingual connected digital space. It is therefore vital for the European LT indus‐\ntry to embrace and foster the opportunities the rapidly evolving ICT eco‐system offers and to pursue a\ndynamic innovation agenda ahead of its competitors globally.\nLT‐Innovate has developed a market model to estimate the size of LT market in terms of sales and services.\nThe worldwide LT market is worth around €19.3B today and should grow to nearly €30B by 2015. The\nEuropean speech technology market is growing by 9.7%; and should grow to €8.6B by 2015. The intelligent\ncontent market is set to grow to €6.2B. The translation technology market is worth some €8.6B and should\ngrow to €14.9B. The growth rates in the “Rest of the World (ROW)” markets should be significantly higher\nthan in Europe and the Americas as these emerging markets mature. The translation technology segment\nwill continue to dominate the European LT market.\nIn terms of market participants, there are some 500 European companies actively developing or integrating\nLT, most of them still small companies and all too often, focus on niches in their national (language) mar‐\nkets.However, the European LT industry is gradually moving LT up the value chain into mainstream applica‐\ntions and markets. Furthermore, the gaps in language coverage for speech and content technology, and the\npotential to create a demand‐driven dynamic holds significant potential for growth of the LT industry across\nEurope.\nTo facilitate this strategic growth, it is suggested that the pace of development could be accelerated through\ncollaborative innovation bringing together LT companies with their peers and other corporate actors and\nbuyers across the ICT value chain. Various scenarios for this process are explored in the Report\nThe final three sections analyse in detail the history, companies and product/service offerings in the key LT\nsegments of speech, translation and intelligent content technology, providing a guide to key players and their\nrole for the three different application areas.\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n",
  "speaker": "SYSTEM",
  "uuid": "1651c0a2-2840-46a0-a103-67d7ee6d5964"
}