{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 107\n105\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• IDC tracks the following performance management and analytic applications submarkets:\n‐ Customer relationship analytic applications\n‐ Supply chain analytic applications\n‐ Services operations analytic applications\n‐ Workforce analytic applications\n• In addition, IDC classifies two functional markets as being part of the performance management and\nanalytic applications market. These markets are:\n‐ Financial performance, strategy management, and GRC applications\n‐ Production planning analytic applications\nBig Data Definition\nThe intelligent economy produces a constant stream of data that is being monitored and analysed. Social\ninteractions, mobile devices, facilities, equipment, R&D, simulations, and physical infrastructure all con‐\ntribute to the flow. In aggregate, this is what is called Big Data. However, this document sizes and forecasts\nthe technology and services for managing, analysing, and accessing Big Data, not the data itself.\nIDC’s definition of Big Data technologies describes a new generation of technologies and architectures\ndesigned to economically extract value from very large volumes of a wide variety of data by enabling high‐\nvelocity capture, discovery, and/or analysis.\nInfrastructure\n• External storage systems purchases by enterprises and cloud service providers and direct purchases of\nHDDs by select large cloud service providers (It also includes supporting storage software for device,\ndata replication, and data protection of Big Data storage assets. Internal storage installed directly on\nservers is included in the server segment, not the storage segment of the market sizing.)\n• Server revenue (including internal storage, memory, network cards) and supporting system software as\nwell as spending for self‐built servers by large cloud service providers\n• Datacentre networking infrastructure used in support of Big Data server and storage infrastructure\n(Specifically, this forecast models spending based on IDC’s research into the following markets: Ethernet\nswitches, Fibre Channel switches, InfiniBand switches, and application delivery. Datacentres owned by\nenterprises and cloud service providers are counted.)\n• Cloud infrastructure services that combine server, storage, and networking services, which are deliv‐\nered through public cloud offerings\nSoftware\n• Data organization and management software, including parallel and distributed file systems with glob‐\nal namespace, highly scalable (size and structure) relational databases, key‐value pair (KVP) data stores,\ncontent management systems, graph databases, XML databases, object‐oriented databases, dynamic\n",
  "speaker": "SYSTEM",
  "uuid": "16805969-56a5-479d-816e-daa658fd9045"
}