{
  "message": "SYSTEM: CVIdafenSP_CICYT_Resumido_20160329_.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nla organización de eventos científicos y revisión de artículos de investigación para diferentes \nconferencias. \n \nAsimismo, ha realizado colaboraciones con diferentes centros internacionales, incluyendo \nuna estancia de tres meses en el Information Sciences Institute, de la University of Southern \nCalifornia, de marzo a mayo de 2014. \n  \n \nParte C. MÉRITOS MÁS RELEVANTES \n \nC.1. Publicaciones \n \nIdafen Santana-Perez, Rafael Ferreira da Silva, Mats Rynge, Ewa Deelman, María S. \nPérez-Hernández, Oscar Corcho, Reproducibility of execution environments in \ncomputational science using Semantics and Clouds, Future Generation Computer \nSystems, \nAvailable \nonline \n8 \nJanuary \n2016, \nISSN \n0167-739X, \nhttp://dx.doi.org/10.1016/j.future.2015.12.017. \n \nIdafen Santana-Perez, María Pérez-Henández, \"Towards Reproducibility in Scientific \nWorkflows: An Infrastructure-Based Approach\" Scientific Programming, vol. 2015, \nArticle ID 243180, 11 pages, 2015. doi:10.1155/2015/243180. \n \nDoug James, et. al. (including Idafen Santana-Perez, 55/37) , \"Standing Together for \nReproducibility in Large-Scale Computing: Report on reproducibility@XSEDE\" \nreproducibility@XSEDE workshop, 2014. \n \nSantana-Perez, Idafen and Ferreira da Silva, Rafael and Rynge, Mats and Deelman, \nEwa and Pérez-Henández, María S and Corcho, Oscar , \"A Semantic-Based \nApproach to Attain Reproducibility of Computational Environments in Scientific \nWorkflows: A Case Study\" 1st International Workshop on Reproducibility in Parallel \nComputing (REPPAR14) in conjunction with Euro-Par 2014 (August 25-29), Porto, \nPortugal. \n \nSantana-Perez, Idafen and Ferreira da Silva, Rafael and Rynge, Mats and Deelman, \nEwa and Pérez-Henández, María S and Corcho, Oscar , \"Leveraging Semantics to \nImprove Reproducibility in Scientific Workflows\" reproducibility@XSEDE workshop, \n2014. \n \nSantana-Perez, I.; Perez-Hernandez, M.S.; , \"A Semantic Scheduler Architecture for \nFederated Hybrid Clouds,\" Cloud Computing (CLOUD), 2012 IEEE 5th International \nConference on , vol., no., pp.384-391, 24-29 June 2012. \n \nSantana Suarez, O.; Perez Aguiar, J.; Santana Perez, I.; Quesada Lopez, R. \nFunctional Disambiguation Using the Syntactic Structures Algorithm for Each \nFunctional Interpretation for Spanish Language. In Computer Aided Systems Theory - \nEUROCAST 2009, Vol. 5717; Moreno-Diaz, R.; Pichler, F.; Quesada-Arencibia, A., \nEds.; Springer Berlin / Heidelberg: Berlin, Heidelberg, 2009. \n \nArtal, C. G., Dolores, M., Suarez, A., Perez, I. S., and Lopez, R. Q. OLC, On-Line \nCompiler to Teach Programming Languages, IJCCC, Vol. III (2008), No.1, 2008. \n \nC.2. Proyectos \n \nEspaña Virtual (CENIT-2008 1030), Ministerio de Industria, Turismo y Comercio. \nPrograma CENIT. Entidades participantes: Deimos Space S.L., Androme Iberica, \nS.L., Centro Nacional de Información Geográfica, Dnextep Consulting, S.L., Grid \nSystems, S.A., GeoSpatiumLab, S.L., GeoVirtual, S.L., Indra Espacio, S.A., \nUniversidad Politécnica de Madrid, Universidad Carlos III de Madrid, Universidad de \nMálaga, Barcelona Media, Animante Baleares, Universidad de Zaragoza, Universidad \nde Valladolid, Universidad Jaume I, Solucions on Hand, ELIMCO Sistemas, SIGRID, \nIVER, UNED, Universidad Politécnica de Catalunya, Universitat de les Illes Balears, \nBot Consulting. 25.192.648,00 € (total). 01/09/2008 – 31/12/2011. Investigador \nresponsable: Carlos Fernández de la Peña (proyecto), Asunción Gómez Pérez \n(UPM). Participación: investigador. \n \nSEALS –Semantic Evaluation at Large Scale (FP7-238975) Unión Europea. \nUniversidad Politécnica de Madrid (coordinador); University of Sheffield (Reino \nUnido); Forschungszentrum Informatik (Alemania); University of Innsbruck (Austria); \nInstitut National de Recherche en Informatique et en Automatique INRIA (Francia); \n",
  "speaker": "SYSTEM",
  "uuid": "18a0bc90-21e0-430f-998e-e4e97ef10391"
}