{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 10\n3.4   Checking the semantic annotation of RESTful services \nIn order to check the collected sample individuals and initial semantic annotations of \nthe previous process, our system invocates the RESTful service that was already \nregistered in the repository (as we describe in Section 3.2) and validates the input and \noutput parameters. \n \nFor the validation of the input parameters, our system selects, for each parameter, \na random subset of the example instances (of classes and/or properties) coming from \nthe DBpedia (and GeoNames) ontology that we have obtained and registered before. \nNext, it makes several invocations of the RESTful service iterating over these \nregistered values. The system does not check this with all the possible combination of \ncollected instances for all parameters for two reasons: first, because of the \ncombinatorial explosion that may be produced in such a case, and second because \nmany RESTful services have invocation limitations.  \nIf the service returns results from the invocation, then the service is deemed as \nexecutable, and the corresponding annotations are marked as valid. If a service cannot \nbe invoked successfully, the service is classified as non-executable and is \nautomatically discarded from the list of services that can be automatically annotated. \n \nFor the validation of the output parameters, our system only takes into account \nexecutions with the correct inputs from the input sets that have been considered \nbefore. Next, the system compares the outputs obtained after execution with the \ninformation already stored in the repository due to the initial retrieval processes done \nbefore with DBPedia (and GeoNames), and external utility services. If the output can \nbe matched, our system considers the output annotation as valid. \n \nFinally, the correspondences that have been established between the different \nparameters of the RESTful service and the DBpedia (and GeoNames) ontology  are \nregistered and stored in the repository, so that they can be used later. In such a way, \nthe RESTful service is annotated semantically and it will allow generating semantic \ndescriptions or annotations of any of the types that were identified in the related work \nsection (WADL, hREST, etc.). Table 3 provides an abbreviated form of this \ndescription for our exemplar service 1.  \n \nTable 3. Semantic annotation of a RESTful service \n($country,bBoxSouth,isoNumeric,http://dbpedia.org/ontology/Con\ntinent,fipsCode,http://dbpedia.org/property/areaMetroKm,langua\nges,isoAlpha3,http://dbpedia.org/ontology/country,bBoxNorth,ht\ntp://dbpedia.org/ontology/populationDensity,bBoxWest,http://db\npedia.org/ontology/Currency,bBoxEast,http://dbpedia.org/ontolo\ngy/capitalgeonameId,http://dbpedia.org/ontology/country) \n",
  "speaker": "SYSTEM",
  "uuid": "18a43858-49cc-4f1d-9679-e372a14c90aa"
}