{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 91\n89\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nmarketing but also in new business models like virtual supermarkets.    \n• Smart devices interaction: text input technologies are the pillar for many applications for smart devices\nsuch as SMS, one‐to‐many text communication, email, etc. \nTrends\nScanning and text input technologies are under different trend scenarios. \nFrom one side, with the progressive digitalization of business processes the adoption drivers for scanning are\naligned with the cost reduction culture. Companies seek for reducing overall costs, shortening cycle times,\nreducing errors, improving information sharing and reducing paper filing/storage. On top of that, these ini‐\ntiatives may be linked to other intelligent content projects such as ensuring compliance and auditability,\nimproving visibility into business processes or improving litigation preparedness. As a result, cost reduction\ninitiatives that include scanning technologies are helping to create a paperless culture and reduce the car‐\nbon footprint.\nFrom the other side, the main drivers for text input technologies are related to providing better user expe‐\nriences on any device that requires text input (from a mobile to an ATM) based on focus of attention, text\ncreation versus text copy tasks, novice versus expert performance, quantitative versus qualitative measures\nand the speed–accuracy trade‐off.\nMarket leaders\nScanning and text input technologies markets are currently influenced by several IT industries such as mobile\nindustry (smartphones but also ruggedized devices) or the document imaging industry.  Ruggedized mobile\ndevices include devices of a handheld form factor that are of industrial design, have mobile computing capa‐\nbilities, are designed for data capture, and have wireless connectivity. These devices must have a high‐level\noperating system as well as application processors. Such devices are designed for data capture and have 1D,\nand often 2D, barcode scanning capabilities, representing the evolution of barcode scanning handheld\ndevices to include on‐board intelligence and wireless connectivity to back‐end enterprise IT systems.\nRuggedized vendors such as Honeywell, Motorola, Casio, Datalogic, Fujitsu or Denso Wave relay on internal\ndevelopments and third‐parties scanning / text input software vendors to add functionalities to their prod‐\nucts. This happens as well for the mobile industry, were Apple, Samsung or Nokia relays on third parties.\nScanning and text input vendors usually have OEM partnerships in several industries which translate into\nsmall revenue margins. One of the main actors in this market is Nuance due to the progressive acquisition\nof several companies. However, this market still remains strongly fragmented.\nChallenges / opportunities\nOpportunities\n• Mobile: With the exponential growth of smartphones, tablets and mobile information workers the\nneed for better mobile services is increasing.  Use of mobile devices to capture document will intro‐\nduce/educate users on the benefit of document capture and drive demand for scanners as users deploy\nan infrastructure to support digital document.\n• Scan behaviour should rise in the cloud. The need to take paper content to the cloud is evident.\n",
  "speaker": "SYSTEM",
  "uuid": "19002386-1c23-4bc9-947c-ae70f3e5c8f9"
}