{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 98\n96\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n34.3% of the market total. In Europe, Exalead acquired by Dassault Systémes is experiencing a significant\ngrowth that is helping to consolidate its position within the top ten vendors.\nThere is continued progress on the part of enterprise software providers like Microsoft, IBM, Oracle, and SAP\nto provide embedded search at advanced levels within their proprietary application platform offerings.\nThe main innovation source is to gather unified search and navigation platforms. To date, smaller search ven‐\ndors have been at the forefront of creating unified information access platforms. Companies like Endeca,\nFAST (now part of Microsoft), and Exalead (now part of Dassault Systèmes) were quick to see the need to\nfind all information, regardless of its source or format, and were early to add search across structured data\nto their offerings. They were joined by newer vendors such as Attivio, BA‐Insight, MarkLogic, Sinequa,\nPalantir, Inbenta and Perfect Search.\nTherefore, innovation comes from the small players and big players are acquiring these companies in order\nto complete their portfolio and have access to these innovations. So innovation in big players takes the form\nof being able to combine several technologies at the same time. For example, Autonomy has added content\nmanagement, NLP, analytics, visualization, workflow, rich media analysis, and data analysis to its IDOL plat‐\nform.\nChallenges / Opportunities\nOpportunities\n• Unified search platforms: Newer approaches and technologies are breaking down the barriers between\nthe BI and the search worlds.\n• Data is going to grow faster and faster: Big Data, Social Media Data, Internet of Things are just a few\nexamples of the shape of things to come. Companies needs to be ready to deal with huge volumes of\ndata, combine information of a variety of sources and provide results on real‐time. So, companies will\nneed to upgrade their current search engines.\n• Search‐based applications: in the current context, ROI is king. Search‐based applications provide a\nfaster ROI for companies.\nChallenges\n• Lose search‐ focus: More focus on Big Data than in search. The first driver to invest in Big Data is to solve\ndata volume issues.\n• The run for search accuracy: accuracy will increase more from complementary technologies rather than\nincremental innovation.\n• Garbage‐in garbage‐out: the first step to have a good data search is data quality. Search and navigation\nvendors should start including data management solutions to their portfolio.\n• Platform vs. application deployment: creating a broad search platform will produce better accuracy\nbut slower‐results (search based applications) in the short term.\n• Closed internet sources are growing: Facebook, Twitter and other social platforms are progressively\nchanging their access policies. Vendors will face the challenge of providing an integrated search expe‐\nrience for their customers.\n",
  "speaker": "SYSTEM",
  "uuid": "1b17e50c-2590-4141-93b1-2e32933f6448"
}