{
  "message": "SYSTEM: CV-Cicyt_MCSFB_21Marzo2016.pdf: Página 23\nCongreso: Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA) y Jornadas de Transferencia \nTecnológica de Inteligencia Artificial (TTIA) (CAEPIA-TTIA 2009) \nPublicación: Proceedings of the CAEPIA-TTIA 2009. ISBN: 978-84-692-6424-9 \nVolume:   \nPages: 307-316  \nLugar celebración: Sevilla, Spain \nFecha: 9-13 November 2009 \n \n \nAutores: M.C. Suárez-Figueroa, A. Gómez-Pérez, B. Villazón-Terrazas \nTítulo: How to write and use the Ontology Requirements Specification Document \nCongreso: The 8th International Conference on Ontologies, DataBases, and Applications of Semantics (ODBASE 2009) \nPublicación: Proceedings of the 8th International Conference on Ontologies, DataBases, and Applications of Semantics \n(ODBASE 2009). On the Move to Meaningful Internet Systems: OTM 2009. (Robert Meersman, Tharam Dillon, and Pilar \nHerrero)  (ISBN: 978-3-642-05150-0). LNCS 5871. \nVolume: Part II \n Pages: 966-982 \nLugar celebración: Vilamoura, Algarve-Portugal \nFecha: 3-5 November 2009 \n \n \nAutores: M.C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: NeOn Methodology for Building Ontology Networks: a Scenario-based Methodology \nCongreso: International Conference on SOFTWARE, SERVICES & SEMANTIC TECHNOLOGIES (S3T 2009) \nPublicación: Proceedings of the International Conference on SOFTWARE, SERVICES & SEMANTIC TECHNOLOGIES (S3T \n2009) (ISBN: 978-954-9526-62-2). \nVolume:   \nPages: 160-167 \nLugar celebración: Sofia, Bulgaria \nFecha: 28-29 October 2009 \n \n \nAutores: G. Aguado de Cea, A. Gómez-Pérez, E. Montiel-Ponsoda, M.C. Suárez-Figueroa \nTítulo: Using Linguistic Patterns to Enhance Ontology Development \nCongreso: International Conference on Knowledge Engineering and Ontology Development (KEOD 2009) \nPublicación: Proceedings of the International Conference on Knowledge Engineering and Ontology Development (KEOD \n2009). (ISBN: 978-989-674-012-2) \nVolume:   \nPages: 206-213  \nLugar celebración: Madeira, Portugal \nFecha: 6-8 October 2009 \n \n \nAutores: G. Aguado de Cea, E. Montiel-Ponsoda, M.C. Suárez-Figueroa \nTítulo: Approaches to ontology development by non ontology experts \nCongreso: ISMTCL - International Symposium on Data and Sense Mining, Machine Translation and Controlled Languages \nPublicación: Proceedings of the International Symposium on Data and Sense Mining, Machine Translation and Controlled \nLanguages (ISMTCL 2009) (ISSN 0758 6787; ISBN 978-2-84867-261-8) \nVolume:   \nPages: 23-30  \nLugar celebración: Besançon, Francia \nFecha: 1st – 3rd July 2009 \n \n \nAutores: A. García-Silva, A. Gómez-Pérez, M. C. Suárez-Figueroa, B. Villazón-Terrazas \nTítulo: A Pattern Based Approach for Re-engineering Non-Ontological Resources into Ontologies \nCongreso: Third Asian Semantic Web Conference (ASWC 2008)  \nPublicación: The Semantic Web. LNCS. 0302-9743 (Print) 1611-3349 (Online). ISBN: 978-3-540-89703-3 \nVolume: 5367/2008  \n \n \nPages: 167-181 \nLugar celebración: Bangkok, Thailand \nFecha: 2nd - 5th February 2009 \n \n \nAutores: M. Fernández-López, A. Gómez-Pérez, M. C. Suárez-Figueroa \nTítulo: Selecting and Customizing a Mereology Ontology for its Reuse in a Pharmaceutical Product Ontology \nCongreso: The 5th International Conference on Formal Ontologies in Information Systems (FOIS 2008) \n",
  "speaker": "SYSTEM",
  "uuid": "1c406ff8-cd3c-42fc-b979-397f27b6962e"
}