{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 5\n \n \nPág. 7 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nEl español es la lengua más hablada del mundo después del chino, si tenemos en cuenta los \nhablantes nativos, y la tercera por número de hablantes después del inglés. Se prevé que en \n2030 sea la segunda lengua de intercambio económico en el mundo, principalmente por el \ncrecimiento del mercado latinoamericano. El español posee una enorme capacidad de \ninternacionalización dado que nueve de cada diez usuarios se encuentra fuera de nuestras \nfronteras2. Que se trate de una lengua compartida con otras naciones representa, sobre todo, \nuna oportunidad de estrechar los lazos de cooperación con la Comunidad Iberoamericana. \nPor otra parte, España cuenta con organizaciones con prestigio internacional especializadas en la \nlengua española, entre las que destacan la Real Academia Española, el resto de reales \nacademias y el Instituto Cervantes. \nAdicionalmente, en España existen numerosos grupos investigadores de reconocido prestigio \ninternacional trabajando en procesamiento del lenguaje español y lenguas cooficiales, así como \ngrupos especializados en semántica. Los investigadores y una buena parte de la Industria del \nsector se encuentra agrupada alrededor de la Sociedad Española para el Procesamiento del \nLenguaje Natural (SEPLN), que ha cumplido en 2015 su XXXI aniversario, y de varias \nagrupaciones empresariales. \nSin embargo, el desarrollo de aplicaciones para una lengua y, en muchos casos, para un ámbito \nde conocimiento determinado, depende de la disponibilidad de tecnología y recursos para esa \nlengua y en un ámbito de conocimiento determinado. En el caso de España, la disponibilidad de \nesos recursos para el idioma del castellano, aunque en menor medida y con algunos vacíos \nsignificativos, tiene un nivel parecido al que existe para el alemán o el francés a pesar de tener \nun número muy superior de hablantes. Para las lenguas cooficiales el nivel es menor. Estos \nrecursos tienen un coste elevado que no pueden asumir pequeñas y medianas empresas. Para \ngarantizar la disponibilidad de aplicaciones en español y lenguas cooficiales es necesario \naumentar el número, la calidad, la variedad y la disponibilidad de los recursos y herramientas que \nles dan soporte.   \nAdemás, en previsión del crecimiento del sector de procesamiento de lenguaje natural y \ntraducción automática, se considera conveniente ampliar la formación en esta tecnología a los \nprofesionales de las TIC en empresas y Administración Pública. \nLas Administraciones Públicas deben incorporar las tecnologías de procesamiento de lenguaje \nnatural y de la traducción automática para mejorar la calidad y capacidad del servicio público, \nactuando, además, como tractores de la demanda. Existen áreas como la Sanidad o la Justicia en \nlas que la Administración tiene un papel determinante en el desarrollo de nuevos servicios \nbasados en la comprensión más profunda o la traducción automática de los contenidos que \ngestiona.  \nPor otro lado, el gran valor potencial que tiene buena parte de la información que genera el \nsector público como recurso lingüístico representa una extraordinaria oportunidad para el \n                                                           \n2 Información obtenida del Informe 2015 del Instituto Cervantes, “El español: una lengua viva”. Capítulo 1. El español en cifras. \nhttp://eldiae.es/wp-content/uploads/2015/06/espanol_lengua-viva_20151.pdf \n",
  "speaker": "SYSTEM",
  "uuid": "1d31d42f-a970-4199-8c6a-c478acc34530"
}