{
  "message": "SYSTEM: El_ViajeroPoster.pdf: Página 1\nEl Viajero: A Provenance Enabled Servicefor News and Blog Aggregation\nDaniel Garijo ●Boris Villazón-Terrazas ●Oscar Corcho\nOntology Engineering Group, Departamento de Inteligencia Artificial, Facultad de Informática, Universidad Politécnica de Madrid, Spain.\nMotivation, Background and Approach\nWebN+1 Use Case\nocorcho@fi.upm.es\nbvillazon@fi.upm.es\ndgarijo@delicias.dia.fi.upm.es\nProvenance\nof\na\nresource\nis\nthe\nrecord\ndescribing\nall\nthe\nprocesses and steps involved in how the resource has come to be\nat its current state. It is relevant in a wide range of domains\n(scientific, business and social networking among others), and it is\nuseful to determine whether to trust a resource or not.\nEl Viajero Platform\nEl Viajero is a news and blog platform focused in the domain of\ntravelling, belonging to the Prisacom Group.\nIt integrates heterogeneous contents (e.g. images, videos, photos,\nnews, etc.) from different types of users: journalists, bloggers and\nnormal users. Provenance is key to determine where the information\ncomes from and how it has been modified.\nBackground\nMany provenance models exist for different domains:\n•Focused in the description of the process that led to the\nresource (OPM, Provenir, Provenance Vocabulary, PML, etc.)\n•Focused in the description of the resource (SIOC, DC, etc.)\nThe W3C Provenance Incubator Group developed a roadmap and\nthe first steps towards a standard, which is being currently\ndiscussed by the W3C Provenance Interchange Group.\nHowever, no standard guidelines for provenance publishers exist\nat the moment.\nOverview\nThe service for El Viajero is divided in different modules:\n•\nThe parsers process and send the information from the platform\n(posts, blogs, comments, IPTCs (i.e. travel guides), etc.) to the\nannotation interface.\n•\nThe annotation interface inserts into the repository the input\nreceived from the parsers, using our OPM adaptation as domain\nmodel.\n•\nThe query interface provides some default queries to retrieve the\nprovenance from the resources of the platform.\n•\nThe REST API handles all the requests and inserts new contents\nto the repository or retrieves the requested information depending\non the request.\n•\nThe\nrepository\nstores\nthe\nprovenance\nfor\nall\nthe\navailable\nresources in the platforms, under the proposed domain model.\nAll the examples are available at: http://webenemasuno.linkeddata.es\nOur approach\nOPM Core\nOPM profile for our domain\nSIOC\nMPEG-7\nGEO\n1\n2\n3\nJENA  repository\nPost Parser\nBlog Parser\nXML Parser\nIPTC parser\nPARSERS\nAnnotation interface\nHTTP POST\nrequest\nSPARQL query\nHTTP \nGET\nREST API\nInsert the \nprocessed data\nStore in \nrepository\nInsert XML \ndata\nReceive request\nSend answer\nUser/Content provider\nApplication\nSend/receive\nRDF Answer\nOWL Model\nQuery Interface\nSPARQL \nQuery\nSpecific Query /RDF Answer\nRDF Answer\n• Guide browser and viewer (Using Map4RDF)\n• Guide, post and Image Searcher\nOur approach uses OPM as model to\ncapture\nthe\nprovenance\nof\nthe\nplatform. It has been divided in three\ndifferent layers. The first layer (1) is\nthe core of the model (OPMO) and it\nis used to represent the evolution of\nthe resources in their lifetime.\nThe second layer (2) extends the first\none\nto\nadapt\nit\nto\nthe\nspecific\nprocesses and resources that can be\nfound in our scenario.\nFinally, in the last layer (3) we reuse\nthree resource-centric vocabularies\nto\ndescribe\nthe\nprovenance\nof\ndifferent resources available in the\nplatform.\nSIOC is used to represent the metadata from posts, blogs and social\nnetworking features. MPEG-7 is used for describing images and videos and\nW3C Geo is used for representing the geospatial information of the resources.\nOpen Provenance Model\nDomain generic model centered in the description of the process involved in the\nevolution of the resources. It is the outcome of the Provenance Challenge\nseries and has two different implementations: OPMO (OPM Ontology) and\nOPMV (OPM Vocabulary).\n",
  "speaker": "SYSTEM",
  "uuid": "1d337d75-695c-4004-82a2-2f0b52a610f5"
}