{
  "message": "SYSTEM: NeOn_Glossary_of_Processes_and_Activities.pdf: Página 4\n Ontology Reuse. It refers to the process of using available ontologies for solving different problems.  \n Ontology Reverse Engineering [Gómez-Pérez and Rojas-Amaya, 1999]. It refers to the activity of \noutputting a possible conceptual model on the basis of the code in which the ontology is \nimplemented. \n Scheduling [Gómez-Pérez et al., 2003]. It refers to the activity of identifying the different activities \nand processes to be performed during the ontology development, their arrangement, and the time \nand resources needed for their completion. \n Ontology Search. It refers to the activity of finding candidate ontologies or ontology modules to be \nreused. \n Ontology Selection. It refers to the activity of choosing the most suitable ontologies or ontology \nmodules among those available in an ontology repository or library, for a concrete domain of interest \nand associated tasks. \n Ontology Specialization. It is an ontology enrichment activity for extending the ontology in depth. \n Ontology Statement Reuse. It refers to the process of using available ontology statements in the \nsolution of different problems \n Ontology Summarization. It refers to the activity of providing an abstract or summary of the \nontology content. \nThe summary can include, for example, a couple of top level concepts in the ontology class \nhierarchy (perhaps a graphical representation of these top-level concepts and lthe inks between \nthem). \n Ontology Translation. It refers to the activity of changing the representation formalism or language \nof an ontology to another.  \nOntology Translation can be part of an ontology reengineering process. \n Ontology Update. It refers to minor changes carried out in an ontology that could not be considered \nan upgrade. \n Ontology Upgrade. It refers to the activity of replacing an ontology with a new version. \n Ontology Validation. It is the ontology evaluation that compares the meaning of the ontology \ndefinitions against the intended model of the world aiming to conceptualize. \nIt answers the question “Are you producing the right ontology?” \n \n Ontology Verification. It is the ontology evaluation that compares the ontology against the ontology \nrequirement specification document (ontology requirements and competency questions), thus \nensuring that the ontology is built correctly (in compliance with the ontology requirements \nspecification). \nIt answers the question “Are you producing the ontology right?”  \n Ontology Versioning [Stojanovic, 2004]. It refers to the activity of handling ontology changes by \ncreating and managing different versions of the ontology. \n \n",
  "speaker": "SYSTEM",
  "uuid": "1dab5fe8-4098-4711-b53d-59453431faf3"
}