{
  "message": "SYSTEM: Cv_abreviado-mperez.pdf: Página 2\n \n2 de 4  \n \nCURRÍCULUM ABREVIADO (CVA) \n \n \nsubvencionados por entidades públicas y 1 proyecto competitivo, subvencionado por una \nempresa privada.  Ha participado como experta evaluadora tanto en la Comisión Europea \ncomo para la Agencia Nacional de Evaluación y Prospectiva (ANEP). En relación a la \ntransferencia de conocimiento al sector productivo, la candidata ha participado en 3 \nproyectos, uno de ellos dentro del contexto del centro mixto .COM (Center for Open \nMiddleware), que tiene como principal objetivo el desarrollo de middleware open source \nen el dominio bancario y en otros sectores industriales. También posee un registro de \npropiedad intelectual. Así mismo, ha participado en la iniciativa ActuaUPM en su XI \nconvocatoria en Innovacion y Creacion de Empresas, mediante el proyecto Chronomad. \n \nHa dirigido 6 tesis doctorales, 2 de las cuáles han conseguido el premio extraordinario de \ndoctorado, con mención de excelencia y una de ellas en un centro de prestigio \nextranjero. En la actualidad se encuentra dirigiendo la tesis de otros cuatro \ninvestigadores. Ha organizado múltiples conferencias internacionales, entre las que \ndestaca su reciente participación como General Chair en IEEE Cluster 2014, y pertenece \na una gran cantidad de comités de programa de conferencias internacionales (más de 80 \nediciones). Entre estos últimos son muy reseñables los comités de programa en \nconferencias tan prestigiosas como ICPP, Supercomputing o CCGrid. \n \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \n \n \nM.S. Pérez, A Sánchez, V. Robles, P Herrero, J.M Peña \n“Design and implementation of a data mining grid-aware architecture” \nFuture Generation Computer Systems 23 (1), 42-47 \nEnero 2007,  \nElsevier, \nPp. 42–47 \nFactor de impacto: 1.095 \n \nA. Sánchez, M.S. Pérez, K. Karasavvas, P. Herrero, A. Pérez \n”MAPFS-DAI, an extension of OGSA-DAI based on a parallel file system” \nFuture Generation Computer Systems. Grid Computing. \nTheory, Methods and Applications 23(1) \nEnero 2007 \nElsevier Science \nPp.  138-145 \nFactor de impacto:  1.095 \n \nP. Herrero, J. L. Bosque, M. Salvadores and M.S. Pérez \nWE-AMBLE: A workflow engine to manage awareness in collaborative \ngrid environments \nInternational Journal of High Performance Computing Applications (IJHPCA) 22(2), \nSpecial Issue on Work \now Systems in Grid Environments \nAgosto 2008 \nPp. 250-267 \n SAGE Publications \n Factor de impacto: 1.824 \n \nM. Salvadores, P. Herrero, J.L. Bosque, M.S. Perez \n“A Semantic Collaborative Awareness Model to deal with Resource Sharing in Grids” \nFuture Generation Computer Systems 26(2) \nFeb. 2010 \nElsevier \nPp. 276 - 280 \nFactor de impacto: 2.371 \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "1e15bffa-6ecf-4772-b397-7fc8f5f35b81"
}