{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 7\ncrucial to identify the purpose and scope of the ontology; the formal language to be \nused for implementing the ontology should be decided by ontology developers. The \ntask output is included in slots 1-3 of the template shown in Table 1. The output in the \nSEEMP ORSD is shown in Table 2. \nTask 2. Identify intended end-users. The goal of this task is to establish who the \nmain intended end-users of the ontology are. The ontology development team has a \nset of interviews with users and domain experts to carry out this task taking as input a \nset of ontological needs. The task output is a list containing the intended users of the \nontology to be built, which is included in slot 4 of the template shown in Table 1. The \noutput in the SEEMP ORSD is shown in Table 2. \nTable 2. SEEMP ORSD Slots 1 to 5. \nSEEMP Reference Ontology Requirements Specification Document \n1 \nPurpose \nThe purpose of building the Reference Ontology is to provide a consensual knowledge \nmodel of the employment domain that can be used by public e-Employment services. \n2 \nScope \nThe ontology has to focus just on the ICT (Information and Communication \nTechnology) domain. The level of granularity is directly related to the competency \nquestions and terms identified. \n3 \nImplementation Language \nThe ontology has to be implemented in WSML language. \n4 \nIntended End-Users \nUser 1. \nCandidate who is unemployed and searching for a job or searching another \noccupation for immediate or future purposes \nUser 2. \nEmployer who needs more human resources. \nUser 3. \nPublic or private employment search service which offers services to gather \nCVs or job postings and to prepare some data and statistics. \nUser 4. \nNational and Local Governments which want to analyze the situation on the \nemployment market in their countries and prepare documents on employment, \nsocial and educational policy. \nUser 5. \nEuropean Commission and the governments of EU countries which want to \nanalyze the statistics and prepare international agreements and documents on \nthe employment, social and educational policy. \n5 \nIntended Uses \nUse 1. \nPublish CV. Job seeker places his/her CV on the PES Portal.  \nUse 2. \nPublish Job Offer. An Employer places a Job Offer on the PES Portal. \nUse 3. \nSearch for Job Offers. The Employer looks for candidates for the Job Offer \nthrough PES Portal. \nUse 4. \nSearch for Employment information. Job Seeker looks for of general \ninformation about employment in a given location at the PES Portal. \nUse 5. \nProvide Job Statistics. The PES Portal provides employment statistics to the Job \nSeeker and Employer. \n",
  "speaker": "SYSTEM",
  "uuid": "1e9d2192-ded1-4a68-a756-170de3803882"
}