{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 83\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 83 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nrequirements should be taken into account. Some guidelines to help with this selection are \nprovided in this step. \nSoftware developers and ontology practitioners should select the ONLCM. Such selection \nconsists of locating, evaluating, and selecting an ONLCM for the ontology network project. The \nfollowing proposed substeps should be carried out for selecting the ONLCM:   \na) Identify ontology network development characteristics and constraints. The ONLCM \nselection should be based upon ontology network development characteristics and \nconstraints, such as: if prototyping is required during the development, if knowledge \nresource reuse is recommended, if the risk impact should be evaluated, etc. \nb) Identify all the possible ONLCMs. From the collection of ontology network life cycle models \npresented in Section 5.1, software developers and ontology practitioners should identify \npossible models to be applied, depending on ontology network development characteristics \nand constraints.  \nThe following assumptions can help software developers and ontology practitioners to \nidentify possible ONLCMs for a particular ontology network. \n¾ When ontology network requirements are assumed to be known at the beginning of the \nontology network development, the following ontology life cycle models can be \nproposed: waterfall model, incremental model or iterative model. \n¾ When ontology network requirements could be not known at the beginning of the \nontology network development and could change during the development, the following \nontology network life cycle models can be proposed: evolutionary prototyping or spiral \nmodel. \n¾ When uncertainties in the ontology network requirements can derive into risks in the \ndevelopment, which could be analysed, then the spiral model is proposed. \nBased on the aforementioned assumptions, the informal decision tree shown in Figure 36 is \nproposed to help software developers and ontology practitioners to select which ontology \nnetwork life cycle model is the most appropriate for their ontology network.  \n \nFigure 36. Decision Tree for Selecting the Ontology Network Life Cycle Model \nc) Evaluate the various ONLCMs based on past experience and organizational capabilities. \nEach proposed ONLCM should be evaluated using the past records (e.g., reports of \nproblems encountered in meeting schedules) and lessons learned.  \n",
  "speaker": "SYSTEM",
  "uuid": "23e0e5a5-1911-4ea8-b22e-4c97c77d4c6f"
}