{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 24\n \n \nPág. 26 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nSe creará el Comité de Expertos del Plan de Impulso de las Tecnologías del Lenguaje con las \nsiguientes funciones: \n \nAsesoramiento técnico al Comité de Dirección para el desarrollo del Plan. \n \nServir de mecanismo de interlocución entre los actores implicados en la consecución \nde los objetivos del Plan de Impulso de las Tecnologías del Lenguaje. \n \nFacilitar la colaboración, y el intercambio de experiencias y buenas prácticas en el \nproceso de realización del Plan. Colaborar en la difusión del Plan en sus respectivos \nsectores.  \nEn la composición del Comité de Expertos del Plan de Impulso de las Tecnologías del \nLenguaje se conjugará representatividad y eficacia. Su composición podrá variar a lo largo \nde la realización del Plan. El Comité de Expertos podrá crear grupos de trabajo para tareas \nespecíficas. En el Comité de Expertos deberán estar representados al menos los siguientes \nsectores: \n \nSector investigador en procesamiento de lenguaje natural. \n \nSector industrial del procesamiento de lenguaje natural. \n \nSector académico e institucional relacionado con el lenguaje. \n \nSector público implicado en la realización del Plan. \n- Medida 3: Planificación Operativa  \nEntre los cometidos del Comité de Dirección se encuentra la planificación operativa del Plan \na lo largo de su existencia. Es responsable de cada uno de los ciclos de planificación y de las \nfases de cada ciclo (evaluación de la situación inicial, objetivos operativos, diseño y \nevaluación de alternativas, propuesta de actuación, coordinación de actuaciones, \nevaluación de sus resultados). La aprobación del plan operativo corresponderá a los \nórganos competentes. Los planes que se citan en los diversos ejes y líneas forman parte de \nesta planificación operativa que es responsabilidad del Comité de Dirección. \n- Medida 4: Evaluación de la situación y de la realización del plan  \nUn elemento principal de los ciclos de planificación operativa es una evaluación periódica \nobjetiva y suficientemente precisa tanto de la situación, como de los resultados de cada \nfase de la implementación del Plan. Estas tareas de evaluación se coordinarán, en la \nmedida de lo posible, con otros planes de la Agenda Digital para España. \n- Medida 5: Coordinación con otras administraciones \n \nEs imprescindible asegurar una estrecha coordinación y cooperación con otras \nadministraciones en varios ejes: Administraciones Autonómicas, Unión Europea e \nIberoamérica. \n \n",
  "speaker": "SYSTEM",
  "uuid": "25c2ca03-0acd-47a0-8d1e-ea7ce2768d5a"
}