{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 22\n22\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\nProof. This result can be established by exhibiting a Boolean CQ q over a schema\nR, a database D for R, and a set Σ of CDs over R for which there is no a (ﬁnite)\nﬁrst-order query qΣ such that ⟨⟩∈ans(q,D,Σ) if and only if ⟨⟩∈qΣ(D).\n1.5.2 Combined Complexity\nWe now focus on the combined complexity of the CQ answering problem under\nnon-conﬂicting CDs. First we show that, providing that the chase does not fail, the\nproblem is in PSPACE in general, and is in NP in the case of IPCDs and BACDs.\nTheorem 1.6. Consider a CQ q/n over a schema R, a database D for R, a set Σ\nof non-conﬂicting CDs (resp., IPCDs or BACDs) over R, and an n-tuple t ∈Γ n. If\nchase(D,Σ) does not fail, then the problem whether t ∈ans(q,D,Σ) is in PSPACE\n(resp., NP) in combined complexity.\nProof. Let Σ = ΣT ∪ΣK, where ΣT are TGDs and ΣK are KDs. Since chase(D,Σ)\ndoes not fail, Theorem 1.2 implies that our problem is equivalent to the problem\nwhether t ∈ans(q,D,ΣT). Recall that ΣT is a set of inclusion dependencies. More-\nover, observe that if Σ is a set of BACDs, then the maximum arity over all predi-\ncates of R is bounded by a constant. The claim for non-conﬂicting CDs and non-\nconﬂicting BACDs follows from the fact that CQ answering under inclusion depen-\ndencies is in PSPACE in general, and in NP in the case of bounded arity [8].\nThe NP upper bound in the case of non-conﬂicting IPCDs does not follow imme-\ndiately from the fact that CQ answering under inclusion dependencies, in the case of\nbounded arity, is in NP since we have to deal with predicates of unbounded arity. It\nis possible to show that under non-conﬂicting IPCDs, for query answering purposes,\nit sufﬁces to consider an initial ﬁnite part of the chase whose depth is polynomial\nwith respect to q and R. This fact allows us to exhibit a non-deterministic PTIME\nalgorithm which decides whether t ∈chase(D,ΣT). For the formal proof we refer\nthe reader to [36].\nAs for Theorem 1.4, it is important to say that Theorem 1.6 does not provide the\nexact upper bound for the combined complexity of the problem under considera-\ntion, since we assume that the chase does not fail. The combined complexity of the\nproblem whether the chase fails will be studied in the next subsection.\nLet us now establish the desired lower bounds for CQ answering under non-\nconﬂicting CDs (resp., BACDs, IPCDs). A useful decision problem that we are\ngoing to employ in the proof of the following result is the ﬁnite function genera-\ntion (FFG) problem introduced and studied by Kozen in [37]. Consider a ﬁnite set\nof functions F ∪{f} from a set S to itself. The question is whether we can obtain\nf by composing functions of F. This problem is PSPACE-hard, even in the case of\nbijective functions.\n",
  "speaker": "SYSTEM",
  "uuid": "26340fcd-9e77-421a-ae8c-813d457e8f18"
}