{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 11\nGu´ıa de orientaci´on para investigadores noveles\n11\ngarant´ıa de un puesto seguro en una universidad, ya que la responsabili-\ndad de la selecci´on de personal recae en la propia universidad. El informe\nfavorable de la ANECA no es m´as que un mecanismo en el que queda con-\nstancia de manera oﬁcial que una determinada persona est´a capacitada y\ncumple las condiciones para poder acceder a una ﬁgura concreta del PDI en\ncualquier universidad nacional, es decir, la ANECA tiene por objeto asegu-\nrar un nivel m´ınimo. Como ya veremos, se especiﬁcan una serie de criterios\nde evaluaci´on, estructurados en diversos apartados y cada uno con un m´axi-\nmo de puntuaci´on, pero no se establece lo que punt´ua cada apartado en\nconcreto, lo cual nos permite tener una idea de lo que m´as se valora de cara\na obtener la correspondiente acreditaci´on o evaluaci´on favorable por parte\nde la ANECA, pero nos diﬁculta mucho saber en qu´e cosas deber´ıamos cen-\ntrarnos a priori, aprovechando todo lo que se lleva a cabo durante los a˜nos\nde investigaci´on previos a la obtenci´on del t´ıtulo de Doctor, para poder sacar\nel m´aximo provecho y obtener las puntuaciones necesarias para obtener el\ncertiﬁcado favorable, que nos permita poder acceder a formar parte del PDI\nde la Universidad cuando en ´esta se convoquen plazas.\n6.1.\nEvaluaci´on del profesorado para la contrataci´on\nTal y como ya se ha comentado, el profesorado contratado puede estar\nformado, entre otros, por las ﬁguras de Profesor Ayudante Doctor (PAD) y\nProfesor Contratado Doctor (PCD). Para poder acceder a una plaza como\nprofesor contratado en cada una de estas ﬁguras en cualquier universidad\np´ublica espa˜nola, se requiere previamente la evaluaci´on positiva por parte\nde la ANECA. Una vez emitido dicho informe, ´este ser´a v´alido en todo el\nterritorio nacional por tiempo indeﬁnido.\nProcedimiento de solicitud\nCuando alguien desea presentar la solicitud a ANECA, lo m´as r´api-\ndo y aconsejable es que visite su p´agina web (v´ease anexo A) ya que\nen ella, adem´as de encontrar la informaci´on necesaria, dispondremos\ntambi´en de informaci´on actualizada en todo momento. B´asicamente,\nel procedimiento se realiza v´ıa telem´atica, mediante una herramienta\ninform´atica a la que se puede acceder, o bien desde la p´agina web de\nANECA, o bien desde la p´agina web de la Direcci´on General de Uni-\nversidades (DGU) y a trav´es de la cual se rellenar´a la solicitud y el\ncurriculum vitae. La documentaci´on a presentar en el formato tradi-\ncional (en papel) estar´a formada por las copias cotejadas de la docu-\nmentaci´on acreditativa de la titulaci´on exigida y de todos los m´eritos\na los que se haga referencia en el historial acad´emico. Adem´as, el pro-\nceso de evaluaci´on est´a abierto durante todo el a˜no, por lo que no hay\nunos plazos establecidos para su solicitud. ANECA evaluar´a las solic-\nitudes en un plazo m´aximo de 3 meses h´abiles a partir de la fecha de\n",
  "speaker": "SYSTEM",
  "uuid": "26a6fb8b-d9ec-4147-b180-f73cf8417373"
}