{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 12\n10\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nconsumer markets – as with everything else, driven by the availability of mobile apps that can translate text\nas well as speech.\nApplications in the new ecosystem are emerging, many still at the consumer “long tail” stage of develop‐\nment, and the age of on‐site IT using licensed Enterprise software is far from over. But the impact of the new\necosystem on Enterprise software markets is already clear. Social business processes are being defined for\nnext‐generation applications. All major global software vendors are developing cloud strategies, and being\ndirectly challenged by new entrants.  Salesforce.com (whose SaaS CRM platform was the first major disrup‐\ntor in the Enterprise space) has evolved into a complete Platform‐as‐a‐Service (PaaS) company.\nNew‐generation PaaS offerings provide market access for small, specialist companies that would otherwise\nstruggle for visibility to customers, analogous in some ways to the opportunities for micro‐retailers on sites\nlike Amazon or eBay. Expanding the range and scope of platforms that can carry semantics, analytics, speech\nand translation products is an important opportunity. And alongside these shifts in the applications market,\nthe value of data itself has a growing impact. Platforms, and the applications built on them, are being recon‐\nfigured; data will drive innovation in much of the ecosystem, and managing the Big Data that flows from the\nmobile/social/global web itself is just the beginning: data (big, or not so big) is becoming crucial to innova‐\ntion. \nIn the era of semantics – when we need to know the meaning of the data that flows around the digital\nuniverse – Language Technology is essential for innovation. \nTransformational entrepreneurship will increasingly come from the intersection of engineering, design, and\ndomain expertise. Deep knowledge about a particular field or industry, and the capacity to apply known\ntechniques in new fields, will create value in the new ecosystem. Language Technology is key for such inno‐\nvation, entwined as it is with human knowledge and the ability to understand and interpret meaning in\nspeech and text.\nFigure 2: The LT Value Chain\n",
  "speaker": "SYSTEM",
  "uuid": "279529c7-163a-4b8b-bc87-5c1191cabf66"
}