{
  "message": "SYSTEM: Eswc2010webofdatatrack_submission_2.pdf: Página 12\n4   Preliminary evaluation \nIn this section we present some preliminary comparisons of the performance of our \ntool and DARQ, which has been the only system that we have managed to work \nwith17. The testbed that we have used cannot be considered as the definitive testbed, \nsince it does not explore sufficiently the whole range of types of distributed SPARQL \nqueries that may be considered in usual applications. However, we wanted to make a \nfirst test on the behavior of these systems. For these experiments, we used a PC with \nan Intel Core 2 Duo, 2.5GH and 3GB of RAM memory running on Windows 7. In \nterms of query response time, we executed the selected queries 10 times for each \nsystem, and obtained the median of all executions. \nThe first query is the one described in section 3 (bands from the Madchester \nmovement and, optionally, their members). DARQ does not return the whole set of \ncorrect answers since it skips the optional part of the query, meanwhile SPARQL-\nDQP provides correct answers to this query. SPARQL-DQP requires 4 seconds to \nexecute the query, while DARQ does it in 5 seconds.  \nOur next query involves the Bio2RDF18 set of SPARQL endpoints. In this query \nwe ask for the taxonomy, the gene and related elements of the protein Q8KKD2. To \nretrieve this information we have to query four SPARQL endpoints: Iproclass19, \nGeneId20, Taxon21, and GenBank22. The query is the following: \n \nSELECT ?iproclass.gene ?taxon.x ?genbank.genBank  \nFROM iproclass: <http://iproclass.bio2rdf.org/sparql>  \nFROM geneid: <http://geneid.bio2rdf.org/sparql>  \nFROM taxon: <http://taxon.bio2rdf.org/sparql‐taxon>  \nFROM genbank: <http://genbank.bio2rdf.org/sparql‐genebank>  \nWHERE \n{ \n   <http://bio2rdf.org/iproclass:Q8KKD2> \n                  <http://bio2rdf.org/ns/iproclass#xGeneid>  ?iproclass.gene . \n   ?iproclass.gene <http://bio2rdf.org/ns/bio2rdf#xTaxon>  ?geneid.taxon .  \n   ?geneid.taxon <http://bio2rdf.org/ontology/bio2rdf:xGI> ?taxon.x .  \n   ?taxon.x <http://bio2rdf.org/ontology/ncbi:featureID>  ?genbank.genBank .  \n} \n \nThe previous query has been subdivided and executed in three different stages, so \nas to test different configurations: \n- \nQ1. It obtains only the information from the Iproclass and Geneid SPARQL \nendpoints.  \n- \nQ2. It obtains the information from the Iproclass, Geneid and Taxon endpoints. \n- \nQ3. It obtains the information from the four endpoints.  \n                                                           \n17 Only Networked Graphs could be also comparable. However, we have not been able to \nconfigure it properly to execute it, and hope to be able to do it in the future. \n18 http://bio2rdf.org/ \n19 http://iproclass.bio2rdf.org/sparql \n20 http://geneid.bio2rdf.org/sparql \n21 http://taxon.bio2rdf.org/ \n22 http://genbank.bio2rdf.org/sparql \n",
  "speaker": "SYSTEM",
  "uuid": "28805b5c-4118-46bd-ba67-b24ed71897a7"
}