{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 18\nBÚSQUEDA \n \n18 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n• Medios: se dispone de un depósito con mucho vino (más de 100 litros …) y \nlas únicas operaciones permitidas son llenar cada garrafa en el depósito, \nvaciarlas en el depósito y pasar contenido de una garrafa a la otra, hasta \nque la primera se vacíe o la segunda se llene. (En particular, no es lícito \nsuponer que se dispone de otra garrafa que puede contener exactamente \ndos litros …) \n• El problema del granjero, el lobo, el carnero y la lechuga. \n• Entrada: un granjero, un lobo, un carnero y una lechuga se encuentran en la \norilla derecha de un río. \n• Salida: todos ellos han pasado a la orilla izquierda del río. \n• Medios y restricciones: se dispone de una barca que debe ser conducida por \nel granjero y que sólo tiene capacidad para uno de los otros elementos; el \nlobo se comerá al carnero si los deja juntos sin compañía en uno de los \nlados; el carnero se comerá la lechuga si los deja solos. \nEjercicios. A partir de las siguientes descripciones de los problemas que se indican, \ndetallar con mayor precisión la entrada, la salida y los medios de resolución. \n1) El problema del viajante. Un representante de comercio tiene que visitar una \nserie de ciudades viajando entre ellas por carretera. Dispone de un plano de la \nregión con la información de las distancias entre las ciudades. Desea partir de la \nciudad en la que está para volver a ella tras haber visitado el resto de ciudades, pero \nhabiendo hecho el mínimo número de kilómetros posible. \n2) Las n reinas. Se trata de situar n reinas (siendo n un número entero positivo \nmayor que 3) del ajedrez en un tablero n x n (el normal tiene 8 x 8 casillas) de modo \nque no se \"coman\" entre sí. \n \n2.2. Sistemas de producción y búsqueda. \nSi particularizamos la definición de problema dada en el apartado anterior del \nsiguiente modo: \n• Entrada: una descripción del estado inicial del mundo. \n• Salida: una descripción (parcial) del estado del mundo deseado. \n",
  "speaker": "SYSTEM",
  "uuid": "2a709adb-0edf-4633-8db5-a3d8698ec8b8"
}