{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 30\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97755\nlas ayudas no podrán superar el precio público de las tasas universitarias establecidas por \nla correspondiente Comunidad Autónoma para las universidades públicas.\nArtículo 52.  Pago de los precios públicos.\n1.  La ayuda, cuando proceda, se abonará directamente a las Universidades una vez \nque justifiquen la exención aplicada a los beneficiarios de ayudas de FPU. A tal efecto, las \nuniversidades presentarán ante la Dirección General de Política Universitaria la relación \nde beneficiarios del programa de becas de FPU a los que se ha eximido del pago de los \nprecios públicos, con indicación del número de créditos a los que alcanza la exención.\n2.  La solicitud de pagos de los precios públicos por parte de las universidades, se \npresentarán hasta el 30 de mayo de 2010, resolviéndose antes del 30 de septiembre.\nArtículo 53.  Incompatibilidades.\nLas ayudas de precios públicos indicadas en la presente Orden serán incompatibles \ncon las obtenidas para el mismo fin en cualquier otra convocatoria de entidades públicas \no privadas, para los mismos créditos que se acrediten en la solicitud de la presente \nconvocatoria.\nCAPÍTULO VIII\nDisposiciones finales\nPrimera.  Carta Europea del Investigador y Código de Conducta para la contratación \nde investigadores.\n1.  La Recomendación de la Comisión Europea (2005/251/CE) de 11/03/2005 \n(«DOUE» L75 de 22/03/2005), relativa a la Carta Europea del Investigador y Código de \nConducta para la contratación de investigadores, se aplicará en el subprograma incluido \nen esta Orden.\n2.  Los investigadores que reciban una ayuda con cargo al subprograma incluido en \nesta Orden deberán cumplir los principios y exigencias generales aplicables a los \ninvestigadores.\n3.  Las entidades a las que estén adscritos los investigadores en el ámbito del \nsubprograma incluido en esta Orden, así como los departamentos o entidades que \nfinancian las ayudas deberán cumplir los principios y exigencias generales de las entidades \nempleadoras y financiadoras.\nSegunda.  Habilitación competencial.–La presente Orden se dicta al amparo de lo \nestablecido en el artículo 149.1.15.ª de la Constitución, que asigna al Estado la competencia \nexclusiva en el fomento y coordinación general de la investigación científica y técnica.\nTercera.  Entrada en vigor.–La presente Orden entrará en vigor el día siguiente al de \nsu publicación en el «Boletín Oficial del Estado».\nMadrid, 6 de noviembre de 2009.–El Ministro de Educación, Ángel Gabilondo Pujol.\ncve: BOE-A-2009-18342\nhttp://www.boe.es\t\nBOLETÍN OFICIAL DEL ESTADO\t\nD. L.: M-1/1958 - ISSN: 0212-033X\n",
  "speaker": "SYSTEM",
  "uuid": "2adb4d8f-a94e-47ea-bdb0-1f33c5cd0c26"
}