{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 66\n64\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nLocalisation TMS \nLocalisation management systems are a specialized form of translation management system that are used\nprimarily or exclusively for software localisation. Localisation has a unique set of requirements compared to\ndocument translation, so this differentiation makes sense. For example, when localizing software, it is very\nimportant to pay attention to word length, as this affects the layout of a user interface. For example,\nGerman, with its longer average word length and abundance of compound words, can easily break the lay‐\nout of a webpage or application. Localisation management tools are designed with these issues in mind,\nwhereas document oriented tools are less concerned with issues like this.\nThere has been a proliferation of vendors that offer localisation as a turnkey SaaS offering over the past cou‐\nple of years. Examples include companies like GetLocalisation, OneSky, Smartling, Tethras, and Transifex.\nThese companies provide turnkey, cloud based services that enable customers to upload their prompt files\nand other assets, control how they will be translated and to what languages, and if needed, order bulk trans‐\nlations from a professional language service provider that has integrated with the service. The customer can\ngenerally combine machine, crowd (bring your own translators) and professional (outsourced) translation. \nTranslation Memory & Terminology Management \nTranslation memory and terminology glossaries are generally implemented as a feature within larger sys‐\ntems. These services are used to improve translator efficiency and accuracy. Term glossaries are translation\ndictionaries that are built from frequently occurring words or phrases, for example technical terms, brand\nnames, etc. These dictionaries are used to pre‐translate recurring words and phrases, and to assist transla‐\ntors in using consistent translations, and also to avoid translating items that should be left as is, such as\nbrand names.\nTranslation memory is a record of previously created human translations. Typically, this is used to display\nsimilar source texts and their translations, both as a memory aid for translators, and as a style guide.\nTranslation memory can also be used to boost translator efficiency, for example by enabling them to make\nsmall changes to previously created texts (see section 3.1.3.1 for information on translation memory). \nBoth services are typically integrated into a translation management system, but there are examples of\nstand‐alone translation memory services, including TAUS Data repository (estimated to be the largest), or\nMemSource, a commercial translation memory application that is available both as a self‐hosted product\nand as a SaaS offering.\nQA Tools & Processes\nTranslation management systems typically employ a number of tools and processes to maximize quality at\ndifferent stages of the project.\nTechnology Providers\nA number of translation process management platforms are commonly integrated into the translation sup‐\nply chain, including translation management systems, localisation management systems, captioning and\nsubtitling platforms, stand‐alone translation memory services and live interpretation systems. Each of these\ndirectly manages or interacts with the translation workflow, each with its own use cases and special require‐\nments.\n",
  "speaker": "SYSTEM",
  "uuid": "2bb65a8b-15a0-42f0-9afa-d0a1c07a18b7"
}