{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 5\n1 The Return of the Entity-Relationship Model: Ontological Query Answering\n5\nWe then turn our attention, in Section 1.6, to negative constraints, which allows\nus to express, for instance, non-participation of an entity to a relationship, but also\nmore general assertions. We show that the addition of negative constraints does not\nincrease the complexity of query answering.\nLast but not least, in Section 1.7, we mention that the tractable ER+ languages\nwe present here have most DL-Lite languages as special cases. This conﬁrms the\nusefulness of ER+ in ontology modeling and ontology-based query answering.\n1.1.3 Related work.\nOur model is based on Chen’s ER model [3]. The extended model considered\nin [16] includes the generalization and full aggregation constructs, while the one\nin [15] allows for arbitrary data types, optional and multivalued attributes, a con-\ncept for specialization and generalization, and complex structured entity types. [17]\nconsiders relational schemata with referential integrity constraints that can be asso-\nciated with an extended ER schema.\nThe paper [18] gives a formal ﬁrst-order semantics to the ER model. Reasoning\ntasks under theories expressed in different variants of the ER model, whose con-\nstructs are given a formal semantics, are studied in [19].\nQuery answering under ER ontologies is tackled in [20], where the proposed\nER language is strictly less expressive than the ones presented in this chapter; the\nproblem is studied in the context of data integration systems, and a a ﬁrst-order\nrewriting technique is proposed, later extended in [9]. The notion of separability was\nﬁrst introduced in [11]. Sufﬁcient conditions for separability appear, for instance,\nin [26, 27].\nThe formalism of [21], which is also studied with respect to query answering,\nis more expressive than ER+, and it does not offer the same tractability of query\nanswering.\nOther works [8, 22] consider query containment, which is tightly related to the\nquery answering problem in the case of incomplete information. [22] considers\nquery containment in a formalism similar to ER+, but with less expressive nega-\ntive constraints, and eventually incomparable to ER+; the combined complexity is\nhigher than the one under non-conﬂicting ER+, and data complexity is not studied.\nOur work is tightly related to the Semantic Web and, in general, to web data\nmanagement. The World Wide Web Consortium (W3C) deﬁnes several standards,\nincluding the Resource Description Framework (RDF) for the data layer, the Web\nOntology Language (OWL), based on Description Logics (DLs), for the ontology\nlayer, and the Rule Interchange Format (RIF), currently being deﬁned as a standard,\nfor the rule layer. Several ontology languages have been proposed, many of which\nare more expressive than ER+, while being less efﬁcient in terms of query answer-\ning. The ER+ model is intended to be a viable alternative to the most prominent\ntractable OWL sublanguages. Our ER+ variants offer the same, desirable tractabil-\nity properties (ﬁrst-order rewritability, in particular), while in addition avoiding the\n",
  "speaker": "SYSTEM",
  "uuid": "2bccf963-6520-4a11-83ae-3789aa97d45c"
}