{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 97\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 97 of 124\nWe currently use a threshold value of 0.8 which we observed to correctly indicate relatedness in most of\nthe cases. Indeed, as high values as 0.7 are often assigned to unrelated tags. For example, in the tagset:\n{girl, eating, red, apple} the similarity between red and girl is 0.7 for the senses:\nBolshevik, Marxist, Pinko, Red, Bolshie (emotionally charged terms used to refer to extreme radicals or\nrevolutionaries)\nGirlfriend, Girl, Lady_friend\n(a girl or young woman with whom a man is romantically involved)\nThese two senses are connected through the concept Person in the WordNet hierarchy, however the two\ntags are unrelated in the context of this tag cluster. While this empirically established 0.8 value lead to\nreasonable results and was sufﬁcient for this proof of concept prototype, we plan to establish an optimal\nvalue through systematic experiments.\nThanks to the modular architecture of FLOR, the disambiguation and sense selection method can be re-\nplaced by other methods (e.g., such as those used in [TGEM07] and [YGS07]). Or our current method could\nbe modiﬁed to exploit a different similarity measure between two concepts such as the Google Similarity\nDistance [CV07].\nAnother possible improvement could be achieved by further expanding the resource tagset with more related\ntags. These can be discovered with statistical measures based on tag co-occurrence as described in [SM07].\nFor example, the expanded tagset of {apple, mac} could be {apple, mac, computer, macOs}. So\ninstead of trying to disambiguate with two tags we increase the possibilities of ﬁnding the correct sense by\ndisambiguating with a more speciﬁc context.\nSUB-STEP 2.2: The Semantic Expansion\nexpands the tag with its synonyms and hypernyms (see Fig. 6.2). For the purpose of this work we used\nWordNet to extract the synonyms of the correct sense and the synonyms of this sense’s hypernym in Word-\nNet. For example, if in the speciﬁc context the tag jaguar refers to an animal then the semantic expansion\nwould include a list of synonyms: {Panther, Panthera onca, Felis onca} and a list of hypernyms: {Big cat,\nFeline, Carnivore}.\n6.1.3\nSTEP 3: Semantic Enrichment\nThe ﬁnal phase of FLOR identiﬁes the SWEs that are relevant for each tag by leveraging the results of\nlexical cleaning and semantic expansion performed in the previous two phases. The ﬁnal output of FLOR\nis produced by this phase (see Fig. 6.1) and it is an enriched tagset with relevant SWEs and their semantic\nneighbourhood (e.g., parents, children, relations).\nSUB-STEP 3.1 and 3.2: Entity Discovery and Selection\nThe relevant SWEs are discovered by querying the WATSON semantic web gateway [M. 07], which gives\naccess to all online ontologies. We search for all ontological entities (Classes, Properties, Individuals) that\ncontain in their local name or in their label(s) one of the lexical representations or the synonyms of a tag.\nSuch queries often result in several SWEs some of which are very similar (or the same when they appear in\nontologies that are versions of each other). To reduce the number of SWEs, we perform an entity integration\nprocess similar to the one described in [TGEM07]. The goal of this process is to “collapse\" entities that have\na high similarity into a single semantic object, thus reducing redundancy. To compute similarity between two\nentities we compare their semantic neighbourhoods (superclasses, subclasses, disjoint classes for classes;\ndomain, range, superproperties, subproperties for properties) and their localnames and labels. The similarity\nsimDgr for two SWEs e1 and e2 is calculated as:\nsimDgr = Wl ∗simLexical(e1, e2) + Wg ∗simGraph(e1, e2)\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "2bd7d411-a346-457a-8f4e-7da6e5c4519e"
}