{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 302\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n308\n493.- Catálogo de Investigaciones Educativas. Centro de Investigación\ny Documentación Educativa (CIDE)\nDirección Web: http://www.mec.es/cide/jsp/plantilla.jsp?id=inv05\nOrganismo editor: Centro de Investigación y Documentación Educativa (CIDE).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Educación.\nDescripción y comentarios: Catálogo de investigaciones educativas perteneciente al Centro\nde Investigación y Documentación Educativa. El Catálogo de Investigaciones Educativas\nrecoge las investigaciones financiadas o realizadas por el CIDE y los organismos del\nMinisterio de Educación que le precedieron. Incluye los resúmenes de casi un millar de inves-\ntigaciones, resultado de la actividad de este centro desde hace más de treinta años. Su estruc-\ntura es similar a la de los Catálogos que periódicamente se han ido publicando en papel desde\n1974. En cada investigación se indica el título, la procedencia institucional, el director del pro-\nyecto y los investigadores, la convocatoria en que se aprobó o si se trata de un proyecto del\npropio organismo, y el año de finalización del trabajo, junto con un resumen. Las investiga-\nciones se clasifican en 18 áreas temáticas y están indexadas por descriptores (de nivel educa-\ntivo, temáticos y metodológicos) utilizando el Thesaurus Europeo de la Educación (Comisión\nde la Unión Europea-Consejo de Europa). Por último, si la investigación ha sido publicada,\nse cita la referencia correspondiente. Los estudios aquí resumidos, aunque estén inéditos, se\nencuentran a disposición del público en la Biblioteca del Ministerio de Educación, Política\nSocial y Deporte. Algunos de ellos han sido además publicados por este Ministerio o por otras\ninstancias. En este catálogo se pueden utilizar descriptores predeterminados.\n494.- Catálogo de Publicaciones Periódicas de la Biblioteca General del Centro\nde Investigación y Documentación Educativa (CIDE)\nDirección Web: http://www.mec.es/cide/jsp/plantilla.jsp?id=bib04\nOrganismo editor: Centro de Investigación y Documentación Educativa (CIDE).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Educación.\nDescripción y comentarios: Base de datos que refleja el conjunto de las publicaciones\nperiódicas conservadas en la Biblioteca del MEC, con sus datos fundamentales: título, edi-\ntor, fechas que abarca, descriptores, etc. \nMINISTERIO DE EDUCACIÓN POLÍTICA SOCIAL Y DEPORTE\nBASES DE DATOS  1/1/04  03:39  Página 308\n",
  "speaker": "SYSTEM",
  "uuid": "2bf5299b-4e7e-4670-ba51-d5460402336a"
}