{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 13\n11\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n2. Markets for Language Technology\n2.1 The Market Context for LT\nNeedless to say, the reconfiguration of the ICT landscape has an impact on markets. Language Technology is\nan unusually broad software category that is engaged in a wide range of product and service sectors, from\ncore technology deeply embedded in complex Enterprise systems, to sophisticated consumer gizmos, to\nindustrial robotics (and everything in between). Although LT has been a commercial market for many years,\nonly recently have technological conditions made it possible to exploit LT on a large scale. In the market con‐\nditions surrounding the new ICT ecosystem, take‐up of Language Technology is accelerating.\nMany LT‐based applications are clustered in segments of Enterprise software and services. While the overall\nEnterprise market for software and services is currently growing at around 4.5%/year (recovering from a con‐\ntraction of 3% in 2009, and an estimated loss of over a thousand billion Euro in sales during the recession),\nsome segments are growing much faster, driven the trends outlined above. The fastest growth is in Big Data\nsoftware and services, which is currently expanding at 38%/year, forecast to be worth €13B globally by 2015\naccording to IDC (starting from practically zero only a few years ago). The exceptional growth rate for Big\nData products reflects the strategic needs of Enterprise both to manage the data deluge in all its forms and\nto exploit the availability of new sources of data to improve operational performance.\nSoftware that embeds LT to manage textual and spoken information and content, and the platforms that\nprocess and communicate knowledge, are also high growth markets according to IDC forecasts.2 For instance\nthe Business Analytics market (including Business Intelligence, Data Warehousing platforms, and Analytics\napplications) is experiencing 12% growth, and is expected to be worth €36B globally by 2015. Customer\nRelationship Analytics (part of the Customer Experience Management market with strong growth driven by\nsocial data) is growing at 11% heading towards a value of €2.6B. Growth for Search & Discovery software and\nservices is less strong, though still double the industry average, at 7% CAGR, growing to €2.4B in 2015; most\nof the activity here is in Unified Information Access platforms and applications built around them for partic‐\nular business domains – the conventional “generic” Enterprise search software market is no longer growing.\nContent Management (including Document Capture and Imaging, Content and Records Management, Web\nand Digital Asset Management) is growing at 9%, aiming for €4.8B in 2015. According to TechNavio, the on‐\ndemand, cloud‐based share of these markets is growing much faster than old‐style packaged/licensed prod‐\nucts, estimated by them to be 17% a year over the period 2011‐2015.\nThe mobile market is where the convergence of LT features is most visible, e.g. combining speech with intel‐\nligent search and navigation systems, or translators. The mobile device market is the largest consumer elec‐\ntronics market globally, experiencing massive innovation in multiple different areas; OEMs, carriers, software\nvendors, and silicon providers are all scrambling to stay competitive in this rapidly changing space. Major\ninnovation is centred around enhancing the User Interface with emphasis on interactivity using gesture,\nspeech, and facial recognition, and adding intelligent, location‐aware services; security, displays, connectiv‐\nity solutions, and sensors are also areas of high innovation.\nWorldwide smart‐phone shipments passed a new milestone during the third quarter of 2012, with the total\nnumber surpassing 1 billion units, forecast to reach the second billion within three years (according to\nStrategy Analytics) and experiencing annual revenue growth of 25%/year according to TechNavio. Growth in\nautomotive telematics, which already overlaps with the smart‐phone market (e.g. sharing platforms and\nsoftware) is even faster estimated at 33%/year. Tablet and eReader sales, boosted in part by the increasing\nadoption of eLearning technology, are growing at 21%/year.\n2 Unless noted otherwise, all Enterprise software market data is supplied by IDC.\n",
  "speaker": "SYSTEM",
  "uuid": "2d42e79d-2352-4e85-95a6-05412853b917"
}