{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 16\n \n \nPág. 18 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nObjetivos específicos del plan \n3\n \nEl objetivo general del Plan de Impulso de las Tecnologías del Lenguaje es desarrollar la industria \ndel procesamiento del lenguaje natural y la traducción automática en España, especialmente en \nlengua española y lenguas cooficiales.  \nEste objetivo general puede descomponerse en los siguientes objetivos específicos:  \n1. Desarrollo de infraestructuras lingüísiticas: \n \nImpulsar la industria del procesamiento del lenguaje natural en español y lenguas \ncooficiales poniendo a su disposición infraestructuras lingüísticas (recursos y \nprocesadores) de propósito general. \n \nReducir la distancia que separa las infraestructuras lingüísticas en español y las lenguas \ncooficiales respecto del inglés en lo que se refiere a la cantidad, calidad y disponibilidad \nde infraestructuras lingüísticas de propósito general para procesamiento del lenguaje \nnatural y traducción automática. \n \nAsegurar la disponibilidad pública gratuita o a bajo coste (al menos para PyMEs \ninnovadoras, sector investigador y Administraciones Públicas) de infraestructuras \nlingüísticas de calidad en español y lenguas cooficiales. \n \nAsegurar la coordinación en el desarrollo de infraestructuras lingüísticas, evitando \nduplicidades y buscando sinergias. Disponer de herramientas comunes para la \ngeneración así como campañas de evaluación de infraestructuras lingüísticas. \n \nAdoptar normas técnicas de interoperabilidad, una política de licencias adecuada, y \nmecanismos de protección de datos personales en la generación de recursos \nlingüísticos. \n \nPotenciar métodos de generación automática de recursos lingüísticos. \n2. Impulso de la industrias de las tecnologías del lenguaje: \n2.1. Mejorar  la visibilidad y la transferencia de conocimiento del sector: \n \nMejorar la visibilidad del sector del procesamiento de lenguaje natural y de la \ntraducción automática.  \n \nTrasladar la excelencia investigadora española a la industria. Recuperar doctores \nespecialistas y formar nuevos investigadores y desarrolladores en estas áreas. \n2.2. Apoyo a la internacionalización y la comercialización del sector: \n \nMejorar la internacionalización de las empresas del sector, especialmente en el \nmercado iberoamericano y norteamericano. \n",
  "speaker": "SYSTEM",
  "uuid": "2d85bab8-0a5d-4183-a515-3c3077fcd1ed"
}