{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 23\n \nAutores: Aguado de Cea, G., Álvarez de Mon, I. Pareja Lora, A. y Plaza Arteche, R \nTítulo: A Semantic Web Page Linguistic Annotation Model \nTipo de participación: Coautora de la ponencia \nCongreso: 15th European Conference on Artificial Intelligence, Workshop on Semantic Authoring, Annotation and Knowledge \nMarkup \nPublicación: Si \nLugar celebración: Lyon, France \nFecha: Julio, 2002 \n \n \nAutores: Bernardos, S. y Aguado de Cea, G. \nTítulo: Reutilización y adaptación de la ontología GUM al castellano \nTipo de participación: Coautora de la ponencia \nCongreso: IX Conferencia de la Asociación Española para la Inteligencia Artificial, CAEPIA 2001 \nPublicación: Si (“Actas de la IX Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA 2001)”; ISBN: \n84-932297-0-9) \nLugar celebración: Gijón, España \nFecha: Noviembre, 2001 \n \nAutores: Aguado de Cea, G. \nTítulo: Lenguas para fines específicos y terminología: algunos aspectos teóricos y prácticos \nTipo de participación: Conferenciante invitada \nCongreso: I Encuentro Internacional de Estudios de Filología Moderna y Traducción \nPublicación: Si \nLugar celebración: Las Palmas de Gran Canarias, España \nFecha: Noviembre, 2001 \n \n \n \nAutores: Aguado de Cea, G. \nTítulo: Creación Terminológica y desarrollo científico en informática \nTipo de participación: ponente en Mesa Redonda sobre \"Aportaciones de la ingeniería a la lengua española\" \nCongreso: Jornadas organizadas por el Instituto de la Ingeniería de España \nPublicación: http://www.iies.es/comites/terminologia/creacionterminologica.pdf \nLugar celebración: Madrid, España \nFecha: Mayo, 2001 \n \n \nAutores: Aguado de Cea, G. y Bernardos, S. \nTítulo: Método para la elaboración de un corpus  para la GLN \nTipo de participación: Co-Autora de la Ponencia \nCongreso: Sociedad Española para el Procesamiento del Lenguaje Natural (SEPLN) \nPublicación: Si \nLugar celebración: Vigo, España \nFecha: Septiembre, 2001 \n \n \nAutores: Aguado de Cea, G. \nTítulo: Situación actual y perspectivas de las lenguas para fines específicos en España. \nTipo de participación: ponente en Mesa redonda. \nCongreso: I Congreso Internacional de la Asociación de lenguas para fines específicos (AELFE) \nPublicación: No \nLugar celebración: Madrid \nFecha: Septiembre, 2000 \n \n \nAutores: Aguado de Cea, G. \nTítulo: Las Metáforas en  el Lenguaje de Internet \nTipo de participación: Conferenciante invitada \nCongreso: El Inglés Profesional y Académico. Universidad de Castilla la Mancha \nPublicación: No \nLugar celebración: Ciudad Real, España \nFecha: Julio, 2000 \n \n \nAutores: Aguado de Cea, G. y Bernardos, S. \nTítulo: Ontogeneration: Arquitectura basada en ontologías para la generación de textos en castellano \nTipo de participación: CO-Autora de la Ponencia \n",
  "speaker": "SYSTEM",
  "uuid": "2eb9f402-007b-49cc-9b4c-5da9155b7990"
}