{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 12\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 12 de 42 \n2.2 \nDetalle de los proyectos de los últimos cinco años \nEn total 33 proyectos internacionales, de los cuales 9 son coordinados; 56 proyectos nacionales; y 29 \ncontratos con empresas. En los últimos 5 años el Ontology Engineering Group (Grupo de Ingeniería \nOntológica) ha participado en los siguientes PROYECTOS financiados con cargo a convocatorias \npúblicas con concurrencia competitiva. \n \nTítulo del proyecto: Transforming Transport — TT (H2020-731932) \nEntidad financiadora: Unión Europea \nEntidades participantes: (47) \nDuración, desde: \n01-01-2017 \nhasta: 30-6-2019 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Governance of the Interoperability Framework for Rail and Intermodal Mobility — \nGoF4r (H2020-730844) \nEntidad financiadora: Unión Europea \nEntidades participantes: UNION DES INDUSTRIES FERROVIAIRES EUROPEENNES - UNIFE, \nCEFRIEL - SOCIETA CONSORTILE A RESPONSABILITA LIMITATA, CNC CENTRO NUOVA \nCOMUNICAZIONE SRL, D'Appolonia Belgium NV, EUROPEAN PASSENGERS' FEDERATION IVZW, \nMasarykova univerzita, OLTIS GROUP AS, POLITECNICO DI MILANO, RAIL SAFETY AND \nSTANDARDS BOARD LIMITED, Teleste oyj, TRENITALIA SPA, UNION INTERNATIONALE DES \nCHEMINS DE FER, UNION INTERNATIONALE DES TRANSPORTS PUBLICS, ZILINSKA UNIVERZITA \nV ZILINE, UNIVERSIDAD POLITECNICA DE MADRID, THE UNIVERSITY OF SHEFFIELD \nDuración, desde: \n01-11-2016 \nhasta: 31-10-2018 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Open Applications for Semantically Interoperable Services — OASIS (2015-EU-IA-\n0037 (26696297)) \nEntidad financiadora: Unión Europea \nEntidades participantes: Stad Gent, Open Knowledge Belgium, V-ICT-OR Dienstverlening, iMinds, \nUniversidad Politécnica de Madrid, Consorcio Regional de Transportes de Madrid \nDuración, desde: \n01-10-2016 \nhasta: 30-9-2018 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: esTextAnalytics. Servicios de Text Analytics para la explotación comercial de la \nDBpedia del español (esDBpedia) \nEntidad financiadora: Ministerio de Economía y Competitividad \nEntidades participantes: UPM \nDuración, desde: \n01-10-2016 \nhasta: 31-8-2018 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: Specialist Task Force on Maintenance & Evolution of SAREF Reference Ontology \nEntidad financiadora: European Telecommunications Standards Institute \nEntidades participantes: UPM \nDuración, desde: \n01-04-2016 \nhasta: 31-12-2016 \nInvestigador responsable por la UPM: Raúl García Castro \n \nTítulo del proyecto: Servicio para la realización de un inventario de recursos lingüísticos para \ntraducción automática \nEntidad financiadora: Secretaría de Estado de Telecomunicación y para la Sociedad de la Información. \nMinisterio de Industria \nEntidades participantes: UPM \nDuración, desde: \n01-04-2016 \nhasta: 30-09-2016 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \n",
  "speaker": "SYSTEM",
  "uuid": "2f939a91-3377-4ff8-b3b8-62d92df0dbd3"
}