{
  "message": "SYSTEM: Eswc2010webofdatatrack_submission_2.pdf: Página 14\nprovide more fine-grained detail about the advantages and disadvantages of each \napproach.  \n \nOur future work will be devoted to the extension of the current SPARQL-DQP \nexpressivity, so that it covers more aspects of the SPARQL query language (more \nquery types like ASK, CONSTRUCT and DESCRIBE, result modifiers and SPARQL \noperators), and to the creation of additional optimizers specialized for the type of data \nthat we are handling, while trying to understand better which other SQL-related \noptimizers we can apply in combination with those ones.  \nAs it is stated in [4] and previously mentioned in the Preliminaries section, the \ntransformation of SPARQL query plans to SQL query plans has certain limitations. \nThe problems described with null/blank values, nested optionals and filters require a \nmore detailed study.  \nFinally, our approach would clearly benefit from the existence of statistics about \nthe RDF datasets to query, so that more optimized query plans can be created. It is \nimportant to know how many specific properties, classes or instances of a class an \nRDF repository contains. Statistics are widely used in the database world to perform \noptimizations over the logical query plans created due to the same reason. Two main \napproaches currently exist in this sense. The first one, RDFStats [10], crawls existing \nRDF repositories creating statistics and histograms about them. These statistics can be \naccessed with the RDFStas API. The second approach, examineRDF23, produces \nstatistics about large datasets: UniProt24, DBpedia, CIA World Factbook25 and the \n230M triple BSBM26 dataset. Our current implementation should be extended by \nconsidering some of these existing statistics in order to generate more optimized \nquery plans.  \n8 Acknowledgments \nThis work has been performed in the context of the ADMIRE project (FP7 ICT-\n215024). We would like to thank the OGSA-DAI team (Ally, Bartek, Amy, Tilaye, \nMario, Alastair, Mike and Elias) for the help provided during the system \nimplementation, and to Claudio Gutiérrez and Renzo Angles for their collaboration in \nthe understanding of the relationship between SPARQL and SQL. Finally we thank \nAlexander de León for his support on the generation of the testbed for bio2rdf.org. \n9   References \n[1] Angles R, Gutiérrez C (2008) The Expressive Power of SPARQL. In Proc. of the \n7th International Semantic Web Conference (ISWC 2008). LNCS 5318:114-129. \n                                                           \n23 http://www.zaltys.net/examineRDF/ \n24 http://www.uniprot.org/ \n25 https://www.cia.gov/library/publications/the-world-factbook/ \n26 http://www4.wiwiss.fu-berlin.de/bizer/BerlinSPARQLBenchmark/ \n",
  "speaker": "SYSTEM",
  "uuid": "30ef1ec4-6d65-4881-af5e-4684538e4e2b"
}