{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 98\nPage 98 of 111 \nNeOn Integrated Project EU-IST-027595 \nThe iSOCO team also reuse ideas from projects whose main goal is to integrate the invoice \nvocabulary into ontologies. The problem of integrating invoice vocabulary like the one provided \nby UBL into ontologies is not new. Projects like the ONTOLOG project19 or the XBRL Ontology \nproject20 cover this issue. The goal of the ONTOLOG project is to extend SUMO with the UBL \nvocabulary of invoicing. The project extends SUMO with the elements necessary for \nrepresenting the invoice concepts and all the related concepts and relations and also classes \nthat define the vocabulary used in UBL. The XBRL Ontology Specification provides main \nconcepts and properties for describing financial and economic data on the Semantic Web. This \nlast approach creates, from scratch, the invoice ontology but it is still in an early stage. There \nalso exist other projects about integration like [59], HARMONISE21 or [29] in which semantic \ninteroperability is achieved to integrate the different technologies. \n¾ Ontology Conceptualization, Ontology Formalization, and Ontology Implementation. All \nthe knowledge gathered from the analysis of the domain [30], from the needs identified from \nthe competency questions, and from the existing resources identified previously are integrated \nin the development of the invoice ontology. The initial ontology network is built following the \nterminology from upper ontologies and using the knowledge extracted from the experts. Once \nthe implementation is finished, the Ontology Integration of the reused time ontology and of \nthe invoice technologies reused and reengineered is carried out.  \nThe ontology is developed using Protégé 3.2 and the ontology language selected is OWL. \n¾ Ontology Specialization. The final invoice reference ontology will be adapted to the cluster of \ncompanies that will use it, for instance, a laboratory. The invoice reference ontology will be \nspecialized according to each cluster of companies’ needs (in an initial phase only laboratories \nare included). \n¾ Ontology Localization. Localization is not a very important need of this invoice ontology \nnetwork but it should be taken into consideration. The users of this ontology belong to different \nregions of Spain in which different languages are used. Although Spanish is the official \nlanguage in the entire national territory, in these regions other languages co-exist; that is why \nlocalization has to be taken into account. \nAs ontologies have to be adapted to other countries, the necessity of localization is strongly \nneeded. Localization will be carried out initially for the different Spanish regions and then will \nbe adapted to other countries.  \nThe ontology network has been designed in English, so all concepts are written in English. It \ncan be adapted by the end users to their own language and particular needs. \n¾ Ontology Evaluation. The ontology network will be evaluated by the users of PharmaInnova. \nThey will also create and evaluate the ontology network invoices. Their evaluation will consist \nof two steps: first, the end users validate the ontology, checking whether it has all the concepts \nthey need; then they adapt the invoice reference ontology using the prototype created in the \nscope of WP8 and emit invoices that are instances of the adapted ontology. This second \nevaluation step requires longer time because the prototype is still in a development phase. \nFigure 40 shows what the Invoice Management ontology network (for more detail [31]). \n                                                 \n19 http://ontolog.cim3.net/ \n20 http://xbrlontology.com/ \n21 http://www.ercim.org/publication/Ercim_News/enw51/missikoff.html \n \n",
  "speaker": "SYSTEM",
  "uuid": "313a7c3f-fa05-4b79-8faf-1ce7821ec88e"
}