{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 34\nBÚSQUEDA \n \n34 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n \n2.5. Espacios de estados. \nComo hemos definido en 2.3, el espacio de estados es el conjunto de estados \nfactibles para un problema junto a la estructura de adyacencia definida \nimplícitamente por los operadores o reglas. Según la estructura que los operadores \ndefinan sobre el conjunto de estados hablaremos de árbol o grafo de estados. Las \nposibilidades relevantes (por cómo influyen en el proceso de búsqueda) son: \n• Arbol \n• Grafo dirigido acíclico \n• Grafo dirigido (no necesariamente acíclico) \n• Grafo no dirigido \nEmpezando por el final, la estructura de grafo no dirigido de estados aparece cuando \nsi de un estado e se puede pasar a un estado e' por aplicación de un operador \nsiempre existe otro operador (o el mismo) que permite pasar de e' a e. Este es el \ncaso, por ejemplo, del 8-puzzle con la representación con la que venimos \ntrabajando. Con esta estructura, si no se toman las medidas oportunas, la búsqueda \npuede caer en ciclos que impidan la terminación de la ejecución. \nSi no se da la circunstancia anterior, existen estados e, e' tales que de e se puede \npasar a e', pero de e' no se puede pasar a e. En este caso, la dirección u \norientación de la adyacencia es importante y se habla de grafo dirigido de estados. \nPor ejemplo, en la representación dada para el problema de las garrafas, del estado \n(3,0) se puede pasar al estado (0,0) (aplicando el operador vacia-cuatro), pero no se \npuede pasar (directamente; esto es, por aplicación de una única regla) de (0,0) a \n(3,0). Pero, en general, que no se pueda pasar directamente no significa que no se \npueda pasar por una secuencia de aplicaciones de reglas. Eso posibilita la aparición \nde ciclos (dirigidos) como el siguiente: (0,0) --> (0,3) --> (3,0) --> (0,0). En este caso, \nla aparición de bucles infinitos en la búsqueda que se citaron para los grafos no \ndirigidos de estados también pueden reproducirse y será necesario tenerlo en \ncuenta en el diseño de estrategias de control. \nSi en el grafo dirigido no aparecen ciclos (dirigidos) hablaremos de grafo dirigido \nacíclico de estados. Para poner un ejemplo de un tal espacio de estados, pensemos \nen la siguiente representación para el problema de las n reinas. Conceptualmente, \n",
  "speaker": "SYSTEM",
  "uuid": "319a3b85-c113-49b9-ad45-9a02078eac0c"
}