{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 65\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 65 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nontology networks from scratch than those proposed by METHONTOLOGY [32] or On-To-\nKnowledge [53] for building ontologies. \nThe ontology network development should start with the knowledge acquisition activity, \npossibly including the ontology elicitation activity. This activity should be carried out during the \nwhole development; however, software developers and ontology practitioners should acquire \nmost of the knowledge at the beginning of the process. The level of knowledge acquisition \ndecreases as development progresses. \nSimultaneously with the knowledge acquisition activities, software developers and ontology \npractitioners should specify the requirements that the ontology network should fulfil, by means \nof the ontology specification activity. The purpose of the ontology specification activity is to \noutput a document that includes the purpose, level of formality and scope of the ontology \nnetwork, target group and intended uses of the ontology network.  \nThen, software developers and ontology practitioners should carry out the ontology \nconceptualization activity. In this activity, the domain knowledge, obtained during the \nknowledge acquisition activities, should be organized and structured in a conceptual model \naccording to the ontology specification document. In this scenario reuse is not considered, as \nstated in the scenario assumptions.  \nHaving completed the ontology network conceptualization, software developers and ontology \npractitioners should formalize the ontology network and implement it in an ontology language \n(e.g., OWL, RDF(S), or F-Logic), by means of the ontology formalization and the ontology \nimplementation activities, respectively. \nOntology support activities, such as knowledge acquisition and elicitation, documentation, \nconfiguration management, evaluation and assessment, should be carried out during the whole \nontology network development. The intensity of such activities depends on the concrete \nmoment of the development progress. \nIn the case of the ontology evaluation activity, it can include different “sub-activities” (ontology \nvalidation and ontology verification activities) as shown in Figure 21. The ontology validation \nactivity can be seen as a process composed of two activities (following the ‘process’ definition \nof Section 2.1): ontology diagnosis and ontology repair activities. \n \nFigure 21. Ontology Evaluation Activity \n Outcomes: The principal output is a network of ontologies that represents the expected \ndomain implemented in an ontology language (OWL, F-Logic, etc.). In addition, a broad range \nof documents, such as the requirements specification, the ontology documentation, the \nontology evaluation, etc., will be generated as output by the different activities. \n",
  "speaker": "SYSTEM",
  "uuid": "3281af8e-fae4-4925-a334-306f2e616d54"
}