{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 19\n \n \nPág. 21 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nArticulación del Plan \n4\n \nPara la elaboración del Plan de Impulso de las Tecnologías del Lenguaje se ha constituido un \nComité Directivo interdepartamental que reúne a los órganos de la Administración General del \nEstado con protagonismo en esta materia. El Comité Directivo, a su vez, requirió un informe \nprevio de un Comité de Expertos que reunía a representantes de los sectores implicados \n(investigador, industria, Academias, Administraciones Públicas) sobre el estado de las \ntecnologías del lenguaje en España que incluía, además, recomendaciones para el desarrollo de \neste sector en España. \nLas medidas propuestas en este Plan pretenden contribuir al desarrollo de los objetivos \nestratégicos de la Agenda Digital para España, así como a aquellos objetivos concretos \nestablecidos en el presente Plan. Estas medidas se organizan en los siguientes ejes: \nEje 0: Gobernanza \nEste eje inicial pretende definir un mecanismo de coordinación, colaboración e intercambio de \nideas, documentación e información entre los diferentes agentes implicados en esta industria con \nel objetivo de evaluar la situación actual del sector, evaluar el avance del Plan periódicamente y \nplanificar las sucesivas actuaciones al respecto. Esta herramienta de coordinación y control \nestará compuesta por el Comité Directivo y por un Comitéde Expertos.  \nEje I: Apoyo al desarrollo de infraestructuras lingüísticas \nEl procesamiento de lenguaje natural y la traducción automática de textos se basa en el uso de \nprocesadores lingüísticos que permiten, por ejemplo, realizar automáticamente la extracción de \nlemas, reconocimiento de entidades (nombres de personas, organizaciones, lugares,…), \ndesambiguación de términos, cálculo de la similitud semántica entre documentos, clasificación \nautomática de los mismos, simplificación del contenido textual, generación de resúmenes, etc. \nPara realizar dichas tareas son necesarios recursos lingüísticos específicos que dependen de la  \nlengua procesada o traducida, el dominio de información tratada y otros factores específicos. \nEstos recursos lingüísticos son, por ejemplo, corpus paralelos (colecciones de documentos en \nvarias lenguas), listas de nombre propios (de personas, organizaciones, marcas, topónimos, \netc.), terminologías, diccionarios, etc.; todos ellos en los formatos adecuados para ser \nexplotados por los procesadores lingüísticos.  \nEl objetivo de este eje es el desarrollo de procesadores y recursos lingüísticos de propósito \ngeneral. \nEje II: Impulso de la Industria del Lenguaje \nSe pretende apoyar la transferencia de conocimiento entre el sector investigador y la industria. \nDebe apoyarse firmemente la captación y generación de talento en torno al sector de las \ntecnologías del lenguaje con el fin de preservar el conocimiento en nuestras universidades y su \ntransferencia a empresas del sector o de nueva creación en el marco del apoyo a la innovación.  \n",
  "speaker": "SYSTEM",
  "uuid": "349edb30-2690-40a7-99c3-eaccce9cef78"
}