{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 185\nMINISTERIO DE MEDIO AMBIENTE Y MEDIO RURAL Y MARINO\n191\n262.- Buscador de documentos de la Agencia para el Aceite de Oliva\nDirección Web: http://aao.mapa.es/\nWeb adicional: http://intereweb.mapa.es/pwAgenciaAO/Buscador.aao?opcion_seleccionada=\n40&control_acceso=S&idioma=ESP\nOrganismo editor: Agencia para el Aceite de Oliva.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nTexto completo\nAvanzada\nMateria: Agricultura.\nDescripción y comentarios: Base de datos de toda la documentación relativa a la Agencia\npara el Aceite de Oliva, incluyendo las disposiciones legislativas sobre el aceite de oliva.\n263.- Boletín hidrológico\nDirección Web: http://www.mma.es/portal/secciones/acm/aguas_continent_zonas_asoc/\nboletin_hidrologico/index.htm\nOrganismo editor: Área de Coordinación Exterior. Ministerio de Medio Ambiente, y\nMedio Rural y Marino.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nTexto completo\nSimple\nMateria: Medio Ambiente.\nDescripción y comentarios: Información sobre reservas hidráulicas. El Área de Coordina-\nción Exterior recibe los datos que se originan en las Demarcaciones Hidrográficas y otras Ad-\nministraciones hidráulicas intracomunitarias, el Instituto Nacional de Meteorología y Red\nEléctrica de España, y realiza el tratamiento técnico de la información para su presentación co-\nmo soporte de las decisiones de gestión hidráulica que se deben tomar a nivel nacional, con sus\nimplicaciones técnicas, económicas y sociales. Su objetivo es el conocimiento de las reservas\nhidráulicas en tiempo real, el seguimiento, análisis y publicación de los datos hidrológicos que\npermiten conocer el estado de los volúmenes almacenados en todos los embalses con capaci-\ndad mayor a 5 hm3, la situación de los sistemas de explotación, de las reservas destinadas a rie-\ngo y abastecimiento de poblaciones, los caudales fluyentes, las precipitaciones y la energía hi-\ndroeléctrica almacenada y producida. Se presentan además informes hidrológicos de tenden-\ncia en forma de gráficos que ilustran la situación y evolución de las reservas hidráulicas. Para\nfacilitar su interpretación se compara la situación referida a la fecha actual con la de la sema-\nna anterior, con la de los años precedentes, y con la media de los cinco años y diez años ante-\nriores, todos referidos a la misma fecha que se presenta la información. \nBASES DE DATOS  1/1/04  03:39  Página 191\n",
  "speaker": "SYSTEM",
  "uuid": "353d7272-8d06-4b68-b2c0-4d8e4c3c93f3"
}