{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 38\n36\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nCollaborations “may be suitable” for public support in certain conditions:\n• Open Alliances developing on proprietary platforms where results are likely to fill a gap (or a market\nfailure) considered strategic, or with particular social value\n• Peer Ecosystems among small market participants, where competitive imbalance is distorting the\npotential to innovate, or to extend LT features to desired markets or constituencies\n• Peer Ecosystems among large market participants where network members represent a substantial pro‐\nportion of actors in an economically significant sector\n• Peer Alliances where outcomes are of particular social importance, such as public sector or security\n• Peer Alliances where outcomes are likely to promote interoperability of systems that extends beyond\nthe partnership\n• Asymmetric Ecosystems where platform owners represent constituencies with particular social or eco‐\nnomic value; associations, groups of companies but not A company\n• Any of the above where valuable data is created and IPRs are contributed to an open infrastructure.\nScenario: Open Ecosystems\nCore open‐source technology as infrastructure for a network of organisations that participate at different\npoints in the value chain:\n• Leverages robust underlying technology\n• A natural path for academic tech‐transfer in collaboration with industry, good evolutionary path\n• Well suited to collaboration in verticals, or clearly defined horizontal applications\n• Potential for large scale\nExample: KNIME ‐ an ecosystem built on an open‐source platform for a scientific domain\nIn early 2004 at the University of Konstanz, a team of developers from a Silicon Valley software company spe‐\ncialising in pharmaceutical applications started working on a new open source platform as a collaboration\nECOSYSTEM\nALLIANCES\nOPEN\nCore open‐source technology as infrastruc‐\nture for a network of organisations that\nparticipate at different points in the value\nchain.\nPartners share intellectual capital, R&D\nrisk, and rewards without long‐term com‐\nmitments.\nPEER\nCompanies with relatively equal market\nstrength exchange technologies across a\nnetwork of overlapping application areas.\nCompanies with relatively equal market\nstrength partner to share and develop\ncomplementary technologies.\nASYMMETRIC\nA company with significant market\nstrength facilitates a network of organisa‐\ntions that participate at different points in\nthe value chain.\nA company with significant market\nstrength partners with a niche developer\nof innovative technologies.\nSuitable\nMay be Suitable\nNot Suitable\nFigure 17: Collaborative Styles\n",
  "speaker": "SYSTEM",
  "uuid": "373e2011-63ef-45f5-9981-511c262f621e"
}