{
  "message": "SYSTEM: CV-Cicyt_MariaPoveda-Septiembre-2014.pdf: Página 3\nParticipación en Proyectos de I+D financiados en Convocatorias públicas. \n \n \n(nacionales y/o internacionales)  \n \nTítulo del proyecto: Ready4SmartCities \"ICT Roadmap and Data Interoperability for Energy Systems in Smart Cities\" \n(FP7-608711) \nEntidad financiadora: Union Europea. \nEntidades participantes: D´APPOLONIA SPA (coordinador), UNIVERSIDAD POLITECNICA DE MADRID, CENTRE \nSCIENTIFIQUE ET TECHNIQUE DU BATIMENT, CENTRE FOR RESEARCH AND TECHNOLOGY HELLAS, \nTEKNOLOGIAN TUTKIMUSKESKUS VTT, INSTITUT NATIONAL DE RECHERCHE EN INFORMATIQUE ET EN \nAUTOMATIQUE, AIT Austrian Institute of Technology GmbH, AEC3 LTD, POLITECNICO DI TORINO, EMPIRICA \nGESELLSCHAFT FUER KOMMUNIKATIONS- UND TECHNOLOGIE FORSCHUNG MBH \nDuración, desde: Octubre 2013 \nhasta: Septiembre 2015 \nInvestigador responsable: por la UPM Asunción Gómez Pérez \nNúmero de investigadores participantes: 80 \n \n \n \nTítulo del proyecto: BuscaMedia (Hacia una adaptación semántica de medios digitales multirredmultiterminal) \n(CENIT-2009-1026) \nEntidad financiadora: Centro para el Desarrollo Tecnológico Industrial (CDTI). Ministerio de Ciencia e Innovación. Programa \nCENIT. \nEntidades participantes: + 20 participantes \n(ATOS ORIGIN, ACTIVA MULTIMEDIA, GFI, INDRA, CCMA, BILBOMATICA, FRACTALIA, BMAT, ISID, ISOCO, \nDAEDALUS, UPM-GATV (G. Aplicación Telecom. Visuales), UPM-DIT (Dpto. ingeniería Telemática), GSI-UPM (Grupo de \nSistemas Inteligentes), UPM-OEG (Grupo de Ingeniería Ontológica), UNIVERSIDAD NACIONAL DE EDUCACIÓN A \nDISTANCIA, ROBOTIKER TECNALIA, Grupo CREMIT (UPC), Grupo de Procesado de Imagen (UPC), UNIVERSIDAD \nCARLOS III DE MADRID, UNIVERSITAT POMPEU FABRA, FUNDACIÓ BARCELONA MEDIA UNIVERSITAT POMPEU \nFABRA, FUNDACIÓN CTIC) \nDuración, desde: Octubre 2009 \nhasta: Diciembre 2013 \nInvestigador responsable: Paul Moore \nNúmero de investigadores participantes: 80 \n \n \n \nTítulo del proyecto: mIO! Tecnologías para prestar servicios en movilidad en el futuro universo inteligente (CENIT- \n2008-1019) \nEntidad financiadora: Centro para el Desarrollo Tecnológico Industrial (CDTI). Ministerio de Ciencia e Innovación. Programa \nCENIT. \nEntidades participantes: 28 participantes \n(AT4, CAN, CEMITEC, TOURGUNE, CTIC, ECSC, ESI-TECNALIA, EUVE, INABENSA, ISOCO, ROBOTIKER, SUGAR, \nTBS, TELVENT, TID, TREELOGIC, UCLM, UDEUSTO, UGR, UMA, UNICAN, UPCT, UPM-OEG, UPV, URJC, UVA, UVI, \nWN21) \nDuración, desde: Marzo 2009 hasta: Diciembre 2011  \nInvestigador responsable: Raúl Yusta Ruiz \nNúmero de investigadores participantes: 100 \n \n \n \nTítulo del proyecto: GeoBuddiesAnotación semántica colaborativa con dispositivos móviles en el Camino de \nSantiago. (TSI2007-65677-C02) \nEntidad financiadora: Ministerio de Educación y Ciencia \nEntidades participantes: 2 participantes \n(UPM, Universidad de Santiago de Compostela) \nDuración, desde: Octubre de 2007 hasta: Septiembre de 2010 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 16 \n \n \nTítulo del proyecto: NeOn - Lifecycle Support for Networked Ontologies (FP6-027595) \nEntidad financiadora: Unión Europea \n",
  "speaker": "SYSTEM",
  "uuid": "3751ca8a-d200-45a9-a8a8-9b6f1552fdc7"
}