{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 1\nA Catalogue of Recurrent Pitfalls in Ontology \nModelling \nMaría Poveda, Mari Carmen Suárez-Figueroa, Asunción Gómez-Pérez \nOntology Engineering Group. Departamento de Inteligencia Artificial. \nFacultad de Informática, Universidad Politécnica de Madrid.  \nCampus de Montegancedo s/n.  \n28660 Boadilla del Monte. Madrid. Spain \n \nmpoveda@delicias.dia.fi.upm.es, {mcsuarez, asun}@fi.upm.es \n \nAbstract. Modelling ontologies has become one of the main topics of research \nwithin the Ontology Engineering field because of the difficulties this area \npresents. These difficulties can involve the inclusion of anomalies or pitfalls in \nthe modelling. In this regard, it is important both (a) to prevent the appearance \nof pitfalls in ontologies and (b) to correct the ontologies containing such \ncommon anomalies, with the aim of improving the ontology quality. In this \npaper we present a catalogue of recurrent pitfalls made by developers when \nmodelling ontologies. Additionally, we provide some guidelines for helping \ndevelopers to model ontologies free of pitfalls and to correct the ontologies that \ncontain pitfalls. \nKeywords: pitfalls, ontology modelling, ontology engineering  \n1   Introduction \nOntology modelling has become one of the main issues in the current ontology \nengineering research, since ontologies are becoming more and more popular among a \nwider range of users. Ontology modelling has been mainly performed using different \nknowledge modelling techniques (such as artificial intelligence modelling techniques \nbased on frames and first-order logic, representation techniques based on description \nlogics, etc.) [5]. Recently, a new modelling technique based on the use of Ontology \nDesign Patterns (ODPs) [3] is also emerging.  \nHowever, independently of the technique used to develop an ontology, developers \nmust tackle with a wide range of difficulties and handicaps when modelling \nontologies. Most of the times, these difficulties imply the inclusion of anomalies in \nthe ontology modelling [1, 2].  \nIn this regard, it is worth mentioning that in [11] authors describe a set of common \nerrors made by developers during ontology modelling. Moreover, in [6] it is shown a \nclassification of errors identified when the consistency, the completeness, and the \nconciseness is evaluated in ontology taxonomies. Finally, in [9, 10] authors identify \nan initial set of common pitfalls as well as a classification of them. \nTherefore, in this context it is important both (a) to prevent the appearance of \npitfalls in ontologies and (b) to evaluate and correct the ontologies containing such \ncommon anomalies, with the goal of improving the ontology quality. With respect to \n",
  "speaker": "SYSTEM",
  "uuid": "38693291-4d9c-4918-9a13-7d7ec74c9255"
}