{
  "message": "SYSTEM: CV-Cicyt_EMP_Enero2010.pdf: Página 20\n \n23-28 junio 2008: AERFAI Summer School on “New Trends in Pattern Recognition for Language Technologies”. \nEn la Facultad de Ciencia y Tecnología de la Universidad del País Vasco, en Leioa, Bilbao. \n \n15-17 abril 2008: Curso Avanzado en “Semantic heterogeneity and ontology matching”, dentro del módulo Ciencia \nde la Computación del Programa Oficial de Posgrado de la Facultad de Informática de la UPM, por el profesor \nJérŏme Euzenat. \n \n8-14 julio 2007: Fith European Summer School on Ontological Engineering and the Semantic Web (SSSW-2007). \nEn Cercedilla, Madrid, organizada por la KnowledgeWeb Network of Excellence.  \n \n6-13 mayo 2005: II Escuela internacional de traducción (SummerTrans II – Internationale DAAD-\nSommerakademie). En el ATRC – Advance Translation Research Center de la Universidad de Saarland, \nAlemania.  \n \n22-23 octubre 2004: III Jornadas Berlinesas para profesores de ELE. En el Instituto Cervantes de Berlín.  \n \n15-24 julio 2004: I Escuela internacional de traducción (SummerTransI – Internacional Translation Summer \nSchool). En el Institut für Translationswissenschaft (Instituto de Traductología) de la Universidad de Innsbruck, \nAustria. \n \n6-9 junio 2003: 19 Coloquio catalano-alemán (19. Deutscher Katalanistentag). “Normes i identitats”. En la \nUniversidad de Ciencias Aplicadas de Colonia) - Departamento de Románicas de la Universidad de Colonia. \n \n21-22 febrero 2002: V Encuentros internacionales de traducción/I Congreso nacional de traducción e \ninterpretación en los servicios públicos. En el Departamento de Filología Moderna de la Universidad de Alcalá. \n \n23-26 septiembre 1998: .XI Jornades de Sociolingüística de la Nucia “La norma cosa de tots”. Institut \nInteruniversitari de Filologia Valenciana - Ayuntamiento de la Nucia. \n \n24-26 septiembre 1997: X Jornades de Sociolingüística de la Nucia. Departamento de Filología Catalana de la \nUniversidad de Alicante - Ayuntamiento de la Nucia. \n \nJunio-septiembre 1995, y Julio 1996: Curso de inglés en el Colchester English Study Center (CESC), Colchester, \nGran Bretaña \nOTROS MÉRITOS Y TÍTULOS: \n \nJunio 2001: Intérprete Jurado para la traducción oral y escrita del inglés al castellano y del castellano al inglés.  \n \nOctubre 2004: Intérprete Jurado (inglés/español – alemán)(Staatlich anerkannte Übersetzerin und Dolmetscherin \nfür die englische undspanische Sprache für gerichtiliche, behördliche und notarielle Zwecke) por el Estado \nFederado de Sajonia-Anhalt, Alemania.  \n \nJunio 2005: Certificado de Aptitud Pedagógica (CAP) por el Instituto de Ciencias de la Educación de la \nUniversidad Complutense de Madrid. \n \nMayo 2005: Beca del DAAD para su participación en la II Escuela internacional de traducción (SummerTrans II – \nInternationale DAAD-Sommerakademie) en el ATRC – Advance Translation Research Center de la Universidad de \nSaarland \n \nEnero 2003: Trabajo de Bachelor \"Análisis comparativo y terminológico del código penal alemán y español\". En la \nHochschule Magdeburg-Stendal. Nota: 1,3 (sobresaliente, según sistema alemán)  \n \nJulio 2002: Premio del DAAD por los méritos como mejor estudiante extranjera en la Hochschule Magdeburg-\nStendal.  \n \nJunio 1998: Tercer puesto en el concurso Redewettbewerb in Deutscher Sprache del Goethe Institut. \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "38e53911-ec26-4c69-a028-f861dece44a0"
}