{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 66\nBÚSQUEDA \n \n66 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEn cuanto a las modificaciones en la implementación son mínimas. En la búsqueda \nen anchura (en árbol) teníamos la definición: \n(defun reorganizar-nodos-a-expandir  \n                              (lista-nodos-nuevos lista-nodos) \n  (if (endp lista-nodos-nuevos) \n      lista-nodos  \n     ; si no hay nodos nuevos la lista ABIERTOS es la de antes \n      (append lista-nodos lista-nodos-nuevos)))  \n     ; en otro caso, nuevos nodos se an~aden al final de lista \nmientras que en la búsqueda en profundidad el código es: \n(defun reorganizar-nodos-a-expandir  \n                              (lista-nodos-nuevos lista-nodos) \n  (if (endp lista-nodos-nuevos) \n      lista-nodos  \n     ; si no hay nodos nuevos la lista ABIERTOS es la de antes \n      (append lista-nodos-nuevos lista-nodos)))  \n     ; en otro caso, nuevos nodos se an~aden al comienzo de la \n     ; lista \nEn cuanto a la comparación de los dos tipos de búsqueda, una primera observación \nes que la búsqueda en profundidad necesita, en general, menos espacio para ser \nrealizada. En concreto, la complejidad en espacio será O(bd) frente a la complejidad \nexponencial O(bd) de la búsqueda en anchura. Recuérdese que b es el factor de \nramificación (media del número de nodos generados desde un nodo). y d mide la \nprofundidad del estado objetivo (mínimo del número de aplicaciones de reglas \nnecesarias para llegar del estado inicial a un estado objetivo). \nEn cambio, la complejidad asintótica en tiempo es de orden exponencial O(bd), \ncomo era la de la búsqueda en anchura. Pese a este resultado teórico en ocasiones \nel número de estados examinados por la búsqueda en profundidad puede ser \nconsiderablemente menor que en la búsqueda en anchura. Compárese la Figura 5, \nque contiene un árbol de búsqueda en profundidad (en grafo y con límite de \nprofundidad; ver luego) para el 8-puzzle con la Figura 4. \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "3942f029-0204-4ad6-b5ca-17f5448d9c96"
}