{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 104\nPage 104 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nFigure 42. Main Scenarios for Building the Nomenclature Ontology Network  \nThe main activities carried out or to be carried out for building the Nomenclature ontology network \nare explained here. These activities are based on the methodological work being done in WP5. \nSome of the activities have been carried out following methodological guidelines provided by WP5. \n¾ Knowledge Acquisition and Ontology Elicitation. The pharmaceutical domain was specified \nand studied in [30]. This study analyzes the Spanish pharmaceutical sector in the recent years \nand studies in depth the current status of the communications as well as the problems of \nintegration between the different actors when exchanging information about drugs. Additionally, \nthe different interviews carried out with domain experts have given the ATOS team an insight of \nthe Spanish pharmaceutical sector and of the resources directed into the Semantic \nNomenclature case study. \n¾ Ontology Specification. The ATOS team created a list of Competency Questions (CQs) to \npinpoint the necessities that the ontology network has to satisfy in the Semantic Nomenclature \napplication. The strategies for stating the different competency questions was: first, to define \nspecific competency questions on the pharmaceutical and Semantic Nomenclature domain and \nthen to compose more general competency questions from the answers taken from the specific \nones. The list of competency questions has been included in [31]. \n¾ Non Ontological Resource Reuse. The idea was to select pharmaceutical standards that \nwould cover most of the identified necessities. Pharmaceutical classification systems and \ndifferent thesauri, taxonomies and vocabularies were identified. First, as previously described, \nthe source of knowledge and data in a “local” are identified, trying to find reliable sources, such \nas the government and official pharmaceutical entities of Spain, since they provide the ATOS \nteam with the main databases (Digitalis, Integra, BOTPlus). Then, the ATOS team looked for \nresources, such as online vademecum (Vademecum) or Catalonian sources, which were \nsuggested to the ATOS team by pharmaceutical professionals. Then, medical vocabularies, \nthesauri and taxonomies (ATC, Snomed, UMLS, etc.) from international bodies related to \npharmacy were analyzed to find how drugs are described, and so to find connections between \n \n",
  "speaker": "SYSTEM",
  "uuid": "3a13cb52-3de2-4a3c-84fe-b309804ea355"
}