{
  "message": "SYSTEM: 2010CVAlvarezdeMon.pdf: Página 23\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n- \nSubdirectora del Departamento de lingüística aplicada a la Ciencia y la Tecnología \nde la Universidad Politécnica de Madrid desde 2005   \n \n- \nDirectora Delegada de la Sección Departamental de la E.U.I.T. de Telecomunicación \ndesde noviembre de 2006 hasta diciembre del 2008. \n \n- \nRevisora para la revista electrónica  RAEL  de la Asociación Española de \nLingüística aplicada. \n \n- \n Miembro del Comité de redacción de la revista Ibérica de la Asociación Europea de \nLenguas para Fines Específicos  \n \n- \nResponsable del panel de Lenguas para Fines Específicos de la Asociación \nespañola de lingüística Aplicada de abril de 2003 a Abril de 2006  \n    \n- \nCoordinadora del Panel de Traducción del I Congreso Internacional de AELFE, \nAsociación Europea de Lenguas para Fines Específicos, , 25,26,27 y 28 de \nSeptiembre de 2002, Madrid. \n \n- \nCoordinadora del Curso de Orientación Universitaria de la Universidad Politécnica de \nMadrid, en la asignatura de Inglés, participando en la elaboración de las pruebas de \nInglés para el Distrito Universitario de Madrid, desde el curso 1991-1992 hasta el \ncurso 1999-2000. \n \n- \nVocal del Tribunal de Corrección de las Pruebas de Aptitud para el Acceso a la \nUniversidad de la Universidad Politécnica de Madrid, desde julio de 1987 hasta el \ncurso 1994-1995 inclusive. \n \n- \nVocal del Tribunal de Revisión de las Pruebas de Aptitud (COU) para el Acceso a \nFacultades, Escuelas Técnica Superiores y Colegios Universitarios. Cursos 1996-\n1997 y 1997-1998. \n \n- \nDelegada de la Sección Departamental de la E.U.I.T. de Telecomunicación (mayo de \n1994 a mayo de 1996). \n \n- \nColaboración como traductora con la Cátedra de Acústica de la E.U.I.T. de \nTelecomunicación durante el curso 1984-1985. \n \n- \nColaboración como traductora con la Cátedra de Electrónica de la E.U.I.T.de \nTelecomunicación durante el curso 1984-1985. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "3a16d913-50b4-49bf-9e4b-c63199194982"
}