{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 51\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 51 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nDuring the first round of the process, at the meeting in Bled (January 23rd 2007) we \nreached consensus on 25 activity definitions out of 46 identified activities. The following \npartners participated in this meeting: JSI, OU, UKARL, and UPM. Figure 16 shows the \nconsensuated activity definitions during the first round. Some activities have been classified \nfollowing a “sub-type” approach, such as: ontology validation and ontology verification that \ncan be seen as ontology evaluation activities. Such classification is also shown in Figure \n16.  \n \nFigure 16. Activities Consensuated in the First Round on 23rd January at Bled \nDuring the second round of the process, at the meeting held in Dubrovnik (29th June 2007) \nthere were 61 identified activities, 36 activities of them without consensus. At this meeting \nwe reached a consensus on 4 activity definitions; we also agreed on deleting 5 activities, \nand almost achieved a consensus on 8 activity definitions (waiting for concrete feedback on \nminor details and to be consensuated in the next round). The following partners participated \nin this meeting: CNR, FAO, JSI, UKARL, UPM, and USFD. Figure 17 shows the \nconsensuated activity definitions during the second round. The 5 deleted activities are \nsurrounded by a dotted line and the synonymous activities are linked by a bi-directional \narrow in Figure 17.  \n \nFigure 17. Activities Consensuated in the Second Round on 29th June at Dubrovnik \nFurthermore, in the third round, it was decided to finish the consensus process on the \nremaining 27 activity definitions via email. Therefore, during the third round of the process \n(July 2007), several expert people provided feedback on the aforementioned 8 almost \nconsensuated activities and UKARL and UPM exchanged several emails and included \nseveral comments in the wiki with the following results: 22 activity definitions consensuated \n",
  "speaker": "SYSTEM",
  "uuid": "3b8ef380-8f4a-4050-ba5d-5e5cfa33a948"
}