{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 86\nPage 86 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nActivity \nNatural Language Questions \nOntology Localization \nDo you want to have your ontology network in different natural \nlanguages, as for example, in English, Spanish and French? \nOntology Matching \nDo you want to find correspondences between entities of different \nontologies or ontology modules? \nOntology Merging \nAre you going to reuse existent ontologies or ontology modules \n(let’s say O1 and O2) to create a new one (O3) as a union/fusion \nof the initial ones (O3 = O1 + O2)? \nAre you going to build an new ontology network or a part of it as a \nfusion of existent ontologies? \nOntology \nModification \nAre you going to change or modify your ontology network? \nOntology \nModularization \nDo you want to identify modules in your ontology network to make \nthe reuse or maintenance of it easier? \nOntology Module \nExtraction \nDo you need to take out some modules of your ontology network \nto use them for other purposes? \nOntology Partitioning \nDo you want to divide your ontology network in modules so that \nthey can be treated separately? \nOntology Population \nDo you want to transform (semi)-automatically the knowledge \ncontained in unstructured, semi-structured or structured data \nsources into instances or individuals of your ontology network? \nOntology Pruning \nDo you want to take out conceptual structures that are no longer \nrelevant for your ontology network? \nNon Ontological \nResource \nReengineering \nDo you have the intention of taking an existing non ontological \nresource (e.g., thesaurus, data base, etc.), enhancing it and \nimplementing it as an ontology? \nOntology \nReengineering \nDo you want to take an existing and implemented ontology to \nenhance it and implement it again? \nOntology \nRestructuring \nDo you want to check the knowledge contained in your ontology \nand the organization of it, correct any kind of incorrectness or \ninconsistencies, and document the changes made? \nNon Ontological \nResource Reuse \nDo you have the intention of using non ontological resources (as a \ncontrolled vocabularies or data bases) in the development of your \nontology? \nOntology Reverse \nEngineering \nDo you want to transform the code in which an ontology is \nimplemented into its corresponding conceptual model? \nDo you want to output the conceptual model starting from the \nimplementation code of an ontology? \n",
  "speaker": "SYSTEM",
  "uuid": "3bceb4c5-03e5-43f7-ab08-f12c1caa630a"
}