{
  "message": "SYSTEM: CV-Cicyt_MCSFB_Noviembre2013.pdf: Página 39\n• \nMarzo 2003-Abril 2003. Impartición del Modulo T5.B. ‘Ingeniería y Gestión del Conocimiento’ del Máster a \nDistancia en Dirección de Sistemas y Tecnologías de la Información y las Comunicaciones (INAP). (20 horas). \n• \nMarzo 2003. Impartición de 6 horas de clases prácticas en el curso ‘Ontology Engineering and the Semantic \nWeb’ englobado dentro del Programa ATHENS. \nDOCENCIA RECIBIDA\n• \n“Inteligencia emocional para docentes universitarios\" (Septiembre 2011). Facultad de Informática (UPM) (14 \nhoras). \n: \n• \n“Técnicas efectivas de negociación y liderazgo” (Junio 2011). Instituto de Ciencias de la Educación (UPM) (12 \nhoras). \n• \n“Coaching para el cambio” (Marzo 2011). Instituto de Ciencias de la Educación (UPM) (12 horas). \n• \n“Manejo de los conflictos en las relaciones humanas” (Abril 2010). Instituto de Ciencias de la Educación (UPM) \n(12 horas).  \n• \n“Prevención de patologías de la voz y su manejo en clase” (Abril 2010). Instituto de Ciencias de la Educación \n(UPM) (12 horas).   \n• \n“Mejora de la comunicación y desarrollo de habilidades sociales” (Mayo 2010). Instituto de Ciencias de la \nEducación (UPM) (12 horas). \n• \n“Curso de Formación Inicial del Profesorado en el Marco del Espacio Europeo de Educación Superior” \n(2008-2009). Instituto de Ciencias de la Educación (UPM) (420 horas).  \n• \n\"Semantic heterogeneity and ontology matching\" (Jerome Euzenat). Curso Avanzado dentro del módulo \nCiencia de la Computación del Programa Oficial de Posgrado de la Facultad de Informática de la Universidad \nPolitécnica de Madrid (15, 16, y 17 de abril de 2008) (12 horas). Facultad de Informática. \n• \n“The Second European Summer School on Ontological Engineering and the Semantic Web (SSSW-2004)1”. \n(18th-24th July 2004). (40 horas) Cercedilla (Spain). \nIDIOMAS\n• \nItaliano: Finalizado 5º Curso en la “Escuela Oficial de Idiomas” (Alcorcón). \n: \n• \nAlemán: Finalizado 2º Curso en la “Escuela Oficial de Idiomas” (Alcorcón).  \nDIRECCIÓN DE TRABAJOS DOCENTES\nCodirectora de la Tesis de Master (Maestría en Ciencias Computacionales - CENIDET) titulada “KnOWLearn: una \nmetodología basada en el reuso para la construcción de ontologías de dominio”, defendida en Febrero de 2013. \n: \nCodirectora de la Tesis de Master (Master en Inteligencia Artificial Avanzada: Fundamentos, Métodos y Aplicaciones - \nUNED) titulada “Desarrollo de una ontología para Smart Home”, defendida en Junio de 2012. \nCodirectora de la Tesis de Master (Maestría en Ciencias Computacionales - CENIDET) titulada “Metodología para creación \nde ontologías de dominio OWL utilizando la mezcla de ontologías dirigida por parámetros”, defendida en Febrero de 2012. \nTutora de la Tesis de Master (Master de Investigación en Inteligencia Artificial – DIA) titulada “Analyzing and Ranking \nMultimedia Ontologies for their Reuse”, defendida en Febrero de 2011. \nTutora de la Tesis de Master (Master de Investigación en Inteligencia Artificial - DIA) titulada “Metodología NeOn aplicada a \nla representación del contexto”, defendida en Septiembre de 2010. \n                                                      \n1 http://babage.dia.fi.upm.es/summerschool/ \n",
  "speaker": "SYSTEM",
  "uuid": "3ca2993b-0281-411f-8e6a-1424d99d5413"
}