{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 29\n \n \nPág. 31 \n \nPlan de Impulso de las Tecnologías del Lenguaje \ntraducción automática entre los subsectores en los que España ofrece oportunidades de \ninversión más interesantes. \n- Medida 6: Posibilidad de incluir el procesamiento de lenguaje natural y traducción \nautomática en los acuerdos (MoU) que se firmen con países Iberoamericanos (o de otras \nregiones) en el futuro. \n- Medida 7: Favorecer el desarrollo de infraestructuras lingüísticas y apertura de datos \npúblicos en variantes del español. \n- Medida 8: Identificar ferias, congresos o eventos en los que, con la colaboración del ICEX, \npueda darse difusión a los productos y proyectos realizados por las empresas españolas \ndel sector. \n- Medida 9: Estudio sobre el estado del arte de la internacionalización de las empresas \nespañolas del sector en los países con mayor mercado de internacionalización. \n- Medida 10: Estudiar la posibilidad de ayudas a incubadoras o aceleradoras, o de plantear \nproyectos de hermanamiento entre empresas pequeñas y empresas grandes. \n \nEje III: LA ADMINISTRACIÓN PÚBLICA COMO IMPULSOR DE LA INDUSTRIA DEL LENGUAJE \nLínea 1: Plataformas de procesamiento de lenguaje natural y traducción automática en las \nAdministraciones Públicas  \nMotivo: \nEl servicio público que prestan las Administraciones Públicas es un claro beneficiario de las \ntecnologías del lenguaje. Por su carácter transversal, sus aplicaciones en la mejora de los \nservicios al ciudadano son numerosas. Ejemplos que no agotan estos beneficios son: \n \nAumentar la capacidad, calidad y automatismo de los servicios de atención al ciudadano \npor los canales telefónico e Internet; y cada vez más, en movilidad. Prestación de \nservicios avanzados basados en el procesamiento del lenguaje natural y en la traducción \nautomática. \n \nMejorar la capacidad y reducir el coste de la traducción entre el castellano, las lenguas \ncooficiales y las lenguas comunitarias. \n \nMejorar la capacidad, calidad y rapidez de la tramitación administrativa incorporando \netapas de procesamiento automático de información en lenguaje natural. \n \nMejorar la accesibilidad a personas con discapacidad. \n \nMejorar el conocimiento profundo y actualizado de la información gestionada por los \ndistintos sectores para la dirección de políticas públicas. Este conocimiento se puede \n",
  "speaker": "SYSTEM",
  "uuid": "3ea28411-343e-411b-842e-54a2c5bd5994"
}