{
  "message": "SYSTEM: Cicyt_Asun-19-05-10.pdf: Página 35\nTítulo: Semantic mappings: out of ontology world limits \nCongreso: IEEE International Workshop on Ontology Alignment and Visualization (OnAV’08). International Conference on \nComplex, Intelligent and Software Intensive Systems (CISIS-2008) \nPublicación: IEEE International Workshop on Ontology Alignment and Visualization (OnAV’08). International Conference on \nComplex, Intelligent and Software Intensive Systems (CISIS-2008). Páginas: 907-912. ISBN: 978-0-7695-3109-0 \nLugar celebración: Barcelona, España \nFecha: 5 de marzo de 2008 \n \nAutores (p.o. de firma): Aldo Gangemi, Asunción Gómez-Pérez, Valentina Presutti, Mari Carmen Suárez-Figueroa  \nTítulo: Towards a Catalog of OWL-based Ontology Design Patterns \nTipo de participación: Artículo \nCongreso: CAEPIA 2007 \nPublicación: Proceedings  \nLugar celebración: Salamanca, España \nFecha: 12 a 16 de Noviembre de 2007 \n \nAutores (p.o. de firma): Óscar Muñoz García, Asunción Gómez Pérez, Marta Iglesias Sucasas, Soonho Kim. \nTítulo: A Workflow for the Networked Ontologies Lifecycle. A Case Study in FAO of the UN \nTipo de participación: Artículo (best paper award of the TTIA (Artificial Intelligence Technology Transfer) section) \nCongreso: CAEPIA 2007 \nPublicación: Proceedings de XII Conferencia de la Asociación Española para la Inteligencia Artificial. CAEPIA-TTIA 2007. \nLugar celebración: Salamanca, España \nFecha: 12 a 16 de Noviembre de 2007 \n \nAutores (p.o. de firma): Thanh Tran, Peter Haase, Holger Lewen, Óscar Muñoz García, Asunción Góméz-Perez, Rudi \nStuder \nTítulo: Lifecycle-Support in Architectures for Ontology-Based Information Systems \nTipo de participación: Artículo \nCongreso: ISWC 2007 + ASWC 2007. The 6th International Semantic Web Conference and the 2nd Asian Semantic Web \nConference 2007 \nPublicación: Proceedings (ISBN: 3540762973, 9783540762973) \nLugar celebración: Busan, Corea del Sur \nFecha: 11-15 de noviembre de 2007 \n \nAutores (p.o. de firma): Reuben Wright, Manuel Sánchez-Gestido, Asuncion Gomez-Perez  Maria Pérez-Hernández Rafael \nGonzález-Cabero and Oscar Corcho  \nTítulo: A Semantic Data Grid for Satellite Mission Quality Analysis. \nTipo de participación: Artículo \nCongreso: Workshop on the First Industrial Results of Semantic Technologies (FIRST2007) at ISWC/ASWC2007 \nPublicación: Proceedings  \nLugar celebración: Busan, Corea \nFecha: 11 de Noviembre de 2007 \n \nAutores (p.o. de firma): Montiel-Ponsoda, E., Aguado de Cea, G., Suárez-Figueroa, M.C., Palma, R. Peters, W., and \nGómez-Pérez, A.  \nTítulo: LexOMV: an OMV extension to capture multilinguality \nTipo de participación: Artículo \nCongreso: OntoLex07 Workshop at the 6th International Semantic Web Conference (ISWC 2007) \nPublicación: Proceedings  \nLugar celebración: Busan, Corea \nFecha: 11 de Noviembre de 2007 \n \nAutores (p.o. de firma): Peters, W., Montiel-Ponsoda, E., Aguado de Cea, G., Gómez-Pérez, A.  \nTítulo: Localizing Ontologies in OWL \nTipo de participación: Artículo \nCongreso: OntoLex07 Workshop at the 6th International Semantic Web Conference (ISWC 2007) \nPublicación: Proceedings  \nLugar celebración: Busan, Corea \nFecha: 11 de Noviembre de 2007 \n \nAutores (p.o. de firma): Asunción Gómez Pérez, Jaime Ramírez, Boris Villazón Terrazas  \nTítulo: Reusing Human Resources Management Standards for Employment Services \nTipo de participación: Artículo \nCongreso: First Industrial Results of Semantic Technologies Workshop – ISWC 07 \n",
  "speaker": "SYSTEM",
  "uuid": "41228979-5117-4541-b73f-00bae78cc322"
}