{
  "message": "SYSTEM: QRVocabulary.pdf: Página 5\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n87 / 103 \nA.4: Behavioural Building Blocks: Causal Dependencies \nBehavioural dependencies describe relations between behavioural features. There are \nthree kinds of dependencies: causal dependencies, mathematical dependencies and \ncorrespondences. Causal dependencies are used to model how processes induce \nchanges, either directly or indirectly. These dependencies are represented as influences \nand proportionalities. \nA.4.1 Influences  \nInfluences are directed relations between two quantities, and are either positive or \nnegative. Influences are the cause of change within a model, and are therefore said to \nmodel processes. Depending on the magnitude of the source quantity and the type of \ninfluence, the derivative of the target quantity either increases or decreases. An \ninfluence I+(Q2,Q1) causes the quantity Q2 to increase if Q1 is positive, decrease if it is \nnegative, and remain stable when it is zero (assuming there are no other causal \ndependencies on Q2). For an influence I- this is just the opposite. Influences are also \nreferred to as direct influences. \n \nExamples: \n• I+(Size, Natality) – Population Size increases if population Natality is above zero, \ndecreases if it is below zero, and remains stable if it is zero. \n• I-(Size, Mortality) – Population Size decreases if population Mortality is above \nzero, increases if it is below zero, and remains stable if it is zero. \n• I+(Height, Growth rate) – Plant Height increases if plant Growth rate is above \nzero, decreases if it is below zero, and remains stable if it is zero. \n \nRemarks: \nInfluences should be used when the following relation has to be modelled: ‘If the source \nquantity has a non-zero value, the target quantity will change’. \nA.4.2 Proportionalities \nProportionalities are directed relations between two quantities. They propagate the \neffects of a process, (i.e. they set the derivative of the target quantity depending on the \nderivative of the source quantity). For this reason, they are also referred to as indirect \ninfluences. Like influences, proportionalities are either positive or negative. A \nproportionality P+(Q2,Q1) causes Q2 to increase if Q1 increases, decrease if Q1 \ndecreases, and remain stable if Q1 remains stable (given that there are no other causal \ninfluences on Q2). For a proportionality P- the opposite applies. \n \nExamples: \n• P+(Height,Amount) – Fluid Height increases if fluid Amount increases, decreases \nif fluid Amount decreases, and remains stable if fluid Amount remains stable. \n• P-(Height,Width) – Fluid Height decreases if container Width increases, \nincreases if container Width decreases, and remains stable if container Width \nremains stable. \n• P+(Birth,Size) – Population Birth increases if population Size increases, \ndecreases if population Size decreases, and remains stable if population Size \nremains stable.) \n \nRemarks: \nProportionalities should be used when the following relation has to be modelled: If the \nsource quantity changes, the target quantity will change too. \n",
  "speaker": "SYSTEM",
  "uuid": "413925d5-5f40-4c5e-be0e-cffd93660f0c"
}