{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 10\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13918\n9.  Las universidades, a través de la Escuela de Doctorado o de la correspondiente \nunidad responsable del programa de doctorado establecerán los mecanismos de evaluación \ny seguimiento indicados anteriormente, la realización de la tesis en el tiempo proyectado y \nlos procedimientos previstos en casos de conflicto y aspectos que afecten al ámbito de la \npropiedad intelectual de acuerdo con lo establecido en el párrafo anterior.\nArtículo 12.  Dirección de tesis.\n1.  De acuerdo con lo establecido en el artículo 11.4, la universidad asignará al \ndoctorando un director para la elaboración de la tesis doctoral que será el máximo \nresponsable de la coherencia e idoneidad de las actividades de formación, del impacto y \nnovedad en su campo de la temática de la tesis doctoral y de la guía en la planificación y \nsu adecuación, en su caso, a la de otros proyectos y actividades donde se inscriba el \ndoctorando. La tesis podrá ser codirigida por otros doctores cuando concurran razones de \níndole académico, como puede ser el caso de la interdisciplinariedad temática o los \nprogramas desarrollados en colaboración nacional o internacional, previa autorización de \nla comisión académica. Dicha autorización podrá ser revocada con posterioridad si a juicio \nde la comisión académica la codirección no beneficia el desarrollo de la tesis.\n2.  Las universidades, a través de la Escuela de Doctorado o de la correspondiente \nunidad responsable del programa de doctorado, podrán establecer requisitos adicionales \npara ser director de tesis.\n3.  La labor de tutorización del doctorando y dirección de tesis deberá ser reconocida \ncomo parte de la dedicación docente e investigadora del profesorado.\nArtículo 13.  Tesis doctoral.\n1.  La tesis doctoral consistirá en un trabajo original de investigación elaborado por el \ncandidato en cualquier campo del conocimiento. La tesis debe capacitar al doctorando \npara el trabajo autónomo en el ámbito de la I+D+i.\n2.  Las Universidades establecerán el procedimiento para la presentación de la tesis \ndoctoral, incluyendo la determinación de un plazo máximo para la posterior lectura de la \nmisma.\nLas universidades, a través de la Escuela de Doctorado o de la correspondiente unidad \nresponsable del programa de doctorado, establecerán procedimientos de control con el fin \nde garantizar la calidad de las tesis doctorales, incidiendo especialmente en la calidad de \nla formación del doctorando y en la supervisión.\n3.  La universidad garantizará la publicidad de la tesis doctoral finalizada a fin de que \ndurante el proceso de evaluación, y con carácter previo al acto de defensa, otros doctores \npuedan remitir observaciones sobre su contenido.\n4.  La tesis podrá ser desarrollada y, en su caso, defendida, en los idiomas habituales \npara la comunicación científica en su campo de conocimiento.\nArtículo 14.  Evaluación y defensa de la tesis doctoral.\n1.  El tribunal que evalúe la tesis doctoral se compondrá de acuerdo con los requisitos \nfijados por la universidad y de acuerdo con lo establecido en el presente artículo.\n2.  La totalidad de los miembros que integren el tribunal deberán estar en posesión \ndel título de Doctor y contar con experiencia investigadora acreditada. En todo caso, el \ntribunal estará formado por una mayoría de miembros externos a la Universidad y a las \ninstituciones colaboradoras en la Escuela o programa.\n3.  El tribunal que evalúe la tesis dispondrá del documento de actividades del \ndoctorando, a que se refiere el artículo 2.5 de este real decreto, con las actividades \nformativas llevadas a cabo por el doctorando. Este documento de seguimiento no dará \nlugar a una puntuación cuantitativa pero sí constituirá un instrumento de evaluación \ncualitativa que complementará la evaluación de la tesis doctoral.\n4.  La tesis doctoral se evaluará en el acto de defensa que tendrá lugar en sesión \npública y consistirá en la exposición y defensa por el doctorando del trabajo de investigación \ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "41e1c5eb-4f6c-4351-aef1-12bc0a8928ed"
}