{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 83\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 83 of 124\nPR-NOR-TSLO-01. Pattern for re-engineering a term-based thesaurus which follows the record-based\ndata model\nThe pattern for re-engineering thesaurus shown in Table 5.1 suggests a guide to transform a thesaurus into\na lightweight ontology. The thesaurus is a term-based one and it is modeled with a record-based data model.\nThis pattern aims at creating a lightweight ontology from the thesaurus, being the semantics of the BT/NT\nrelations between terms the subClassOf relationship.\nTable 5.1: Pattern for Re-engineering a term-based thesaurus which follows the\nrecord-based model\nSlot\nValue\nGeneral Information\nName\nTerm-based Thesaurus to Lightweight Ontology (record-based model)\nIdentiﬁer\nPR-NOR-TSLO-01\nType of Component\nPattern for Re-engineering Non-Ontological Resources (PR-NOR)\nUse Case\nGeneral\nRe-engineering a term-based thesaurus which follows the record-based model to design a\nLightweight Ontology.\nExample\nSuppose that someone wants to build a lightweight ontology based on the European Training\nThesaurus (ETT), which is a term-based thesaurus and it follows the record-based model.\nPattern for Re-engineering Non-Ontological Resources\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a term-based thesaurus which follows the record-based\nmodel.\nA thesaurus represents the knowledge of a domain with a collection of terms and a limited\nset of relations between them.\nThe record-based data model [Soe95] is a denormalized structure, uses a record for every\nterm with the information about the term, such as synonyms, broader, narrower and related\nterms.\nExample\nThe European Training Thesaurus (ETT) constitutes the controlled vocabulary of reference\nin the ﬁeld of vocational education and training (VET) in Europe.\nThe relation semantics between the sub-ordinate and the super-ordinate concepts is\nsubClassOf.\nGraphical Representation\nGeneral\nExample\nOUTPUT: Designed Ontology\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "42b5a146-76aa-4ed8-9854-086256b50928"
}