{
  "message": "SYSTEM: HGARCIA_CVA_Proyectos_2016.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \ningeniero de inteligencia de negocios y administrador de bases de datos, en compañías de \ndesarrollo de software y servicios de comercio electrónico.  \n \nLos temas de investigación y desarrollo que le interesan son las tecnologías semánticas, el \nprocesamiento de lenguaje natural, el aprendizaje automático y Big Data. Sus artículos de \ninvestigación se han publicado en revistas indexadas, y en conferencias y talleres \ninternacionales. De acuerdo a Google Scholar sus artículos se han citado 675 veces. \nAdemás Andrés colabora con la revisión de artículos en revistas, conferencias y talleres \ninternacionales. \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \nAndrés García-Silva, Leyla Jael García, Alexander García, and Oscar Corcho. 2014. Social \nTags and Linked Data for Ontology Development: A Case Study in the Financial Domain. To \nappear: Proceedings of the 4th International Conference on Web Intelligence, Mining and \nSemantics WIMS'14 \n \nAndrés García-Silva, Víctor Rodríguez-Doncel, and Oscar Corcho. 2013. Semantic \nCharacterization of Tweets Using Topic Models: A Use Case in the Entertainment \nDomain. Int. \nJ. \nSemant. \nWeb \nInf. \nSyst. 9, \n3 \n(July \n2013), \n1-13. \nhttp://dx.doi.org/10.4018/ijswis.2013070101 \n \nÓscar Muñoz-García, Andrés García-Silva, Óscar Corcho. 2013. Towards Concept \nIdentification using a Knowledge-Intensive Approach. In Proceedings of the Concept \nExtraction Challenge at the Workshop on 'Making Sense of Microposts' (#MSM2013), CEUR-\nWS.org, online ceur-ws.org/Vol-1019/paper_29.pdf \n \nAndrés García-Silva, Jeon-Hyung Kang, Kristina Lerman, and Oscar Corcho. 2012. \nCharacterising emergent semantics in twitter lists. In Proceedings of the 9th international \nconference on The Semantic Web: research and applications (ESWC'12). Springer-Verlag, \nBerlin, Heidelberg, 530-544. http://dx.doi.org/10.1007/978-3-642-30284-8_42 \n \nAndrés García-Silva, Iván Cantador, Óscar Corcho: Enabling Folksonomies for Knowledge \nExtraction: A Semantic Grounding Approach. Int. J. Semantic Web Inf. Syst. 8(3): 24-41 \n(2012). http://dx.doi.org/10.1007/978-3-642-30284-8_42 \n \nAndrés García-Silva, Oscar Corcho, Harith Alani, and Asunción Gómez-Pérez. 2012. Review \nof the state of the art: Discovering and associating semantics to tags in folksonomies. Knowl. \nEng. Rev. 27, 1 (February 2012), 57-85. http://dx.doi.org/10.1017/S026988891100018X \n \nPablo N. Mendes, Max Jakob, Andrés García-Silva, and Christian Bizer. 2011. DBpedia \nspotlight: shedding light on the web of documents. In Proceedings of the 7th International \nConference on Semantic Systems (I-Semantics '11). ACM, New York, NY, USA, 1-8. \nhttp://doi.acm.org/10.1145/2063518.2063519 \n \nAndrés García-Silva, Max Jakob, Pablo N. Mendes, and Christian Bizer. 2011. Multipedia: \nenriching DBpedia with multimedia information. In Proceedings of the sixth international \nconference on Knowledge capture (K-CAP '11). ACM, New York, NY, USA, 137-144. \nhttp://doi.acm.org/10.1145/1999676.1999701 \n \nAndrés García-Silva, Leyla Jael García, Alexander García, and Oscar Corcho. 2015. Building \nDomain Ontologies Out of Folksonomies and Linked Data. International Journal on Artificial \nIntelligence Tools, 24(2), 1540014. \nAndrés García-Silva, Asunción Gómez-Pérez, María del Carmen Suárez-Figueroa, Boris \nVillazón-Terrazas. 2008.  A Pattern Based Approach for Re-engineering Non-Ontological \nResources \ninto \nOntologies. \nIn \nproceedings \nof \nthe \n3rd \nAsian \nSemantic \nWeb \nConference (ASWC 2008), Bangkog Thailand 167-18 \n",
  "speaker": "SYSTEM",
  "uuid": "42c54565-38c2-4f30-ad73-4387abbfbca9"
}