{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 79\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 79 of 124\ntwo ways of representing the knowledge encoded by the thesauri: (1) record-based model, and (2) relation-\nbased model. In order to exemplify the data models for thesauri, we use an excerpt from the FAO Thesaurus,\nAGROVOC1 presented in Figure 5.4. This Figure shows the terms: Oryza and Rice. Next, we describe the\ndata models for thesauri.\nFigure 5.4: Excerpt of the AGROVOC thesaurus\nRecord-based Model\nThe record-based model, which is a denormalized structure, uses a record for every term with the information\nabout the term, such as synonyms, broader, narrower and related terms. In this model, the information is\nstored in large packages, and to access or change any piece of information we must get into the appropriate\npackage. This model looks like the ﬂattened model presented in section 4.2.1. We can apply this model to\na term-based thesaurus (Figure 5.5-a)) and to a concept-based thesaurus (Figure 5.5-b)). In the case of the\nconcept-based thesaurus, the information about the concepts is added to each record.\nRelation-based Model\nThe relation-based model leads to a more elegant and efﬁcient structure. Information is stored in individual\npieces that can be arranged in different ways. Relationship types are not deﬁned as ﬁelds in a record, but they\nare simply data values in a relationship record, thus new relationship types can be introduced with ease. In\nthe case of the term-based thesaurus, Figure 5.6-a) ,there are three entities: (1) a term entity, which contains\nthe overall set of terms, (2) a term-term relationship entity, in which each record contains two different term\ncodes and the relationship between them, and (3) a relationship source entity, which contains the overall\nthesaurus relationships. In the case of the concept-based thesaurus, Figure 5.6-b), there are four entities:\n(1) a concept entity, which links each term with exactly one concept, thus this entity has one record for each\nterm and for each concept as many records as there are terms, (2) a concept-concept relationship entity, in\nwhich BT, NT and RT are established explicitly between concepts, (3) a term-term relationship entity, in which\nUF and USE relations are established explicitly between terms, this is an optional entity, (4) a relationship\nsource entity, which contains the overall thesaurus relationships.\n1http://www.fao.org/agrovoc/\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "449cff28-2127-491e-84ec-fdc259e27c56"
}