{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 94\n92\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\ninclude newspapers, books, and guides. Internal‐use products include training materials, compliance\naudits, and management reports. Customizing these documents can improve demand for existing prod‐\nucts by offering more relevant information. Authoring and content can also expand the realm of possi‐\nble products through finer market segmentation.\n• Documentation. Documentation describes the properties of a product, process, or service.\nDocumentation includes documents such as product specifications, user guides, and repair manuals.\nCustomizing these documents can make them shorter by reducing irrelevant content and improve their\neffectiveness by eliminating confusion over whether certain content is applicable to a particular item.\n• Notification. Notifications further or update an on‐going relationship with a party. Notifications include\ndocuments such as statements, reminders, and alerts. Customizing these documents can engender an\nimmediate psychological feeling of satisfaction in the party as well as enable them to more effectively\nuse a product or service, further enhancing satisfaction.\nEach of these document purposes corresponds to a generic type of business process, and the scale of a\nprocess for a given enterprise will affect the scale of document customization. An automobile insurance car‐\nrier may offer hundreds of quotes a day, customized with applicant information and special offers for which\nthe applicant qualifies. An aircraft manufacturer may have to send out thousands of maintenance updates a\nmonth, customized to reflect the precise configuration of every aircraft. A pharmaceutical company may\nhave to generate dozens of regulatory filings a month, based on pieces of content created by hundreds of\ndifferent staff members. Segmentation by document purpose and segmentation by vertical market focus\nprovide additional ways to cluster and examine vendor positioning and the market.\nSpecific solutions based on authoring and creation applications are corporate communication, marketing\ncampaigns, print services, professional publishing (like newspapers), requirements quality validation, stan‐\ndardize document creation (for example corporate curriculum), translation cost reduction, automated doc‐\numentation for manufacturing, compliance, customer satisfaction or e‐learning.\nTrends\nQuality pursue is one of the major trends that pushes authoring and creation market evolution.\n• Technology integration: The focus of authoring tools in maintaining a consistent text quality is pushing\nthe inclusion of linguistic intelligence in these tools. Vendors are including technologies such as seman‐\ntic technologies or statistical algorithms to enhance the common authoring tools (spell, grammar and\nstyle checker). Moreover, other technologies are being integrated such a as translation memory sys‐\ntems.\n• Machine data: as internet of things extends in business processes, authoring and creation applications\ncan be used to automated use of data into technical documentation.\nMarket leaders\nAfter a consolidation phase where companies such XyEnterprise, Astoria, Arbortext were acquired, the\nauthoring and creation market currently consists a wide fragmented set of niche companies providing serv‐\nices for specific industries. \nAmong them, the top worldwide vendors are Acrolinx, Congree, Across Systems, Oracle, SDL Global\nAuthoring management or Tedopres. Small companies such as The Reuse Company have entered the last\ntwo years providing services for the IT sector.\n",
  "speaker": "SYSTEM",
  "uuid": "457b5985-2e9f-4ddc-afa9-d745c0dc4f45"
}