{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 4\n4\nGraeme Hirst\n1.2.2 Inheritance of linguistic properties\nGenerally speaking, the behaviour of words with respect to many non-semantic lexi-\ncal properties in any given language tends to be regular: words that are phonetically,\nmorphologically, or syntactically similar to one another usually exhibit similar pho-\nnetic, morphological, or syntactic behaviour. For example, in English most verbs\nform their past tense with either -ed or -d, and even most of those that don’t do so\nfall into a few small categories of behaviour; and quite separately, verbs also cluster\ninto a number of categories by their alternation behaviour (see section 1.4.3 below).\nIt is therefore possible to categorize and subcategorize words by their behaviour—\nthat is, build an ontology of lexical behaviour—and use these categories to construct\na lexicon in which each word, by default, inherits the properties of the categories and\nsubcategories of which it is a member. Of course, idiosyncratic properties (such as\nmany of the combinatory properties listed in an ECD) will still have to be speciﬁed\nin each word’s entry. Inheritance of properties facilitates both economy and con-\nsistency in a large lexicon. A hierarchical representation of lexical knowledge with\nproperty inheritance is really just a special case of this style or method of knowl-\nedge representation. Accordingly, the inheritance of properties in the lexicon and\nthe design of formal languages for the representation of lexical knowledge have\nbeen areas of considerable study (e.g., Briscoe, de Paiva, and Copestake 1992, Gaz-\ndar and Daelemans 1992; for an overview, see Daelemans, De Smedt, and Gazdar\n1992; for the DATR language for lexical knowledge representation, see Evans and\nGazdar 1996).\nIt should be clear that a hierarchical representation of similarities in lexical be-\nhaviour is quite distinct from any such representation of the meaning of words;\nknowing that boy and girl both take -s to make their plural form whereas child does\nnot tells us nothing about the relationship between the meanings of those words.\nRelationships between meanings, and the hierarchies or other structures that they\nmight form, are a separate matter entirely; they will be discussed in section 1.3.2.\n1.2.3 Generating elements of the lexicon\nEven with inheritance of properties, compiling a lexicon is a large task. But it can be\neased by recognizing that because of the many regularities in the ways that natural\nlanguages generate derived words and senses, many of the entries in a lexicon can\nbe automatically predicted.\nFor example, at the level of inﬂection and afﬁxation, from the existence of the\nEnglish word read, we can predict that (among others) reading, reader, unreadable,\nand antireadability are also words that should be in the lexicon, and in three out\nof these four cases we’d be right. Viegas et al. (1996) present a system of lexi-\ncal rules that propose candidate words by inﬂection and afﬁxation (an average of\nabout 25 from each base form), automatically generating lexical entries for them; a\nlexicographer must winnow the proposals. In their Spanish lexicon, about 80% of\nthe entries were created this way. But a lexicon can never anticipate all the nonce\nwords and neologisms that are easily created from combinations of existing words\n",
  "speaker": "SYSTEM",
  "uuid": "45a596c8-f8da-48c2-8834-671ac11aec23"
}