{
  "message": "SYSTEM: D5.3.2.pdf: Página 28\nPage 28 of 48 \nNeOn Integrated Project EU-IST-027595 \n \n3.2.2. Iterative-Incremental Ontology Network Life Cycle Models \nThe main feature of this model family is the development of ontology networks organized in a set of \niterations (or short mini-projects with a fixed duration). Each individual iteration is similar to an \nontology network project using any type of waterfall model from those presented in Section  3.2.1, \nas shown schematically in Figure 13. \nThis model could be used in the following situations: \n\u0001 In ontology projects with large groups of developers and including complex developments. \n\u0001 In ontology project in which requirements are not completely known or can change during the \nontology development.  \nThe result of any iteration is a functional and partial ontology network that meets a subset of the \nontology network requirements. Such a partial ontology network can be used, evaluated and \nintegrated in any other ontology network.  \nThis model is based in the successive improvement and extension of the ontology network by \nmeans of performing multiple iterations with cyclic feedback and adaptation. The ontology network \ngrows incrementally along the development. Generally, in each iteration new requirements are \ntaken into account, but, occasionally, in a particular iteration the existing partial ontology network \ncould be enhanced.  \nThe main benefit of this model is to identify and alleviate the possible risks as soon as possible. \nThis model focuses on a set of basic requirements; from these a subset is chosen and considered \nin the development of the ontology network. The partial result is reviewed, and the initial set of \nrequirements is increased and/or modified in the next iteration until the complete ontology network \nis developed. \nIt is worth mentioning that at the beginning of the ontology network project, to perform a complete \nrequirement specification or a simple and incomplete requirement specification has an influence on \nthe number of iterations during the ontology project.  \n \nFigure 13. Schematic Vision of the Iterative-Incremental Model \nFigure 13 shows the schematic vision of the iterative-incremental model where the first initiation \nphase has as main outcomes the ontology network requirements and the general and global plan \nfor the whole ontology network development. Regarding the different iterations, as mentioned \nbefore, each iteration in the iterative-incremental model can follow a different version of the \nwaterfall model from those presented in Section  3.2.1. However, any version of the waterfall model \nto be used in the iterative-incremental model should be modified in the following way: \n\u0003 No backtracking is allowed between phases in a particular iteration, because the refinement \nshould perform in the next iterations. \n\u0003 In the initiation phase of each iteration, the revision of the ontology network requirements \nand of the global plan should be carried out. Additionally, a detailed plan for the particular \niteration should be performed.  \n",
  "speaker": "SYSTEM",
  "uuid": "46fce0f2-94e3-412e-a63f-02728ab2b76e"
}