{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 109\nBÚSQUEDA \n \n109 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n11\n7 \n14\n \nFigura 16 \nCon la terminología introducida, el problema del viajante puede ser re-enunciado de \nmodo mucho más conciso: \"Dado un grafo completo con pesos en sus aristas (y un \nvértice v en él), encontrar un ciclo total óptimo (basado en v)\". \nLas ventajas de esta redefinición del problema son múltiples. Aparte de la concisión \nya mencionada, se obtiene una descripción mucho más precisa del problema, en la \nque las circunstancias irrelevantes han sido eliminadas (abstracción). Por último, \neste proceso de matematización o formalización del enunciado es un primer paso \npara la tarea de encontrar las estructuras de datos que van a permitir representar en \nel computador el sistema de producción que resolverá el problema. En lo que sigue, \nutilizaremos indistintamente la terminología que proviene del problema inicial \n(ciudades, mapa, etc.) y la de su formalización (vértices, grafo, ciclo, etc.). \nUtilizando el mismo estilo que en el apartado 2.1, el planteamiento definitivo del \nproblemas sería el siguiente. \n• El problema del viajante del comercio. \n• Entrada: un nombre, asociado a un vértice de un grafo completo. \n• Salida: un ciclo total (óptimo), basado en el vértice con ese nombre. \n• Medios: se dispone del grafo completo con pesos en las aristas; se puede \npasar entre cualquier par de vértices distintos por medio de la arista \ncorrespondiente. \nObsérvese que la palabra \"óptimo\" ha sido escrita entre paréntesis al describir la \nsalida del problema. Esto es debido a que el problema del viajante puede ser \ninterpretado como un problema de optimización (en este sentido, sólamente \"primero \nel menos costoso\" y los algoritmos A* garantizan la solución del problema) o bien \ncomo un problema de búsqueda de un ciclo total (para el que podríamos aplicar \n",
  "speaker": "SYSTEM",
  "uuid": "49deb24e-6566-49ed-8b50-36aea9b8ca7d"
}