{
  "message": "SYSTEM: MasterUPM_O%26SW-english.pdf: Página 1\n \n \n \nOntologies and the Semantic Web \nUniversidad Politécnica de Madrid \nA. Gómez-Pérez, O. Corcho, G. Aguado \n {asun, ocorcho, lupe}@fi.upm.es \n \n \n \nMasters where this course is taught \nOntologies and the Semantic Web is taught as a four-monthly subject in the following official master \nprograms at the Universidad Politécnica de Madrid. \n• \nMaster in Information Technologies \n• \nEuropean Master in Logic Computation (ERASMUS Mundus Program) \n• \nMaster in Research in Artificial Intelligence \n \n• \nIt is credited 6 ECTS \n• \nPresential classes: 2 hours /week \n• \nEnglish /Spanish \n \nURL: http://delicias.dia.fi.upm.es/wiki/index.php/Master-Eng-07-08 \nPre-requisites \n \nStudents that take this course have to hold a degree in Computer Science (5-year degree) or any 3-year \nInformation Technology degree or related area \n \nIt is highly recommendable to have attained a certain level in the following subjects and technologies as \nthey will not be explained in the classes. \n• \nKnowledge representation systems: frames, semantic networks and description logics \n• \nWeb Technologies: HTML, XML, SOAP, WSDL, UDDI, etc.  \n• \nJava and JDBC \n \n \n \nObjectives  \nThe general objective is to provide students with a sound grounding of scientific, methodological and \ntechnological fundamentals in the Semantic Web domain that will be later used to build applications that \ncan integrate, combine and infer heterogeneous and distributed information.  \nAccording to this general objective, students should be able:  \n1. To identify and resolve real world problems by applying these technologies successfully.  \n2. To build systems in different domains (for instance, knowledge management, biomedicine, e-\ncommerce, e-learning, etc.) and applications for those areas.  \n3. To integrate applications developed with semantic web technologies with other software and \nhardware systems \n4. To assimilate technological changes  \n \n",
  "speaker": "SYSTEM",
  "uuid": "49e39d8e-0f35-412e-9acb-ea8ac0009a18"
}