{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 44\nBÚSQUEDA \n \n44 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nprofundidad generados a partir de un mismo padre se ordenan de un modo \narbitrario, es necesario indicar cuál es el criterio seguido. En el ejemplo, hemos \nexpandido los estados de \"izquierda a derecha\". \nI \nA \nB \nC \nD \nO \nE \nF \n1 \n2 \n3 \n4 \n5 \n6 \n \nFigura 2 \nEjercicio. Dibujar, con las convenciones anteriores, el árbol de búsqueda en \nanchura para el espacio de estados de la figura 1, con expansión de \"derecha a \nizquierda\". Compárese el número de estados generados y examinados con respecto \nal árbol de la figura 2. \nLa búsqueda en anchura es una estrategia exhaustiva: el recorrido por niveles \nexamina todos los estados que son accesibles desde el estado inicial. En particular, \nsi un estado objetivo es alcanzable, la búsqueda en anchura lo encuentra. La \ndemostración es sencilla: el estado objetivo aparecerá en un cierto nivel de \nprofundidad y, en un número finito de pasos (suponiendo un número finito de \noperadores y un número finito de posibles aplicaciones de un operador sobre un \nestado), llegará a ese nivel. Este mismo razonamiento muestra que la búsqueda en \nanchura siempre encuentra la secuencia solución más corta (una de las que tienen \nel mínimo número de aristas). Atención: esto no significa en absoluto que realice un \nnúmero pequeño de operaciones. Se trata de una propiedad de la secuencia \nsolución encontrada, no del proceso por el que ha sido construida (de hecho, \nveremos que la búsqueda en anchura puede llegar a ser extremadamente ineficaz). \nDe lo anterior se sigue que, si existe solución, incluso en un espacio de estados con \nciclos, como el del problema de las garrafas (la Figura 3 presenta parte de ese \nespacio de estados), el algoritmo de búsqueda en anchura no entrará en bucles \ninfinitos, aunque sí que explorará en numerosas ocasiones la misma zona del \nespacio de estados, lo que puede perjudicar considerablemente su eficiencia. \n",
  "speaker": "SYSTEM",
  "uuid": "4a0f2915-37c7-407f-9379-e95cad3090ad"
}