{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 2\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11151\nLas ayudas que puedan concederse a los diferentes beneficiarios se podrán cofinanciar \ncon recursos procedentes del Fondo Social Europeo.\nEn virtud del artículo vigésimo octavo de la Orden ECI/266/2008, de 6 de febrero, se \nfaculta al Secretario de Estado de Universidades e Investigación para dictar las resoluciones \nnecesarias para la aplicación de la Orden de bases.\nDe acuerdo con el artículo 2.1.a) y c) del Real Decreto 1042/2009, de 29 de junio \n(publicado en el Boletín Oficial del Estado número 157, de 30 de junio de 2009), por el que \nse desarrolla la estructura orgánica básica del Ministerio de Ciencia e Innovación, \ncorresponde a la Secretaria de Estado de Investigación la planificación, seguimiento, \ncoordinación y evaluación del Plan Nacional de Investigación Científica, Desarrollo e \nInnovación Tecnológica, así como la planificación, coordinación, impulso y gestión de las \nactividades de formación e incorporación de personal investigador.\nEn su virtud, se resuelve:\nCAPÍTULO I\nObjeto y disposiciones generales de los subprogramas\nArtículo 1.  Objeto.\nEl objeto de la presente resolución es aprobar la convocatoria correspondiente al año \n2010 del procedimiento de concesión de ayudas para la formación de recursos humanos, \nen régimen de concurrencia competitiva y aplicando los principios de publicidad y \nobjetividad, a través de los siguientes subprogramas, que se rigen por lo dispuesto en este \ncapítulo y por las disposiciones específicas contenidas para cada uno de ellos en los \nrespectivos capítulos:\na)  Subprograma de Formación de Personal Investigador del Ministerio de Ciencia e \nInnovación (Subprograma FPI-MICINN): concesión de un máximo de 1.100 ayudas para la \nformación del personal investigador (FPI) en Centros de I+D de aquellos titulados \nuniversitarios que deseen realizar una tesis doctoral asociada a proyectos de I+D concretos \nfinanciados por el Plan Nacional de I+D+i. Adicionalmente, este subprograma financia los \nprecios públicos por la matrícula en el máster y doctorado, y la realización de estancias \nbreves en otros Centros de I+D (Capítulos del II al V).\nb)  Subprograma de Formación de Personal Investigador en agroalimentación en los \ncentros de investigación INIA-CCAA (Subprograma FPI-INIA): concesión de 50 ayudas a \ntitulados universitarios que deseen realizar una tesis doctoral asociada a los temas \nespecíficos identificados por el Instituto Nacional de Investigación y Tecnología Agraria y \nAlimentaria (en adelante INIA) y las Comunidades Autónomas, en los Centros de \nInvestigación Agraria y Alimentaria incluidos en la Comisión Coordinadora de Investigación \nAgraria INIA-CCAA, y que figuran en el servidor de información del INIA. Además el \nsubprograma financia las tasas de los cursos de máster y doctorado, la realización de \nestancias en el extranjero, así como la asistencia a reuniones, congresos y cursos de \nperfeccionamiento (Capítulos II y VI).\nArtículo 2.  Beneficiarios.\n1.  En las disposiciones específicas de los subprogramas se determinan, para cada \ntipo de ayuda, los sujetos que pueden tener la condición de beneficiarios, de entre los \ndefinidos en el artículo cuarto de la Orden de Bases.\n2.  No podrán obtener la condición de beneficiario las personas o entidades en quienes \nconcurra alguna de las circunstancias establecidas en el artículo 13 de la Ley 38/2003, de \n17 de noviembre, General de Subvenciones.\n3.  Los beneficiarios deberán cumplir las obligaciones recogidas en el artículo 14 de \nla citada Ley.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "4a400af8-61b6-49d9-9b32-768d13509a89"
}