{
  "message": "SYSTEM: Curriculum_abreviado_CVA_Proyectos_2016-MCSF2.pdf: Página 4\n \n4 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nC.4. Patentes \n \n \nMaría Poveda-Villalón, Mari Carmen Suárez-Figueroa, Asunción Gómez-Pérez. OOPS! \n(OntOlogy Pitfall Scanner). M-009445/2012 (Registro territorial de la Comunidad de \nMadrid). España. 20-diciembre-2012. Universidad Politécnica de Madrid \n \nAsunción Gómez-Pérez, Mari Carmen Suárez-Figueroa, Óscar Muñoz, Martín Vigo. \ngOntt. M-006071/2011 (Registro territorial de la Comunidad de Madrid). España. 20-julio-\n2011. Universidad Politécnica de Madrid \n \nC.5. Trabajos dirigidos \n \n \nCodirectora de la Tesis Doctoral titulada “Ontology Evaluation: a pitfall-based approach \nto ontology diagnosis”. Universidad Politécnica de Madrid. Escuela Técnica Superior de \nIngenieros Informáticos. Febrero 2016 \n \nCodirectora de la Tesis de Master (Master en Inteligencia Artificial) titulada “Metodología \nNeOn Aplicada a la Creación de una Ontología Sobre Transporte Público”, defendida en \nJulio de 2014. \n \nCodirectora de la Tesis de Master (Maestría en Ciencias Computacionales - CENIDET) \ntitulada “KnOWLearn: una metodología basada en el reuso para la construcción de \nontologías de dominio”, defendida en Febrero de 2013. \n \nCodirectora de la Tesis de Master (Master en Inteligencia Artificial Avanzada: \nFundamentos, Métodos y Aplicaciones - UNED) titulada “Desarrollo de una ontología \npara Smart Home”, defendida en Junio de 2012. \n \nCodirectora de la Tesis de Master (Maestría en Ciencias Computacionales - CENIDET) \ntitulada “Metodología para creación de ontologías de dominio OWL utilizando la mezcla \nde ontologías dirigida por parámetros”, defendida en Febrero de 2012. \n \nTutora de la Tesis de Master (Master de Investigación en Inteligencia Artificial – DIA) \ntitulada “Analyzing and Ranking Multimedia Ontologies for their Reuse”, defendida en \nFebrero de 2011. \n \nTutora de la Tesis de Master (Master de Investigación en Inteligencia Artificial - DIA) \ntitulada “Metodología NeOn aplicada a la representación del contexto”, defendida en \nSeptiembre de 2010. \n \nC.6. Organización de actividades de I+D \n  \n \nDemos and Posters Session, hosted by the 20th International Conference on Knowledge \nEngineering and Knowledge Management (EKAW 2016). November 19-23, 2016 \n \nEU Project Networking Session, hosted by the 11th Extended Semantic Web Conference \n(ESWC 2014). May 25-29, 2014 \n \nSpecial Session on Intelligent Components producing and consuming Knowledge and \nData (SS4-ICP) hosted by the 11th International Conference on Practical Applications of \nAgents and Multi-Agent Systems (PAAMS 2013). May 22-24, 2013 \n \nWOP 2012. 3rd Workshop on Ontology Patterns, hosted by the 11th International \nSemantic Web Conference (ISWC 2012). November 12, 2012 \n \nOEDW 2012. 1st International Workshop on Ontology Engineering in a Data-driven \nWorld, hosted by the 18th International Conference on Knowledge Engineering and \nKnowledge Management (EKAW 2012). October 9, 2012 \n \nTKE (Terminology and Knowledge Engineering) Conference. New frontiers in the \nconstructive symbiosis of terminology and knowledge engineering. June 20-21, 2012 \n \nOntology Engineering: the NeOn Methodology through the NeOn Toolkit. Tutorial hosted \nby the 8th International Semantic Web Conference (ISWC 2009). October 26, 2009 \n \nNeOn Methodology: how to build ontology networks. Tutorial hosted \nby \nthe \n16th \nInternational Conference on Knowledge Engineering and Knowledge Management \nKnowledge Patterns (EKAW 2008). September 29, 2008 \n \nKRRSW 2008. 1st International Workshop on Knowledge Reuse and Reengineering over \nthe Semantic Web, hosted by the 5th European Semantic Web Conference (ESWC \n2008). June 2, 2008 \n \nEON 2006. Evaluation of Ontologies for the Web, located at the 15th International World \nWide Web Conference (WWW 2006). May 22, 2006 \n",
  "speaker": "SYSTEM",
  "uuid": "4a4fdf5e-3ae3-4c1a-bc4e-20b75667af98"
}