{
  "message": "SYSTEM: FormularioCPM_asunciondemaria.gomez.pdf: Página 12\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n3.6. Coste estimado del desarrollo de su solución propuesta\n€\n3.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n3.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n3.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n3.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 3.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\nOtro(s) Retos(s):\n­12­\n(*) Campos obligatorios\nversión 1.2.\n#\n#\n24\n139.992,00\nLa construcción de recursos semánticos multilingües en el formato de los datos \nlingüísticos enlazados avanza en la tarea de compartir e integrar recursos lingüísticos \ncomplementarios que se encuentran actualmente aislados y mantenidos de forma \nindependiente por los diversos organismos de la Administración pública.  \n \nTeniendo en cuenta la política de Reutilización de la Información del Sector Público \n(RISP) y siguiendo la filosofía de los datos abiertos, las guías, modelos y técnicas \ndesarrollados por el OEG permiten la construcción de recursos lingüísticos a partir de la \nintegración de recursos existentes una vez transformados al formato de los datos \nenlazados. Al igual que con otro tipo de datos, los datos lingüísticos también se \nrepresentan como recursos mediante URIs únicas, lo que permite crear vínculos con otros \nrecursos que contengan información lingüística complementaria en la misma o distinta \nlengua. Esto permitirá la construcción eficiente de recursos multilingües en las lenguas del \nEstado, e incluso su conexión con recursos en otras lenguas a nivel internacional.  \n \nOtro aspecto beneficioso de los recursos lingüísticos como datos enlazados es que se \npuede identificar la información lingüística que se requiere, o la combinación de lenguas \nque se necesita para un proyecto en concreto, y configurar un recurso ad hoc partiendo \nde los datos conectados, y sin perder la traza del recurso original. Esto permite la \nagregación de la información pertinente para un proyecto, contribuyendo a la agilidad y \neficiciencia de las soluciones.  \n \nAdemás, al tomar como punto de partida la gran cantidad de recursos lingüísticos que se \nencuentran disponibles como datos abiertos en la nube de datos lingüísticos enlazados \n(LLOD cloud), se puede contribuir directamente al Reto 7 (Extracción terminológica \nautomatizada), ayudando a la extracción automática de términos o a la construcción \nautomática de ontologías a partir de recursos lingüísticos previamente transformados a \neste formato. En este sentido, tanto Apertium RDF como Terminoteca RDF, serían dos \npuntos de partida de aplicación inmediata.\nAdemás de las ventajas que este nuevo paradigma de organización y publicación de \ndatos lingüísticos tiene en sí mismo, hay muchas otras ventajas que se derivan de su uso \ny explotación en aplicaciones de procesamiento de texto, de anotación semántica, de \nanálisis de opinión o sentimientos, de desambiguación, de traducción automática, entre \nmuchas otras.  \n  \nUnos recursos lingüísticos de calidad en formatos estándar son la base para el procesado \ny la anotación semántica de los textos. Actualmente, la gran mayoría de herramientas de \nprocesamiento de lenguaje natural se han desarrollado para la lengua inglesa, y eso viene \nen parte justificado por la disponibilidad de recursos curados y mantenidos en inglés. Para \npoder generar un desarrollo similar de las tecnologías del lenguaje para el castellano y el \nresto de lenguas co-oficiales, es imprescindible la compartición y apertura de los recursos \nlingüísticos disponibles. El formato de la Web de Datos lo permite, y además permite la \nreutilización de gran cantidad de herramientas agnósticas al lenguaje pero que requieren \nformatos de representación estándar.   \n \nLas herramientas de anotación semántica se basan en ontologías enriquecidas con \ninformación lingüística, con lo que la conversión de los recursos lingüísticos al formato de \nlos datos enlazados, facilitará dicho enriquecimiento, contribuyendo a la una mejora de la \ntarea de desambig ación semántica para la posterior anotación te t al\nLos beneficios de esta propuesta apuntados en las secciones anteriores, tanto en lo \nrelativo al servicio público como su impacto en las tecnologías del lenguaje, se \npropagarán con el tiempo a un ámbito más amplio. Dado que los conjuntos de datos \nlingüísticos enlazados pueden servir de base a muchos proyectos de innovación basados \nen tecnologías del lenguaje, la solución propuesta tendrá un impacto positivo en áreas \ncomo salud, legal, educación, vigilancia tecnológica, etc.   \n \nTanto las técnicas como las metodologías en las que se apoya esta propuesta son \nindependientes del dominio y del lenguaje, por lo tanto, serán fácilmente adaptables a \ndominios y entornos lingüísticos diversos.\n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "4a6685e3-a3ae-4edb-9323-98a363698fec"
}