{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 99\n97\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n4.16 Content Analytics\nContent Analytics are systems to provide access to or to derive specific high‐quality information about enti‐\nties, locations, actions and evaluations from text, unstructured data and rich media. Content analytics tasks\nincludes categorizing text, clustering related text elements, extracting concepts or entities, modelling the\nrelationships between entities or concepts, producing taxonomies, mining graphics, audio, and video, etc.\nContent analytics provides insights of unstructured data combining several types of intelligent content tech‐\nnologies such as natural language processing, machine learning, clustering and categorization engines or\nsemantics.\nTraditionally, content analytics can be classified as:\n• Text analytics: gather insights from text sources.\n• Speech analytics: gather insights from audio sources.\n• Rich media analytics: gather insights from video sources.\nAs companies are interested in vertical business solutions rather than generic platforms, this classification is\nless significant. Specialized solutions includes a combination of text, audio, still images, animation, video and\ninteractivity content forms analytics.\nApplications\nAnalytics is one of the top IT priorities worldwide. In particular, in 2011, 20.1% of companies consider that\nsmart technologies (technologies that capture, process and present real‐time information from partners,\nsuppliers, customers, etc. via devices such as phones, sensors, chips in order to enable better data analysis\nand real‐time / smarter business decisions) is one of the top IT priorities, as well as 18.4% of companies\nbelieve that for Business Intelligence / Analytics technologies7.\nAs a result, content analytics applications are emerging in many sectors and disciplines at the same time.\nAmong them, it is necessary to highlight:\n• Security applications: to analyse plain text sources such as internet news, to discover threat patterns in\nthe new undefined corporate perimeter, to track and monitoring terrorist activities, etc.\n• Biomedical applications: to access provide based‐data diagnostics, automated cancer recognition, etc.\n• Search: to provide new ways to improve search results, etc. This is vital for example in those sectors that\nneeds information index and retrieval (for example, academics).\n• Legal discovery: to detect possible legal threats, etc.\n• Media: to curate content, RSS subscription optimization, topic trending, screen recording, etc.\nMarketing: churn analysis, customer micro segmentation, digital marketing strategy optimization, RSS sub‐\nscription optimization, targeting, etc.\n• Customer Experience Management. Including: sentiment analysis (to detect emotions and negative or\npositive opinions about a brand or product), loyalty analysis, influence score analysis, user feedback,\nuser surveys, etc.\n• Social media analytics.\n• Testing: to improve quality, automated coding generation, etc.\nMoreover, content analytics could help, from a generic point of view, to support the whole decision making\nprocess when combined with business analytics solutions:\n• Operational decision‐making process: Simulation, Risk management, Profitability KPIs, Collaboration,\n",
  "speaker": "SYSTEM",
  "uuid": "4a9d6b7b-4f8c-423d-9377-82cdcf7d48a2"
}