{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 34\n \n \nPág. 36 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nObjetivos: \nLos objetivos perseguidos por esta línea de actuación son los siguientes:  \n \nOfrecer nuevos servicios públicos o mejorar la capacidad y calidad de servicios públicos \nexistentes mediante la aplicación de las tecnologías del procesamiento del lenguaje \nnatural. \n \nServir de demostración de las capacidades y beneficios de las tecnologías del \nprocesamiento del lenguaje natural. \n \nGenerar recursos reutilizables para otros proyectos del mismo u otro dominio. \n \nServir de aprendizaje para futuros proyectos. \n \nServir de aplicación inmediata de medidas horizontales del Plan; uso de infraestructuras \ny plataformas comunes. \nMedidas: \n- Medida 1: Realizar un conjunto limitado de proyectos de aplicación de las tecnologías del \nlenguaje natural en servicios públicos estratégicos de gran impacto social. Se \nseleccionarán los proyectos con los siguientes requisitos: \n \nCompromiso de  los órganos competentes. Asegurar el liderazgo de los que conocen \nbien el problema y tienen competencias para resolverlo. \n \nConcreción. Responder a problemas ya identificados que justifiquen la idoneidad y el \nmomento de la puesta en marcha del proyecto. \n \nElevado impacto económico y social. \n \nDesarrollo de la cadena de valor completa. \n \nGeneración de recursos reutilizables. Evitar la generación de recursos cautivos de las \nimplementaciones y las tecnologías propietarias que no permiten la portabilidad de \nrecursos. \n \nSinergias con las demás medidas del Plan de Impulso de las Tecnologías del Lenguaje, \ny en particular, con la generación de recursos lingüísticos y con la plataforma de \nprocesamiento del lenguaje natural y de traducción automática de las \nAdministraciones Públicas. \n \nCarácter demostrador de las capacidades y beneficios de las tecnologías del lenguaje. \n \nEspecial atención a la adquisición de experiencia para futuros proyectos. \nLos sectores en los que se empezará a trabajar son Sanidad, Turismo y Educación \n(primeros proyectos 2016-17). Pero se prevé la posibilidad de incorporar otros proyectos \nfaro más adelante aplicados a otras áreas (Justicia, Atención al Ciudadano, y Vigilancia \n",
  "speaker": "SYSTEM",
  "uuid": "4b6c0ad4-db1a-4eb4-b5b2-5ae3d30d3a78"
}