{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 12\nPage 12 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n1. Introduction \nThe Semantic Web of the future will be characterized by using a very large number of ontologies \nembedded in ontology networks built collaboratively by distributed teams, where an ontology \nnetwork or a network of ontologies is defined as a collection of ontologies (called networked \nontologies) related together through a variety of different relationships such as mapping, \nmodularization, version, and dependency relationships [35]. So, future Semantic Web applications \nwill be based on networks of contextualized ontologies, which will be in continuous evolution. Such \nnetworks could include ontologies that already exist or they could be developed by reusing either \nother ontologies or non ontological but knowledge aware resources (thesauri, lexicons, text \ncorpora, DBs, UML diagrams, etc.) built by others [9]. \n1.1. WP5 Objectives and Main Tasks \nIn this context, the main objectives of WP5 are:  \n1 \nTo create the NeOn methodology that will support the collaborative aspects of ontology \ndevelopment and the reuse and the dynamic evolution of networked ontologies in distributed \nenvironments where contextual information is introduced by developers (domain experts, \nontology practitioners) at different stages of the ontology development process.  \n2 \nTo create a rigorous, sound NeOn methodology for the development of large scale Semantic \nWeb applications that supports the reference architecture and the service oriented \ninfrastructure developed in WP6.  \n3 \nTo provide qualitative and quantitative experimental evidence of how by following the NeOn \nmethodologies the system development improves.  \nThese objectives will be achieved through investigating the following tasks:  \n \nTask 5.3. Identification and definition of the development process and life cycle for networks of \nontologies. Results of these researches are included in this deliverable.   \n \nTask 5.4. The NeOn methodology for building collaboratively ontology networks will include \nmethods, techniques and tools for carrying out the activities identified and defined in the \nontology network development process.   \n \nTask 5.5. The NeOn methodology for development of large-scale Semantic Web applications \nfrom the initial phases (requirement analysis) of the development process until the stage prior \nto the implementation. To ease the use of the NeOn reference architecture and of the NeOn \nsoftware components, a set of developer-oriented reference specifications will be defined. \nThese specifications will serve as a skeleton for adapting the selected components and for \ndeveloping new complex semantic-based software components and semantic applications.  \n \nTask 5.6. Experimentation with the NeOn methodologies. In this task experiments, methods, \nand metrics are proposed for evaluating the main outcomes produced in this WP. The goal is to \nprovide qualitative and quantitative evidence that with the NeOn methodologies ontologies and \nsystems are built faster and better. \n",
  "speaker": "SYSTEM",
  "uuid": "4be6d693-d64d-4e46-b8ff-b3ba84e04bf4"
}