{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 230\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n236\n351.- Entidades emisoras. Opas Comisión Nacional del Mercado de Valores\n(CNMV)\nDirección Web:\nhttp://www.cnmv.es/index_n.htm?/consultas/reg_ofi_ent_emisoras/reg_ofi_ent_emi.htm~\n/p_consultas_4.html\nOrganismo editor: Comisión Nacional del Mercado de Valores (CNMV).\nClase de información:\nFormato de presentación:\nInformes\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Mercado de Valores.\nDescripción y comentarios: Esta información ha sido procesada por la CNMV reprodu-\nciendo la documentación recibida según lo dispuesto en el Real Decreto 1197/1991, de 26\nde julio. La información completa sobre la OPA, así como el anuncio de la misma, se ofre-\ncen en formato pdf.\n352.- ESIs. Registro Oficial de Empresas de Servicios de Inversión. Registro Oficial\nde Sociedades y Agencias de Valores y Sociedades Gestoras de Cartera\nDirección Web: http://www.cnmv.es/index_n.htm?/consultas/reg_ofi_soc_agen_valo/\nregsociedades.htm~/p_consultas_8.html\nWeb adicional: http://www.cnmv.es/index_n.htm?/consultas/reg_ofi_soc_agen_valo/\nregsociedades.htm~/p_consultas_8.html\nOrganismo editor: Comisión Nacional del Mercado de Valores (CNMV).\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Mercado de Valores.\nDescripción y comentarios: Empresas de Servicios de Inversión (ESIs). Herramienta de\nconsulta de las Empresas de Servicios de Inversión (ESIs) registradas en la CNMV y que,\npor tanto, están autorizadas para prestar servicios de inversión. Es posible acceder a infor-\nmación completa sobre una entidad determinada. Entre otros datos relevantes, es posible\nconsultar: si es o no miembro de algún mercado; agentes registrados (para cada uno, se\ninforma el nombre, la dirección, el ámbito geográfico y el alcance material de sus activi-\ndades); sucursales, si las tiene; folleto de tarifas (en formato PDF); contratos tipo (en for-\nmato PDF) y programa de actividades (en formato PDF). \nBASES DE DATOS  1/1/04  03:39  Página 236\n",
  "speaker": "SYSTEM",
  "uuid": "4c1052e8-8efb-4dee-b041-5057422dc911"
}