{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 13\n6.2\nOntology Matching Experiment\nIn our approach, we use ontology matching techniques for reconciliating models com-\ning from different authors but modelling similar domains. Thus, the question that we\nposed above (Q2) emerges naturally. Our target is to study the applicability of already\nexistent alignment approaches in the context of QR modelling.\nWe have tested the use of two state of the art ontology matching systems: Falcon-\nAO [21], and CIDER [18] (a complete evaluation of the large amount of alignment sys-\ntems currently available is out of the scope of this paper). We chose these two systems\nowing to their good behaviour in previous Ontology Alignment Evaluation Initiative\n(OAEI) competitions16 and to their complementary nature: Falcon is more focused on\nstructure-based matching and incorporates efﬁcient partition-based mechanisms, while\nCIDER relies on a context-based similarity measure and applies lightweight semantic\nreasoning. The evaluation was conducted as follows:\n1. First, a golden standard17 was deﬁned by human experts18. They created speciﬁc\nQR models for this experiment and identiﬁed semantic equivalences between them.\nAs result, eight QR models grouped in pairs were created, and a reference align-\nment ﬁle was produced for each pair, containing a total of 85 equivalences between\nthe model terms19.\n2. Then, each ontology aligner system was run separately. Each one received the two\nQR models as input, and produced an alignment ﬁle as result, containing the found\ncorrespondences between the two models.\n3. Finally, each produced alignment was compared to the golden standard, and preci-\nsion and recall computed.\nOur preliminary tests show issues with the QR model representation (Section 3)\nwhen applying Ontology Matching techniques. Particularly, the domain building blocks\nare not deﬁned by their properties, as is common in ontologies. To alleviate this issue\n(among others), a supplementary representation of the domain vocabulary accompanies\neach QR model. The properties of the domain vocabulary are programmatically in-\nferred from the richer model fragment and scenario representations. Table 3 shows the\nexperimental results, and illustrates the beneﬁts of using this reduced representation.\nCIDER\nFalcon\nPrecision Recall Precision Recall\nOWL representation\n23%\n85%\n10%\n82%\nReduced OWL representation\n92%\n95%\n67%\n95%\nTable 3. QR Model Matching Experiment: Averaged results for both model representations.\n16 http://oaei.ontologymatching.org/\n17 It can be found in http://delicias.dia.ﬁ.upm.es/∼jgracia/experiments/dynalearn/omtechniques.html\n18 Three researchers in biological science from University of Bras´ılia (Brazil).\n19 We expressed the alignments in the Alignment Format [15], to facilitate their later processing.\n",
  "speaker": "SYSTEM",
  "uuid": "4c2cdfc9-6fac-454a-8dcd-8622ff5ea577"
}