{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 8\n(UPM), German Herrero (ATOS), Elena Montiel-Ponsoda (UPM), Marta Sabor (OU), Boris Villazon-Terrazas (UPM), and \nZheng Yufei (UPM). \nTítulo: NeOn Deliverable 5.4.1: NeOn Methodology for Building Contextualized Ontology Networks. \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Febrero 2008  \nEditorial (si libro):  \nLugar de publicación: Autores (p.o. de firma): Valentina Presutti (CNR). Otros autores: Aldo Gangemi (CNR), Stefano David \n(CNR), Guadalupe Aguado de Cea (UPM), Mari Carmen Suárez-Figueroa (UPM), Elena Montiel-Ponsoda (UPM), María \nPoveda (UPM). \nTítulo: NeOn Deliverable 2.5.1: A Library of Ontology Design Patterns: reusable solutions for collaborative design of \nnetworked ontologies. \nRef. \n revista \n Libro \nClave: S  Volumen:  \nPáginas, inicial: final:  \nFecha: Febrero 2008  \nEditorial (si libro):  \nLugar de publicación: \n \nAutores (p.o. de firma): Elena Montiel-Ponsoda (UPM); Wim Peters (USFD); Guadalupe Aguado de Cea (UPM); Mauricio \nEspinoza (UPM). Other Authors: Mari Carmen Suárez-Figueroa (UPM); José Ángel Ramos Gargantilla (UPM); Asunción \nGómez-Pérez (UPM); Inmaculada Álvarez-de-Mon (UPM); Margherita Sini (FAO); Aldo Gangemi (CNR); Óscar Muñoz \n(UMP); Raúl Palma (UPM) \nTítulo: NeOn Deliverable 2.4.1. Multilingual Ontology Support \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Agosto 2007 \nEditorial (si libro):  \nLugar de publicación: \n \nAutores (p.o. de firma): Mari Carmen Suárez-Figueroa (UPM). Otros autores: Guadalupe Aguado de Cea (UPM), Carlos Buil \n(iSOCO), Caterina Caracciolo (FAO), Martin Dzbor (OU), Asunción Gómez-Pérez (UPM), Germán Herrrero (ATOS), Holger \nLewen (UKARL), Elena Montiel-Ponsoda (UPM), Valentina Presutti (CNR) \nTítulo: NeOn D5.3.1 NeOn Development Process and Ontology Life Cycle  \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Agosto 2007 \nEditorial (si libro):  \nLugar de publicación: \n \n \nAutores (p.o. de firma): Aguado de Cea, G., Montiel-Ponsoda, E. Ramos Gargantilla, J.C. \nTítulo: Multilingualidad en una aplicación basada en el conocimiento. Artículo en la revista PLN, Procesamiento del Lenguaje \nnatural, nº38 (Sociedad española para el Procesamiento del Lenguaje Natural). \n \nRef.   \n revista  \n \n  Libro: \nClave: CL \nVolumen:  \nPáginas, inicial: 77  \nfinal: 98   \nFecha: 2007 \nEditorial (si libro):   \nISSN: 1135-5948 \nLugar de publicación: Jaén \n \nAutores (p.o. de firma): Aguado de Cea, G. \nTítulo: A multiperspective approach to specialized phraseology: Internet as a reference corpus for phraseology. Formando \nparte del libro . The Texture of Internet: Netlinguistics in Progress  \n \nRef.   \n revista  \n \n  Libro: \nClave: CL \nVolumen:  \nPáginas, inicial:  \n \nfinal: \n \nFecha: 2007 \nEditorial (si libro): Cambridge Scholars Publishing \n \nISBN: 9781847181732 \nLugar de publicación: Cambridge \n \n",
  "speaker": "SYSTEM",
  "uuid": "4c791733-0f7f-466d-9f00-41342800eca8"
}