{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 103\nBÚSQUEDA \n \n103 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nLa situación anterior no podrá producirse si h es una subestimación de h*. Si la \nheurística h verifica que h(e) <= h*(e) para todo estado e (para el que exista h*) se \ndice que h es una heurística admisible. \nLa importancia de la anterior noción viene determinada por el siguiente resultado: si \nun algoritmo A utiliza una heurística admisible, entonces, si existe solución, \nencuentra una solución óptima.  \nUna instancia del esquema A en la que la heurística sea admisible se denomina \nalgoritmo A*. Así, un algoritmo A* siempre encontrará una solución óptima (si existe \nalguna). \nObsérvese que si tomamos como heurística la función identicamente nula (h = 0), \nsiempre subestima h*, es decir, siempre es admisible y, por tanto, A es A* y siempre \nencontrará una solución óptima. Pero éste no es un resultado nuevo. Si h = 0, \nentonces f = g; es decir, la búsqueda está controlada totalmente por la información g \ny en este caso el algoritmo A se comporta como \"primero el menos costoso\". \nVeremos más adelante que éste es, en cierto sentido, el caso menos interesante \nentre los A*. \nPese a que, evidentemente, la admisibilidad de una heurística tiene importantes \nrepercusiones en el comportamiento del algoritmo A, puede parecer un concepto \nmeramente teórico, puesto que, como ya hemos indicado, el cálculo de h*(e) no \ntiene por qué ser sencillo. Sin embargo, para determinar la admisibilidad de una \nheurística no es necesario calcular con exactitud los valores h*(e), basta con \ndemostrar que esos números acotan superiormente al valor heurístico y, en \nocasiones, esa demostración no es difícil.  \nPor ejemplo, consideremos el caso del 8-puzzle, con coste de cada arista igual a 1 y \ncon heurística el número de dígitos mal situados. Puesto que para situar un dígito \nmal situado se requiere al menos un movimiento (más de uno en la mayoría de las \nocasiones), resulta que esta heurística es admisible. \nSi consideramos el problema del tren, con coste de cada arista igual al número de \nkilómetros del trayecto y con heurística la distancia (en kilómetros) en línea recta a la \nciudad objetivo, es claro que la heurística es admisible (la distancia más corta entre \ndos puntos es la determinada por la recta que los une). En cambio, si el coste de \ncada arista mide la duración en horas del trayecto resulta que la heurística no tiene \npor qué ser, en general, admisible (aunque sigue siendo una heurística ...). \n",
  "speaker": "SYSTEM",
  "uuid": "4c80145f-67d7-478a-ae66-078430eedff7"
}