{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 15\n1. Ontology and the Lexicon\n15\n“Pragmatically, a common ontology deﬁnes the vocabulary with which queries and\nassertions are exchanged among agents”.\nAn example of a technical ontology with a parallel vocabulary is the Uniﬁed\nMedical Language System (UMLS) (e.g., Lindberg, Humphreys, and McCray 1993;\nwww.nlm.nih.gov/research/umls). The concepts in the Metathesaurus component of\nthe UMLS, along with their additional interpretation in the Semantic Net compo-\nnent, constitute an ontology. Each concept is annotated with a set of terms (in En-\nglish and other languages) that can be used to denote it; this creates a parallel vocab-\nulary. Additional linguistic information about many of the terms in the vocabulary\nis given in the separate Specialist Lexicon component. See Hahn (this volume) for\nmore details of the UMLS.\n1.5.2 Developing a lexically based ontology\nIt has long been observed that a dictionary implicitly contains an ontology, or at\nleast a semantic hierarchy, in the genus terms in its deﬁnitions. For example, if\nautomobile is deﬁned as a self-propelled passenger vehicle that usually has four\nwheels and an internal-combustion engine, then it is implied that automobile is a\nhyponym of vehicle and even that automobile IS-A vehicle; semantic or ontological\npart–whole relations are also implied.\nExperiments on automatically extracting an ontology or semantic hierarchy\nfrom a machine-readable dictionary were ﬁrst carried out in the late 1970s. Am-\nsler (1981), for example, derived a “tangled hierarchy” from The Merriam-Webster\nPocket Dictionary; Chodorow, Byrd, and Heidorn (1985) extracted hierarchies from\nWebster’s Seventh New Collegiate Dictionary. The task requires parsing the deﬁni-\ntions and disambiguating the terms used (Byrd et al. 1987); for example vehicle has\nmany senses, including a play, role, or piece of music used to display the special\ntalents of one performer or company, but this is not the sense that is used in the\ndeﬁnition of automobile. In the analysis of the deﬁnition, it is also necessary to rec-\nognize the semantically signiﬁcant patterns that are used, and to not be misled by\nso-called “empty heads”: apparent genus terms that in fact are not, such as member\nin the deﬁnition of hand as a member of a ship’s crew (Markowitz, Ahlswede, and\nEvens 1986, Alshawi 1987). Perhaps the largest project of this type was MindNet\n(Richardson, Dolan, and Vanderwende 1998).\nOften, the literature on these projects equivocates on whether the resulting hi-\nerarchies or networks should be thought of as purely linguistic objects—after all,\nthey are built from words and word senses—or whether they have an ontological\nstatus outside language. If the source dictionary is that of a technical domain, the\nclaim for ontological status is stronger. The claim is also strengthened if new, non–\nlexically derived nodes are added to the structure. For example, in The Wordtree, a\ncomplex, strictly binary ontology of transitive actions by Burger (1984), the nodes\nof the tree were based on the vocabulary of English (for example, to sweettalk is\nto ﬂatter and coax), but names were manually coined for nodes where English fell\nshort (to goodbadman is to reverse and spiritualize; to gorilla is to strongarm and\ndeprive).\n",
  "speaker": "SYSTEM",
  "uuid": "4ce1d135-9138-4a69-98c7-2f8f1202c118"
}