{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 10\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n- \nhttp://www.mcu.es/libro/CE/AgenciaISBN/InfGeneral/TablaCDU.html \n(en \nespañol) \n- \nhttp://www.udc-online.com/introduction.asp (en inglés, versión trial online por 2 \nsemanas, entrar en contacto para obtener usuario y clave para acceder) \n- \nDescargado en el formato PDF la versión utilizada en la Agencia Española del \nISBN. \n2. LCC (Library of Congress Classification). El Sistema de Clasificación del Congreso es \nun sistema de clasificación que fue desarrollado entre los siglos XIX y XX para \norganizar y ordenar las colecciones de libros de la Biblioteca del Congreso de los \nEEUU. \n- \nhttp://www.loc.gov/catdir/cpso/lcco/ \n- \nPara acceder al sistema completo de clasificación a través de Internet u otro \nmedio de publicación es necesario pagar por ello. Se puede acceder a los \narchivos con las clases principales en formato HTML o en formato WordPerfect \nde forma libre. \n- \nDescargados archivos en el formato WordPerfect y convertidos a formato Word \ncon las clasificaciones principales para “Music”, “Fine Arts” y “Language and \nLiterature” \n3. DDC (Sistema Dewey de Clasificación). Se trata de un sistema de clasificación \nbibliográfico propietario desarrollado por Móvil Dewey en 1876. \n- \nhttp://www.oclc.org/dewey/ \n- Está organizado en 10 clases o categorías principales, cada una dividida en 10 \nclases secundarias o subcategorías, que a su vez, se dividen en otras 10 \nsubdivisiones. Las clases principales y las clases secundarias están en formato \nHTML en http://en.wikipedia.org/wiki/List_of_Dewey_Decimal_classes.  \n- No está disponible de forma gratuita para descarga o cualquier otro medio. \n2.3.3 Sistemas de Clasificación Iconográfica \n1. Iconclass es un sistema de clasificación por materia. Se trata de una colección ordenada \nde definiciones de objetos, personas, eventos e ideas abstractas que pueden ser tema de \nuna imagen. Historiadores de arte, investigadores y encargados de museos o galerías de \narte lo utilizan para describir, clasificar y registrar el tema de imágenes presentadas en \nvarios medios como pinturas, dibujos y fotografías. \n- \nhttp://www.iconclass.nl/libertas/ic?style=index.xsl \n- \nEditor: Royal Netherlands Academy of Arts and Sciences \n- \nTipos de relaciones: jerárquica \n \n10\n",
  "speaker": "SYSTEM",
  "uuid": "4d6e376c-3a34-4e09-8cb2-381edcb0b2af"
}