{
  "message": "SYSTEM: Cv_abreviado-mperez.pdf: Página 1\n \n1 de 4  \n \nCURRÍCULUM ABREVIADO (CVA) \n \n \n \n \nParte A. DATOS PERSONALES \nNombre y apellidos \nMaría de los Santos Pérez Hernández \nDNI/NIE/pasaporte \n06577696H \nEdad \n41 \nResearcher ID \n L-4795-2015 \nNúm. identificación del investigador \nCódigo Orcid \n0000-0003-2949-3307 \n \nA.1. Situación profesional actual  \nOrganismo \nUniversidad Politécnica de Madrid  \nDpto./Centro \nDpto. de Arquitectura y Tecnología de Sistemas Informáticos / \nE.T.S de Ingenieros Informáticos  \nDirección \nCampus de Montegancedo s/n, Boadilla del Monte, 28660  \nTeléfono \n 913367380 \ncorreo electrónico mperez@fi.upm.es \nCategoría profesional \nProfesora Titular de Universidad  \nFecha inicio \n05/06/2007 \nEspec. cód. UNESCO \n120317,330406, 330418, 120903, 330499  \nPalabras clave \nSistemas distribuidos, paralelismo, data mining, tecnología \nsemántica  \n \nA.2. Formación académica (título, institución, fecha) \nLicenciatura/Grado/Doctorado \nUniversidad \nAño \nLicenciada en Informática \nUniversidad Politécnica de Madrid \n1998 \nDoctora en Informática \nUniversidad Politécnica de Madrid \n2003 \n \nA.3. Indicadores generales de calidad de la producción científica (véanse instrucciones) \n \nLos datos que se muestran a continuación proceden de Web of Science, como se propone \nen el modelo de curriculum, y de Google Scholar, puesto que en el área de informática se \ndebe tener en cuenta que una parte de la producción científica corresponde a conferencias, \nen lugar de revistas.  \n• \nSexenios de investigación (y fecha del último concedido): 2 (2011) \n• \nTesis doctorales dirigidas en los últimos 10 años: 6 \n• \nCitas totales: 184 (WoS) / 778 (Google Scholar)  \n• \nh-index: 5 (WoS) / 15 (Google Scholar) \n \n \nParte B. RESUMEN LIBRE DEL CURRÍCULUM (máximo 3500 caracteres, incluyendo \nespacios en blanco) \n \nMaria S. Pérez es Profesora Titular de Universidad en la E.T.S. de Ingenieros Informáticos \nde la Universidad Politécnica de Madrid. Recibió el Premio al Rendimiento Académico \n(1996) y el premio Extraordinario de Doctorado por la UPM (2003). \n \nEn el ámbito investigador, ha publicado 33 artículos en revistas con factor de impacto. \nTambién posee un gran número de artículos publicados en actas de congresos recogidos \nen la lista publicada por CORE (ERA Conference List). Estas actas son un vehículo de \ndifusión del conocimiento comparable a las revistas que ocupan posiciones relevantes en \nel JCR y tienen unos criterios de calidad similares. El número de artículos clasificados en \nesta lista con ranking CORE A es 10. Así mismo, también se caracteriza por una gran \nparticipación en la comunidad investigadora, como atestiguan la organización de \nmúltiples conferencias internacionales, la edición de publicaciones internacionales o la \nimpartición de diversos seminarios. La candidata ha realizado 3 estancias en Centros de \nInvestigación y tiene reconocidos dos tramos de actividad investigadora (sexenios). \nDestaca por una abundante actividad en proyectos de investigación competitivos. Es \nreseñable su participación en 5 proyectos europeos, en 2 de los cuáles participa como IP \ny en 1 de ellos como coordinadora general del proyecto, así como su participación en \notros 5 proyectos competitivos a nivel nacional. A partir del año 2007, la solicitante ha \nparticipado de manera continua en proyectos del plan nacional. Respecto a la \ncoordinación de proyectos, la solicitante ha dirigido 5 proyectos competitivos, \nFecha del CVA  \n29-03-2016 \n",
  "speaker": "SYSTEM",
  "uuid": "4da0b761-9280-4c4d-829b-c093fa611619"
}