{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 2\nmakes generating feedback based on a large set of models difﬁcult, since the consensus\nand disagreement between models cannot be easily determined. We hypothesise that\nthe application of Semantic Web techniques to describe and interlink QR models will\nbe beneﬁcial.\nWe call grounding the process of linking terms in models to concepts in a com-\nmon vocabulary. Grounding transforms the set of models into a semantically enabled\nnetworked resource of scientiﬁc data that can be exploited both in the scientiﬁc and\neducational contexts. By allowing comparison between models, algorithms can be writ-\nten to make modelling suggestions based on other models. Furthermore, when reusing\nmodel parts, knowledge can be more gracefully integrated, as equivalent knowledge\nalready existing in a model can be reused. For ﬁnding these pieces of common infor-\nmation, ontology matching techniques can be applied to explore the similarities among\nmodels, with the purpose of getting valuable feedback during the model construction\nprocess.\nThe approach presented in this paper consists of the following steps (see Figure 1):\nOntology Aligner\nUser\nSemantic Reasoner\ngy\ng\nUser\nQuality feedback\nOWL export\nSemantic repository\nModel\nModel\nGrounding\nOnline ontologies\nModelling tool\nThe Web\nFig. 1. Overview of the approach\n1. OWL Export. The conceptual knowledge contained in QR models is extracted and\nexpressed in OWL [20], to facilitate their ontology-based description.\n2. Grounding. The terms from the QR models are linked into external vocabularies\n(e.g., DBpedia [2]). These grounded models are stored in a semantic repository.\n3. Quality feedback. Alignment and reasoning techniques are applied to discover simi-\nlarities and dissimilarities among models, and based on that to enrich the modelling\nprocess with adequate feedback and suggestions for knowledge reuse.\n",
  "speaker": "SYSTEM",
  "uuid": "4fe63b0c-27e5-4002-9778-7c06550f76d9"
}