{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 10\n56 \nO. Corcho \n \n5 \nConclusion and open research problems \nIn this paper we have described the most widely used \ndocument annotation approaches. We have shown the \nsimilarities and differences between the use of Dublin Core \nfor annotating the properties of the document itself and the \nuse of thesauri, controlled vocabularies and ontologies for \nannotating the document contents. All these approaches can \nbe characterised according to a continuous line between the \nhighly informal, lightweight vocabularies to very formal \nheavyweight ontologies. \nThen we have described formal languages used  \nboth in the past, and currently, for annotating web  \nresources, in the context of the semantic web, and tools that \nallow creating ontology based annotations. During  \nthe last years, especially with the emergence of the semantic \nweb, many advances in document annotation have seen  \nthe light. However, there are still many open issues  \n(with different degrees of maturity) to be solved.  \nIn this paper we have not pretended to present an  \nexhaustive state of the art on document annotation: in fact, \nwe have focused in Sections 3 and 4 in ontology based \ndocument annotation, and we have not covered all the \nexisting approaches, but only some of the most relevant \nones. \nOne of these open issues is maybe one of the most \nimportant aspects to be considered in order to make the \nupgrade of current web content to the semantic web a \nreality. The set of tools presented in Section 4 are mainly \nmanual or semi-automatic annotation tools, the latter based \non \ninformation \nextraction \nand/or \nmachine \nlearning \ntechniques. The manual annotation of documents is a high \ncost and error prone task, as has been proven by \npreSemantic Web initiatives. To alleviate this task, an \nimportant effort is currently being made in the automation \nof document annotations, and the result is some degree  \nof automation as shown in some of the descriptions \nprovided in Section 4. However, there is still some work to \ndo to achieve a complete automation of the annotation \nprocess. \nFinally, it is important to note that there are many other \naspects of document annotation that could have been \ndescribed in this paper, such as the quality of document \nannotations, \nthe \nmanagement \nof \ninconsistencies \nin \ndistributed annotated data, the lifecycle of annotations and \ntheir related vocabularies (e.g., the management of the \nevolution of the vocabularies in which the annotations are \nbased), the existence of annotation management systems for \nquerying, storage, reasoning, etc. Clearly all these aspects \nwould deserve future special issues, since much research is \nbeing done in all these areas. \nAcknowledgement \nThis work has been supported by the EU project Esperonto \n(IST-2001-34373). \n \n \nReferences \nBenjamins, V.R., Contreras, J., Blázquez, M., Dodero, J.M., \nGarcía, A., Navas, E., Hernández, F. and Wert, C. (2004) \n‘Cultural heritage and the semantic web’, in Bussler, C., \nDavies, J., Fensel, D. and Studer, R. (Eds.): The Semantic \nWeb: \nResearch \nand \nApplications, \nFirst \nEuropean  \nSemantic Web Symposium (ESWS2004), Springer-Verlag, \npp.433–444. \nBenjamins, V.R., Contreras, J., Corcho, O. and Gómez-Pérez, A. \n(2002) ‘Six challenges for the semantic web’, in Cristani, M. \n(Ed.): KR2002 Workshop on the Semantic Web, Toulouse, \nFrance. \nBenjamins, V.R., Fensel, D., Decker, S and Gómez-Pérez, A. \n(1999) ‘(KA)2: building ontologies for the internet: a mid \nterm report’, International Journal of Human Computer \nStudies, Vol. 51, pp.687–712. \nBray, T., Paoli, J., Sperberg-McQueen, C.M. and Maler, E. (2000) \nExtensible \nMarkup \nLanguage \n(XML) \n1.0, \nW3C \nRecommendation, http://www.w3.org/TR/REC-xml. \nBrickley, D. and Guha, R.V. (2004) RDF Vocabulary Description \nLanguage 1.0: RDF Schema, W3C Recommendation, \nhttp://www.w3.org/TR/PR-rdf-schema. \nCiravegna, F. (2001) ‘Adaptive information extraction from  \ntext by rule induction and generalisation’, in Nebel, B. (Ed.): \n17th \nInternational \nJoint \nConference \non \nArtificial  \nIntelligence \n(IJCAI’01), \nSeattle, \nWashington, \nMorgan \nKauffmann \nPublishers, \nSan \nFrancisco, \nCalifornia,  \npp.1251–1256. \nDean, M. and Schreiber, G. (2004) OWL Web Ontology Language \nReference, \nW3C \nRecommendation, \nhttp://www.w3.org/ \nTR/owl-ref/. \nDomingue, J. and Motta, E. (2000) ‘PlanetOnto: from news \npublishing to integrated knowledge management support’, \nIEEE Intelligent Systems and their Applications, Vol. 15,  \nNo. 3, pp.26–32. \nFensel, D., Angele, J., Decker, S., Erdmann, M., Schnurr, H.P., \nStaab, S., Studer, R. and Witt, A. (1999) ‘On2broker: \nsemantic-based access to information sources at the www’, in \nde Bra, P. and Leggett, J. (Eds.): World Conference on the \nWWW and Internet (WebNet’99), Honolulu, Hawaii,  \npp.1366–1371. \nGómez-Pérez, A., Fernández-López, M. and Corcho, O. (2003) \nOntological Engineering: with Examples from the Areas of \nKnowledge Management, E-commerce and the Semantic Web, \nSpringer-Verlag, London. \nHandschuh, \nS., \nStaab, \nS. \nand \nMäedche, \nA. \n(2001)  \n‘CREAM – creating relational metadata with a component-\nbased, ontology-driven annotation framework’, in Gil, Y., \nMusen, M. and Shavlik, J. (Eds.): First International \nConference on Knowledge Capture (KCAP’01), ACM Press, \nVictoria, Canada, 1-58113-380-4, New York, pp.76–83. \nHeflin, J.D. and Hendler, J.A. (2001) ‘A portrait of the semantic \nweb in action’, IEEE Intelligent Systems and their \nApplications, Vol. 16, No. 2, pp.54–59. \nHorrocks, I., Fensel, D., Harmelen, F., Decker, S., Erdmann, M. \nand Klein, M. (2000) ‘OIL in a nutshell’, in Dieng, R. and \nCorby, O. (Eds.): 12th International Conference in \nKnowledge \nEngineering \nand \nKnowledge \nManagement \n(EKAW’00), Juan-Les-Pins, France, Lecture Notes in \nArtificial Intelligence LNAI 1937, Springer-Verlag, Berlin, \nGermany, pp.1–16. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "502ad9a4-0979-4e04-9274-c7eb6d509d17"
}