{
  "message": "SYSTEM: QRVocabulary.pdf: Página 12\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n94 / 103 \nA.8.5 The notion of History \nValue History \nThe value history describes how quantity values change through a sequence of states \n(usually a behaviour path). \nTransition History \nThe transition history shows the transitions that cause the changes from one state to the \nother for a sequence of states. \nEquation History \nThe equation history describes how the ordinal relations change through a sequence of \nstates (usually a behaviour path). \nA.9: Inequalities and Values as Conditions or Consequences \nA.9.1 Value Assignment \nValues are abbreviations for inequalities between a quantity, or a derivative, and \nqualitative values in its quantity space. The qualitative simulator converts these values \nto (possibly multiple) inequality relations. For example, a magnitude set to an interval \nbetween two points using a value is mapped to the inequality relations smaller than \n(with respect to the higher point), and small than (with respect to the lower point). A \nvalue assignment to a point is equivalent to an equality relation to that point. \n \nRemarks: \nWhen value assignments (and/or inequalities) are used as a condition, and the value \n(and/or inequality) cannot be derived, the reasoning engine tries to assume the value \n(and/or inequality). If the resulting state is not inconsistent, it will appear in the state-\ngraph. Value assignments (and/or in/equalities) as consequences should be used \nconservatively, because if two model fragments with opposing consequence value \nassignments (and/or in/equalities) become active, the resulting state is inconsistent and \nwill be removed. It is good practice to only use these types of ingredients in combination \nwith an assumption. \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "50f18dde-b45d-44b2-a36b-2a33ac412b94"
}