{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 76\nPage 76 of 111 \nNeOn Integrated Project EU-IST-027595 \nand taking into account knowledge about the concrete domain. Such specification should \nbe evaluated (from technical and user perspectives). \n \nDesign/Modelling Phase. The output of this phase should be an informal model and a \nformal one that satisfy the requirements obtained in the previous phase. The formal model \ncan not be used by computers, but it can be reused in other ontology networks. Both \nmodels should be documented, evaluated and assessed. \n \nImplementation Phase. In this phase, the formal model obtained in the previous one is \nimplemented in an ontology language. As in previous phases, the result of this \nimplementation should be documented, evaluated and assessed. The output of this phase \ncan be used by semantic applications or by other ontology networks.  \n \nMaintenance Phase. If, during the use of the ontology network, errors or missing knowledge \nare detected, then the development team should apply again the model starting from the \nrequirements definition phase. Additionally, in this phase documentation, evaluation, and \nassessment should be also carried out as well as the generation of new versions for the \nontology network. \n \nFigure 28. Five-phase waterfall ontology network life cycle model  \nProject management and configuration management issues should be carried out in all the \nphases of the model. The same applies to knowledge acquisition, documentation, evaluation \nand assessment.  \n Six-phase waterfall ontology network life cycle model.  \nThis model, shown in Figure 29, extends the previous one with a new phase in which the reuse \nof already implemented ontologies or ontology modules is considered. The main requirement in \nthe Reuse Phase is the obtention of one or more ontologies or ontology modules to be reused \nin the ontology network being developed. The output of this reuse phase could be an informal \nmodel or a formal one to be used in the ‘design/modelling’ phase; or an implemented model (in \nan ontology language) to be used in the ‘implementation’ phase. \nFor the other phases the requirements are the same as those presented in the previous model. \n \n",
  "speaker": "SYSTEM",
  "uuid": "5239bbf6-5307-49d5-a8fd-6f81313cb3d3"
}