{
  "message": "SYSTEM: CV-Cicyt_MCSFB_21Marzo2016.pdf: Página 24\nPublicación: In C. Eschenbach and M. Grüninger (Eds.). 2008. Formal Ontologies in Information Systems. IOS Press. doi: \n10.3233/978-1-58603-923-3-181. ISSN: 0922-6389. ISBN: 978-1-58603-923-3  \nVolume:  \n \n \n \n Pages: 181-194   \nLugar celebración: Saarbrücken, GERMANY \nFecha: October 31-November 3, 2008 \n \n \nAutores: G. Aguado de Cea, A. Gómez-Pérez, E. Montiel-Ponsoda,  M. C. Suárez-Figueroa  \nTítulo: Natural Language-based Approach for Helping in the Reuse of Ontology Design Patterns \nCongreso: 16th International Conference on Knowledge Engineering and Knowledge Management Knowledge Patterns \n(EKAW 2008) \nPublicación: Proceedings of 16th International Conference on Knowledge Engineering and Knowledge Management \nKnowledge Patterns (EKAW 2008). ISSN: 0302-9743. LNAI: 5268. ISBN: 978-3-540-87695-3. \nVolume:   \n \n \nPages: 32-47 \nLugar celebración: Acitrezza, Catania, ITALY \nFecha: September 29-October 3, 2008 \n \n \nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: Building Ontology Networks: How to Obtain a Particular Ontology Network Life Cycle?  \nCongreso: International Conference on Semantic Systems (I-SEMANTICS’08)   \nPublicación: Proceedings of I-SEMANTICS 2008. ISSN: 0948-695x. Online edition: ISSN 0948-6968  \nVolume.   \n \n \n \n \nPages: 142-149 \nLugar celebración: Graz, AUSTRIA \nFecha: September 3-5, 2008 \n \n \nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: First Attempt towards a Standard Glossary of Ontology Engineering Terminology  \nCongreso: The 8th International Conference on Terminology and Knowledge Engineering   \nPublicación: Managing ontologies and lexical resources. TKE 2008 8th International Conference on Terminology and KE. \nISBN: 87-91242-50-9 \nVolume. Pages: 1-15 \nLugar celebración: Copenhagen, DENMARK \nFecha: August 18-August 21, 2008  \n \n \nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: Towards a Glossary of Activities in the Ontology Engineering Field  \nCongreso: The 6th Language Resources and Evaluation Conference (LREC 2008)   \nPublicación: 6th Conference on Language Resources and Evaluation. ISBN: 2-9517408-4-0 \nVolume.   \n \n \nPages: 870-873 \nLugar celebración: Marrakech, MOROCCO \nFecha: May 28-May 30, 2008  \n \n \nAutores: A. Gangemi, A. Gómez-Pérez, V. Presutti, M. C. Suárez-Figueroa \nTítulo: Towards a Catalog of OWL-based Ontology Design Patterns \nCongreso: XII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA-TTIA 2007) \nPublicación: Actas de la XII Conferencia de la Asociación Española para la Inteligencia Artificial. ISBN: 978-84-611-8846-8 \nVolume: I.  \n \n \n \n \nPages: 387-396 \nLugar celebración: Salamanca, SPAIN \nFecha: November 12-November 16, 2007 \n \n \nAutores: A. Gómez-Pérez, A. López-Cima, M. C. Suárez-Figueroa, O. Corcho \nTítulo: The ODESeW platform as a tool for managing EU project: the KnowledgeWeb case study  \nCongreso: EKAW 2006. 15th International Conference on Knowledge Engineering and Knowledge Management Managing \nKnowledge in a World of Networks \nPublicación: Managing Knowledge in a World of Networks. Springer. LNAI 4248. Steffen Staab, Vojtêch Svátek (Eds). \nPages: 389-396. ISSN: 0302-9743. ISBN: 3-540-46363-1 \nLugar celebración: Podebrady, CZECH REPUBLIC \nFecha: October 2-6, 2006 \n \n",
  "speaker": "SYSTEM",
  "uuid": "54878e17-7618-4297-9604-b09c0e1f616c"
}