{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 17\n1. Ontology and the Lexicon\n17\n1.5.4 Ontologies for lexicons\nAs mentioned in section 1.3.1, most theories of what a word sense is relate it in some\nway to the world. Thus, an ontology, as a non-linguistic object that more-directly\nrepresents the world, may provide an interpretation or grounding of word senses. A\nsimple, albeit limited, way to do this is to map between word senses and elements\nof or structures in the ontology. Of course, this will work only to the extent that the\nontology can capture the full essence of the meanings. We noted in section 1.5.1\nabove that the UMLS grounds its Metathesaurus this way.\nIn machine translation and other multilingual applications, a mapping like this\ncould act as an interlingua, enabling the words in one language to be interpreted in\nanother. However, greater independence from any particular language is required; at\nthe very least, the ontology should not favour, say, Japanese over English if it is to\nbe used in translation between those two languages. In the twelve-language SIMPLE\nlexicon (Lenci et al. 2000), a hand-crafted upper ontology of semantic types serves\nas an anchor for lexical entries in all the languages (Lenci 2001). The semantic\ntypes are organized into four qualia roles, following the tenets of generative lexicon\ntheory (see section 1.2.3 above).\nHovy and Nirenburg (1992) have argued that complete language-independence\nis not possible in an ontologically based interlingua for machine translation, but\nsome degree of language-neutrality with respect to the relevant languages can\nnonetheless be achieved; and as the number of languages involved is increased,\nlanguage-independence can be asymptotically approached. Hovy and Nirenburg\npresent a procedure for merging a set of language-dependent ontologies, one at\na time, to create an ontology that is neutral with respect to each. Near-synonyms\nacross languages (section 1.4.1 above) are just one challenge for this approach. (See\nalso Hovy (1998) and Noy (this volume).)\n1.6 Conclusion\nIn this chapter, we have discussed the relationship between lexicons, which are lin-\nguistic objects, and ontologies, which are not. The relationship is muddied by the\ndifﬁcult and vexed relationship between language, thought, and the world: insofar\nas word-meanings are objects in the world, they may participate in ontologies for\nnon-linguistic purposes, but they are inherently limited by their linguistic heritage;\nbut non-linguistic ontologies may be equally limited when adapted to applications\nsuch as text and language processing.\nAcknowledgements\nThe preparation of this chapter was supported by a grant from the Natural Sciences\nand Engineering Research Council of Canada. I am grateful to Eduard Hovy, Jane\nMorris, and Nadia Talent for helpful discussions and examples.\n",
  "speaker": "SYSTEM",
  "uuid": "54f56b64-73b0-4d77-a185-6f20cb204639"
}