{
  "message": "SYSTEM: CV-Cicyt_MC_Enero-2010.pdf: Página 15\nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: Building Ontology Networks: How to Obtain a Particular Ontology Network Life Cycle?  \nCongreso: International Conference on Semantic Systems (I-SEMANTICS’08)   \nPublicación: Proceedings of I-SEMANTICS 2008. ISSN: 0948-695x. Online edition: ISSN 0948-6968  \nVolume. Pages: 142-149 \nLugar celebración: Graz, AUSTRIA \nFecha: September 3-5, 2008 \n \n \nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: First Attempt towards a Standard Glossary of Ontology Engineering Terminology  \nCongreso: The 8th International Conference on Terminology and Knowledge Engineering   \nPublicación: Managing ontologies and lexical resources. TKE 2008 8th International Conference on Terminology and KE. \nISBN: 87-91242-50-9 \nVolume. Pages: 1-15 \nLugar celebración: Copenhagen, DENMARK \nFecha: August 18-August 21, 2008  \n \n \nAutores: E. Montiel-Ponsoda, G. Aguado de Cea, A. Gómez-Pérez,  M. C. Suárez-Figueroa \nTítulo: Helping Naïve Users to Reuse Ontology Design Patterns  \nCongreso: 1st International Workshop on Reuse and Reengineering over the Semantic Web (en la conferencia European \nSemantic Web Conference (ESWC 2008) \nPublicación: Proceedings of 1st International Workshop on Reuse and Reengineering over the Semantic Web (en la \nconferencia European Semantic Web Conference (ESWC 2008)  \nVolume. Pages: \nLugar celebración: Tenerife, SPAIN \nFecha: June 1-5, 2008 \n \n \nAutores: M. C. Suárez-Figueroa, A. Gómez-Pérez \nTítulo: Towards a Glossary of Activities in the Ontology Engineering Field  \nCongreso: The 6th Language Resources and Evaluation Conference   \nPublicación: 6th Conference on Language Resources and Evaluation. ISBN: 2-9517408-4-0 \nVolume. Pages:  \nLugar celebración: Marrakech, MOROCCO \nFecha: May 28-May 30, 2008  \n \n \nAutores: A. Gangemi, A. Gómez-Pérez, Valentina Presutti, M. C. Suárez-Figueroa \nTítulo: Towards a Catalog of OWL-based Ontology Design Patterns \nCongreso: XII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA-TTIA 2007) \nPublicación: Actas de la XII Conferencia de la Asociación Española para la Inteligencia Artificial. ISBN: 978-84-611-8846-8 \nVolume: I. Pages: 387-396 \nLugar celebración: Salamanca, SPAIN \nFecha: November 12-November 16, 2007 \n \n \nAutores: E. Montiel-Ponsoda, G. Aguado de Cea, M. C. Suárez-Figueroa, R. Palma, W. Peters \nTítulo: LexOMV: an OMV extension to capture multilinguality  \nCongreso: OntoLex’07 Workshop (ISWC 2007) \nPublicación: \nVolume. Pages:  \nLugar celebración: Busan, KOREA \nFecha: November 11-November 15, 2007 \n \n \n \n \n \nAutores: A. Gómez-Pérez, A. López-Cima, M. C. Suárez-Figueroa, O. Corcho \nTítulo: R&D Project Management with ODESeW (Poster) \n",
  "speaker": "SYSTEM",
  "uuid": "56ba5fe1-f77c-4424-979f-e81389230d57"
}