{
  "message": "SYSTEM: Ejercicios.pdf: Página 16\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n16 \n \nProblema nº 8  (4 puntos)  \n \nUna tienda de comercio electrónico vende impresoras. Se desea integrar con  la tienda \nvirtual un sistema que aconseje, según las necesidades del cliente, qué tipo de impresora \ndebe comprar.  \n \nSupóngase que en la tienda virtual existe una opción de  \"ayúdame a elegir\" que \nvisualiza en pantalla  un formulario en el que el usuario rellena sus preferencias sobre \nimpresoras.   \n ¿desea imprimir en color?  \n ¿desea utilizar su impresora de forma compartida/en red?  \n ¿le gustaría una impresora capaz de enviar y recibir faxes? \n ¿le gustaría una impresora capaz de escanear y copiar? \n ¿Desea calidad en la imagen? \n \nUna vez rellenado y enviado el formulario a la tienda virtual,  el sistema introduce las \npreferencias del cliente en su base de conocimientos e infiere qué tipo de impresora \ncomprar. El sistema conoce la siguiente información sobre impresoras: \n \n \nC\nol\nor \nTrabaj\na  \nEn \nRed \nEnvia y  \nRecibe  \nfaxes \nEscane\na  \ny copia \nCalidad  \nEn la \nImagen \nImpresora-1 \nSí Sí \nSí \nSí \nNo \nImpresora-2 \nSí Sí \nNo \nNo \nNo \nImpresora-3 \nSí No \nNo \nNo \nSí \nImpresora-4 \nSí Sí \nNo \nNo \nSí \nImpresora-5 \nSí Sí \nNo \nSí \nRegular \n \n \n \n \n1)  Dibujar un  Sistema Basado en Marcos que represente el problema, indicando todas las \nrelaciones, propiedades de clase y de instancia de cada marco clase. (1 punto) \n \n2.) Representar de forma tabular  el marco Cliente  y el marco coche modelo1  (1  punto) \n \n3) Desarrollar el valor activo que infiere el tipo de coche que compra el cliente e indicar en qué \nfaceta de qué propiedad va incluido. ( 1 punto) \n \n4)  Desarrollar los valores activos que calculan los suplementos e  indicar en qué faceta de qué \npropiedades van incluidos. ( 1 punto) \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "57a46865-90d5-4532-9f3a-dcb572303585"
}