{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 24\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 24 de 42 \n9. Gracia J, Montiel-Ponsoda E, Cimiano P, Gómez-Pérez A, Buitelaar P, McCrae J. \nChallenges for the Multilingual Web of Data. International Jounal on Semantic Web \nand Information Systems. IGI-Publisching. ISSN: 1552-6283. \n10. Gray AJG, Garcıa-Castro R, Kyzirakos K, Karpathiotakis M, Calbimonte JP, Page K, \nSadler J, Frazer A, Galpin I, Fernandes AAA, Paton NW, Corcho O, Koubarakis M, De \nRoure AD, Martinez K, Gomez-Perez A. A Semantically Enabled Service Architecture \nfor Mashups over Streaming and Stored Data. ISWI 2011 Workshop. ESWC2011. \nISBN: 978-3-642-21033-4. \n11. Gray AJG, Sadler J, Kit O, Kyzirakos K, Karpathiotakis M, Calbimonte JP, Page K, \nGarcía-Castro R, Frazer A, Galpin I, Fernandes AAA, Paton NW, Corcho O, Koubarakis \nM, De Roure D, Martinez K, Gómez-Pérez A. A Semantic Sensor Web for \nEnvironmental Decision Support Applications. Sensors. MDPI AG, Suiza, 2011. ISSN: \n1424-8220. \n12. Jiménez A, Mateos A, Suárez-Figureoa MC, Fernández-López M, Gómez-Pérez A. \nSelecting multimedia ontologies to be reused on the basis of the GMAA decision \nsupport system. International Conference on Operations Research 2001. Zurich, \nAustria. 30 Agosto – 2 Septiembre 2011. \n13. Lopez-Pellicer FJ, Vilches-Blázquez LM, Zarazaga-Soria LF, Muro-Medrano PR, \nCorcho O. The Delft Report: Linked Data and the challenges for geographic information \nstandardization. Jornadas Ibéricas de Infraestructuras de Datos Espaciales 2011 (JIIDE \n2011). \nBarcelona, \nEspaña. \n9-11 \nde \nnoviembre \nde \n2011. \nhttp://www.jiide2011.org/jiide2011/pdf/C_69.pdf. \n14. Lynden S, Corcho O, Kojima I, Antonioletti M, Buil-Aranda C. Open Standards for \nService-Based Database Access and Integration. Grid and Cloud Database \nManagement. Springer-Verlag. . ISBN: 978-3-642-20044-1. \n15. Mendes P, Jakob M, García-Silva A, Bizer C. DBpedia Spotlight: Shedding Light on the \nWeb of Documents. Proceedings of the 7th International Conference on Semantic \nSystems (I-Semantics). I-Semantics. Graz, Austria. 7–9 September 2011. \n16. Montiel-Ponsoda E, Aguado de Cea G. Grasping the semantics of predictes for \nontology building with the Lexical Constructional Model. SOCIETAS LINGUISTICA \nEUROPAEA SLE 2011 - 44T H ANNUAL MEETING - Book of abstracts. SOCIETAS \nLINGUISTICA EUROPAEA 2011. Logroño, España. 8-11 septiembre 2011. \n17. Montiel-Ponsoda E, Aguado-de-Cea G, McCrae J. Representing term variation in \nlemon. http://tia2011.crim.fr/Workshop-Proceedings/TIAW-2011.pdf. 9th International \nConference on Terminology and Artificial Intelligence - Workshop. Paris, Francia. 10 \nNovember 2011. \n18. Montiel-Ponsoda E, Gracia J, Aguado-De-Cea G, Gómez-Pérez A. Representing \nTranslations on the Semantic Web. ISWC 2011 - Workshop The Multilingual Semantic \nWeb. Bohn, Alemania. 23 de octubre 2011. \n19. Muñoz-García O, García-Silva A, Corcho O, de la Higuera Hernández M, Navarro C. \nIdentifying Topics in Social Media Posts using DBpedia. Proceedings of the Networked \nand Electronic Media Summit (NEM summit 2011). NEM summit 2011. Torino, Italy. 27-\n29 September 2011. \n20. Palacios Valverde JM, Fernández Pérez M, Corcho O, Méndez González VM, Gómez \nPérez JM. Semantically enabling UPnP Networks of Multimedia Home Content. IEEE \nAmérica Latina. IEEE LATIN AMERICA TRANSACTIONS. . ISSN: 1548-0992. \n21. Palma R, Corcho O, Gómez-Pérez A, Haase P. A holistic approach to collaborative \nontology development based on change management. Expert Systems with \nApplications. Pergamon-Elsevier Science Ltd. - Q1, 2011. ISSN: 0957-4174. \n22. Pariente-Juárez S, Suárez-Figueroa MC, Estrada H, Martínez A. CreaDO – A \nMethodology to Create Domain Ontologies using Parameter-based Ontology Merging \nTechniques. Proceedings of the Special Session. Special Session of the 10th Mexican \nInternational Conference on Artificial Intelligence, MICAI-2011. Puebla, Mexico. 26th \nNovember – 4 December 2011. \n23. Radulovic F, García-Castro R. Towards A Quality Model For Semantic Technologies. In \nProceedings of the 2011 International Conference on Computational Sciences and Its \nApplications. Santander, Spain. June, 2011. ICCSA 2011 - The 11th International \nConference on Computational Science and Its Applications. SANTANDER. 20 de junio \nde 2011. ISBN: 978-3-642-21897-2. \n",
  "speaker": "SYSTEM",
  "uuid": "57b34632-fd10-4e4d-8fc0-b2731c72cd00"
}