{
  "message": "SYSTEM: Calendario_Laboral_CM_2012.pdf: Página 1\nMARTES 20 DE SEPTIEMBRE DE 2011\nPág. 12\nB.O.C.M. Núm. 223\nBOCM-20110920-2\nBOLETÍN OFICIAL DE LA COMUNIDAD DE MADRID\nBOCM\nI. COMUNIDAD DE MADRID\nC) Otras Disposiciones\nVicepresidencia, Consejería de Cultura y Deporte\ny Portavocía del Gobierno\n2\nDECRETO 158/2011, de 15 de septiembre, del Consejo de Gobierno, por el que\nse establecen las fiestas laborales para el año 2012 en la Comunidad de Madrid.\nEl texto refundido del Estatuto de los Trabajadores, aprobado por el Real Decreto Le-\ngislativo 1/1995, de 24 de marzo; la Ley 8/1984, de 25 de abril, declarando fiesta de la Co-\nmunidad de Madrid la jornada del 2 de mayo, y el artículo 45 del Real Decreto 2001/1983,\nde 28 de julio, modificado por el artículo único del Real Decreto 1346/1989, de 3 de no-\nviembre, y declarando expresamente en vigor por la disposición derogatoria única del Real\nDecreto 1561/1995, de 21 de septiembre, establecen las decisiones que puede adoptar la\nComunidad de Madrid en relación con la celebración en su territorio de las fiestas labora-\nles de ámbito nacional.\nEn su virtud, oídos los Grupos Parlamentarios de la Asamblea de Madrid, la Iglesia\nCatólica y las instituciones económicas y sociales representativas en la Comunidad de\nMadrid, a propuesta del Vicepresidente, Consejero de Cultura y Deporte y Portavoz del Go-\nbierno, previa deliberación del Consejo de Gobierno, en su reunión del día 15 de septiem-\nbre de 2011,\nDISPONGO\nArtículo único\nCalendario laboral para el año 2012\nEl calendario laboral resultante para el año 2012 en el ámbito de la Comunidad de\nMadrid es el que se relaciona en el Anexo que se incorpora al presente Decreto, sin perjuicio\nde las dos fiestas locales que, además, corresponda celebrar en cada municipio.\nDISPOSICIONES FINALES\nPrimera\nComunicación al Ministerio de Trabajo e Inmigración\nDe lo dispuesto en el presente Decreto se dará traslado al Ministerio de Trabajo e In-\nmigración antes del 30 de septiembre de 2011.\nSegunda\nEntrada en vigor y publicación\nEl presente Decreto entrará en vigor el día de su publicación en el BOLETÍN OFICIAL\nDE LA COMUNIDAD DE MADRID.\nDado en Madrid, a 15 de septiembre de 2011.\nEl Vicepresidente, Consejero de Cultura y Deporte\nLa Presidenta,\ny Portavoz del Gobierno,\nESPERANZA AGUIRRE GIL DE BIEDMA\nIGNACIO GONZÁLEZ GONZÁLEZ\n",
  "speaker": "SYSTEM",
  "uuid": "58b33c4e-6ff3-4220-a9ec-ffd7d9c9f7d8"
}