{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 47\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 47 of 124\nNext, we present the proposed template used to describe the patterns for re-engineering non-ontological\nresources (PR-NOR). To present the patterns for re-engineering non-ontological resources we have adapted\nthe tabular template for ontology design patterns used in [SFBG+07]. The template adapted and the meaning\nof each ﬁeld is shown in Table 3.1.\nTable 3.1: Pattern for Re-engineering Non-Ontological Resource Template\nSlot\nValue\nGeneral Information\nName\nName of the pattern\nIdentiﬁer\nAn acronym composed of component type + abbreviated name of the component + number\nComponent Type\nPattern for Re-engineering Non-Ontological Resource (PR-NOR)\nUse Case\nGeneral\nDescription in natural language of the re-engineering problem addressed by the pattern for\nre-engineering non-ontological resources.\nExample\nDescription in natural language of an example of the re-engineering problem.\nPattern for Re-engineering Non-Ontological Resource\nINPUT: Resource to be Re-engineered\nGeneral\nDescription in natural language of the non-ontological resource.\nExample\nDescription in natural language of an example of the non-ontological resource.\nGraphical Representation\nGeneral\nGraphical representation of the non-ontological resource.\nExample\nGraphical representation of the example of non-ontological resource.\nOUTPUT: Designed Ontology\nGeneral\nDescription in natural language of the ontology created after applying the pattern for\nre-engineering the non-ontological resource.\nGraphical Representation\n(UML) General Solution\nOntology\nGraphical representation, using the UML proﬁle [BH06], of the ontology created for the\nnon-ontological resource being re-engineered.\n(UML) Example Solution\nOntology\nExample showing a graphical representation, using the UML proﬁle [BH06], of the ontology\ncreated for the non-ontological resource being used.\nPROCESS: How to Re-engineer\nGeneral\nDescription in natural language of the general re-engineering process, using a sequence of\nactivities.\nExample\nDescription in natural language of the re-engineering process applied to the non-ontological\nresource example, using the above sequence of activities.\nRelationships (Optional)\nRelations to other\nmodelling components\nDescription of any relation to other PR-NOR patterns or other ontology design patterns.\n3.1.3\nGeneral Model for Non-Ontological Resource Re-engineering\nIn a nutshell, our method to non-ontological resource re-engineering considers as input a pool of non-\nontological resources and patterns for re-engineering non-ontological resources. The latter provide solutions\nto the problem of transforming non-ontological resources into ontologies.\nBased on the software re-engineering model presented in D.5.4.1 [SFdCB+08] we propose our re-\nengineering model for non-ontological resource re-engineering in Fig.3.1.\nThe NOR re-engineering process consists of the following activities, which are deﬁned in a Glossary of\nActivities in the Ontology Engineering[SFGP08]:\n1. Non-Ontological Resource Reverse Engineering, whose goal is to analyze a NOR to identify its un-\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "598bed0f-8c00-41cb-b289-4b163fcfe79c"
}