{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 8\nO\nE\nG\nntology ngineering roup \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n4. TODOS LOS MIEMBROS TENDRÁN QUE FIRMAN UN DOCUMENTO EN EL QUE \nCONSTATARÁN QUE TIENEN CONOCIMIENTO DE TODO LO EXPUESTO EN EL \nPRESENTE PROTOCOLO DE VIAJES, HACIÉNDOSE INDIVIDUALMENTE RESPONSABLES \nDEL RETRASO QUE PUDIERA DERIVARSE EN EL COBRO DE LOS GASTOS DE VIAJE, EN \nEL CASO DE QUE LO INCUMPLAN. \n \nC) ACUERDOS DE COLABORACIÓN 2010  \nC1. Hoteles Sol - Meliá  \nLa Universidad Politécnica de Madrid ha firmado un acuerdo de colaboración con la cadena de hoteles Sol - \nMeliá para el año 2.010, de forma que los miembros del grupo pueden beneficiarse de las tarifas especiales y \ndescuentos que dichos hoteles ofrecen a la Universidad. Con carácter general se ofrece un descuento de \nalrededor del 10% sobre las tarifas generales. Para aprovechar estos descuentos tenemos tres vías:  \na) Por teléfono: llamando al 902 103 986 o bien al 91 714 84 09 e indicando el código de cliente \n208418.  \nb) Por correo electrónico: mandando un correo a la siguiente dirección [kareservas@solmelia.com] e \nindicando igualmente el código de cliente 208418.  \nc) A través de Internet: pinchando en el siguiente enlace [http://es.solmelia.com/corporate/home.htm] \nhabremos accedido a la sección de empresas de la web de Sol - Meliá. A continuación para poder \nconsultar las tarifas especiales basta con introducir el siguiente código de empresa: 00208418JIK, así \ncomo los datos de la reserva: destino, fecha de salida y entrada...  \n \nC2. Hoteles NH  \nIgualmente podemos contactar con NH por teléfono en el 902 115 116 y solicitar información sobre precios \npidiendo que nos apliquen la tarifa de funcionario, que debería ser más ventajosa que las tarifas generales.  \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "59ef74d8-1800-4170-8a1e-c4b82abae481"
}