{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 94\nPage 94 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n \nTask 3. Ontology validation. Here it is performed a validation process of the invoice \nmanagement ontology network created. The validation process checks the consistency of \nthe ontology network. \n \nTask 4. Instantiation of the invoice management ontology network. During this task the \nontology network previously created is instantiated for the specific use case, that is, for the \npharmaceutical sector. \nHowever, after holding several bi-lateral ad-hoc meetings between iSOCO and UPM, the initial \nworkplan for developing the ontology network in the Invoice Management use case was modified, \nand the new plan is now presented in this section. During such meetings iSOCO explained the \nInvoice Management use case whereas UPM explained methodological guidelines that are being \ncarried out in WP5, which can be used for building the Invoice Management Ontology Network. \nThe ontology network life cycle model chosen in the invoicing use case is finally the incremental \nmodel. After the meetings the iSOCO team held at iSOCO with the UPM team, the iSOCO team \nselected the ontology network life cycle model following the guidelines and the decision tree \npresented in Section 5.3. Based on the decision tree shown in Figure 36, the iSOCO team first \nchose “no” for the question “Do you think that ontology network requirements will change during \nthe development?”. The iSOCO team answered “no” because the requirements are clearly \nspecified in [30]. The most problematic issues to be faced in the use case are: a) to deal with the \nheterogeneity of the invoices emitted and received and b) how to manage the incoming data. \nThese requirements remain invariable during the life cycle of the ontology network. As for the \nsecond question “Do you want to produce intermediate results?” the iSOCO team’s answer was \n“yes”. During the evolution of this use case several prototypes and intermediate ontology networks \nwill be produced and used. The answer to the third question “Do you want to produce each \nintermediate result in a complete manner” was “yes”. So, the selected ontology network life cycle \nmodel was incremental. \n6.2.3. Selected activities  \nBased on the guidelines and suggestions being developed in WP5 and included in this deliverable \n(Section 5.3) and on their experience (some members of the team have developed more than 5 \nontologies), the iSOCO team selected directly the activities to be carried out during the ontology \nnetwork life cycle from the “Required-if Applicable” table.   \nActivities identified as “required” in the “Required-if Applicable” table (table 3 in Section 3.3) are \nselected automatically in the table of selected activities. The iSOCO team only selected those “if \napplicable” activities needed for the Invoice Management ontology network development. So, \nTable 6 only shows those “if applicable” activities selected by the iSOCO team. \nTable 6. Selected “If Applicable” Activities in the Invoice Management Use Case \n \nIf Applicable \nSelected \nOntology Aligning \nX \nX \nOntology Customization \nX \n \nOntology Enrichment \nX \n \nOntology Extension \nX \nX \nOntology Forward Engineering \nX \n \nOntology Learning \nX \n \n",
  "speaker": "SYSTEM",
  "uuid": "5c13ced0-1cb7-46af-ac63-14bfeeb31103"
}