{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 5\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 5 de 42 \nINTERACTIVEX (PIOF-GA-2009-253331), Wf4Ever (FP7-270192), SemDATA (FP7-612551), \nLiDER \n(FP7-610782), \nReady4SmartCities \n(FP7-608691), \nDrInventor \n(FP7-611383), \nBigStorage (H2020-642963), 3cixty (EIT ICT Labs-14523), Vicinity (H2020-688467), SlideWiki \n(H2020-688095), STARS4ALL (H2020-688135), KOPAR (H2020-655009), SIMON (H2020-\n621041), CLARITY (H2020-693881), Mobile-Age (H2020-693319), OASIS (2015-EU-IA-0037 ), \nGoFar (H2020-730844), TT (H2020-731932). \nLos consorcios formados para el desarrollo de estos proyectos incluyen más de 60 \nuniversidades de prestigio internacional. De entre las universidades no europeas, merece \nmencionarse Tel Aviv University. Asi mismo, se enumeran a continuación algunos de los \ngrupos de investigación internacionales, de reconocido prestigio con los que el Grupo \ncolabora: Stanford Medical Informatics, Stanford University (EE.UU.); Information Management \nGroup, University of Manchester (Reino Unido); Intelligence, Agents and Multimedia Group, \nUniversity of Southampton (Reino Unido); UK National e-Science Centre (Reino Unido); \nInformation Systems Group, Oxford University (Reino Unido); Knowledge Media Institute, Open \nUniversity (Reino Unido); AIFB and FZI, Universität Karslruhe (Alemania); Language \nTechnology Lab, DFKI GmbH (Alemania) Cognitive Interaction Technology Excellence Cluster \n(Alemania); Knowledge Representation and Reasoning Group, Vrije Universiteit (Holanda); \nDigital Enterprise Research Institute, National University of Galway (Irlanda); Exmo, INRIA \n(Francia); STI Innsbruck, Innsbruck (Austria), Information Sciences Institute, University of \nSouthern California (EE.UU). También hemos colaborado con numerosos institutos de \ninvestigación, como INRIA en Francia, DFKI en Alemania y CNRS en Italia. \nLa sección 2.2 incluye el detalle de proyectos de los últimos cinco años. \n1.3 \nPublicaciones \nEl impacto de las publicaciones es elevado, pues son numerosas las citas que han obtenido \ndichas publicaciones por otros autores. Como muestra, se presenta el uso del factor h, que \nmide la calidad profesional en función de la cantidad de citas que han recibido sus artículos. Un \ncientífico tiene índice h si ha publicado h trabajos con al menos h citas cada uno. Por ello, \ntomando como fuente el Google Scholar, a título de ejemplo, se indican algunos índices h de \nmiembros del Grupo: Asunción Gómez-Pérez (h=52, con más de 16.200 citas), Óscar Corcho \n(h=38, con más de 9.000 citas). Para conocer el impacto de las publicaciones de los miembros \ndel \ngrupo, \nse \nrecomienda \nutilizar \nel \nsiguiente \nenlace \nde \nGoogle \nScholar: \nhttp://scholar.google.es/citations?hl=en&view_op=search_authors&mauthors=Ontology+engine\nering+group \nLa sección 2.3 incluye el detalle de las publicaciones de los últimos cinco años. \n1.4 \nSupervisión de trabajos de investigación, postdocs e invitados \nDesde el año 2000, se han supervisado el trabajo de más de 40 doctores entre contrataciones \npropias y programas Juan de la Cierva, Reintegration Grant, MERG CO-Fund y Marie Curie. Se \nhan defendido 36 tesis doctorales (9 premios extraordinarios de tesis y 12 menciones \neuropeas/internacionales). Además se han defendido más de 150 Proyectos finales de \ncarrera y tesis de máster. La sección 2.4 enumera las tesis defendidas en los últimos años. \nDesde 2010, el OEG ha contratado a 24 doctores, de los cuales 9 están actualmente \nrealizando su labor investigadora en el Grupo. Son 7 los doctores contratados por programas \noficiales en situación competitiva de captación de talento: 2 por el programa Marie Curie de la \nUnión Europea, 3 por el programa Juan de la Cierva Formación, 2 por el programa Juan de la \nCierva Incorporación, 1 por el programa Cofund, 1 por el programa Reintegration Grant. De \ntodos ellos, 3 están actualmente con relación contractual en el grupo de investigación. El resto \nde doctores han sido contratados por proyectos internacionales de los diferentes programas \nmarco de la Unión Europea y con contratos procedentes de proyectos del Plan Nacional tipo \nCenit o Avanza. \n",
  "speaker": "SYSTEM",
  "uuid": "5ce83d6c-5da0-4e8d-855a-5db4ee02643a"
}