{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 6\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11155\nArtículo 11.  Recursos.\n1.  Contra esta resolución de convocatoria de ayudas podrá interponerse, con carácter \npotestativo, recurso de reposición, ante el órgano que la dictó, en el plazo de un mes \ndesde el día siguiente a la publicación de la Resolución en el Boletín Oficial del Estado de \nconformidad con los artículos 116 y 117 de la Ley de Régimen Jurídico de las Administraciones \nPúblicas y del Procedimiento Administrativo Común.\n2.  Alternativamente, contra esta resolución de convocatoria podrá recurrirse en vía \nContencioso-Administrativa ante la Audiencia Nacional, de conformidad con la Ley 29/1998, de \n13 de julio, en el plazo de dos meses a contar desde el día siguiente a la publicación de la \nresolución en el Boletín Oficial del Estado. En caso de silencio administrativo, el plazo será de \nseis meses a partir del día siguiente a aquél en que la solicitud se entienda desestimada.\nArtículo 12.  Control.\nLos beneficiarios de las ayudas estarán sujetos a las actuaciones de control que lleven \na cabo las instituciones facultadas para ello por la Ley 38/2003, de 17 de noviembre, así \ncomo, de conformidad con el artículo 46 de la citada ley, a facilitar cuanta información les \nsea requerida por la Intervención General de la Administración del Estado, por el Tribunal \nde Cuentas, y por la Comisión Europea y las autoridades de gestión, certificación y auditoria \ndel Fondo Social Europeo, en su caso.\nArtículo 13.  Incumplimiento.\n1.  El incumplimiento total o parcial de los requisitos y obligaciones establecidos en \nesta resolución y demás normas aplicables, así como de las condiciones que, en su caso, \nse establezcan en la correspondientes resoluciones de concesión, dará lugar, previo el \noportuno expediente de incumplimiento, a la pérdida de derecho al cobro de la ayuda y/o \na la obligación de reintegrar ésta y los intereses de demora correspondientes, conforme a \nlo dispuesto en el Título II (reintegro de subvenciones), Título III (control financiero) y en el \nTítulo IV (infracciones y sanciones) de la Ley 38/2003, de 17 de noviembre, y en el \nReglamento de la Ley 38/2003, de 17 de noviembre.\n2.  Los criterios proporcionales de graduación de incumplimientos serán los que se \nindican a continuación:\na)  El incumplimiento total y manifiesto de los objetivos científicos y técnicos para los \nque se concedió la ayuda, determinado a través de los mecanismos de seguimiento y \ncontrol científico técnico, será causa de reintegro total de la subvención, y en su caso de \nla pérdida del derecho al cobro de las cantidades pendientes de percibir.\nb)  El incumplimiento de los objetivos parciales o de las actividades concretas \nconllevará la devolución de aquella parte de la subvención destinada a las mismas, y en \nsu caso la pérdida del derecho al cobro de las cantidades pendientes de percibir.\nc)  La falta de presentación, de acuerdo con lo establecido en la correspondiente \nconvocatoria, de los informes de seguimiento anuales o finales conllevará la devolución de \nlas cantidades percibidas y no justificadas, y en su caso la pérdida del derecho al cobro de \nlas cantidades pendientes de percibir.\nd)  El incumplimiento de las medidas de difusión establecidas, en los términos del \nartículo 31.3 del reglamento de la Ley 38/2003, de 17 de noviembre, será causa del \nreintegro parcial del importe asociado a dicho incumplimiento.\n3.  El régimen de infracciones y sanciones será el dispuesto en el Título IV de la Ley \nGeneral de Subvenciones.\nArtículo 14.  Reintegros voluntarios.\nDe conformidad con el artículo 90 del Reglamento de la Ley 38/2003, de 17 de \nnoviembre, los interesados podrán realizar el reintegro voluntario al Tesoro Público de \nremanentes no aplicados al fin para el que se concedió la ayuda, según lo dispuesto en la \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "5d085c90-082f-404a-9f12-e8611de0e29f"
}