{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 68\nPage 68 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n \nThe ontology reengineering activity should be carried out with the ontologies or \nmodules selected. \n \nOntologies or modules will be merged to obtain a new ontology or module. \nBefore reusing the selected ontologies or modules by following any reuse mode, it is also \nconvenient to evaluate the ontologies or modules through the ontology evaluation activity. \nIf the software developers and ontology practitioners decide to reuse the selected ontologies or \nmodules as they are, then they integrate, by means of carrying out the ontology integration \nactivity, the ontology or module codes in the ontology network code developed following the \nactivities of scenario 1 (Section 4.1). In this case, Figure 22 shows the ontology reuse activity \nviewed as a process composed of the following activities: ontology search, ontology \nassessment, ontology comparison, ontology selection, and ontology integration. \n \nFigure 22. Ontology Reuse Activity \n Outcomes: The principal output is an ontology network that represents the expected domain \nimplemented in an ontology language (OWL, F-Logic, etc.). Additionally, a broad range of \ndocuments including the requirements specification, the ontology documentation, the ontology \nevaluation, etc. will be generated as output of different activities. \n4.4. Scenario 4: Building Ontology Networks by Reusing and Reengineering \nOntologies or Ontology Modules \n Assumptions: It is supposed that software developers and ontology practitioners “want” to use \nexisting ontologies or ontology modules by reengineering them before reusing them in the \nontology network building.  \n Prerequisite resources: Knowledge of the domain (general or specific) of the ontology \nnetwork to be developed should be available for building the ontology network. \nAdditionally, ontologies or ontology modules related to the domain to be covered by the \nontology network to be developed should be available. \n Sequence of activities: The sequence of activities in this scenario is the same as the \nsequence presented in scenario 3 (Section 4.3); however, when software developers and \nontology practitioners need to decide the reuse mode (that is, activity 5 in Section 4.3), they \ncan argue that the selected ontologies or ontology modules are useful for the concrete use \ncase. They do not want to reuse the ontologies or modules as they are but to transform them \nby means of the ontology reengineering activity, as shown in scenario 4 (Figure 20). In this \n",
  "speaker": "SYSTEM",
  "uuid": "5d746ac2-16ce-493a-8621-aa204af75d6e"
}