{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 62\n60\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nTerminology Management \nTerminology management systems enable users to create, translate and manage dictionaries or term glos‐\nsaries on a customer, project or asset level. Term glossaries are useful for defining how a set of words, phras‐\nes or proper names should be translated (or not translated). This is used not so much to reduce translation\ncost, but to encourage consistent vocabulary and style, and to prevent dissonant translations of phrases that\nrecur frequently. \nWhile glossary terms can be auto‐translated, the best practice is to recommend their use to translators, who\nthen click on an accept button or link, to paste the recommended phrase into their translation editing envi‐\nronment. Translators should be able to override the recommendation because there are often situations\nwhere the translated text needs to be edited for grammatical correctness. \nThis is basically a required feature for any serious CAT tool, and is available in some form on almost every\ntranslation and localisation platform or tool in use today. There are also a few vendors that specialize in ter‐\nminology management tools, such as Interverbum Tech.\nControlled Authoring\nControlled authoring tools, such as Acrolinx, are used before translation even begins. These tools are\ndesigned to maximize the source content’s quality and consistency, and provide the following key features:\n• Spellcheck and grammar correction: to catch basic mistakes during authoring\n• Terminology management: to insure that technical terms are used consistently\n• Brand protection: to insure that brand names and proper names are used correctly\n• Edit for MT: to enable users to prepare source text for machine translation\nThe basic goal is to prevent authors from using inconsistent terminology, catch common errors, and gener‐\nally produce standardized output that is search engine friendly, and translation ready. \nQuality Assurance\nTranslation quality assurance relies on a combination of technology and processes to prevent errors from\ncreeping into translation projects. The QA process starts before a project is sent out for translation, for exam‐\nple be sanitizing text to protect non‐translatable elements, disambiguate the source text, provide comments\nand context, etc.\nOnce translation is in progress, QA is implemented in several ways at different stages of the process:\n• [Prior to translator assignment]: decide which translator(s) are best match to the task, factoring in skill\nlevel, prior QA scores, availability and domain of expertise.\n• [during translation] : computer aided translation (CAT) tools draw upon resources such as spellcheck‐\ners, term glossaries, and translation memory to increase productivity, catch common errors, and\nencourage the use of consistent style and terminology.\n• [Post translation]: completed translations are generally sent to an editor or trusted reviewer to be spot\nchecked, and post‐edited as needed (or sent back to the translator(s) for additional work.\n• [Post translation]: highly automated systems may send translations to one or more randomly chosen\ntranslators for a blind peer review and score. Editors only intervene to evaluate translations with an\nambiguous score.\n• [Post‐delivery]: highly automated translation services may also provide a widget or API through which\nthe customer can comment on, score or request re‐translation of texts. This allows high volume trans‐\nlation applications to continually improve translations without subjecting every text to embargo, and\nalso enables the client’s customers to contribute feedback about translations (e.g. in moderated crowd\n",
  "speaker": "SYSTEM",
  "uuid": "5ddef5ac-e181-4297-95d1-3892bcaaaef8"
}