{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 110\nBÚSQUEDA \n \n110 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \ncualquiera de las estrategias explicadas en el texto) en el que, después, se pide que \nla solución encontrada tenga una cierta calidad (optimalidad, en este caso). \nEl siguiente paso consiste en elegir una representación para el problema. Esto \nconlleva buscar nociones adecuadas para los estados y los operadores (en los tres \nniveles conceptual, lógico y físico). \nPor similitud con el problema del tren y viendo que la entrada para el problema \npuede ser interpretada como una ciudad, podría suponerse que la noción de \n\"estado\" adecuada puede identificarse con \"ciudad\". Sin embargo, un análisis un \npoco más detallado nos mostrará que eso no es cierto. ¿Basta una ciudad para \nsaber si hemos alcanzado el objetivo? Evidentemente no. La situación es muy \ndiferente en el problema del tren: allí una ciudad basta como estado, puesto que sólo \nnos interesa llegar a una ciudad fijada. En el problema del viajante saber dónde nos \nencontramos en cada momento no es suficiente para describir el estado del proceso. \nLa razón es que no sólo buscamos un camino, sino un camino con restricciones. Las \nrestricciones se refieren al camino ya recorrido, luego éste debe formar parte del \nestado, debe ser el estado (nótese que en un grafo completo un camino queda \ndefinido por cualquier secuencia de vértices en la que no haya dos vértices \nconsecutivos repetidos). La situación, pese a lo que pudiese parecer en una primera \nobservación, es mucho parecida a la del problema de las n reinas (el estado no \npuede identificarse con una posición con el tablero, sino que debe ser la \nconfiguración del tablero, lo que puede ser interpretado como un camino con \nrestricciones) que a la del problema del tren. \nPodría pensarse que con la información relativa al \"padre\" en los nodos, puede \ndefinirse como estado sólo la ciudad y recuperar el camino a partir del nodo. Esto \nsería mezclar, inapropidamente, la noción de nodo y la de estado. Sí puede \nemplearse esta idea para definir una representación en el nivel lógico (o físico) para \nlos estados (ver más adelante). \nEn conclusión, los estados serán secuencias de nombres de vértices, comenzando \ncon un mismo nombre, digamos A (que representa a la ciudad de partida), tal que en \nla secuencia no hay nombres repetidos, salvo en el caso de que la secuencia defina \nun ciclo total (es decir, en la secuencia aparecen todos los vértices del grafo), caso \nen el que el último nombre de la secuencia vuelve a ser A. Al imponer que, salvo en \nel caso de ciclo total, no haya repetidos (es natural hacerlo, puesto que en el objetivo \nno debe haberlos) estamos ya fijando una precondición para las reglas a definir. \nTendremos una regla por cada uno de los pares (ordenados) de vértices (v,w). \n",
  "speaker": "SYSTEM",
  "uuid": "5fbbf3a1-f172-4d89-acba-9ac1fad5827f"
}