{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 22\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11171\nArtículo 42.  Presentación de solicitudes.\n1.  Las solicitudes de participación en estas ayudas serán presentadas por los centros \nde I+D de adscripción de las ayudas de formación del personal investigador, de conformidad \ncon el procedimiento que se describe a continuación.\n2.  El plazo de presentación de solicitudes por parte de los Centros de I+D será desde \nel día 16 al 30 de septiembre de 2010, ambos inclusive. Previamente a dicho plazo, los \ninvestigadores deberán haber cumplimentado y presentado en sus respectivos Centros \nde I+D los correspondientes formularios de solicitud.\n3.  En la página web del Ministerio de Ciencia e Innovación http://www.micinn.es \nestarán disponibles los formularios de solicitud que será necesario cumplimentar por los \ninvestigadores en formación y por los Centros de I+D. Los formularios deberán \ncumplimentarse a través de los medios telemáticos habilitados para ello y siguiendo las \ninstrucciones recogidas en la citada página web. En caso contrario no será considerado \nválido y se entenderá como no presentado.\n4.  Los Centros de I+D presentarán su solicitud, de acuerdo con lo indicado en el \nartículo anterior, utilizando el formulario disponible en la página web y que consta de los \nsiguientes apartados:\nA)  Instancia de solicitud. Se incluirá la dirección de correo electrónico designada a \nlos efectos de comunicaciones y/o requerimientos que se puedan realizar, que será \nconsiderada en este caso como válida a efectos de notificaciones.\nB)  Relación de investigadores propuestos para disfrutar de una estancia breve, \ndonde se indicarán, para cada uno de ellos, los datos personales y la duración de la \nestancia solicitada.\n5.  Una vez debidamente cumplimentado el formulario de solicitud, a través de los \nmedios telemáticos habilitados al efecto, los Centros de I+D deberán imprimir los apartados \nA) y B) del formulario y los presentarán con las correspondientes firmas originales.\n6.  La solicitud podrá presentarse en el Registro del Ministerio de Ciencia e Innovación \nde la calle Ramírez de Arellano, 29, 28071, Madrid, o en cualquiera de los lugares señalados \nen el artículo 38.4 de la Ley 30/1992, de 26 de noviembre, de Régimen Jurídico de las \nAdministraciones Públicas y del Procedimiento Administrativo Común. También se podrá \nhacer uso de la posibilidad de registro telemático con la firma electrónica del representante \nlegal del Centro de I+D solicitante, siempre que los medios telemáticos estén habilitados \nal efecto. Si se opta por esta posibilidad, se atenderá a las instrucciones que en la página \nweb del MICINN se indiquen.\nEn el caso de que los Centros de I+D optaran por presentar su solicitud en una oficina \nde Correos de España, lo harán en sobre abierto para que la instancia sea fechada y \nsellada por el personal de Correos antes de ser certificada.\n7.  La presentación de la solicitud conlleva la autorización al órgano concedente para \nrecabar, en los casos en que sea legalmente exigible, los certificados a emitir por la Agencia \nEstatal de la Administración Tributaria y por la Tesorería General de la Seguridad Social.\n8.  En el impreso de solicitud se incluirá declaración responsable del representante \nlegal del organismo solicitante de no encontrarse incurso en ninguna de las situaciones \nque impiden acceder a la condición de beneficiario. El organismo interesado deberá \ncomunicar al órgano concedente las posibles alteraciones de las circunstancias recogidas \nen dicha declaración.\n9.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \ncomunicación a terceros de los datos recogidos en la misma, con objeto del tratamiento \nposterior de los datos con fines históricos, estadísticos o científicos, en el marco de la Ley \nOrgánica 15/1999, de 13 de diciembre, de Protección de Datos de Carácter Personal.\n10.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \nutilización, por parte del órgano instructor o del órgano concedente, de medios electrónicos \npara la practica de las notificaciones que se realicen a lo largo del procedimiento.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "604a3ee4-fd43-4589-af8d-f086c87d41d3"
}