{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 67\n65\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nTranslation management systems\nPurpose built TMS systems are often embedded within other products, such as content management sys‐\ntems. While these do not provide full supply chain management, they provide most of the functions need‐\ned to manage translation workflow for typical users. Examples include the Translation Management Tool, by\nMD Systems, for the Drupal content management system, and Word Press ML (wpml.org), a multilingual\ntranslation management tool for the popular Word Press platform.\nStand‐alone TMS systems, on the other hand, are used to manage translation workflow for many different\ntypes of assets, from documents, to websites. Since different types of content require different workflows,\nand often different service providers, an enterprise TMS enables operators to manage not just the transla‐\ntion process, but also the vendor supply chain. Examples of vendors in this category include SDL, Across\nSystems, and Lingotek. \nLocalisation management systems\nLocalisation management systems are a special type of translation management system, and focus on the\ntasks and challenges that are unique to software localisation. There has been a proliferation of SaaS based\nservices in this area, especially for mobile app localisation for iOS and Android platforms. These services\nenable users to upload their application prompt catalogues using a variety of localisation file formats, and\nmanage them and their translations via a centralized repository. Newer services borrow from collaborative\ndevelopment platforms like Github to support agile localisation, where localisations are continually refined\nand deployed with incremental upgrades. \nExamples of these services include GetLocalisation, Onesky, Tethras, Transfluent, and Transifex, all of which\nare accessible to both small and large companies. On the high end of the market, companies like Moravia\nWorldwide and Welocalize provide software localisation and testing to large software companies such as\nMicrosoft and Oracle. \nTranslation memory (standalone)\nTranslation memory, while it is generally integrated into translation management systems, is also available\nas a stand‐alone, cloud based service. TAUS provides a translation memory that pools submissions from a\nlarge number of sources; the translation memory is accessible via a web API, and currently contains over 50\nbillion words spanning over 2200 language combinations. \nMost translation management systems and CAT tools provide some form of translation memory. Nearly all\nprovide exact match translation memory, to avoid re‐translation of repeating texts, as well as terminology\nglossaries or dictionaries, to promote consistent translation. Most also provide fuzzy match translation\nmemory, as a memory aid and style guide for translators. If a TMS or CAT tool does not provide at least basic\ntranslation memory, this is a serious deficiency that should rule out the use of that product. \nAudio/video captioning systems\nAudio/video captioning and subtitling systems have a unique set of requirements that differ from text based\ncontent. Because of this, vendors tend to specialize in this area. Captioning systems must deal with a num‐\nber of technical issues, including:\n• Support for a wide variety of video file/stream formats\n• Tools to transcribe audio tracks to create source language captions\n• Tools to translate captions into one or more languages\n• Ability to time code captions so they appear at the right time during playback\n",
  "speaker": "SYSTEM",
  "uuid": "61003f1e-819e-4507-8474-12d843dc32b9"
}