{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 20\nPage 20 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n \nFigure 1. Process Groups in the Software Development Process [7]  \n2.2.3. RUP development process \nOne of the best-known methodologies is the Rational Unified Process (or RUP). This methodology \nis an iterative software development framework originally created by the Rational Software \nCorporation in late 1980-s, which became a division of IBM in 2002. Since then the methodology \nmay be sometimes referred to as IBM RUP process. \nRUP is not a single concrete process that would prescribe definite steps for the software \ndevelopment, but rather it is an adaptable framework. It is intended to be tailored and customized \nby the development organizations and project teams that are expected to select the elements of \nthe process appropriate for their needs. RUP is also a fully-fledged software product in its own right \n(it includes a hyperlinked knowledge base with sample artefacts and detailed descriptions for many \ndifferent types of activities). \nRUP is based on six key principles for so-called business-driven development: \n1. Adapting the process. There is not a single ‘typical’ software development process; \norganizations must have options to tailor the process to their needs. To this extent, RUP \nprovides pre-configured process templates for small, medium and large projects, which can be \nused for easier adoption. \n2. Balancing stakeholder priorities. The key principle of this tenet is to address the traditional \nrequirements gathering and analysis, and see these activities as a part of a broader \nrelationship to business goals and stakeholder interests, which are often contradictory. \n3. Collaborating across teams. Since RUP is built upon an assumption of iterative, incremental \ndevelopment, the direct effect of this assumption is that a range of developers will be involved. \n",
  "speaker": "SYSTEM",
  "uuid": "6118ef02-86aa-4888-b0ee-3e52eb9f8a1e"
}