{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 14\n12\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nShooting across these shifts in ICT markets is the impact of the “globalisation” of the Internet. A medium that\nwas initially dominated by English language users is fast becoming more representative of the world, though\npenetration rates still vary significantly by region. Europe (including Russia & Turkey) has a 63% penetration\nrate according to Internet World Stats. In the EU28 (including Croatia, which will join the Union next year),\n67% of the population is now online. Although penetration rates in Asia are only slightly more than a quar‐\nter of the population, these users now constitute 45% of the population of the internet. The 275 million\ninternet users in North America are now only slightly more than 10% of the world internet population.\nSpeakers of Asian languages now dominate web usage, but the languages represented by web content are\nstill heavily biased toward English. Data from LanguageConnect show that of the top 1 million websites online,\n55% are published in English, only 4.6% in Chinese (many, of course, published in multiple languages); while\nthis remains imbalanced, it is a far cry from the days when 90% of web content was in English, not so many\nyears ago. While English is declining, the share of content published in other European languages is not\nincreasing proportionately; the fastest growth is in non‐European languages, though Spanish and Portuguese\ngain significance because of Latin American markets. Aside from English, Spanish and Portuguese, only five\nother EU languages (German, French, Italian, Polish and Dutch), out of 60 or more spoken in the Union, are\npublished on more than 1% of the top million sites. \nThe digital economy is embedded in this sprawling multilingual reality, where the people using the inter‐\nnet, and the content in their languages, are slowly converging with demographic facts.\nLinguistic diversity in Europe is a particularly compelling challenge in the age of digital commerce. Although\ntwo‐thirds of Europeans are online (with much higher penetration rates in some regions), linguistic diversi‐\nty fractures the unity of that market online. While the potential is for a single European digital market with\nFigure 3: World Internet Penetration Rates (2012 Q2)\n",
  "speaker": "SYSTEM",
  "uuid": "61eb273e-8355-4a00-ab5d-4787b1d6b10c"
}