{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 15\nGu´ıa de orientaci´on para investigadores noveles\n15\nLecture Notes in Artiﬁcial Intelligence (LNAI), fueron eliminadas de\nla bases de datos del JCR. Las colecciones LNCS sol´ıan recoger ac-\ntas de congresos. Aunque, en 2005, estas colecciones ten´ıan un factor\nde impacto de 0.4 (que no estaba mal), posiblemente, la empresa ISI\nlas elimin´o del JCR porque la pol´ıtica de revisi´on que ten´ıan estas\npublicaciones no era muy consistente, lo que signiﬁca, que las publi-\ncaciones en LNCS han perdido prestigio respecto a hace algunos a˜nos\ny ya no tienen el mismo valor que ten´ıan. A la hora de redactar nue-\nstro curriculum, este tipo de publicaciones lo deber´ıamos poner en el\napartado A.4, y no en este.\nEn cualquier caso, hay que elegir muy bien los congresos en los que\nqueremos publicar y no dejarnos llevar por otros factores, tales como\nel lugar donde se celebra el congreso o el que sea f´acil publicar.\nA.2. Libros y cap´ıtulos de libros\nEn este apartado se tiene en cuenta fundamentalmente la calidad\ndel libro o cap´ıtulo atendiendo a criterios tales como el n´umero\nde citas, el prestigio de la editorial, los editores, la colecci´on en\nla que se publica la obra, las rese˜nas en las revistas cient´ıﬁcas\nespecializadas, la extensi´on y las traducciones a otras lenguas. Se\nvaloran preferentemente los libros que tengan ISBN; que se publiquen\nen editoriales especializadas de reconocido prestigio, en las que se\npueda garantizar un riguroso proceso de selecci´on y evaluaci´on de los\noriginales. Para su valoraci´on en este apartado, los libros y cap´ıtulos\nde libros deben reﬂejar claramente que son fruto de la investigaci´on\no de la reﬂexi´on bien documentada. Para saber las veces que hemos\nsido citado, podemos buscar nuestras publicaciones en determinadas\nbases de datos, como por ejemplo “Scopus” o “Google Scholar”, y\nas´ı hacernos una idea de cu´antas veces nos han citado y qu´e autores\nlo han hecho. Mientras que “Google Scholar” es de acceso libre y\npodemos acceder a ´el desde cualquier lugar, “Scopus” ha sido creada\npor la editorial Elsevier y s´olo se podr´a acceder a la misma desde\nlugares que hayan comprado el acceso (desde la Universidad de\nAlicante, por ejemplo). El problema que tiene “Google Scholar” es\nque no es del todo ﬁable y tendr´ıamos que realizar nosotros mismos\nun ﬁltrado manual. No obstante, s´ı que nos sirve para hacernos una\nidea nosotros mismos, aunque si tuvi´eramos que enviar este tipo de\ninformaci´on a la ANECA, ser´ıa m´as conveniente que consult´aramos\n“Scopus” o la base de datos SCI.\nA.3. Participaci´on en proyectos de investigaci´on obtenidos en convo-\n",
  "speaker": "SYSTEM",
  "uuid": "62b5d73c-8dda-4efd-93d1-eeb8aff3dd66"
}