{
  "message": "SYSTEM: CV-Cicyt_Elena_Mar2016_v1_.pdf: Página 17\nPublicación: en actas del congreso \nLugar celebración: Logroño, La Rioja \nFecha: septiembre de 2011 \n \nAutores: Elena Montiel-Ponsoda, Daniel Vila-Suero, Boris Villazón-Terrazas, Gordon Dunsire, Elena Escolano y Asunción \nGómez-Pérez \nTítulo: Combining Style Guidelines for Naming and Labeling Ontologies in the Multilingual Web \nCongreso: DC-2011 International Conference on Dublin Core and Metadata Applications \nPublicación: en actas del congreso \nLugar celebración: La Haya, Países Bajos \nFecha: septiembre de 2011 \n \nAutores: John McCrae, Mauricio Espinoza, Elena Montiel-Ponsoda, Guadalupe Aguado de Cea, Philipp Cimiano \nTítulo: Combining statistical and semantic approaches to the translation of ontologies and taxonomies \nCongreso: SSST-5 Fifth Workshop on Syntax, Semantics and Structure in Statistical Translation \nPublicación: en actas del congreso, páginas 116-125, ACL HLT 2011 \nLugar celebración: Portland, Oregon, EEUU \nFecha: junio de 2011 \n \nAutores: John McCrae, Paul Buitelaar, Philipp Cimiano, Thierry Declerck, Elena Montiel-Ponsoda \nTítulo: lemon: lexicon model for ontologies \nCongreso: FlareNet \nPublicación: póster \nLugar celebración: Venecia, Italia \nFecha: mayo de 2011 \n \nAutores: Thierry Declerck, Hans-U. Krieger, Susan M. Thomas, Paul Buitelaar, Sean O'Riain, Tobias Wunner, Gilles Maguet, \nJohn McCrae, Dennis Spohr, Elena Montiel-Ponsoda \nTítulo: Ontology-based Multilingual Access to Financial Reports for Sharing Business Knowledge across Europe \nCongreso:  \nPublicación: In József Roóz, János Ivanyos (eds.): Internal Financial Control Assessment Applying Multilingual Ontology \nFramework  \nLugar celebración: Budapest, Hungría \nFecha septiembre de 2010 \n \nAutores: G. Aguado de Cea, A Gómez-Pérez, E. Montiel-Ponsoda, L.M. Vilches-Blázquez \nTítulo: Rivière or Fleuve? Modelling Multilinguality in the Hydrographical Domain  \nCongreso: 1st Workshop on the Multilingual Semantic Web (MSW 2010) \nPublicación: CEUR Proceedings Vol-571 (ISSN 1613-0073), páginas 21-28 \nLugar celebración: Raleigh, North Carolina, USA \nFecha 27 de abril de 2010 \n \nAutores: G. Aguado de Cea, I. Álvarez de Mon, E. Montiel-Ponsoda \nTítulo: From linguistic patterns to ontology structures  \nCongreso: International Conference on Terminology and Artificial Intelligence (TIA 2009).  \nPublicación: CEUR Proceedings Vol-578 (ISSN 1613-0073)  \nLugar celebración: Toulouse, France \nFecha 18-20 de noviembre de 2009 \n \nAutores: G. Aguado de Cea, A. Gómez-Pérez, E. Montiel-Ponsoda, M.C. Suárez-Figueroa \nTítulo: Using Linguistic Patterns to Enhance Ontology Development.  \nCongreso: International Conference on Knowledge Engineering and Ontology Development (KEOD 2009).  \nPublicación: en actas del congreso (ISBN: 978-989-674-012-2), páginas 206-213 \nLugar celebración: Madeira, Portugal \nFecha 6-8 de octubre de 2009 \n \nAutores: M. Espinoza, E. Montiel-Ponsoda, and A. Gómez-Pérez \nTítulo: Ontology Localization \nCongreso: K-CAP2009 - The Fifth International Conference on Knowledge Capture.  \nPublicación: en actas del congreso (ISBN: 978-1-60558-658-8) páginas 33-40 \nLugar celebración: California, USA \nFecha 1-4 de septiembre de 2009 \n \nAutores: G. Aguado de Cea, E. Montiel-Ponsoda, M.C. Suárez-Figueroa \nTítulo: Approaches to ontology development by non ontology experts \n",
  "speaker": "SYSTEM",
  "uuid": "6376c197-d0fe-40f4-8564-ef80781111cf"
}