{
  "message": "SYSTEM: FeedbackOEGWebsite.pdf: Página 1\nFeedback from OEG Website \nWe should have a separate category for events, not inside the news section.  \nIdea to standarize every page related with OEG? Standarize, smartcities, services, mock… etc. \nHave the same template for deploy, ontology, services…etc.  \nCenter on Team? Team is something that is important, so it should be alone in the menu. Inside \nthe menu we should have a section called Who we are? Or About us?. The research group has \nnot to be as formal as the main page of the Uni, so we can have more informal language.  \nJob opportunities should have more impact and have it in the menu separately.  \nMore information in the homepage. The homepage it has to be the most relevant information \nabout the group. Not a lot of text but more information about other parts of the website. Extend \nthe concept of the links in other places of the website as in the homepage . \nMost of the users will come from a mobile. This should have implications of the design. (Logs of \nthe visitors? If they come from the mobile or the computer?) More simple webpages more \naccessible in a mobile phone.  \nIn highlighted content of the menu must have more info about projects, opportunities , \ntechnologies, services…  \nIf we put too much information in the webpage you could bias the kind of user that is going to use \nthe webpage. Right now the design is ﬂexible, in the carrousel.  \nTemporal frame of things. From here to 10 days this is what we have (project, job oﬀer, \ncollaborations…) etc.  \nWho are the users? Students, companies and research groups. Three categories in the \nhomepage. Three sections one for each kind of user. In that way every kind of user will feel \nwelcome in the webpage.  \nMost of people agree that this sections should be in the bottom (after highlighted content). \nSomeone showed an example of a website that has this structure. In this case,  after the main \ncarrousel they have three sections for each proﬁle.  \nSection of FAQ.  \nHow can we present the projects for the companies?  \nRight now it is not possible to ﬁnd a person by his/her expertise.  \nArchive of projects is useful for the people inside OEG, but the companies would be more \ninterested in what can we oﬀer you? Expertise in Linked Data or whatever. It is important to \nhighlight in which ﬁelds we are the best. An area of “Our expertise” we don’t know  \nInside the project page (a single project) have the area that this project belongs to. In the people \nthere should be also a section saying where they have their expertise. (Inside a single people \nlayout).  \nVicky asked if the projects have the links to the people that are working in that project.  \nHow easy it will be to update this website? Minimize the text that has to be changed over time. \n",
  "speaker": "SYSTEM",
  "uuid": "6416071c-f3e5-4605-8faa-8bd69dce81cc"
}