{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 95\n93\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nChallenges / opportunities\nOpportunities\n• Digital content growth: as digital content is exponentially growing, the more important become author‐\ning and creation tools to assure quality.\n• Focus on new vertical solutions: with exception of media or manufacturing, the majority of markets\nare still early adopters.\n• Collaboration: increasing collaboration among employees is one of the pillars to boost employee’s pro‐\nductivity. Authoring and creation vendors should focus on enable collaboration capabilities for their\nplatforms. In that sense, cloud computing is the key technology component to consider.   \nChallenges\n• Non‐mature Market: although authoring and creation technologies have been widely adopted by mar‐\nkets like media, manufacturing or high technology companies, other markets that could benefit from\nthese technologies are not mature enough. For example, requirement quality analysers could increase\nthe quality of software code and create a consistent corporate framework.\n• Verticalization requires new partnerships: expanding authoring and creation technologies beyond\nmedia industry requires deeper and specific industry knowledge. As authoring / creation vendors are\nmainly focused on technology, they should find the proper VARs.\n4.15 Search & Navigation \nSearch and Navigation are systems to provide rapid access to text or unstructured data inside databases, on\ndesktops or across the entire Internet. Search & Navigation systems include search engines, platforms, and\napplications with browsing and navigation, applied to enterprise or Web content. LT in search appears in uni‐\nfied information access platforms.\nSearch and navigation applications create access to unstructured and structured information. This range of\nsoftware applications and technologies analyses, tags, and searches text — often in multiple languages —\nand rich media such as audio, video, and image files. It combines several technologies such as information\naccess platforms, extended search platforms, search engines, multilingual modules, question‐answering\napplications, categorization/metadata tagging tools, categorizers and clustering engines, visualization tools\nfor information navigation and analysis, filtering and alerting tools, and text analytics applications. This pro‐\ngressive Integration of different techniques seeks to boost search accuracy.\nTraditionally, search has been classified as:\n• Enterprise search: index data and documents from a variety of sources such as: file systems, intranets,\ndocument management systems, e‐mail, and databases.\n• Web search: index documents on the open web.\n• Mobile search: index the content on a single computer.\n• Desktop search: index the content on a single mobile.\nNowadays, with the increased demand of unified access platforms, this distinction is becoming less clear as\n",
  "speaker": "SYSTEM",
  "uuid": "65ba6db7-5030-4fd9-8a80-fee9fa8a2ef5"
}