{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 77\n75\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nCustom and Adapted MT Engines\nStatistical machine translation software is generic, meaning the same translation engine can be used for any\nnumber of language pairs or specialized applications. There is no need to handcraft the translation software\nas there often is with rules based translation. There is a market need for customized, or adapted, translation\nengines that are trained with corpora for a specific language pair, or for a particular industry or domain of\nexpertise. Doing so results in higher quality and more consistent translation for that application. \nA number of companies are focusing on language or domain specific translation engines as their speciality,\namong them: SDL/BeGlobal. We expect this to be an area of ongoing development, along with hybrid\nmachine/human translation platforms.\nOpen Source MT Technology\nOpen source has already had a major impact on machine translation. There are mature and actively used\nopen source platforms for all types of machine translation. Apertium enables people to build their own rules\nbased translation engines. Moses is widely used by people building custom statistical machine translation\nsystems. \nOpen source is important not so much to end users, but to language service providers who want to develop\ncustomized or adapted translation engines. Because they don’t have to build or support the underlying\ntranslation engine, they are freed to focus primarily on compiling training data needed to build a client’s sys‐\ntem. Thus its primary role, in the context of MT, is to reduce the R&D costs that these companies would oth‐\nerwise incur in bringing their products to market. \nData Sharing for MT\nPublic translation memories will play an important role in the improvement of machine translation because\nthey can be used to generate high quality training corpora. This will also reduce development costs for com‐\npanies because they can re‐use an ever growing baseline corpora that many parties feed into, and can focus\non collecting the high value information that is specific to their client’s project. The ability to share transla‐\ntion memories is also important for poorly resourced languages where there are often smaller batches of\ntranslations stored in many different locations, typically language service providers. If these can be pooled\nand shared, this will make it much easier for companies to create high quality translation engines for second‐\nary language pairs.\nHuman/Machine Translation\nAnother important trend is the growing use of machine translation for a first pass, with human translators\n(users, professional translators or both) providing feedback, suggested translations, or direct post‐edits. This\napproach is becoming popular because it is often unknown if a particular document will be read by enough\npeople to justify the cost of professional translation. For example, a document might be translated by\nmachine, but then when traffic reaches a defined threshold, would be sent to human translators and editors\nfor further review and post‐editing. We expect this type of cost optimisation workflow to become popular,\nespecially with web and mobile content producers who have to generate fast and low‐cost translations. Also,\nif customers know that content is being machine translated, and only later cleaned up by people, their\nexpectation of quality is markedly different.\nSDL BeGlobal is a good example of this type of integration. Their machine translation engine, which can also\nbe trained with custom corpora, is fully integrated into SDL’s Translation Management System, and can be\nused to generate first draft texts that are, in turn, processed and post‐edited by staff translators or out‐\nsourced workers as needed. \nFrom Licensing to Professional Services\nAcross the board, vendors are migrating to a Software‐as‐a‐Service business model. Few companies want to\n",
  "speaker": "SYSTEM",
  "uuid": "6769f7b4-80de-4a81-b3f7-905223adbbc2"
}