{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 11\nTerminological Principles used for Ontologies \n \n11\nThe concept terminological ontology in Figure 4 does not correspond to the \nconcept that we have introduced in Figure 9. By terminological ontology we \nunderstand an ontology which adheres to the principles of terminology de-\nscribed in section 1. According to these principles an ontology is based on an \nanalysis and specification of characteristics and use of subdivision criteria. \nOn the basis of some of the concepts in Figure 7, some more concepts can \nbe introduced into our proposal for an ontology in Figure 9. For example, in \nFigure 7, we find the concept formal is-a hierarchy. Lassila & McGuiness \n(2001) characterizes this as a “strict subclass hierarchy”, which we under-\nstand as a hierarchy comprising only type relations (is-a relations), as op-\nposed to “informal term hierarchy” which may comprise associative relations. \nFigure 9 comprises the concepts formal ontology and informal ontology. \nHowever, in this case ‘formal’ and ‘informal’ means something else than in \nLassila & McGuiness (2001). In Figure 9 ‘formal’ and ‘informal’ refers to \nwhether the concepts are described in a formal way or not.  In Figure 9 we \nhave introduced two concepts: ontology with type relations, corresponding to \nthe concept formal is-a hierarchy in Lassila & McGuiness (2001), and ontol-\nogy with mixed relations, i.e. ontology comprising type relations, part-whole-\nrelations and associative relations. Hence the subdivision criterion would be \nRELATION TYPES. In Figure 9 it would be possible to have for example a \nconcept informal ontology with type relations, which is a subconcept of the \ntwo concepts: formal ontology and ontology with type relations. \nHere we have not discussed in detail all ontologies found in the examples \nin section 2, and we have not completed the ontology in Figure 9. This will \nbe future work. However, some of the ontologies mentioned in for example \nFigure 7 should, in our view, not be categorized as ontologies, either because \nthey are concerned only with the expressions (e.g. controlled vocabulary, \nglossary) or because their purpose is classification rather than description of \nknowledge (e.g. thesaurus).  \n In the next section we will discuss the concept information ontology \nwhich is found in Figure 4 (van Heijst et al. (1997).  \n \n5 Ontology vs. conceptual data model \n \nVery often the term ontology is used for data model, either conceptual data \nmodel or information model (also referred to as information ontology, c.f. \nFigure 4). However, the concept information model is defined as a “data \nmodel that represents the organization of information in a manner that re-\nflects the structure of an information system”, cf. for example CEN CWA \n15045 (2004), and thus, in our opinion, it is not a type of ontology. In data \nmodelling one distinguishes three concepts conceptual data model, informa-\n",
  "speaker": "SYSTEM",
  "uuid": "67c2c891-e669-476f-86cd-5c2fc7de000c"
}