{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 5\ninterest. I don't want to give you a rate, but it is a very high rate. Given two people with exactly the same\nability, the one person who manages day in and day out to get in one more hour of thinking will be\n\t\ntremendously more productive over a lifetime. I took Bode's remark to heart; I spent a good deal more of\n\f\nmy time for some years trying to work a bit harder and I found, in fact, I could get more work done. I don't\n\u0014\nlike to say it in front of my wife, but I did sort of neglect her sometimes; I needed to study. You have to\nneglect things if you intend to get what you want done. There's no question about this.\n&\nOn this matter of drive Edison says, ``Genius is 99% perspiration and 1% inspiration.'' He may have been\n\u001c\nexaggerating, but the idea is that solid work, steadily applied, gets you surprisingly far. The steady\n\b\napplication of effort with a little bit more work, \n\t\nintelligently applied\n'\n is what does it. That's the trouble;\ndrive, misapplied, doesn't get you anywhere. I've often wondered why so many of my good friends at Bell\n \nLabs who worked as hard or harder than I did, didn't have so much to show for it. The misapplication of\n\u001f\neffort is a very serious matter. Just hard work is not enough - it must be applied sensibly.\n\b\nThere's another trait on the side which I want to talk about; that trait is ambiguity. It took me a while to\ndiscover its importance. Most people like to believe something is or is not true. Great scientists tolerate\n \nambiguity very well. They believe the theory enough to go ahead; they doubt it enough to notice the errors\n\t\nand faults so they can step forward and create the new replacement theory. If you believe too much you'll\n\t\nnever notice the flaws; if you doubt too much you won't get started. It requires a lovely balance. But most\ngreat scientists are well aware of why their theories are true and they are also well aware of some slight\n\u0017\nmisfits which don't quite fit and they don't forget it. Darwin writes in his autobiography that he found it\nnecessary to write down every piece of evidence which appeared to contradict his beliefs because otherwise\nthey would disappear from his mind. When you find apparent flaws you've got to be sensitive and keep\n\f\ntrack of those things, and keep an eye out for how they can be explained or how the theory can be changed\n\f\nto fit them. Those are often the great contributions. Great contributions are rarely done by adding another\n\f\ndecimal place. It comes down to an emotional commitment. Most great scientists are completely committed\n \nto their problem. Those who don't become committed seldom produce outstanding, first-class work.\n\f\nNow again, emotional commitment is not enough. It is a necessary condition apparently. And I think I can\n\u0011\ntell you the reason why. Everybody who has studied creativity is driven finally to saying, ``creativity comes\n\f\nout of your subconscious.'' Somehow, suddenly, there it is. It just appears. Well, we know very little about\n\u000e\nthe subconscious; but one thing you are pretty well aware of is that your dreams also come out of your\n\f\nsubconscious. And you're aware your dreams are, to a fair extent, a reworking of the experiences of the\n\u0006\nday. If you are deeply immersed and committed to a topic, day after day after day, your subconscious has\n \nnothing to do but work on your problem. And so you wake up one morning, or on some afternoon, and\nthere's the answer. For those who don't get committed to their current problem, the subconscious goofs off\n\f\non other things and doesn't produce the big result. So the way to manage yourself is that when you have a\n\u000e\nreal important problem you don't let anything else get the center of your attention - you keep your thoughts\n\u0018\non the problem. Keep your subconscious starved so it has to work on \n\u000e\nyour\n(\n problem, so you can sleep\npeacefully and get the answer in the morning, free.\n\u000f\nNow Alan Chynoweth mentioned that I used to eat at the physics table. I had been eating with the\n\u0011\nmathematicians and I found out that I already knew a fair amount of mathematics; in fact, I wasn't learning\n\u0014\nmuch. The physics table was, as he said, an exciting place, but I think he exaggerated on how much I\n\u0014\ncontributed. It was very interesting to listen to Shockley, Brattain, Bardeen, J. B. Johnson, Ken McKay and\n\u0007\nother people, and I was learning a lot. But unfortunately a Nobel Prize came, and a promotion came, and\n\u000e\nwhat was left was the dregs. Nobody wanted what was left. Well, there was no use eating with them!\n\nOver on the other side of the dining hall was a chemistry table. I had worked with one of the fellows, Dave\n\u001c\nMcCall; furthermore he was courting our secretary at the time. I went over and said, ``Do you mind if I join\nyou?'' They can't say no, so I started eating with them for a while. And I started asking, ``What are the\n!\nimportant problems of your field?'' And after a week or so, ``What important problems are you working\n\u001e\non?'' And after some more time I came in one day and said, ``If what you are doing is not important, and if\n\u000e\nyou don't think it is going to lead to something important, why are you at Bell Labs working on it?'' I wasn't\n!\nwelcomed after that; I had to find somebody else to eat with! That was in the spring.\n\nIn the fall, Dave \n\u000b\nMcCall stopped me in the hall and said, ``Hamming, that remark of yours got underneath\n)\nmy skin. I thought about it all summer, i.e. what were the important problems in my field. I haven't changed\nmy research,'' he says, ``but I think it was well worthwhile.'' And I said, ``Thank you Dave,'' and went on. I\n\u0014\n",
  "speaker": "SYSTEM",
  "uuid": "69d9664a-472f-48c2-af54-d2a99f45d0c1"
}