{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 90\nPage 90 of 111 \nNeOn Integrated Project EU-IST-027595 \n6. NeOn Use Cases Life Cycles  \nThis chapter includes the ontology network life cycle for the NeOn use cases (fisheries in WP7, \nand invoicing and nomenclature in WP8) is included. \nEach use case is described in a specific section with the following structure:  \n¾ Use case description, including a general overview of the use case. \n¾ Selected ontology network life cycle model (using the decision tree presented in step 2 \nwithin Section 5.3). \n¾ Selected activities to be carried out (using the decision tree presented in step 3 within \nSection 5.3). \n¾ Activities carried out for building the ontologies / ontology networks.  \n¾ Lessons learned by following the methodological guidelines including in this deliverable and \nother guidelines being carried out in WP5. \nIn the FAO use case (Section 6.1) the section structure is not exactly the same as the \naforementioned because the activities carried out within T7.2 (Mapping of resources and initial \nfishery ontology repository) and described in detail in [60] were carried out in parallel with the \nactivities related to T5.3 (Identification of the networked development process and ontology \nlifecycle) in WP5. In fact, no specific methodological guidelines from WP5 were available when the \ndevelopment of the first set of fisheries ontologies included in [60] began. The ontologies at \nhand have been developed according to a number of guidelines and “best practices\" commonly \nknown in the literature (Ontology 101, available documentation for OWL and for Protege-OWL). On \nthe other hand, the FAO team dealt with relatively novel tasks, i.e. development of ontologies \npopulated from database, which involves a novel tool (ODEMapster); unfortunately, there are no \nguidelines or methodologies currently available for this tool that FAO team know of.  \niSOCO use case (Section 6.2) and ATOS use case (Section 6.3) are described following the \naforementioned structure. Both partners have taken into account the methodological work \npresented in this deliverable and other methodological work being carried out within WP5 for \ndeveloping their ontology networks. \n6.1. FAO Ontology Network Life Cycle \n6.1.1. Use case description \nThe aim of the WP7 case study is to create an ontology-driven stock depletion assessment system \n(FSDAS) (for a general overview of the WP7 use case, refer to [\n]). Such a system will use data \nsets already available at FAO, and these data sets will be accessed by means of (a network of) \nontologies. One candidate of the data sets for inclusion is the time series about fisheries. Central to \nall fisheries statistics are the biological species that are caught, produced and exchanged in the \nmarket. Biological species constitute a metadata (commonly called reference data, which is stored \nin reference tables) that is used to reference (or annotate) the statistical data. Reference tables are \nstored in relational tables in a RDBMS. \n37\n6.1.2. Activities carried out for building the ontologies \nSince the data at hand is stored in relation form, the process of converting it into ontologies is, at \nthe same time, a problem of domain modeling and of data reengineering.  \n \n",
  "speaker": "SYSTEM",
  "uuid": "6afbc24d-9b0d-445c-8d5c-bf5beefe6265"
}