{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 2\n \n \n2\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \nI. OBJETO Y CONDICIONES  \n \nPRIMERO.- NÚMERO DE AYUDAS  \n \n \nEsta convocatoria contempla la concesión de un máximo de treinta y cinco ayudas para \nPersonal Investigador en Formación.  \nDe esas treinta y cinco ayudas, se establece un cupo de cinco ayudas dirigidas a alumnos \nque hayan cursado los estudios universitarios fuera de España, siguiendo uno de los \nobjetivos fijados en el R.D. 1393/2007 que es potenciar la apertura hacia los estudiantes \nprocedentes de otros países del Espacio Europeo de Educación Superior y de otras áreas \ngeográficas. Por otro lado, habrá dos ayudas relacionadas con la temática de investigación \nen cooperación internacional para el desarrollo. \n \nSEGUNDO.- REQUISITOS DE LOS SOLICITANTES \n \n2.1.  De modo general, podrán considerarse candidatos a las ayudas convocadas, aquellos \ntitulados universitarios que realicen o vayan a realizar estudios de doctorado en la \nUniversidad Politécnica de Madrid bajo la dirección de uno de sus profesores o \ninvestigadores; y en particular los que cumplan los siguientes requisitos en la fecha de \ncierre de presentación de solicitudes: \n1. Poseer la nacionalidad española, ser nacional de un país miembro de la Unión \nEuropea o extranjero no comunitario con residencia legal en España. \n2. Los solicitantes deberán estar matriculados durante curso 2009/10 en un período \nde formación de un Programa de Doctorado o justificar que están en el período de \ninvestigación del mismo. Se define período de formación de un Programa de \nDoctorado como los créditos necesarios para obtener el DEA, incluido éste, en el \ncaso de RD 778/1998, los 60 ECTS que sean últimos de un título de máster o un \nconjunto de 60 ECTS de varios títulos de máster que sean últimos respectivamente \nen cada título en el caso del RD 56/2005, y lo que se explicita como período \nformativo en el caso del RD 1393/2007. \nBajo determinadas circunstancias excepcionales, aquellos estudiantes extranjeros \nque aún no hayan formalizado la matrícula, según se establece en el párrafo \nanterior, podrán solicitar la ayuda con el compromiso de formalizar la matrícula si \nresultan seleccionados, condición a la que queda sujeta la percepción de la beca. \n \n3. Haber concluido los estudios (incluido en su caso el Proyecto o Trabajo Fin de \nCarrera) en 2001 o posteriormente. \nTambién podrán presentar su solicitud los titulados universitarios cuya fecha fin de \nestudios sea inmediatamente anterior a la citada y que acrediten los siguientes \nsupuestos: \na)  Dedicación a la atención y al cuidado de hijos menores de seis años,  \nb)  Haber realizado actividad en proyectos de cooperación internacional para el \ndesarrollo. \nc)  Haber sido víctima de violencia de género o de terrorismo. \n",
  "speaker": "SYSTEM",
  "uuid": "6c043f8b-7bab-4ce3-9d46-f94bf28812f3"
}