{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 8\nGu´ıa de orientaci´on para investigadores noveles\n8\nmos distinguir por un lado al Personal de Administraci´on y Servicios (PAS)\nque, a su vez, puede estar formado por: personal funcionario de las escalas\nde las propias Universidades; personal laboral contratado por la propia Uni-\nversidad, o por personal funcionario perteneciente a los cuerpos y escalas\nde otras Administraciones p´ublicas. En cuanto al profesorado (tambi´en de-\nnominado Personal Docente e Investigador (PDI)), es posible hacer dos dis-\ntinciones tal y como se puede ver en el cuadro 1. Por una parte, est´a el PDI\ncontratado, que incluye las ﬁguras de Ayudante, Profesor Ayudante Doctor,\nProfesor Contratado Doctor, Profesor Asociado y Profesor Visitante, y por\notra parte, encontramos lo que se denominan cuerpos docentes universitar-\nios, formado por el profesorado universitario funcionario y que incluye las\nﬁguras de Profesor Titular de Universidad y Catedr´atico de Universidad.5\nM´as adelante, en la secci´on 6 introduciremos qu´e es la Agencia Nacional\nde Evaluaci´on de Calidad y Acreditaci´on (ANECA), cu´al es su funci´on y\nqu´e importancia tiene dentro de la Universidad, y en concreto para el PDI.\nAdem´as, se dar´a informaci´on m´as detallada sobre cada una de las ﬁguras\nque componen el profesorado universitario, as´ı como los requisitos que deben\ncumplirse para poder acceder a algunas de ellas.\nCATEGOR´IA\nFIGURA\nR´EGIMEN\nProfesorado\ncontratado\nAyudante\nLABORAL\nProfesor Ayudante Doctor\nLABORAL\nProfesor Contratado doctor\nLABORAL\nProfesor Asociado\nLABORAL\nProfesor Visitante\nLABORAL\nCuerpos docentes\nuniversitarios\nProfesor Titular de Universidad\nFUNCIONARIO\nCatedr´atico de Universidad\nFUNCIONARIO\nCuadro 1: Personal Docente e Investigador de las Universidades.\n4.\nFormaci´on predoctoral\nCuando se est´a en ´ultimo a˜no de carrera o ya se tiene el t´ıtulo de Inge-\nniero en Inform´atica, existen becas y programas especializados que permiten\niniciarse en la investigaci´on, o bien comenzar una formaci´on de car´acter em-\ninentemente investigador. Nos referimos a la opci´on de realizar posgrados\no doctorados tanto a nivel nacional como internacional. La ﬁnanciaci´on de\nestas becas puede provenir de organismos p´ublicos (Estado, Comunidades\nAut´onomas, Universidad, Centros de Investigaci´on) o tambi´en es muy fre-\ncuente que entidades privadas o fundaciones (por ejemplo, entidades ﬁ-\nnancieras como La Caixa o Caja Madrid) convoquen becas de este tipo para\nfomentar la investigaci´on y movilidad de los estudiantes espa˜noles. Posible-\n5Con la modiﬁcaci´on de la LOU 6/2001 desaparecen las ﬁguras de Profesor Colabo-\nrador, Profesor Titular de Escuela Universitaria y Catedr´atico de Escuela Universitaria.\n",
  "speaker": "SYSTEM",
  "uuid": "6cef136d-4d94-4eaf-89fc-de33b4d08d52"
}