{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 53\n51\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nsitive to ambient noise. This is one of main barriers to achieving accuracy. As a result, any disturbance near‐\nby prevents the application from accurately recognizing the voice source. This also disrupts the automated\nreply for the spoken command. The inability of the application to suppress the ambient noise is the only fac‐\ntor that is keeping vendors from achieving 100% accuracy. \nLimitations in Automated Speech Services \nASR application vendors offer automated speech recognition applications which can replace humans by pro‐\nviding automated speech services. These services include travel reservations, hotel bookings and in contact\ncentres. Although vendors are offering human‐like experience in automated travel reservations, the limited\ngrammar and language input into this automated system is a challenge in the Global ASR Applications mar‐\nket. In addition, the consumers must have some knowledge about the system and the limited number of\nwords that the system understands. Since the system cannot understand all the human needs it is still limit‐\ned in the market. If given a choice human operators will generally be given a preference over automated\nvoice generated machines. This is the major reason behind the lower adoption rate of ASR applications in\nmost developing countries. \nOut of human tendency, most users will prefer to talk to a human operator. It is a general perception that a\nhuman can understand the needs of another human in a better way and so users calling a customer care\ncontact centre of any enterprise prefer to talk to a human operator who can provide an efficient solution to\ntheir queries and enquiries. Therefore, preference for a human operator is a challenge not only in develop‐\ning countries but also in developed countries. \nLack of Awareness about ASR Applications \nOne of the major challenges in the Global ASR Applications market is lack of awareness about the applica‐\ntions and their benefits. Most enterprises are still under the misapprehension that these applications are dif‐\nficult to adopt and implement. Hence, the adoption rate of these applications in the Enterprises and\nGovernment sectors has been low. \n",
  "speaker": "SYSTEM",
  "uuid": "6d1a7aa2-e898-4c98-9d0a-42a1b7d67d72"
}