{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 15\nAsí pues, hoy día la Administración es una compleja organización dirigida a la presta-\nción de servicios y el ciudadano un cliente o usuario de los mismos16. Ésta es la razón por\nla que utiliza múltiples fórmulas organizativas, públicas, semipúblicas o privadas que le\npermiten mayor agilidad y eficacia para lograr sus fines, en gran parte de los principales\nservicios que presta17.\nLa organización, funcionamiento y principios de su actuación queda recogida en la Ley\nde organización y funcionamiento de la Administración General del Estado (LOFAGE)18. \nEn cuanto a la organización, desde el punto de vista de la circunscripción territorial que\nles afecta, la AGE se compone de órganos de la Administración Central, con competencia\nsobre todo el territorio nacional, y periféricos o territoriales, con competencias reducidas\na una parte de aquél. Además, bajo las directrices del Gobierno, se organiza horizontal-\nmente en Ministerios. Cada uno de estos comprende uno o varios sectores funcionalmen-\nte homogéneos de actividad administrativa19. \nPor lo que se refiere a los principios por los que se rige la AGE, Bauzá ha señalado que,\nen el nuevo contexto social y económico en el que ésta interactúa, junto al principio\nde legalidad cobra importancia el de eficacia, ya que el fin último que persigue la\nAdministración es convertir las demandas de los ciudadanos en productos y servicios de\ndiferente naturaleza y ello con la austeridad presupuestaria que caracteriza el gasto públi-\nco20. Así pues, se trata de conseguir adecuar correctamente los medios de que dispone AGE\na las necesidades que ha de satisfacer. \nFinalmente, la LOFAGE destaca el principio de servicio a los ciudadanos. Toda la\nactuación administrativa gira en torno a éste, condicionando su organización y funciona-\nmiento. Esta obligación conlleva la mejora continua de los procedimientos y de los servi-\ncios públicos. Una primera medida es que todos los ministerios pongan a disposición de\nlos ciudadanos “el esquema de su organización y de los organismos dependientes y las\nguías informativas sobre los procedimientos administrativos, servicios y prestaciones apli-\ncables en el ámbito de la competencia del Ministerio y de sus Organismos Públicos” 21.\nEsto incide de forma decisiva en el desarrollo de los sistemas de información. Los ciuda-\ndanos no son únicamente clientes de los servicios públicos, tienen derechos y obligacio-\nnes que les convierten en miembros activos de la comunidad. Para poder intervenir como\nles corresponde por derecho requieren información, mejora de los procedimientos y la\nincorporación de las nuevas tecnologías para simplificar y agilizar la resolución de sus\nasuntos.\nLas nuevas exigencias de la sociedad, la globalización y las tecnologías de la informa-\nción y de las comunicaciones han determinado la modernización de la Administración\nPública22. Este proceso de cambio no podía realizarse anulando la estructura administrati-\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n20\n16 BAUZÁ MARTORELL, Felio J. Aproximación a la Ciencia de la Administración. Gerencia aplicada a las orga-\nnizaciones públicas. Madrid: Dykinson, 1999, p. 82.\n17 OLÍAS DE LIMA, Blanca. Manual de organización administrativa del Estado. Madrid, Síntesis: 2006, p. 16.\n18 Ley 6/1997 de 14 de abril (“BOE” de 11/IV/1997).\n19 LOFAGE, art. 8.1.\n20 BAUZÁ MARTORELL. Aproximación, p. 82, y OLÍAS DE LIMA. Manual, p. 24.\n21 LOFAGE, art. 4.3.\n22 Prueba de ello es la aprobación de la Ley 11/2007, de 22 de junio, de acceso electrónico de los ciudadanos a los\nservicios públicos; así como el papel de impulsor y moderador de la Sociedad de la Información que corresponde al\nGobierno y a la AGE por mandato de las Cortes en virtud de las leyes 34/2002, de 11 de julio, de servicios de la socie-\ndad de la información y de comercio electrónico, y 56/2007, de 28 de diciembre, de Medidas de Impulso de la Sociedad\nde la Información.\nBASES DE DATOS  1/1/04  03:39  Página 20\n",
  "speaker": "SYSTEM",
  "uuid": "6d267995-1715-4f1a-b9ae-c892c2528801"
}