{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 86\nBÚSQUEDA \n \n86 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEjercicios.  \n1) Dibújense los árboles de búsqueda en anchura y en profundidad, con \nexpansión de izquierda a derecha, para el espacio de la figura 2 (sin tener en \ncuenta, por tanto, los números que aparecen entre paréntesis). Compárense, en \ncuanto al número de estados generados y el número de examinados, los distintos \nárboles de búsqueda. ¿Qué sucede si se expande, en las 6 estrategias, de derecha \na izquierda? \n2) Existe otra estrategia intermedia entre las escaladas irrevocables y la escalada \nen profundidad. Consiste en añadir a ABIERTOS como nuevos nodos sólo aquellos \nque corresponden a estados cuyo valor heurístico mejora el del estado que está \nsiendo expandido. Dibujar el árbol de búsqueda con el espacio de la figura 2. \nEstudiar su implementación (basta con modificar expandir-nodo). ¿Puede \naplicarse una idea de ese tipo para encontrar una variante de primero el mejor? \nEn cuanto a la complejidad algorítmica, su comportamiento en el peor caso es el \nmismo que el de la búsqueda en profundidad, tanto en tiempo como en espacio. Es \nun método exhaustivo y completo; esto es, encontrará una solución si existe alguna, \naunque no garantiza que dicha solución sea de longitud mínima. \nEn lo referente al aprovechamiento de la heurística, es claro que el método primero \nel mejor es mucho más conveniente que los métodos de escalada (usa la \ninformación de un modo global y no de un modo local), pero hay que tener el cuenta \nel coste en tiempo que requiere el mantener ordenada la lista de ABIERTOS (o, \nequivalentemente, el coste de acceder a ella calculando el mínimo de los valores \nheurísticos; ver más abajo). \nEn cuanto a la implementación, varias soluciones son posibles: \n• \nmodificar sólo reorganizar-nodos-a-expandir para que ordene en cada \nocasión la lista ABIERTOS; \n• \nmodificar también expandir-nodo de manera que devuelva ya ordenados los \nnuevos nodos (en este caso, sería exactamente la misma función que la \nnecesaria para la búsqueda de escalada en profundidad); aprovechando que \nABIERTOS ya está ordenada, se puede implementar reorganizar-nodos-a-\nexpandir con un algoritmo de mezcla, en lugar de ordenación, con el \nconsiguiente ahorro en tiempo; \n• \nse podría modificar el acceso a ABIERTOS, de modo que en lugar de extraer \nsiempre el primer elemento de la lista, se extraiga el nodo cuyo estado tenga el \nvalor heurístico más favorable; si se adopta esta solución no sería necesario \n",
  "speaker": "SYSTEM",
  "uuid": "6d7f203c-297f-46c9-a124-2296f4128594"
}