{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 8\n‟the place of intersection of two or more roads‟; and to include in the Comment \nannotation the word „Crossroads‟. \nP21. Using a miscellaneous class: to create in a hierarchy a class that contains the \ninstances that do not belong to the sibling classes instead of classifying such \ninstances as instances of the class in the upper level of the hierarchy. This class \nis normally named “Other” or “Miscellaneous”. An example of this type of \npitfall is to create the class “HydrographicalResource”, and the subclasses \n“Stream”, “Waterfall”, etc., and also the subclass “OtherRiverElement”. \nP22. Using different naming criteria in the ontology: no naming convention is used \nin the identifiers of the ontology elements. For example, we can name a class by \nstarting with upper case, e.g. “Ingredient”, and its subclasses by starting with \nlower case, e.g. “animalorigin”, “drink”, etc. This pitfall is related to the \nguidelines for giving names to ontology elements provided in [8]. \nP23. Using incorrectly ontology elements: an ontology element (class, relationship \nor attribute) is used to model a part of the ontology that should be modelled with \na different element. An example of this type of pitfall is to create the relationship \n“isEcological” between an instance of “Car” and the instance “Yes” or “No”, \ninstead of creating the attribute “isEcological” whose range is Boolean. This \npitfall is related to the guidelines for distinguishing between a class and a \nproperty value provided by [8]. \nP24. Using recursive definition: an ontology element is used in its own definition. \nFor example, it is used to create the relationship “hasFork” and to establish as its \nrange the following ‟the set of restaurants that have at least one value for the \nrelationship “hasFork”. \n5   Pitfall Analysis: Recurrent Pitfalls \nThis section summarizes the set of pitfalls identified in the 26 ontologies developed \nby the 51 participants in the 3 experiment sessions presented in Section 3. Table 2 \nincludes the occurrence of the 24 pitfalls previously identified in the 26 ontologies. \nDuring the analysis, we have observed that some pitfalls can appear almost in all the \nelements of the ontology, for example, the P8 “Missing annotations”. In contrast, \nother pitfalls only appear in specific parts of the ontology for example, the P13 \n“Missing inverse relationships”. Because of this, the numbers in Table 2 show how \nmany ontologies contain the pitfall instead of how many times appears the pitfall \nalong the 26 ontologies. \nThe recurrent pitfalls are signed by (*) in Table 2. Such pitfalls are mainly related \nto (a) create ontology elements disconnected from the rest of the ontology; (b) miss \nknowledge (annotations, basic information, disjoint axioms, domain or range in \nproperties); (c) specialize too much a hierarchy; (d) swap knowledge representation \nelements (intersection and union, and label and comment); and (e) use different \nnaming conventions in the ontology.  \nIt is also worth mentioning those pitfalls that are less recurrent. Such pitfalls are \nmainly related to (a) create synonyms as classes; (b) create an ad-hoc relation named \n",
  "speaker": "SYSTEM",
  "uuid": "70ddb703-a68f-4783-8de1-53653c2ebbec"
}