{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 11\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n- \nNumerosas instituciones en todo el mundo utilizan Iconclass para describir y \nclasificar sus colecciones de una manera estándar. Los tres componentes \nprincipales de Iconglass son: \n9 \nSistema de Clasificación: 28.000 definiciones ordenadas jerárquicamente \ny divididas en diez clases principales. Cada definición consta de un código \nde clasificación alfanumérico (notación) y de la descripción de un tema \niconográfico (correlacionado textualmente). Las definiciones son utilizadas \npara indexar, catalogar y describir los temas de las imágenes representadas \nen obras de arte, reproducciones, fotografías y otras fuentes. \n9 \nÍndice Alfabético: 14.000 palabras clave son utilizadas para localización \nde la notación y su correlación textual necesaria para describir u indexar \nuna imagen. Ese índice es una herramienta de valor para las personas \ndedicadas a la clasificación iconográfica en la identificación, búsqueda y \nrecuperación de temas y escenarios. \n9 \nBibliografía: 40.000 referencias a libros y artículos de interés iconográfico. \n- \nEl sistema Iconglass está disponible para acceso libre a través de su página web y \ncontiene palabras claves y descripciones en inglés, alemán, francés e italiano. \n2.4 Sistema de Catalogación \nLa institución internacional filantrópica y cultural J. Paul Getty Trust es uno de los mayores \npartidarios de artes en el mundo que enfoca las artes visuales en todas sus dimensiones. El \n“Getty” sirve al público en general y a una amplia gama de comunidades profesionales en Los \nAngeles y por todo el mundo. \nEl “Getty” trabaja con el desarrollo e investigación de vocabularios controlados, del cual forma \nparte el CDWA - Categories for the Description of Works of Art, un estándard para catalogación \nde materiales relacionados al arte, y los tesauros The Art & Architecture Thesaurus (AAT)® y \nThe Union List of Artist Names (ULAN) ®, que serán mencionados posteriormente. El \nprograma de vocabulario del “Getty” está en conformidad con los estándares ISO y NISO para \nla construcción de tesauros. \n1. CDWA - Categories for the Description of Works of Art: describe el contenido de \nbases de datos de arte a través de un framework de conceptos para la descripción y \nacceso a la información sobre obras de arte, arquitectura, otros materiales relacionados a \nla cultura, grupos y colecciones de obras, e imágenes relacionadas. El CDWA incluye \n512 categorías y subcategorías. Un pequeño subconjunto de categorías es considerado el \n“corazón” para representar la información mínima necesaria para identificar y describir \nuna obra de arte. \n- \nhttp://www.getty.edu/research/conducting_research/standards/cdwa/ \n- \nPublicado por: J. Paul Getty Trust \n \n11\n",
  "speaker": "SYSTEM",
  "uuid": "70e91d79-24d3-4d8f-a087-0fd58f43c86e"
}