{
  "message": "SYSTEM: GeoLinkedData_v2_en.pdf: Página 1\nNOR2O\nOntology Engineering Group, Departamento de Inteligencia Artificial, Facultad de Informática, Universidad Politécnica de Madrid, Spain.\nGeoLinkedData (.es) is an open initiative whose aim is to enrich the Web of Data with Spanish geospatial data. This initiative started\noff by publishing diverse information sources belonging to the National Geographic Institute of Spain. Such sources are made\navailable as RDF (Resource Description Framework) knowledge bases according to the Linked Data principles. These data are\ninterlinked with other knowledge bases belonging to the Linking Open Data Initiative. With this work, Spain has joined this initiative,\nin which the United Kingdom and Germany also participate.\nhttp://geo.linkeddata.es\nWhat is  GeoLinked Data?\nModels  (Ontologies)\nThe different geospatial data sources used in the creation of GeoLinkedData belong to the\nNational Geographic Institute of Spain (IGN) and National Statistics Institute of Spain\n(CNIG). These sources are at different scales, and have multiple information related to\nSpanish geographical feature instances and contain multilingual information in the official\nlanguages of Spain (Castilian, Galician, Catalan, and Basque).\nWith respect to the statistical information, we collect these data by directly accessing\nthe INE website, where all these data sources are available in spreadsheets. The set of\nspreadsheets that has been selected contains information about population,\nunemployment, dwelling, industry, and building trade. The information is organized by\nadministrative regions, concretely in provinces and autonomous regions, and within\ntime intervals (years).\nhasStatisticalData\non\nOntology\nSpecification\nLegend\nhydrOntology\n4\nFAO\nFAO \nGeopolitical \nontology\nWGS84\n4\nW3C \nVocabulary\nGML\n4\nGML \nSpecification\nO. \nStatistics\nSCOVO\nO. \nTime\nW3C Time\nhasLat/Long\nhasGeometry\nhasLat/Long\nhasGeometry\nhasLocation/isLocated\nThesaurus\nUNESCO \n4\nEGM / ERM\nGeoNames\n…\nscv:Dimension\nscv:Item\nscv:Dataset\nWGS84 Geo \nPositioning: an RDF \nvocabulary\nhydrographical \nphenomena (rivers, \nlakes, etc.)\nOntology for OGC \nGeography Markup \nLanguage \nVocabulary for \ninstants, intervals, \ndurations, etc.\nNames and \ninternational code \nsystems for \nterritories and \ngroups\nFor the modelling of the information contained in the datasets we have created\nan ontology network, called GeoLinkedData Network, which is a collection of\nontologies joined together through a variety of different relationships such as\nmapping, modularization, version, and dependency relationships.\nThis network has been developed following the NeOn methodology , by reusing\nexisting ontologies and vocabularies.\nSCOVO\nhydrOntology\nTechnology\nVisualization\nPubby\nTechnologies\nThird parties \ntechnologies\n",
  "speaker": "SYSTEM",
  "uuid": "743a5950-5147-4150-947c-2ab927d49c86"
}