{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 16\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11165\nb)  Dependiendo de la fecha de obtención del título o de superación de los requisitos \npara acceder a las enseñanzas de tercer ciclo o a los estudios Oficiales de Posgrado, \nconforme a lo dispuesto en el artículo 17, se presentará la documentación indicada en el \npunto 1.º ó 2.º siguientes:\n1.º  En el caso de solicitantes que, en la fecha de finalización del plazo de presentación \nde solicitudes, estén en posesión del título o hayan superado los requisitos para acceder \na las enseñanzas de tercer ciclo o a los estudios Oficiales de Posgrado, copia del certificado \nde estudios, en el que deberá constar la fecha en la que se han finalizado los estudios y \nque las materias relacionadas constituyen el programa completo de la titulación \ncorrespondiente, así como las calificaciones obtenidas y fechas de obtención de las \nmismas, y, en los casos que corresponda, copia del titulo académico.\n2.º  En el caso de solicitantes que, en la fecha de finalización del plazo de presentación \nde solicitudes, no estén en posesión del título o no hayan superado los requisitos para \nacceder a las enseñanzas de tercer ciclo o a los estudios Oficiales de Posgrado, copia del \ncertificado de notas, en el que consten las calificaciones obtenidas y fechas de obtención \nde las mismas.\nEn los supuestos reflejados en los puntos 1.º y 2.º, cuando se trate de certificados \nexpedidos por centros extranjeros se hará constar además cuales son las calificaciones \nmáximas y mínimas dentro del sistema de evaluación correspondiente y cuál es la \ncalificación mínima para aprobar. Igualmente, los solicitantes que hayan cursado los \nestudios en el extranjero y posean certificación académica extendida en un idioma distinto \nal español o inglés, deberán acompañarla de la correspondiente traducción oficial a uno de \nestos dos idiomas.\nc)  Currículum Vítae.\nd)  En el supuesto previsto en el artículo 17.1.c), el interesado deberá acreditar \ndocumentalmente, mediante un certificado de la universidad española correspondiente, \nque reúne los requisitos para ser admitido en los programas de doctorado.\ne)  Las personas que se acojan al supuesto contemplado en el artículo 17.2.c)2, \ndeben hacerlo constar en el formulario de solicitud y acreditarlo documentalmente.\n8.  La presentación de la solicitud conllevará la autorización del solicitante para que el \nórgano concedente obtenga de forma directa, a través de certificados telemáticos, la \nacreditación de las obligaciones tributarias y con la Seguridad Social y, en el caso de \nciudadanos españoles o ciudadanos extranjeros residentes en territorio español, el \nconsentimiento para que el órgano instructor pueda consultar y comprobar los datos de \nidentidad incluidos en esta solicitud, de modo fehaciente, mediante el Sistema de Verificación \nde Datos de Identidad, de acuerdo con el artículo único.3 del Real Decreto 522/2006, de 28 \nde abril.\n9.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \ncomunicación a terceros de los datos recogidos en la misma, con objeto del tratamiento \nposterior de los datos con fines históricos, estadísticos o científicos, en el marco de la Ley \nOrgánica 15/1999, de 13 de diciembre, de Protección de Datos de Carácter Personal.\n10.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \nutilización, por parte del órgano instructor o del órgano concedente, de medios electrónicos \npara la practica de las notificaciones que se realicen a lo largo del procedimiento.\n11.  La documentación de las solicitudes desestimadas o denegadas podrá retirarse \npor los interesados en el plazo de tres meses a partir de la publicación en el Boletín Oficial \ndel Estado de la resolución de concesión de las ayudas; pasado ese plazo, aquellas \nsolicitudes que no hayan sido recogidas podrán ser destruidas.\nArtículo 32.  Subsanación de errores en las solicitudes.\nDe acuerdo con lo expuesto en el artículo 6, de ser necesaria la subsanación de la \nsolicitud, se requerirá al solicitante, mediante anuncio en el servidor de información del \nMinisterio de Ciencia e Innovación (http://www.micinn.es), para que en el plazo de 10 días \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "75d630ba-70c3-4fcf-85b5-f7b54dc5402b"
}