{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 5\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 5 of 21\n \nU1.  Candidate who is unemployed and searching for a job or searching another \noccupation for immediate or future purposes. \nU2.  Employer who needs more human resources. \nU3.  Public or private employment search service which offers services to gather CVs to \njob postings and to prepare some data and statistics. \nU4.  National and Local Governments which want to analyze the situation on the \nemployment market in their countries and prepare documents on employment, social \nand educational policy. \nU5. European Commission and the governments of EU countries which want to analyze \nthe statistics and prepare international agreements and documents on the \nemployment, social and educational policy. \nCompetency Questions \nCompetency questions are natural language questions used to determine the scope of the \nontology to be built. These questions and their answers are both used to extract the main \nconcepts and their properties, relations and formal axioms of the ontology. The competency \nquestions play the role of a type of requirement specification against which the ontology can \nbe evaluated. Specific competency questions can be composed into more general questions \nthat are answered by composing answers associated to the specific competency questions. \nThe analysis of the SEEMP deliverable D1.1 “User Requirement Definition”, allowed us to \nidentify the following competency questions. The sixty competency questions have been \ngrouped into four groups: job seeker, job offer, date management and currencies.  \nSpecific competency questions related to the job seeker are: \nCQ1. What is his/her name? \nCQ2. What is his/her nationality? \nCQ3. What is his/her birth date? \nCQ4. What is his/her contact information? \nCQ5. What is his/her current job? \nCQ6. What is his/her desired job? \nCQ7. What are his/her desired working conditions? \nCQ8. What kind of contract does he/she want? \nCQ9. How much salary does he/she want to earn? \nCQ10. What is his/her education level? \nCQ11. What is his/her work experience? \nCQ12. What is his/her knowledge? \nCQ13. What is his/her expertise? \nCQ14. What are his/her skills? \nCQ15. What publications does he/she have? \nCQ16. What hobbies does he/she have? \n \nSpecific competency questions related to the job offer: \n",
  "speaker": "SYSTEM",
  "uuid": "76356747-2990-4d63-aeb5-b6b93bcf4982"
}