{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 15\nwhich is what I'm preaching in this whole talk. Knowing many of my own faults, I manage myself. I have a\n\nlot of faults, so I've got a lot of problems, i.e. a lot of possibilities of management.\nQuestion: Would you compare research and management?\nHamming:\n2\n If you want to be a great researcher, you won't make it being president of the company. If you\nwant to be president of the company, that's another thing. I'm not against being president of the company. I\n\njust don't want to be. I think Ian Ross does a good job as President of Bell Labs. I'm not against it; but you\n\u0003\nhave to be clear on what you want. Furthermore, when you're young, you may have picked wanting to be a\ngreat scientist, but as you live longer, you may change your mind. For instance, I went to my boss, Bode,\n\u0017\none day and said, ``Why did you ever become department head? Why didn't you just be a good scientist?''\n\u000e\nHe said, ``Hamming, I had a vision of what mathematics should be in Bell Laboratories. And I saw if that\n\r\nvision was going to be realized, \n\u0005\nI\n7  had to make it happen; I\n7  had to be department head.'' When your vision of\nwhat you want to do is what you can do single-handedly, then you should pursue it. The day your vision,\n\nwhat you think needs to be done, is bigger than what you can do single-handedly, then you have to move\n\ntoward management. And the bigger the vision is, the farther in management you have to go. If you have a\n\f\nvision of what the whole laboratory should be, or the whole Bell System, you have to get there to make it\n\u0005\nhappen. You can't make it happen from the bottom very easily. It depends upon what goals and what\n\u001a\ndesires you have. And as they change in life, you have to be prepared to change. I chose to avoid\n \nmanagement because I preferred to do what I could do single-handedly. But that's the choice that I made,\n\u0014\nand it is biased. Each person is entitled to their choice. Keep an open mind. But when you do choose a path,\n\t\nfor heaven's sake be aware of what you have done and the choice you have made. Don't try to do both\nsides.\n\u0006\nQuestion: How important is one's own expectation or how important is it to be in a group or surrounded by\npeople who expect great work from you?\n\u000f\nHamming: At Bell Labs everyone expected good work from me - it was a big help. Everybody expects you\nto do a good job, so you do, if you've got pride. I think it's very valuable to have first-class people around. I\n\f\nsought out the best people. The moment that physics table lost the best people, I left. The moment I saw\n\u0006\nthat the same was true of the chemistry table, I left. I tried to go with people who had great ability so I\n\f\ncould learn from them and who would expect great results out of me. By deliberately managing myself, I\n\u0007\nthink I did much better than laissez faire.\n\f\nQuestion: You, at the outset of your talk, minimized or played down luck; but you seemed also to gloss\nover the circumstances that got you to Los Alamos, that got you to Chicago, that got you to Bell\n\u000e\nLaboratories.\nHamming: There was some luck. On the other hand I don't know the alternate branches. Until you can say\nthat the other branches would not have been equally or more successful, I can't say. Is it luck the particular\n\f\nthing you do? For example, when I met Feynman at Los Alamos, I knew he was going to get a Nobel Prize.\n\f\nI didn't know what for. But I knew darn well he was going to do great work. No matter what directions\ncame up in the future, this man would do great work. And sure enough, he did do great work. It isn't that\n\u0007\nyou only do a little great work at this circumstance and that was luck, there are many opportunities sooner\n!\nor later. There are a whole pail full of opportunities, of which, if you're in this situation, you seize one and\n\u000e\nyou're great over there instead of over here. There is an element of luck, yes and no. Luck favors a prepared\n!\nmind; luck favors a prepared person. It is not guaranteed; I don't guarantee success as being absolutely\n\u0014\ncertain. I'd say luck changes the odds, but there is some definite control on the part of the individual.\n\u0007\nGo forth, then, and do great work!\n*\n(End of the General Research Colloquium Talk.)\n1\nBIOGRAPHICAL SKETCH OF RICHARD HAMMING\n8\nRichard W. Hamming was born February 11, 1915, in Chicago, Illinois. His formal education was marked\n\u0015\nby the following degrees (all in mathematics): B.S. 1937, University of Chicago; M.A. 1939, University of\n\u001d\nNebraska; and Ph.D. 1942, University of Illinois. His early experience was obtained at Los Alamos 1945-\n\u0011\n1946, i.e. at the close of World War II, where he managed the computers used in building the first atomic\nbomb. From there he went directly to Bell Laboratories where he spent thirty years in various aspects of\n\u001d\ncomputing, numerical analysis, and management of computing, i.e. 1946-1976. On July 23, 1976 he\n\u0007\n",
  "speaker": "SYSTEM",
  "uuid": "779ef6de-3ba6-4180-94f2-4757b4da9457"
}