{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 44\nPage 44 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n3. NeOn Ontology Development Process \nOntologies are artefacts that are designed for a specific purpose to satisfy certain requirements \nand needs emerging in the real world.  \nA network of ontologies or an ontology network is defined as a collection of ontologies (called \nnetworked ontologies) related together through a variety of different relationships such as mapping, \nmodularization, version, and dependency relationships [35].  \nThe ontology development process can be defined (according to the Software Engineering \nterminology) as the process by which user needs are translated into an ontology. \nSo, the ontology network development process is defined as the process by which user needs \nare translated into an ontology network.  \nThere is at least two key aspects of ontology network development process: \n The identification of when an ontology network is better than a single ontology. \n The impact of the evolution of components in a network, that is greater than in a single \nontology.  \nHence, the development of ontology networks is a more complex process, which has some specific \nfeatures different from those of building single ontologies. \nThe main goal of the ontology network development process is to identify and define which \nactivities are carried out when ontology networks are collaboratively built. \nDuring one of the first NeOn plenary meetings, it was noticed that researchers, technology \ndevelopers, and users used different terminology to name the activities involved in the ontology \ndevelopment process; that is, no consensus had been reached yet on many of the definitions for \nontology engineering activities. For instance, it was not clear enough the difference between \nontology modification [54] and ontology update [55]; and other activities had multiple definitions in \nnatural language (e.g., ontology merging [26, 40, 42]). Additionally, we can now observe that new \nactivities related to the Semantic Web of the future (characterized by the use of a very large \nnumber of ontologies embedded in ontology networks built by distributed teams) are emerging \nwithout a concrete and precise definition (e.g. ontology modularization). This situation is the result \nof a lack of standardization in the ontology engineering terminology, which clearly contrasts with \nthe Software Engineering field that boasts the IEEE Standard Glossary of Software Engineering \nTerminology [1], a consensuated glossary.  \nFurthermore, to provide the methodological framework for NeOn, we need to have unambiguous \nunderstanding of the methodological components, i.e., the activities involved in the ontology \nnetwork development process.   \nWithin the NeOn consortium4, it has been decided to build the NeOn Glossary of Activities for \nunifying the terminology used by the NeOn partners. The idea was to achieve consensus on the \nidentification and definition of the activities involved in developing ontology networks.  \nThe NeOn Glossary of Activities is exclusively focused on the activities involved in the ontology \nnetwork development process. Out of the scope of this glossary are definitions of resources (data, \nmetadata, etc.), which will be included in a Resource Glossary. The NeOn Glossary will include the \nNeOn Glossary of Activities, as an important and independent subset, and the Resource Glossary.  \nTo reach a consensus in the activity terminology, we decided to use the wiki technology [44], which \nsupports a higher level of consensus building by community members because a user who \n                                                 \n4 http://www.neon-project.org/ \n",
  "speaker": "SYSTEM",
  "uuid": "77b546f3-b1e8-499c-b4a6-bc9ce9fd5a23"
}