{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 5\nTítulo del proyecto: Esperonto Services. Application Service Provision of Semantic Annotation, Aggregation, Indexing and \nRouting of Textual, Multimedia, and Multilingual WebContent  (Referencia  IST-2001-34373 (FP5)). URL: \nhttp:///www.esperonto.net \nEntidad financiadora: Unión Europea (Action Line IST-2001-3.4.1) \nEntidades participantes: Intelligent Software Components (iSOCO), Universidad Politécnica de Madrid, Institut Für Informatik \nder Universität Innsbruck (IFI), Universitaet des Saarlandes, University of Liverpool, Residencia de Estudiantes, Centre \nd'Innovacio i desenvolupament empresarial (CIDEM), Biovista \nDuración,  desde: 2002 \n \nhasta: 2005 \n \n \n \nCuantía de la subvención:       \nInvestigador responsable: Richard Benjamins. Investigador principal en Facultad de Informática: Asunción Gómez Pérez \nNúmero de investigadores participantes: 32 \n \nTítulo del proyecto: Acción especial para la organización del 1er Congreso Internacional de la Asociación Europea de \nLenguas para Fines Específicos en el programa nacional de difusión de la ciencia y la tecnología. Plan Nacional de I+D+I \n(2000-2003) (Referencia BFF2001-5378-E) \n \nEntidad financiadora: MCYT: Secretaría de Estado de Política Científica y Tecnológica  \nEntidades participantes:  Departamento de Lingüística Aplicada a la Ciencia y la Tecnología \nDuración,  desde: 2002 \n \nhasta: 2003 \n \n \n \nCuantía de la subvención:       \nInvestigador responsable: Guadalupe Aguado de Cea \nNúmero de investigadores participantes: 3 \n \n \nTítulo del proyecto: Plataforma  tecnológica para la Web semántica: Ontologías, Análisis del lenguaje natural y comercio \nelectrónico: CONTENTWEB. (Referencia TIC2001-2745) \n \nEntidad financiadora: CICYT \nEntidades participantes:  Dpto de Inteligencia Artificial (UPM), Dpto. de Lingüística Aplicada (UPM) \nDuración,  desde: 2001 \n \nhasta: 2004 \n \n \n \nCuantía de la subvención:       \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 7 \n \n \nTítulo del proyecto: An International Virtual Space for Individual and Collective Presence and Interaction (AMUSEMENT-\nESPRIT IV, Nº 25197) \nEntidad financiadora: Unión Europea \nEntidades participantes: UPM, Telecom Bretagne, Consorcio Roma, Instituto Europeo de Transferencia de Tecnología, \nSkydatc Roma \nDuración,  desde: 1997 \n \nhasta: 2000 \n \n \n \nCuantía de la subvención:       \nInvestigador responsable: Javier Segovia Pérez \nNúmero de investigadores participantes: 12 \n \n \nTítulo del proyecto: Sistema de consulta y recuperación de información mediante la generación de textos en español en el \ndominio de las sustancias químicas: ONTOGENERATION – A9706 \nEntidad financiadora: UPM \nEntidades participantes:  Dpto.de Inteligencia Artificial y Dpto. de Lingüística Aplicada \nDuración,  desde: Abril 1997  \nhasta: Julio 1998  \n \n \nCuantía de la subvención:       \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 6 \n \n \nTítulo del proyecto: Desarrollo de una Lógica Léxica para la Traducción Asistida por Ordenador a partir de una Base de \nDatos Léxica de Inglés-Español-Francés-Alemán Multifuncional y Reutilizable (Referencia PB94/0437) \nEntidad financiadora: DGICYT \nEntidades participantes:  UNED, U. de Granada, UPM \nDuración,  desde: 1994 \n \nhasta: 1997 \n \n \n \nCuantía de la subvención: \n",
  "speaker": "SYSTEM",
  "uuid": "7844c760-6cd1-466d-866d-b393500abf2a"
}