{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 38\nBÚSQUEDA \n \n38 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n2.6. \n¿Qué \nsignifica \nencontrar \nuna \nsolución? \nPara alcanzar una solución del problema debemos disponer de una descripción de \nun estado deseado del mundo. Está descripción puede ser completa (por ejemplo, \ndiciendo exactamente cuál es el estado objetivo, caso del 8-puzzle) o puede ser \nparcial (describiendo algunas propiedades de los estados que consideramos \nobjetivo, como sucede en el problema de las garrafas). En este segundo caso, la \nforma más habitual de describir los estados objetivos es una función que recibe \ncomo argumento un estado y devuelve verdad si el estado es un estado objetivo y \nfalso en otro caso. \nEn general, la solución consiste en una secuencia de operadores que transforman el \nestado inicial en el estado objetivo. Un ejemplo de solución para el 8-puzzle (tal y \ncomo ha sido enunciado más arriba) aparece en la Figura 12. \nPero podemos resolver de este modo dos problemas distintos: \n• El problema de decisión: consiste simplemente en decir si sí o no se puede \nalcanzar el objetivo desde el estado inicial. \n• El problema de explicación: en este caso se debe indicar cómo se ha llegado \ndesde el estado inicial hasta el objetivo.  \nEn ocasiones, el estado objetivo mismo ya contiene toda la información necesaria \npara resolver los dos problemas (por ejemplo, en las n reinas), pero en general no \nserá cierto (por ejemplo el 8-puzzle). En este último caso, el sistema de producción \ndebe disponer de un modo de almacenamiento de los caminos que van siendo \nexplorados. \nEn cualquiera de los dos problemas, como hemos dicho, la resolución consiste en \nencontrar una secuencia de operadores que transformen el estado inicial en el \nestado objetivo, por lo que tiene sentido estudiar en ambos casos las siguientes \nrestricciones sobre las secuencias solución: \n• Encontrar la secuencia más corta. \n• Encontrar la secuencia menos costosa (en este caso se supondrá que los \ndisparos de las reglas tienen asociado un coste o, equivalentemente, que el \nespacio de estados tiene pesos en las aristas). \n",
  "speaker": "SYSTEM",
  "uuid": "7853e02b-98e6-4b62-b896-04f858752c56"
}