{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 14\nGu´ıa de orientaci´on para investigadores noveles\n14\nde la inform´atica son: “Journal of the ACM”, “Computational Lin-\nguistics” o “Information Processing and Management”. Observamos\nque todas ellas son en ingl´es, ya que es el idioma que tendremos que\nutilizar si queremos que nuestra investigaci´on sea conocida no s´olo en\nEspa˜na, sino tambi´en en el resto del mundo.\nTambi´en se pueden valorar en este apartado los trabajos incluidos\nen las Actas de Congresos internacionales de prestigio, en aquellos\n´ambitos cient´ıﬁcos en los que dichos Congresos sean veh´ıculo de di-\nfusi´on comparable a la de las revistas Journal Citation Report de\nm´aximo prestigio. Pueden ser congresos como, por ejemplo: SIG-\nMOD (ACM SIGMOD Conference on Management Data), KDD\n(Knowledge Discovery and Data Mining), ACL (Annual Meeting\nof the Association of Computational Linguistics) o EMNLP (Em-\npirical Methods in Natural Language Processing), para el ´area de\nconocimiento “Lenguajes y Sistemas Inform´aticos”. Existen p´agi-\nnas Web d´onde se recoge la importancia que tiene cada congreso\n(v´ease el anexo A para ver ejemplos de algunos enlaces). Concreta-\nmente, en el siguiente enlace:http://www.cs-conference-ranking.\norg/conferencerankings/alltopics.html, se muestran solamente\nlos congresos de m´as prestigio en el campo de la inform´atica, junto a\nun valor que mide la importancia de cada uno, al que se ha denomina-\ndo, en ingl´es, Estimated Impact of Conference (EIC). Generalmente, lo\nque sucede con las publicaciones en revistas es que desde que se env´ıa\nun art´ıculo hasta que se publica deﬁnitivamente y sale la revista, puede\ntranscurrir un largo periodo de tiempo, m´as o menos del orden de un\na˜no o incluso m´as. Adem´as, en revistas de prestigio el proceso de re-\nvisi´on es muy duro y estricto y puede suceder que despu´es de todo\nnos rechacen el art´ıculo. Por tanto, la duda que se plantea aqu´ı es que\na lo mejor compensa m´as aprovechar todo ese tiempo para publicar\nen varios congresos internacionales, en vez de optar por una revista.\nHay congresos internacionales que tienen tambi´en mucho prestigio y\ncuyo procedimiento de revisi´on es tambi´en muy severo. Algunos de\nestos congresos, escogen un porcentaje de los art´ıculos seleccionados\ny los recomiendan para que sean publicados en ciertas revistas (si es\nas´ı, suele estar indicado en el “call for papers” o en la p´agina Web)\nque son indexadas en el SCI. Por consiguiente, si conseguimos publicar\nen alguno de estos congresos, y tenemos la suerte que nos aceptan el\nart´ıculo, quiz´a lo podamos publicar tambi´en, en una versi´on m´as ex-\ntendida y detallada, en una revista. Existe un tipo de publicaciones,\nlas llamadas Lecture Notes in Computer Science (LNCS), que eran in-\ndexadas por el JCR, con lo que ten´ıan bastante peso en el curriculum\nde un investigador. En el a˜no 2006, este tipo de revistas y otras rela-\ncionadas (tambi´en pertenecientes a las colecciones de Springer), como\n",
  "speaker": "SYSTEM",
  "uuid": "7a36b591-4b75-4ba6-aa88-1231f628fbd0"
}