{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 50\n48\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• hands‐free use of mobile phone handsets in the car e.g. “Dial office”\n• Speech instructions to navigation systems e.g. GPS‐connected digital maps: “How far is it to the motor‐\nway junction?”\n• In‐car system interaction e.g. “Turn on the radio to the travel reports channel.”\n• in‐car steering systems Industrial and Medical\nIndustrial and medical\nEase of use and improved user experience provided by voice control and synthetic speech output is an excel‐\nlent way to differentiate and add value to their products.\nIt is seen as a practical extended feature. The VR stamps take a Sensory RSC chip and add all the necessary\nexternal requirements to enable a simple hook up to microphones and speaker.\nBanking\nThe smartphone is evolving at a rapid pace. The iPhone 5 and the Galaxy S3 are pushing the limits of phone‐\nbased technology with new features—near field communication (NFC), speech recognition, voice authenti‐\ncation—and more appealing user interfaces, such as Swype, resolution, colours, and screen size. Some capa‐\nbilities require accessing the native code of the device, while others leverage hybrid solutions with parts of\nthe application accessing cloud‐based capabilities. Apple and Android, with dominant market share, take\nadvantage of these capabilities to attract new smartphone customers.\n4.6 Vendor Landscape\nThe Speech Recognition Industry is dynamic and is witnessing development and adoption of several new\napplications. There is a growing demand for speech recognition applications across a number of industries\nsuch as Healthcare, Telecommunications, Logistics, Tourism, and Financial Services. These industries are\nupgrading their existing manual systems such as healthcare transcriptions, biometrics applications, in‐vehi‐\ncle telematics, mobile applications and others with automatic speech recognition capabilities.\nThe majority of the growth in the Speech Technology market comes from the Americas, followed by the\nEurope, Middle East, and Africa (EMEA) region. Although the majority of the growth currently comes from\nthe Healthcare and Enterprise segments, other segments such as Consumers and Mobile devices are expect‐\ned to significantly increase their contributions in the next few years.\nOne of the main drivers in the speech market is the increased demand in the Mobile Applications segment.\nThis segment is witnessing high demand for speech recognition applications because of the numerous reg‐\nulations on the use of mobile phones while driving. The vendors in this segment are developing cost‐effec‐\ntive and easy‐to‐deploy automatic speech recognition applications. The increasing demand for biometrics to\naddress safety concerns is another major factor driving the need for automatic speech recognition applica‐\ntions. \nThe speech applications market is dominated by enterprises, which are the main end‐user segment and\nmainly comprises contact centres. Enterprises accounted leaded the market in 2011. The Global ASR\nApplications area mainly used by contact centres, although embedding this technology in electronic appli‐\nances and automobiles is becoming a major trend. \nNuance Communications is the market leader. The company uses acquisitions as a major strategy to retain\n",
  "speaker": "SYSTEM",
  "uuid": "7a561e26-73dd-49ee-9c1f-e241d4048b53"
}