{
  "message": "SYSTEM: Cicyt_Asun-19-05-10.pdf: Página 42\nCongreso: European Conference on Artificial Intelligence (ECAI2004) \nPublicación: International Workshop`on Semantic Intelligent Middleware for the Web and the Grid(SIM2004) \nLugar celebración: Valencia, España \nFecha: Agosto 2004 \n \nAutores (p.o. de firma): Corcho, O.; Gómez-Pérez, A.; González-Cabero, R.; Suárez-Figueroa, M.C. \nTítulo: ODEval: a Tool for Evaluating RDF(S), DAM+OIL, and OWL Concept Taxonomies \nTipo de participación: Artículo \nCongreso: 1st IFIP Conference on Artificial Intelligence Applications and Innovations (AIAI 2004) \nPublicación: 1st IFIP Conference on Artificial Intelligence Applications and Innovations (AIAI 2004) \nLugar celebración: Toulouse, Francia \nFecha: Agosto 2004 \n \nAutores (p.o. de firma): Corcho, O.; García-Castro, R.; Gómez-Pérez, A. \nTítulo: Benchmarking ontology tools. A case study for the WebODE platform \nTipo de participación: Artículo \nCongreso: 4th International Conference on Language Resources and Evaluation (LREC 2004) \nPublicación: 4th International Conference on Language Resources and Evaluation (LREC 2004) \nLugar celebración: Lisboa, Portugal \nFecha: Mayo 2004 \n \nAutores (p.o. de firma): Gómez-Pérez, A.; Suárez-Figueroa, M.C. \nTítulo: Ontology Evaluation Functionalities of RDF(S), DAML+OIL, and OWL Parsers and Ontology Platforms \nTipo de participación: Artículo \nCongreso: 4th International Conference on Language Resources and Evaluation (LREC 2004) \nPublicación: 4th International Conference on Language Resources and Evaluation (LREC 2004) \nLugar celebración: Lisboa, Portugal \nFecha: Mayo 2004 \n \nAutores (p.o. de firma):Aguado de Cea, G.; Álvarez de Mon, I.; Gómez-Pérez, A.; Pareja-Lora, A. \nTítulo: OntoTag´s Linguistic Ontologies: Improving Semantic Web Annotations for a Better Language Understanding in \nmachines \nTipo de participación: Artículo \nCongreso: International Conference on Information Technology: Coding and Computing (ITCC 2004) \nPublicación: IEEE Commputer Society \nLugar celebración: Las Vegas, Nevada \nFecha: Abril 2004 \n \nAutores (p.o. de firma): Gómez-Pérez, A.; González-Cabero, R.; Lama, M. \nTítulo: A Framework for Design and Composition of Semantic Web Services \nTipo de participación: Artículo \nCongreso: AAAI Spring Symposium Series on Semantic Web Services \nPublicación:  \nLugar celebración: Stanford University, California, EEUU \nFecha: Marzo 2004 \n \nAutores (p.o. de firma): Gómez-Pérez, A.; Aguado de Cea, G.; Álvaro de Mon y Rego, I.; Fernández-López, M.; Corcho, \nO.; Manzano-Macho, D.; López-Cima, A. \nTítulo: Plataforma Tecnológica para la Web Semántica: ontologías, análisis de lenguaje natural y comercio electrónico \n(ContentWeb) \nTipo de participación: Artículo \nCongreso: X Conferencia de la Asociación Española para la Inteligencia Artificial, V Jornadas de Transferencia Tecnológica \nde Inteligencia Artificial (CAEPIA-TTIA 2003) Jornadas de Seguimiento de Proyectos en Tecnologías Informáticas \n(Inteligencia Artificial) \nPublicación: Asociación Española para la Inteligencia Artificial. Pp. 95-102 \nLugar celebración: San Sebastián, España \nFecha: Noviembre 2003 \n \nAutores (p.o. de firma): Corcho, O.; Gómez-Pérez, A.; Guerrero-Rodríguez, J.; Pérez-Rey, D.; Ruíz-Cristina, A.; Sastre-\nToral, T.; Suárez-Figueroa, M.C. \nTítulo: Evaluation Experiment of Ontology Tool’s Interoperability with the WebODE Ontology Engineering Workbench \nTipo de participación: Artículo \nCongreso: Second Evaluation of Ontology-based Tools Workshop (EON2003), Second International Semantic Web \nConference (ISWC2003) \n",
  "speaker": "SYSTEM",
  "uuid": "7af67835-109e-4532-bd57-11fc6f7ff8ca"
}