{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 3\nwhich specializes in coverage of concrete and/or named entities (i.e. people, \norganizations, numbers) and is used for HR applications [10]. Bizer et al present in \n[1] a scenario for supporting recruitment process with Semantic Web technologies but \njust within German Government. Mochol et al depict in [15] a brief overview of a \nSemantic Web application scenario in the Human Resources sector by way of \ndescribing the process of ontology development, but its final goal is to merge \nontologies. In [2] it is described a competency model and a process dedicated to the \nmanagement of the competencies underlying a resource related to e-recruitment \n(mainly CV or a Job Offer).  \nRegarding main standardization initiatives in the HR sector, the HR-XML \nconsortium has built up a library of more than 75 interdependent XML schemas \nwhich define the data elements for particular HR transactions, as well as options and \nconstraints governing the use of those elements [11]. \nFinally there is an effort described in [12] which mission is to promote technology \ninto HR/e- learning standards and applications. Its current focus topics includes: \nsemantic interoperability, semantic of HR-XML[11], etc. \n3 Methodological approach for Reusing Human Resources \nManagement Standards  \nIn this section we describe the adopted approach to build the SEEMP Reference \nOntology; a preliminary version is described in [7]. This methodological approach \nfollows and extends some of the identified tasks of the ontology development \nmethodology METHONTOLOGY [6]; this methodological approach consists of:  \n1. Ontology specification; in this activity we specify, using competency \nquestions, the necessities that the ontology has to satisfy in the new \napplication. \n2. Standards selection; in this activity we select the standards and existing \nontologies that cover most of the identified necessities. \n3. Semantic enrichment of the chosen standard; this activity states how we \nenrich semantically the chosen standard. \n4. Ontology evaluation; in this activity we evaluate the ontology content.  \n3.1 Ontology specification.  \nThis activity states why the ontology is being built, what its intended uses are, and \nwho the end-users are. For specifying the ontology requirements we used the \ncompetency questions techniques proposed in [8].  \n• \nIntended uses of the ontology. The purpose of building the Reference Ontology is \nto provide a consensual knowledge model of the employment domain that could \nbe used by ESs, more specifically within the ICT (Information and \nCommunication Technology) domain. \n• \nIntended users of the ontology. We have identified the following intended users \nof the ontology: candidates, employers, public or private employment search \n",
  "speaker": "SYSTEM",
  "uuid": "7b3d6901-577b-4365-96c8-348b623ca4c7"
}