{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 45\n43\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nto refer to biometric technology that identifies a particular individual’s voice, sometimes to describe a sys‐\ntem that has been trained to recognize a particular person’s voice. There is a difference between the act of\nauthentication (commonly referred to as speaker verification or speaker authentication) and identification.\nTypes of Speech Recognition Technology\nAlthough the ultimate goal of automatic speech recognition technology is to provide out of the box speaker\nindependent speech recognition services, right now we can classify ASR in three types: speaker independ‐\nent, speaker dependent and speaker adaptive. All models use mathematical and statistical formulas to yield\nthe best work match for speech.\nSpeaker independent\nASR recognizes the speech patterns of a large group of people and responds to many users; they are very\nattractive from commercial point of view. Currently, commercially available speaker independent systems\nare based on discrete or isolated word systems and recognize only specific, well‐enunciated single words.\nNow days there are many scenarios where it is not possible to adapt ASR to individual speakers, for exam‐\nple the call centres, where callers are unknown and speak only for a few seconds; thus still many routing,\npurchasing or transaction banking systems are based on discrete word systems. \nSpeaker dependent technologies\nIn these systems accuracy is paramount, and voice‐to‐text typically achieves this by having the user “train”\nthe software during setup and by adapting more closely to the user’s speech patterns over time. Speaker\ndependent models recognize speech patterns from only one person. This technology is seen in commercial\ndictation packages for medical, legal and business professional transcription. For example Dragon dictation\nor MacSpeech Scribe, which claim to have accuracy over 90%, recognize users` voices and speech patterns\nafter training. \nSpeaker adaptive technology\nThis is an emerging variation of the two models above. It usually begins with a speaker independent model\nand adjusts these models more closely to each individual during a brief training period. \nBoth speaker dependent and adaptive technologies are harder to implement as each person’s speech has\nunique spectral features. These models currently use connected word recognition or continuous systems to\nrespond to human normal speech. Connected word technology recognises each word in a limited vocabulary\nwhile continuous systems provide conversational speech recognition with large vocabulary and understand‐\ning the sentences; they are difficult to implement, and few exist.\n4.3 Speech Output or Text‐to‐Speech (TTS)\nSpeech output applications generate intelligible and natural sound speech over different machines or\ndevices enabling the conversion from text or machine‐readable format to verbally spoken language. A com‐\nputer system used for this purpose is called a speech synthesizer, and can be implemented in software or\nhardware. A text‐to‐speech (TTS) system converts normal text into speech; other systems render symbolic\nlinguistic representations like phonetic transcriptions into speech.\nThe quality of a speech synthesizer is judged by its similarity to the human voice and by its ability to be\nunderstood. An intelligible text‐to‐speech program allows people with visual impairments or reading disabil‐\nities to listen to written works on a home computer. Many computer operating systems have included\n",
  "speaker": "SYSTEM",
  "uuid": "7d3c941d-4fa2-4a51-86ee-60c0efe64b75"
}