{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 54\nPage 54 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n \nWP1 \nWP2 \nWP3 \nWP4 \nOntology Specialization \n \nReviewed \n \n \nOntology Specification \n \nReviewed \n \n \nOntology Summarization \n \n \n \nReviewed \nOntology Transforming \n \nReviewed \n \nReviewed  \nCommented \nOntology Translating \n \nReviewed \n \n \nOntology Update \nReviewed \nReviewed \n \n \nOntology Upgrade \nReviewed \n \n \n \nOntology Validation \nReviewed \nCommented \nReviewed \n \n \nOntology Valuation \n \nReviewed \n \nReviewed \nCommented \nOntology Verification \n \nReviewed \n \n \nOntology Versioning \nReviewed \n \n \n \n \n6. To publish the final results in the NeOn website8 and in a public wiki page and to establish the \nprocedure for getting feedback from the ontology community, using the argumentation tool \n“Cicero”.   \nAfter finishing the NeOn Glossary of Activities and delivering the present deliverable, we will \npublish the NeOn Glossary of Activities in the NeOn website and delve into the idea of \nobtaining feed-back from the ontology engineering community (outside NeOn). We plan to \ncreate a public wiki page with all the activities in the glossary to obtain comments from other \npeople. We will to use the argumentation tool “Cicero” (to be included in D2.3.1 due in M20), \nwhich is already a wiki, so that the OE community could comment on the activity definitions for \nabout a year. The long term goal is to have a more complete and consensuated glossary, \nwhich could become the terminological reference in the field. \n7. To propose the standardization of the NeOn Glossary of Activities. If the OE community \nsupports the activity of providing feedback on the NeOn Glossary, then we could think of \napproaching IEEE or W3C for the standardization of the NeOn Glossary of Activities. \nFigure 19 shows the history of the consensus reaching process, including the main results in each \ntime point. \n                                                 \n8 http://www.neon-project.org/ \n",
  "speaker": "SYSTEM",
  "uuid": "7e4afb6c-12cd-453c-af77-9e1d98099821"
}