{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 8\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11157\nCAPÍTULO II\nDisposiciones generales de las ayudas para la formación de personal investigador\nArtículo 17.  Requisitos de los solicitantes.\n1.  Los solicitantes deberán acreditar estar en posesión del título o superado los \nrequisitos para acceder a las enseñanzas de tercer ciclo o a los estudios Oficiales de \nPosgrado, conforme a alguna de las siguientes ordenaciones universitarias:\na)  Estudios de tercer ciclo regulados por el Real Decreto 778/1998, de 30 de abril, \npor el que se regula el tercer ciclo de estudios universitarios, la obtención y expedición del \ntítulo de Doctor y otros estudios de postgrado: Haber finalizado los estudios conducentes \nal Título oficial español de Licenciado, Ingeniero o Arquitecto.\nb)  Estudios Oficiales de Posgrado regulados por el Real Decreto 56/2005, de 21 de \nenero, por el que se regulan los estudios oficiales de postgrado o por el Real Decreto \n1393/2007, de 29 de octubre, por el que se establece la ordenación de las enseñanzas \nuniversitarias oficiales:\n1.º  Haber finalizado los estudios conducentes al título oficial español de Licenciado, \nIngeniero o Arquitecto.\n2.º Haber finalizado los estudios conducentes al título oficial español de Diplomado, \nIngeniero Técnico y Arquitecto Técnico, y tener superados al menos 60 créditos de \nposgrado.\n3.º  No haber finalizado los estudios conducentes al título oficial español de Licenciado, \nIngeniero o Arquitecto, y tener superados 300 créditos entre grado y posgrado, de los \ncuales al menos 60 correspondan a posgrado.\nc)  En el caso de los solicitantes que hayan obtenido el título o realizado los estudios \nque den acceso al doctorado conforme a sistemas educativos extranjeros, se estará a lo \ndispuesto en el artículo 16 del Real Decreto 1393/2007, de 29 de octubre.\n2.  La fecha de finalización de estudios, considerándose como aquella en la que se \nacredite que se han superado todas las materias y requisitos académicos que constituyen \nel programa completo de las titulaciones que se indican a continuación, deberá ser:\na)  Posterior al 1 de enero de 2006, en el caso de licenciados, ingenieros y arquitectos \no equivalente en sistemas universitarios extranjeros. En el caso de estudios no finalizados \n(licenciados, arquitectos o ingenieros) el último requisito o asignatura que le haya dado \nacceso al posgrado deberá ser posterior al 1 de enero de 2006.\nb)  Posterior al 1 de enero de 2005, en el caso de diplomados, ingenieros técnicos y \narquitectos técnicos o equivalente en sistemas universitarios extranjeros.\nc)  Anterior a las señaladas anteriormente y posterior al 1 de enero de 2002, en los \nsiguientes casos:\n1.º  Los que se encuentren en posesión del título oficial de la especialidad en Medicina, \nFarmacia, Biología, Química o Psicología que en el momento de solicitar la ayuda estén \nen posesión del título Oficial de Especialidad Médica (MIR) o Farmacéutica (FIR) o cuenten \ncon el Certificado Oficial de Especialidad en Biología (BIR), Química (QUIR) o Psicología \n(PIR).\n2.º  Los que se hayan dedicado a la atención y cuidado de hijos menores de seis \naños, entre el 1 de enero de 2002 y el 1 de enero de 2006.\n3.  También podrán ser solicitantes quienes estén en disposición de obtener el título o \nreunir los requisitos para acceder a las enseñanzas de tercer ciclo o a los estudios Oficiales \nde Posgrado, de acuerdo a lo indicado en el apartado 1 anterior, en la fecha que se indique, \nen su caso, en las disposiciones específicas de cada subprograma.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "7e8d0667-8477-4f91-9733-539a1dad2c1b"
}