{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 15\nbut the techniques are independent of the target stream query language, al-\nthough issues of stream data model and language evaluation semantics would\nneed to be considered for each case. Finally the prototype implementation, which\nextends ODEMapster, has shown the feasibility of the approach. This work con-\nstitutes a ﬁrst eﬀort towards ontology-based streaming data integration, relevant\nfor supporting the increasing number of sensor network applications being de-\nveloped and deployed in the recent years. The extensions presented in this paper\ncan be summarised in Table 1.\nAlthough we have shown initial results querying the underlying snee engine\nwith basic queries, we expect to consider in the near future more complex query\nexpressions including aggregates, and joins involving both streaming and stored\ndata sources. Another important strand of future work is the optimisation of\ndistributed query processing [17] and the streaming queries [5,6]. It is also our\ngoal to provide a characterisation of our algorithms. In the scope of a larger\nstreaming and sensor networks integration framework, we intend to achieve the\nfollowing goals: i) integrating streaming and stored data sources through an on-\ntological uniﬁed view; ii) combining data from event-based and acquisition-based\nstreams, and stored data sources; iii) considering quality-of-service requirements\nfor query optimisation and source selection during the integration. The present\nwork can be considered as a ﬁrst step to our goal of providing an ontology-based\nintegration platform for continuous heterogeneous data sources.\nExtension\nBase Approach Summary\nsparqlStream\nsparql 1.1\nWindow deﬁnitions with variable upper boundary\nWindow-to-stream operators\nS2O\nR2O\nStream deﬁnitions in mapping\nStreaming data types\nVirtual rdf stream iris\nODEMapster Translation of sparqlStream queries into sneeql\nTable 1. Summary of key contributions.\nAcknowledgments This work has been supported by the European Commis-\nsion project SemSorGrid4Env (FP7-223913). We also thank Alvaro A. A. Fer-\nnandes, Ixent Galpin, and Norman W. Paton, from the University of Manchester,\nfor their valuable ideas and suggestions.\nReferences\n1. Barrasa, J., Corcho, O., G´omez-P´erez, A.: R2O, an extensible and semantically\nbased database-to-ontology mapping language. In: SWDB2004. (2004) 1069–1070\n2. Bizer, C., Cyganiak, R.: D2RQ . Lessons Learned. W3C Workshop on RDF Access\nto Relational Databases (October 2007)\n3. Sahoo, S.S., Halb, W., Hellmann, S., Idehen, K., Jr, T.T., Auer, S., Sequeda, J.,\nEzzat, A.: A survey of current approaches for mapping of relational databases to\nRDF. W3C (January 2009)\n15\n",
  "speaker": "SYSTEM",
  "uuid": "7f1df5ca-7bfb-4f8d-a33c-87bbda84afff"
}