{
  "message": "SYSTEM: Cicyt_Vilches.pdf: Página 22\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \nCURSOS DE POSTGRADO: \n \n \n2003 – 2004 Máster de Dirección de Proyectos GIS. Organizado por el Departamento de Proyectos y Planificación \nRural (EUIT Forestal) de la Universidad Politécnica de Madrid y la Fundación Grupo EP. En colaboración con ESRI \n– España Geosistemas, S.A. (600 horas de duración). \n \n2003 – 2004 Certificado de Aptitud Pedagógica (C.A.P.). Universidad Complutense. Madrid. \n \nTRABAJOS DIRIGIDOS: \n \n \nCo-tutor del trabajo “Diseño de un sistema de información geográfica para la gestión agronómica de una finca \ndedicada al cultivo vitivinícola”. Marta Civit Andreu. Facultad de Informática, Universidad Politécnica de Madrid \n(2009). \n \nEXPERIENCIA DOCENTE: \n \n \nCurso de Infraestructura de Datos Espaciales y su puesta en marcha con herramientas Opensource. Organizado \npor el Instituto Geográfico Nacional, Agencia Española de Cooperación Internacional para el Desarrollo (AECID)  y \nUPM. Duración: 02 – 27/ 11/2009. Docencia impartida: 7 horas \n \nCurso de Infraestructura de Datos Espaciales. Organizado por Geográfico Nacional, Agencia Española de \nCooperación Internacional para el Desarrollo (AECID)  y UPM. Duración: 30/06 al 24/07/2008. Docencia impartida: \n4 horas \n \nCurso de Infraestructura de Datos Espaciales. . Organizado por el Instituto Geográfico Nacional, Agencia Española \nde Cooperación Internacional para el Desarrollo (AECID)  y UPM. Duración: 03 - 27/07/2007. Docencia impartida: \n6 horas. \n \nCurso de Doctorado sobre Infraestructuras de Datos Espaciales. Seminario sobre Tesauros y Ontologías en \nentornos geográficos. EUIT Topografía – Universidad Politécnica de Madrid.  26/01/2006. Docencia impartida: 7 \nhoras \n \nCurso de Infraestructura de Datos Espaciales. . Organizado por el Instituto Geográfico Nacional, Agencia Española \nde Cooperación Internacional para el Desarrollo (AECID)  y UPM. Duración: 03 \n– \n28/07/2006. \nDocencia \nimpartida: 4 horas \n \nXVI Curso sobre Usos y Aplicaciones del Catastro. Impartido por el  Instituto de Estudios Fiscales Y Agencia \nEspañola de Cooperación Internacional para el Desarrollo (AECID). Duración: 05//06 al 30/06/2006.  \n \nCurso “Modelado de Datos Vectoriales”. Organizado por la Subdirección General de Aplicaciones Geográficas del \nInstituto Geográfico Nacional. Octubre, 2006. Madrid. Docencia impartida: 1 hora. \n \nI curso sobre \"Creación de metadatos con la herramienta CatMdEdit del IGN\" subvencionado por el Ministerio de \nFomento. Impartido en la E.T.S.I. en Topografía, Geodesia y Cartografía de la Universidad Politécnica de Madrid. \nCon una sesión titulada: “Tesauros y Ontologías”. 25 Octubre. Madrid. 2005. Duración: 2 horas \n \nPREMIOS: \n \nMiembro del grupo de trabajo de la Infraestructura de Datos Espaciales de España  (IDEE) galardonado con el \npremio al proyecto o iniciativa tecnológica en el sector público. Otorgado por la Asociación Española de Usuarios \nde Telecomunicaciones y de la Sociedad de la Información (AUTELSI). 12 de Noviembre de 2005. Madrid. \n \nCHARLAS INVITADAS: \n \n \nParticipación en la mesa redonda “Experiencias de posgrado en la geografía”. Jornadas del Plan de Innovación \nTutorial (PIT) de la Licenciatura de Geografía. Universidad de Granada. Enero, 2008. Granada. \n \nParticipación como ponente en el Workshop “Ontologies for Sustainable Development”. Organizado por el proyecto \nIDEDES – CYTED 606AC0294 Project, en el marco del Second International Conference on Geospatial Semantics \n(GeoS 2007). 28th November. Mexico City (Mexico). \n",
  "speaker": "SYSTEM",
  "uuid": "7fcf459a-cde4-40f7-8e2b-4b762862a75f"
}