{
  "message": "SYSTEM: Cicyt_Asun-19-05-10.pdf: Página 61\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \n• \nDirectora del Departamento de Inteligencia Artificial de la Facultad de Informática de la Universidad Politécnica de \nMadrid desde el 4 de diciembre de 2008. \n• \nCoordinadora del Máster de Investigación en Inteligencia Artificial que se imparte en la Facultad de Infomática de la \nUniversidad Politécnica de Madrid desde el 4 de diciembre de 2008. \n• \nCoordinadora del Máster Universitario en Inteligencia Artificial por la Universidad Politécnica de Madrid , verificado por \nANECA el 13-1-2010.  \n• \nPresidenta de la Comisión de Doctorado del Departamento de Inteligencia Artificial de la Universidad Politécnica de \nMadrid de la Universidad Politécnica de Madrid desde el 4 de diciembre de 2008. \n• \nMiembro del Comité Técnico de Normalización de la Asociación Española de Normalización y Certificación (AENOR) \nnúmero 148 (AEN/CTN148) sobre Información Geográfica y participa en el Grupo de Trabajo de desarrollo de la norma \nISO 19150. \n• \nAdjunta a la coordinación en el Área de Transferencia de Tecnología de la Agencia Nacional de Evaluación y \nProspectiva ANEP desde el 1 de noviembre de 2006 hasta el 15 de diciembre de 2008 \n• \nMención honorífica al mejor libro de texto por “Ontological Engineering: with Examples from Areas of Knowledge \nmanagement, e-Commerce and the Semantic Web”. Organismo: Fundación General de la UPM  28 enero 2005. \n• \nImpartida charla titulada “Ontological Engineering and Semantic Web. Languages, tools and applications” en el Instituto \nde Salud Carlos III, Madrid. 24-27 Septiembre 2007. \n• \nConferencia invitada titulada “Ontological Engineering and the Semantic Web” en la Universidad de La Coruña. España  \n24/07/2007 \n• \nConferencia invitada titulada “NeOn development process and life cycle” en la Universidad de Santiago de Compostela. \nEspaña  24/07/2007 \n• \nConferencia invitada titulada “Gestión Semántica de Contenidos” en el Seminario Interdisciplinar, Interuniversitario e \nInternacional de Historia, Informática y Traductología”. Córdoba, España  20/06/2006 \n• \nConferencia invitada titulada “Proyectos de la Web Semántica”. SICFIMA. Facultad de Informática UPM. 17 de marzo \nde 2006. \n• \nEntrevistada por el periódico “El heraldo de Aragón”. La entrevista fue publicada el 7 de marzo de 2006. \n• \nConferencia invitada titulada “Web Semántica” en el Ciclo de Conferencias de Ibercaja Zentrum. Zaragoza, España. \nFebrero 2006. I+DEAR, Semanario de El periódico de Aragón publicó el 23 de febrero de 2006 un artículo sobre esta \nconferencia invitada.  \n• \nImpartido Seminario Uso de lenguajes documentales en la web semántica. SEDIC Madrid Diciembre 2005. \n• \nImpartida Tutoría Ontologías: metodologías, herramientas, lenguajes y aplicaciones en CAEPIA 2005. \n• \nRevisión de artículos de  Revistas: \n- \nSpecial Issue sobre Organizational Memory and Knowledge Management for the International Journal of Human-\nComputer Studies/Knowledge Acquisition. 1999 \n",
  "speaker": "SYSTEM",
  "uuid": "8002c823-aa4d-4e0b-a995-a27a2bdfac37"
}