{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 5\n3.3 Semantic enrichment of the chosen standard. \nThis activity states how we enrich the human resources management standards. In \norder to make possible the enrichment of the standards, it was necessary to import \nthem into the ontology engineering tool WebODE [6]. This process consists of \nimplementing the necessary conversions mechanisms for transforming the standards \ninto WebODE’s knowledge model. For this purpose we have developed for each \nstandard/classification an ad hoc translator (wrapper) that transformed all the data \nstored in external resources into WebODE’s knowledge model.  \n \nOnce we transformed the standards into ontologies, the next step is to enrich them \nintroducing concept attributes and ad hoc relationships between ontology concepts of \nthe same or different taxonomies. We perform this task, doing the following. We \ncreated from scratch the Job Seeker Ontology (models the job seeker and his/her CV \ninformation), and the Job Offer Ontology (models the job vacancy, job offer and \nemployer information); following some HR-XML[11] recommendations. Moreover, \nwe defined relationships between the concepts of the Job Seeker and Job Offer \nOntologies and the concepts defined on the standard (classification) based ontology. \n3.4 Ontology Evaluation. \nThe evaluation activity makes a technical judgment of the ontology, of its associated \nsoftware environments, and of the documentation. We will evaluate the Reference \nOntology using the competency questions identified in the first task. \n4 SEEMP Reference Ontology \nThe Reference Ontology, described in this section, will act as a common “language” \nin the form of a set of controlled vocabularies to describe the details of a job posting \nand the CV of a job seeker. The Reference Ontology was developed following the \nprocess described in detail in section 3 and with the ontology engineering tool \nWebODE [6]. The Reference Ontology is composed of thirteen modular ontologies: \nCompetence, Compensation, Driving License, Economic Activity, Education, \nGeography, Job Offer, Job Seeker, Labour Regulatory, Language, Occupation, Skill \nand Time. The main subontologies are the Job Offer and Job Seeker, which are \nintended to represent the structure of a job posting and a CV respectively. While these \ntwo subontologies were built taking as a starting point some HR-XML [11] \nrecommendations, the other subontologies were derived from the available \ninternational standards (like NACE, ISCO-88 (COM), FOET, etc.) and ES \nclassifications and international codes (like ISO 3166, ISO 6392, etc.) that best fit the \nEuropean requirements. Figure 1 presents: \n• \nThese thirteen modular ontologies (each ontology is represented by a triangle). \nTen of them were obtained after wrapping the original format of the \nstandard/classification, using ad hoc translator or wrapper for each \nstandard/classification. \n",
  "speaker": "SYSTEM",
  "uuid": "8086f7b5-5724-4a6e-ad69-e29b484bb64b"
}