{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 32\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 32 de 42 \n24. Jiménez A, Amparo Casado, Javier Bajo, Fernando De la Prieta and Juan F. De Paz. \nLabor Integration of Deaf People Through a Cloud-based Platform. Vol. 12, Issue 1, pp. \n166-175. ISSN: 0974-0635. International Journal of Artificial Intelligence (IJAI). March \n2014. \n25. Llaves A, Fernández JD, Corcho O. Towards efficient processin of RDF Data Streams. \n3rd International Workshop on Ordering and Reasoning (OrdRIng 2014) collocated with \nISWC2014. Riva del Garda, Italia. 2014. \n26. Llaves A, Fernández JD, Corcho O. Map4RDF-iOS: a tool for exploring Linked \nGeospatial Data. Linking Geospatial Data – W3C Workshop. Shoredithc, Reino Unido. \nMarzo 2014. \n27. Llaves A, Kuhn W. An Event Abstraction Layer for the Integration of Geosensor Data. \nInternational Journal of Geographical Information Science. Taylor & Francis. Feb. 2014. \n28. Lozano-Rubí R, Pastor X, Lozano E. OWLing Clinical Data Repositories With the \nOntology Web Language. JMIR Med Inform. 2014. \n29. Mihindukulasooriya N, Esteban-Gutiérrez M, García-Castro R. A Linked Data Platform \nadapter for the Bugzilla issue tracker. 13th International Semantic Web Conference \n(ISWC2014). Riva del Garda, Italia. Octubre 2014. \n30. Mihindukulasooriya N, García-castro R, Esteban-Gutiérrez M. Seven Challenges for \nRESTful transaction models. 5th International Workshop on Web APIs and RESTful \nDesign (WS-REST 2014). ISBN: 978-1-4503-2745-9. Sydney, Australia. Abril 2014. \n31. Mihindukulasooriya N, Priyatna F, Corcho O, García Castro R, Esteban Gutiérrez M. \nMorph-LDP: An R2RML-based Linked Data Platform implementation (demo). 11th \nExtended Semantic Web Conference (ESWC2014). Creta, Grecia. Mayo 2014. \n32. Montiel-Ponsoda E, Aguado-de-Cea G. Applying the lexical constructional model to \nontology building. Libro: Language Processing and Grammars. The role of the \nfunctionally oriented computational models. Nolan B & Periñán-Pascual C (eds). 2014. \nISBN: 978-90-272-5915-8. \n33. Nguyen, N.-T., Kowalczyk, R., Corchado, J.M., Bajo, J. (Eds.). LNCS Transactions on \nComputational Collective Intelligence (LNCS TCCI). Vol. 8670: Special Issue PAAMS \n12/13. ISBN: 978-3-662-44749-9. Springer Verlag (Berlin). October 2014. \n34. Poveda-Villalón M, García-Castro R, Gómez-Pérez A. Building an Ontology Catalogue \nfor Smart cities. 5th workshop on EeB Data Models at ECPPM 2014. Viena, Austria. \nSeptiembre 2014. \n35. Poveda-Villalón M, García-Castro R, Gómez-Pérez A. An Ontology Catalogue for Smart \ncities. Building knowledge workshop. Graz, Austria. Septiembre 2014. \n36. Poveda-Villalón M, Radulovic, F, García-Castro R. Developing Ontologies for \nRepresenting Data about Key Performance Indicators. The 2nd eeBuilding Key \nPerformance Indicators Workshop (KPIs). Niza, Francia. Octubre 2014. \n37. Poveda-Villalón M, Suárez-Figueroa MC, Mateos A, Gómez-Pérez A, Fernández-López \nM. OOPS! (OntOlogy Pitfall Scanner!): An On-line Tool for Ontology Evaluation. \nInternational Journal on Semantic Web and Information Systems. ISSN: 1552-6283. Vol \n10(2). Octubre 2014. \n38. Poveda-Villalón M, Suárez-Figueroa MC, Gómez-Pérez A. OOPS! (OntOlogy Pitfall \nScanner!): An On-line Tool for Ontology Evaluation. EUON 2014. Amsterdam, Holanda. \nOctubre 2014. \n39. Priyatna F, Corcho O, Sequeda J. Formalisation and Experiences of R2RML-based \nSPARQL to SQL query translation using Morph. WWW2014. ISBN: 978-1-4503-2744-2. \nACM. Abril 2014. \n40. Radulovic F, García-Castro R, Gómez-Pérez A. SemQuaRE – An extensión of the \nSQuaRE quality model for the evaluation of semantic techonologies. Computer \nStandards & Interfaces. Dragan S. Domazet. Vol 38. Feb. 2015. \n41. Rodríguez S, Juan F. De Paz, Javier Bajo, Carolina Zato and Juan M. Corchado (Eds.). \nVol. 12, Num 1 (2014): Special Issue on Artificial Intelligence and Distributed Systems. \nInternational Journal of Artificial Intelligence (IJAI). ISSN: 0974-0635. CESER \nPublications. Timisoara (Romania). March 2014. \n42. Rodriguez S, Juan F. De Paz, Fernando de la Prieta, Javier Bajo, and Juan M. \nCorchado (Eds.). Vol. 12, Num 1 (2014): Special issue on Artificial Intelligence in \nRobotics and Imaging. International Journal of Imaging and Robotics (IJIR). ISSN: 2231 \n– 515X. CESER Publications. Timisoara (Romania) . March 2014. \n",
  "speaker": "SYSTEM",
  "uuid": "80a1d1bf-2573-4741-aa4b-5d1e3ae99242"
}