{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 27\n25\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• A clear distinction between the way IP rights are treated for the text to be translated (the Source), the\ntranslation (the Target) and Translation Data as a new legal entity. \n• Translation Data are defined as a database containing terms, phrases and segments of text, aligned\nbetween two or more languages. Translation Data in most cases contain phrases and segments from\nmany Sources and Targets. If the database allows users to reconstruct the Source or Target, as referred\nto in the first principle here above, this will be considered an infringement on the IP rights assigned to\nthe Source and Target.\n• IP rights to the Source and Target may be held exclusively by the author, the translator or the compa‐\nny that is publishing the Source and Target.\n• Translators and translation companies should be allowed to store, share and aggregate Translation Data\nfor the purposes of developing derivative work, leveraging and reusing translations, research, and\nimproving their services. \n• The translator or the company that aggregates the Translation Data holds IP rights to the Translation\nData in the form in which the data are stored and used in the database.  \n• Owners of Source and Target should know that they can legally protect their documents from copying\nwhen they publish on the web. \nCompetition\nThe LT market is now extremely competitive, with many small players and a few very large and very power‐\nful participants. There are threats to small companies in all areas of LT (though not necessarily to the indus‐\ntry itself):\n• in semantics and analytics, where the global software companies are all engaged, and most are devel‐\noping cloud services that give them more reach\n• in translation, where the divide between professional services (the traditional industry) and casual\ntranslation (typified by Google and Bing online translators) is slowly eroding, and competition from new\nentrants (in the USA and in Asia) has accelerated\n• in speech, where a small number of technology suppliers service most of the market in the US and\nEurope, inhibiting access for small companies, or new entrants.\nA healthy industry full of competitive innovators is desirable and will grow the market, particularly in Europe\nwhere attention to under‐served European languages will flourish in the hands of “local” companies.\nHowever, the scale now required to compete indicates a strong need for collaborative approaches to the\nmarket. Small innovators may have more opportunities in leading‐edge unified LT markets, where combin‐\ning forces may give competitive advantage.\nInvestment Climate\nIn spite of persistent complaints that venture capital is scarce in Europe, this has not been observed as a par‐\nticular problem for LT companies, many of which have found sources of funding. However, it is not clear\nwhether growth paths for small European LT companies have really been tested against the realities of the\nclimate, i.e. whether ambitions to scale have been thwarted or simply not tried. Taking advantage of men‐\ntoring and other support features of the investment community is advisable and may not be fully exploited,\nwhich may in turn hold some companies back from their true potential.\nTalent Scarcity\nA study by EMC reports that 65% of data science professionals believe demand for data science talent will\noutpace the supply over the next 5 years – with most feeling that this supply will be most effectively sourced\nfrom new graduates. But there are few degree programmes or even training regimes for data scientists (per‐\n",
  "speaker": "SYSTEM",
  "uuid": "83b6f46b-a761-4abc-bc2c-eae1e74e04f0"
}