{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 61\nBÚSQUEDA \n \n61 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nredundancias (cuando vuelve a aparecer un estado que ya ha sido examinado; \nnótese que esto puede darse tanto en grafos dirigidos acíclicos como en otros que \ntengan ciclos dirigidos) y, sobre todo, puede entrar en bucles infinitos si los estados \nobjetivos no son alcanzables y hay ciclos dirigidos. Si eliminamos la línea 7' \n(manteniendo la 7'') este último problema no puede darse, pero un estado puede ser \nexaminado varias veces (puesto que puede aparecer en dos nodos distintos de \nABIERTOS). En conclusión, la versión con las dos líneas tiene las siguientes \npropiedades en el caso de la búsqueda en anchura: \n• \nCada estado del espacio de estados es examinado, a lo más, una vez. \n• \nSi existe solución, encuentra una de longitud mínima, independientemente del \ntipo de espacio de estados de que se trate (árbol, grafo dirigido acíclico, grafo \ndirigido o no-dirigido y cada uno de ellos finito o infinito). \n• \nSi no existe solución, siempre terminará la ejecución salvo en el caso (inevitable \npara las estrategias exhaustivas) en el que el espacio de estados es infinito. \nComo se ve las propiedades teóricas de la búsqueda en anchura en grafo son \nbastante buenas. Si embargo, no hay que olvidar que dicha mejora tiene un precio \nen cuanto al coste en tiempo (gestión de CERRADOS y algoritmos de búsqueda en \nABIERTOS y CERRADOS) y, sobre todo, en espacio (la lista CERRADOS siempre \naumenta, nunca se eliminan elementos de ella), por lo que si sabemos que el \nespacio de estados es un árbol será preferible utilizar la versión inicial. Por ejemplo, \nsería un derroche utilizar esta versión que acabamos de dar con la representación \nelegida para el problema de las n reinas. \nEste algoritmo de búsqueda en grafo permite clasificar a los estados en cuatro \nclases. En un instante cualquiera del proceso de búsqueda, distinguimos 4 tipos de \nestados: \n• \nLos estados todavía no generados (que, por tanto, no aparecen asociados a \nningún nodo de ABIERTOS ni están en la lista CERRADOS). Estos estados \npodemos considerar que tienen una existencia \"potencial\", puesto que hasta que \nno es generado un estado no aparece en ABIERTOS ni forma parte de \nCERRADOS. En general, muchos estados del espacio de estados no llegarán a \nser nunca generados en el proceso de búsqueda. \n• \nLos estados ya generados, pero todavía no examinados. Son aquéllos que \naparecen en nodos de ABIERTOS. \n",
  "speaker": "SYSTEM",
  "uuid": "84a9e227-246c-45e1-986d-f514be998d6e"
}