{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 8\n2.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n2. Solución II\n2.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n2.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n2.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­8­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN II (marque esta casilla para habilitar los campos asociados a la solución II)\nversión 1.2.\n#\nDebido a la creciente aceptación   de las tecnologías semánticas,   las ontologías  son cada \nvez más   adoptadas en desarrollos de proyecto software. Como resultado, se han \ndetectado nuevos desafíos  para los equipos que tienen que trabajar en tareas habituales \nde ingeniería ontológica   y las prácticas   de desarrollo de software. Entre estos desafíos se \nencuentra la adaptación   de los proyectos de desarrollo de ontologías  a los entornos \ncolaborativos y geográficamente   distribuidos habituales en los desarrollos de software.  \n \nEl Ontology Engineering Group es un grupo de investigación   de referencia en tecnologías \nsemánticas   que en los últimos   20 años   ha desarrollados las principales metodologías para \ndesarrollo de ontologías llamadas METHONTOLOGY y NeOn. Una de las características \nde la metodología NeOn que tiene en cuenta el desarrollo colaborativo y distribuido de \nontologías en la definición de sus procesos y actividades. Con el objetivo de abordar los \ndesafíos relacionados con las actividades de apoyo al desarrollo de ontologías, más \nespecíficamente documentación, evaluación, publicación   y control de versiones, en el \nOntology Engineering Group (OEG) se ha diseñado, desarrollado y desplegado OnToology \n(http://ontoology.linkeddata.es/).  \n \nOnToology es una herramienta online que da soporte al desarrollo colaborativo de \nontologías en entornos git y que actualmente está   integrada con el entorno GitHub \n(http://github.com/). Además   de las ventajas obtenidas de la integración con GitHub, las \nfuncionalidades de OnToology vienen soportadas por una suite de herramientas y \nservicios desarrollados dentro del OEG (por ejemplo, OOPS! OntOlogy Pitfall Scanner!, \nWidoco, AR2DTOOL), así como por servicios externos (por ejemplo, w3id.org \n(http://w3id.org/)). A continuación   se describen de manera detallada las funcionalidades \nde OnToology: \n \n- Documentación: generación de documentación en formato HTML a partir de ficheros de \ndescripción de ontologías en el lenguaje OWL. El sistema es compatible con ficheros de \ndescripción de ontologías que sigan el formato RDF/XML o su versión más legible y abreviada \nTurtle. Esta documentación   es generada mediante la integración de Widoco \n(https://w3id.org/widoco/). \n- Evaluación: Evaluación   de ontologías en base a la aparición   de malas prácticas   o errores \ncomunes que suelen cometer los desarrolladores de ontologías. El sistema genera una \nevaluación mostrada en HTML mediante la integración   del sistema de evaluación   de \nontologías OOPS! (http://oops.linkeddata.es/). El informe de evaluación generado clasifica \nlos tipos de errores según su importancia en “critical”, \n“important” \ny “minor” \nindicando \nlos elementos de la ontología en los que se ha detectado para todos los casos posibles. \n- Generación de diagramas: AR2DTOOL (https://github.com/idafensp/ar2dtool) es un \nsistema para la generación de diagramas a partir de modelos y datos escritos en RDF. \nPartiendo de los datos o el modelo en RDF, el sistema permite obtener un fichero fuente \nen un formato estándar (estilo GraphML) que contiene un diagrama base con la información \nintroducida. Este diagrama podrá luego ser editado libremente por el usuario para \n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "85beef47-680e-4370-984f-ab1e0009dc5d"
}