{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 16\n10. J. Cohen. A coefﬁcient of agreement for nominal scales. Educational and Psychological\nMeasurement, 20(1):37–46, April 1960.\n11. R. Costanza and A. Voinov. Modeling ecological and economic systems with stella: Part iii.\nEcological Modelling, 143(1-2):1–7, October 2001.\n12. M. d’Aquin. Formally measuring agreement and disagreement in ontologies. In Proc. of\nthe 5th International Conference on Knowledge Capture (K-CAP 2009), pages 145–152,\nSeptember 2009.\n13. M. d’Aquin, C. Baldassarre, L. Gridinoc, S. Angeletou, M. Sabou, and E. Motta. Character-\nizing knowledge on the semantic web with Watson. In 5th International EON Workshop, at\nISWC’07, Busan, Korea, November 2007.\n14. M. Dehghani and K. Forbus. QCM: A QP-based concept map system. In J. ˘Zabkar and\nI. Bratko, editors, the 23nd International Workshop on Qualitative Reasoning (QR09), pages\n16–21, Ljubljana, Slovenia, June 2009.\n15. J. Euzenat. An API for ontology alignment. In 3rd International Semantic Web Conference\n(ISWC’04), Hiroshima (Japan). Springer, November 2004.\n16. J. Euzenat and P. Shvaiko. Ontology matching. Springer-Verlag, 2007.\n17. K. D. Forbus, K. Carney, B. L. Sherin, and L. C. UreelII. Vmodel: A visual qualitative mod-\neling environment for middle-school students. In Proc. of the 16th Conference on Innovative\nApplications of Artiﬁcial Intelligence, San Jose, California, USA, pages 820–827, July 2004.\n18. J. Gracia and E. Mena. Ontology matching with CIDER: Evaluation report for the OAEI\n2008. In Proc. of 3rd Ontology Matching Workshop (OM’08), at ISWC’08, Karlsruhe, Ger-\nmany, volume 431, pages 140–146. CEUR-WS, October 2008.\n19. J. Gracia, R. Trillo, M. Espinoza, and E. Mena. Querying the web: A multiontology disam-\nbiguation method. In Sixth International Conference on Web Engineering (ICWE’06), Palo\nAlto, California, USA, pages 241–248. ACM, July 2006.\n20. B. Grau, I. Horrocks, B. Motik, B. Parsia, P. Patelschneider, and U. Sattler. Owl 2: The\nnext step for owl. Web Semantics: Science, Services and Agents on the World Wide Web,\n6(4):309–322, November 2008.\n21. W. Hu and Y. Qu. Falcon-ao: A practical ontology matching system. Journal of Web Seman-\ntics, 6(3):237–239, 2008.\n22. Z. Jeremic, J. Jovanovic, and D. Gasevic. Semantic web technologies for the integration of\nlearning tools and context-aware educational services. In 8th International Semantic Web\nConference (ISWC2009), October 2009.\n23. K. Leelawong and G. Biswas. Designing learning by teaching agents: The betty’s brain\nsystem. Int. J. Artif. Intell. Ed., 18(3):181–208, 2008.\n24. J. Liem and B. Bredeweg.\nOWL and qualitative reasoning models.\nIn C. Freksa,\nM. Kohlhase, and K. Schill, editors, KI 2006: Advances in Artiﬁcial Intelligence. 29th An-\nnual German Conference on AI, number 4314 in Lecture Notes in Artiﬁcial Intelligence,\npages 33–48, Bremen, Germany, 2007. Springer-Verlag Berlin Heidelberg.\n25. G. A. Miller.\nWordnet: A lexical database for english.\nCommunications of the ACM,\n38(11):39–41, November 1995.\n26. J. Novak and D. Gowin. Learning How to Learn. Cambridge University Press, 1984.\n27. T. Nuttle, P. Salles, B. Bredeweg, and M. Neumann. Representing and managing uncer-\ntainty in qualitative ecological models. Ecological informatics, 4(5-6):358–366, Novem-\nber/December 2009.\n28. E. Soloway, A. Z. Pryor, J. S. Krajcik, S. Jackson, S. J. Stratford, M. Wisnudel, and J. T.\nKlein. Scienceware’s model-it: Technology to support authentic science inquiry. Technolog-\nical Horizons on Education, 25(3):54–56, 1997.\n29. G. van Heijst, S. Falasconi, A. Abu-Hanna, G. Schreiber, and M. Stefanelli. A case study in\nontology library contruction. Artiﬁcial Intelligence in Medicine, 7(3):227–255, June 1995.\n",
  "speaker": "SYSTEM",
  "uuid": "87e62838-2440-43a7-b805-2198bf3bee1a"
}