{
  "message": "SYSTEM: EjerciciosL%C3%B3gicaDescriptiva.pdf: Página 2\nFormalizar en lógica descriptiva el modelo para un centro de datos que se describe a \ncontinuación y que se ilustra parcialmente en la figura:  \n‐ \nEn el contexto de los centros de datos hay dos conceptos fundamentales, que son el de \nDocumento y Plataforma, la cual a su vez puede ser una Aplicación o un Servidor. Entre las \naplicaciones que se manejan están los sistemas gestores de bases de datos, los servidores Web y \nlas máquinas virtuales. Entre los documentos que se manejan están, de manera no exhaustiva, \nlas instancias de bases de datos, los servlets, las máquinas virtuales y las páginas Web. Y entre \nlos servidores se encuentran los servidores físicos y los virtuales (de manera exhaustiva). \n‐ \nUn servidor virtual es un servidor que tiene la característica de estar localizado en una máquina \nvirtual. \n‐ \nLos sistemas gestores de bases de datos sólo pueden albergar  instancias de bases de datos. \n‐ \nLos servidores Web sólo pueden albergar servlets y páginas Web. \n‐ \nLos servidores físicos pueden ser servidores activos o inactivos. Los activos albergan alguna \nmáquina virtual y los inactivos no albergan nada. \n \nEsquema del modelo propuesto \nEn una situación dada se tiene la siguiente información recibida de los centros de datos:  \n‐ \nLa aplicación 1 y la aplicación 3 son servidores Web. \n‐ \nLa aplicación 2 y la aplicación 4 son sistemas gestores de bases de datos. \n‐ \nLos servidores 1 a 8 y el servidor A son servidores. El servidor 1, 3, 5 y 7 albergan las \nmáquinas virtuales VM1, VM2, VM3 y VM4 respectivamente. El servidor 2, 4, 6 y 8 albergan \nlas aplicaciones 1, 2, 3 y 4 respectivamente. \n‐ \nEl servidor A es un servidor del que no se tiene más información. \n‐ \nLas máquinas virtuales VM1, VM2, VM3 y VM4 son máquinas virtuales y albergan los \nservidores 2, 4, 6 y 8. \nSe quiere conocer cuáles son los servidores en los que están albergadas las aplicaciones 1 a \n4, cuáles de los servidores son servidores activos, cuáles virtuales y cuáles inactivos, y qué \naplicaciones o servidores albergan estos servidores, o por qué servidores o máquinas \nvirtuales son albergados. ¿Qué tipo de inferencias de las soportadas por el formalismo de \nlógica descriptiva serían necesarias para obtener esta información? No es necesario realizar \ntodas estas inferencias, sino que basta con describir textualmente el proceso que seguiría un \nrazonador para obtener esta información. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "889d6323-65a3-4060-ae39-c9ed35258105"
}