{
  "message": "SYSTEM: CV-Cicyt_Elena_Mar2016_v1_.pdf: Página 22\nTítulo: XVII Encuentro Internacional de la Asociación de Jóvenes Lingüistas \nTipo de actividad: congreso \nAmbito: internacional \n \nFecha: 18 – 20 de abril de 2002 \n \n \n \n \n \n \n \n \nExperiencia de gestión de I+D \nGestión de programas, planes y acciones de I+D \n \nTítulo:       \n \nTipo de actividad:       \nFecha:       \n \n \n \n \n \nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \n \nCONFERENCIAS INVITADAS \n \nRepresenting multilingual lexical and terminological information in RDF vocabularies. En Vocabulary Day -\nDCMI 2013 (Dublin Core Meradata Initiative), en septiembre de 2013, en Lisboa, Portugal.  \n \nWhat can ontologies do for translators? En Seminario de Traducción e Interpretación organizado por la \nHochschule Magdeburg-Stendal, el 18 de noviembre de 2011, en Magdeburgo, Alemania. \n \nBeneficios de las Ontologías en la Traducción, en las I Jornadas Científicas CES Felipe II “Últimas tendencias \nen Traducción e Interpretación”, organizadas por la Universidad Complutense de Madrid, del 7 al 9 de abril de \n2010, en Aranjuez, Madrid.  \n \nÜbersetzungstrategien – einige Überlegungen zur Definition, en simposio internacional “Übersetzen lehren \nund lernen”, organizado por la Fachhochschule Magdeburg-Stendal, del 1 al 2 de julio de 2005, en Magdeburgo, \nAlemania.  \n \nDOCTORADO: \n \nEnero 2011: Obtención del nombramiento de Doctor Europeo \n \nJunio 2007: Obtención de la Suficiencia Investigadora (Diploma de Estudios Avanzados) \n \nEnero 2007: Obtención de una beca de investigación de la Universidad Politécnica de Madrid, cofinanciada con \nel proyecto europeo Lifecycle support for networked ontologies (NeOn) (FP6-027595). \n \nCurso 2006-2007: Segundo curso del Doctorado en “Lenguas para Fines Específicos: un enfoque \nmultidisciplinar” del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la UPM. Periodo de \ninvestigación.  \n",
  "speaker": "SYSTEM",
  "uuid": "8e1cb00f-fa74-43af-b843-955389ee03af"
}