{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 36\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 36 de 42 \n18. Bajo Perez J; Fernando De la Prieta; Juan M. Corchado; Sara Rodríguez. A low-level \nresource allocation in an agent-based Cloud Computing platform. Applied Soft \nComputing. 48 - null, pp. 716 - 728. 12/2016. ISSN 1568-4946 \n19. Bajo Perez J; Andrew T. Campbell; Xia Zhou. Mobile Sensing Agents for Social \nComputing Environments. \"Trends in Practical Applications of Scalable Multi-Agent \nSystems, the PAAMS Collection.Advances in Intelligent Systems and Computing Vol. \n473, pp 157 - 167. ISSN: 2194-5357.\".pp. 157 - 167. ISBN 978-3-319-40158-4. Junio \n2016. \n20. Bajo Perez J; Maria Jose Escalona; Sylvain Giroux; Patrycja Hoffa-Dabrowsk; Vicente \nJulian; Paulo Novais; Nayat Sánchez Pi; Rainer Unland; Ricardo Azambuja Silveira. \nHighlights Practical Applications of Scalable Multi-Agent Systems. The PAAMS \nCollection. Springer Verlag, 2016. ISBN 978-3-319-39386-5 \n21. Bajo Perez J; TIancheng Li; Juan M. Corchado. Fitting for Smoothing: Continuous Track \nEstimation. \"2016 International Conference on Indoor Positioning and Indoor Navigation \n(IPIN)\".pp. 1 - 8. ISBN 978-1-5090-2426-1. Octubre 2016. \n22. Boch L, Víctor Rodríguez Doncel, Jaime Delgado, Silvia Llorente, Eva Rodríguez Luna. \nOverview of the MPEG-21 Media Contract Ontology. Semantic Web Journal. 01/2016. \n23. Bosque-Gil, J., Gracia, J., Montiel-Ponsoda, E., Aguado-de-Cea, G. 2016, May. \nModelling multilingual lexicographic resources for the Web of Data: The K Dictionaries \ncase. En GLOBALEX 2016 Lexicographic Resources for Human Language Technology \nWorkshop Programme, Portoroz, Eslovenia, p. 65 - 72. Mayo 2016. \n24. Bosque-Gil, J., Montiel-Ponsoda, E., Gracia, J., & Aguado-de-Cea, G. 2016, June. \nTerminoteca RDF: A Gathering Point for Multilingual Terminologies in Spain. En Term \nBases and Linguistic Linked Open Data, 12th International Conference on Terminology \nand Knowledge Engineering (TKE 2016), Copenhague, Dinamarca. 136-146. \n25. Calbimonte JP, Mora J, Corcho O. Query Rewriting in RDF Stream Processing. 13th \nESWC Conference (ESWC 2016). Hersonissos, Grecia. Junio 2016 \n26. Carneiro D; Dalila Alves DurÃEs; Javier Bajo Perez; Paulo Novais. Non-intrusive \nMonitoring of Attentional Behavior in Teams. Intelligent Distributed Computing X. \nStudies in Computational Intelligence series Vol. 678, pp. 153-162. ISSN: 1860-\n949X\".pp. 153 - 162. ISBN 978-3-319-48828-8. Octubre 2016. \n27. Casanovas P, Víctor Rodríguez, Jorge Conejero. The Role of Pragmatics in the Web of \nData. Pragmatics and Law. Practical and Theoretical Approaches. pp. 293 - 330. \nSpringer Verlag, 04/2016.Bosque-Gil, J., Gracia, J., Gómez-Pérez, Asunción. 2016, \nJuly. “Linked data in lexicography” Kernerman Dictionary News. ISSN 565-4745. Vol 24. \nPp. 19-24. Julio 2016 \n28. Chamoso P; Juan F. De Paz; Javier Bajo Perez; Gabriel Villarrubia. Intelligent Control \nof Energy Distribution Networks. \"Trends in Practical Applications of Scalable Multi-\nAgent Systems, the PAAMS Collection. Advances in Intelligent Systems and Computing \nVol. 473, pp 99 - 107. ISSN: 2194-5357.\".pp. 99 - 107. ISBN 978-3-319-40158-4. Junio \n2016. \n29. Chamoso P; Juan F. De Paz; Sara Rodriguez; Javier Bajo Perez. Smart Cities \nSimulation Environment for Intelligent Algorithms Evaluation. \"Ambient Intelligence- \nSoftware and Applications ? 7th International Symposium on Ambient Intelligence \n(ISAmI 2016). Advances in Intelligent Systems and Computing Vol. 476, pp 177 - 187. \nISSN: 2194-5357.\".pp. 177 - 187. ISBN 978-3-319-40113-3. Junio 2016. \n30. Chamoso P; Juan F. De Paz; Javier Bajo Perez; Gabriel Villarrubia; Juan M. Corchado. \nPredictive Analysis Tool for Energy Distribution Networks. \"Advances in Artificial \nIntelligence. 17th Conference of the Spanish Association for Artificial Intelligence, \nCAEPIA 2016, Salamanca, Spain, September 14-16, 2016. Proceedings.\".pp. 271 - \n279. ISBN 978-3-319-44635-6. \n31. Chamoso P; Javier Bajo Perez; Fernando De la Prieta; Juan M. Corchado. Conflict \nResolution with Agents in Smart Cities. Interdisciplinary Perspectives on Contemporary \nConflict Resolution. 244-262, IGI Global, 2016. ISBN 9781522502456 \n32. Demazeau Y; Takayuki Ito; Javier Bajo Perez; Maria Jose Escalona. Advances in \nPractical Applications of Scalable Multi-Agent Systems. The PAAMS Collec-\ntion.Springer Verlag, 2016. ISBN 978-3-319-39323-0 \n33. Fang Z, Haofen Wang, Jorge Gracia, Julia Bosque-Gil, Tong Ruan. Zhishi.lemon: On \nPublishing Zhishi.me as Linguistic Linked Open Data. 15th International Semantic Web \n",
  "speaker": "SYSTEM",
  "uuid": "8ef2988a-d059-4f25-84e2-4cb9b3b43ca2"
}