{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 20\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n20 \n Problema nº 16:baremo en los colegios  (4 puntos) (1 hora) \n \nEl ayuntamiento de una gran ciudad desea realizar un sistema de producción que bareme las \ninscripciones de los alumnos en los colegios públicos y concertados de la ciudad.  El sistema utilizando \nun conjunto de criterios escribirá en pantalla la puntuación obtenida por cada alumno en cada uno de los \ncolegios solicitados. Todos los alumnos comienzan con una puntuación de 0 puntos.  \n  \nEl ayuntamiento tiene unos criterios prioritarios, otros complementarios y otros de desempate.  Son \ncriterios prioritarios las rentas anuales de la unidad familiar, la proximidad del colegio al domicilio y  la \nexistencia de hermanos matriculados en el centro.    \n  \nSe dan las siguientes situaciones de renta: \na)         Rentas inferiores o iguales al salario mínimo interprofesional, incrementan en 2 puntos el baremo. \nb)         Rentas comprendidas entre una y dos veces el salario mínimo interprofesional, incrementan en un \npunto el baremo. \nc)         Rentas superiores al doble del salario mínimo interprofesional, no producen incrementos. \n  \nSe dan las siguientes situaciones de proximidad al domicilio: \na)         Si el domicilio está situado en la misma zona de influencia (mismo código postal) que el colegio,              \nse incrementa la puntuación en tres puntos. \nb)         Si el domicilio está situado en zonas limítrofes (diferencia de una unidad en el código postal),             \nla puntuación se incrementa en 2 puntos \nc) Si el domicilio está situado en otras zonas, entonces no puntúa. \n \nSe dan las siguientes situaciones de existencia de hermanos matriculados en el centro: \na)         El primer hermano en el centro incrementa el baremo en tres puntos,  \nb)         Por cada uno de los hermanos siguientes se otorga un punto.  \n  \nSon criterios complementarios las situaciones de familia numerosa y minusvalías. \na)         La familia numerosa incrementa en 1,5 puntos el baremo \nb)         Las minusvalías físicas, psíquicas y sensoriales de algún miembro de la familia              \nincrementa en 1,5 puntos el baremo. \n  \nLos empates que se produzcan al considerar los criterios prioritarios y complementarios, se resolverán \naplicando, en el orden establecido y hasta el momento en el que se produzca el desempate, los siguientes \ncriterios: \na)         Mayor puntuación de hermanos matriculados en el centro. \nb)         Menor renta anual de la unidad familiar \n  \nPara realizar las pruebas se han evaluado todas las solicitudes de un colegio de Madrid del barrio de \nProsperidad, cuyo distrito postal es el 28002.   Se supone que el salario mínimo interprofesional anual es \nde 10.000 euros, que un euro equivale a 166,386 pesetas, y que una familia numerosa está formada por \ntres o más hijos. \na)       Describir el formato que tendrán los elementos de condición que formarán parte de las reglas.  \nb)       Describir la base de hechos inicial del sistema.  \nc)       Describir la base de reglas del sistema que describe los criterios prioritarios y complementarios. \nd)       Describir la base de reglas del sistema que describe los criterios de desempate  \ne)       Definir la estrategia de control  \nf)        Pepe es un alumno que solicita ser admitido. Su unidad familiar tiene un salario de 2.000.000 de \npesetas, vive en el distrito 28002, y tiene dos hermanos matriculados en el centro. Identificar las reglas \nque se ejecutan en cada ciclo para calcular la puntuación de Pepe.  \ng)       María es una alumna que solicita ser admitida en el centro. Sus datos son iguales a los de Pepe,   \nsalvo que el salario de su unidad familiar es de 1,8 millones de pesetas.  María obtiene la misma \npuntuación que obtuvo Pepe en el apartado. Por tanto, el sistema debe utilizar los criterios de desempate \npara establecer quien entra primero. Indicar qué reglas se ejecutarían, en qué orden  y cual de los dos \nalumnos se clasificaría primero.   \n  \n \n",
  "speaker": "SYSTEM",
  "uuid": "8f1de029-60d4-43cc-8a15-03dc0734f423"
}