{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 15\n13\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n500+ million customers, the reality is a series of fragmented linguistic markets, none bigger than possibly\n70/80 million customers, most much smaller. \nThe language landscape in which businesses operate is complex, perhaps more so in Europe than most\nregions. There are 60+ languages spoken in Member States of the EU, and 23 official languages (soon to be\n24). Localising websites for the range of languages that might be used in digital commerce is daunting verg‐\ning on impossible, and only very rich, very large companies can afford to be multilingual on a large scale (at\nmost and very rarely, 25‐30 languages globally). Very few European online shopping sites are localised; 82%\nare published in a single language; 11% offer two languages, and only 2% publish in five or more languages.\nNone could be considered fully multilingual, and indeed at present no company or website could be genuine‐\nly global using the localisation techniques currently at our disposal. Only with large‐scale automation will the\nlimited multilinguality of the web be transformed into a genuinely globally accessible medium. Moreover,\nwithout the intervention of technology, the privilege of “being global” on the web will continue to be limit‐\ned to the largest companies with the deepest pockets.\nThe EU is a culturally diverse and linguistically fragmented market, both on‐ and offline. According to\nEurobarometer surveys, the cross‐border potential of EU retail e‐commerce is not being realised; 51% of\nEU27 retailers sell via the internet, but only 10% support cross‐border transactions. While 30% of EU citizens\nhave purchased online, only 7% have purchased from a retailer in another Member State. Businesses most\nlikely to be involved in cross‐border retailing are medium and medium‐large retail Enterprises, with a limit‐\ned number of outlets in other Member States and with existing language capabilities. Over half of Europeans\nFigure 4: The Languages of the Web Content\n",
  "speaker": "SYSTEM",
  "uuid": "8f25f9d6-3ee9-40d7-b78e-02c7291166e6"
}