{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 20\n18\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nGrowth – Speech Technology\nThe estimate of the size of the 2011 speech technology market, including software and services, is €5.9B, of\nwhich around one‐third is revenue for software.3 The five‐year CAGR for speech is 9.7%; while take‐up is\nexpanding dramatically, the market value of new products is lower than in the traditional Enterprise market.\nBy 2015, the value of the market is forecast to grow to €8.6B, of which services continues to be the lion’s\nshare. The fastest growth will be in “ROW” at 11%.\nTranslation Technology Market\nTrends – Translation Technology\nThe rise and rise of statistical machine translation is having a transformative effect on this market. Although\nvery good rules‐based systems have been available – and used in niche market areas – for decades, no avail‐\nable product ever came near the ability to cover the hundreds of language pairs (and thousands of potential\npairs in the future) that an engine like Google Translate can handle. Both Google and its direct competitor\nthe Microsoft Bing Translator are available for anyone to use on the Web, and can also be licensed as an\nembedded service in third‐party platforms and products using APIs.\nSomewhat to the surprise of the translation industry, the clear line between professional translation (by a\ntrained linguist) and what used to be called “gisting” (a machine translation just good enough to get the gist\n– for amateurs) gets more blurred every day, as both professionals and amateurs pile onto these translation\nplatforms and use them. It is no secret (indeed, is widely discussed on translator forums) that trained and\nFigure 6: Worldwide Speech Technology Software & Services Market\nWorldwide Speech Technology Software & Services Market 2011‐2015 (€B)\n3 See description of methodology in the Global Market section.\n",
  "speaker": "SYSTEM",
  "uuid": "8f529bf0-db95-4611-ae50-bb132c2d600b"
}