{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 28\nBÚSQUEDA \n \n28 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n0 \n1 \n2 \n<vd>\nA \n<vd>\n<vd>\nV \nvector\n \nFigura 9 \n \n2.4.2. Registros en Lisp. \nLos registros en Lisp toman el nombre de \"structs\" (estructuras). La primitiva para \ndefinir una familia de estructuras, todas referidas por un mismo nombre, es \ndefstruct. Este elemento especial toma como argumentos cualquier número \n(mayor o igual que dos) de símbolos, que no serán evaluados. El primer símbolo \nserá interpretado como el nombre de la estructura y los siguientes serán los \nnombres de los campos en la estructura. El valor devuelto por una llamada a \ndefstruct es el nombre de la estructura definida. Por ejemplo, la evaluación de: \n \n> (defstruct libro autor titulo) \n \n===> LIBRO \ndefine una familia de registros, de nombre libro y con dos campos llamados \nautor y titulo. La evaluación de una llamada a defstruct tienen varios efectos \nlaterales. Entre ellos, la definición de una función para la construcción de registros \nde esa familia (el nombre de esta función se construye adjuntando make- como \nprefijo al nombre de la estructura; en el ejemplo anterior: make-libro) y la \ndefinición de funciones de acceso a cada uno de los campos de la estructura (en el \nejemplo, libro-autor y libro-titulo). \nPara construir un ejemplar de una estructura, llamamos al elemento especial de \nconstrucción (como make-libro en el ejemplo) con un número par de argumentos \n(se le puede llamar sin ningún argumento). Los argumentos que aparecen en lugar \nimpar no serán evaluados (y son símbolos construidos poniendo ':' como prefijo del \nnombre de los campos; en el ejemplo, :autor o :titulo). Los argumentos de \nlugar par pueden ser elementos Lisp cualesquiera y serán evaluando, pasando sus \nvalores a ser las componentes de los campos del ejemplar de la estructura que es \nconstruido. Por ejemplo, la evaluación de: \n",
  "speaker": "SYSTEM",
  "uuid": "8fb86247-0868-4050-aec1-af0b07d5d4cf"
}