{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 63\n61\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\ntranslation scenarios).\nExamples of a specialized QA tools are QA Distiller and Error Spy. TAUS has developed the TAUS Dynamic\nQuality Framework, which documents best practices for quality evaluation, provides a method to select fit‐\nfor‐purpose evaluation approaches and a set of tools to establish quality evaluation metrics and bench‐\nmarks.\nComputer‐Assisted Translation Systems\nComputer‐Aided Translation Tools\nComputer aided translation (CAT) tools have been in use since the introduction of personal computers. Their\nprimary purpose is to improve translator productivity and accuracy by providing tools such as document edi‐\ntors, glossaries, and translation memory, in a single integrated environment or workbench. These tools have\nevolved along with the computing and networking industries, first as stand‐alone tools to be used on a sin‐\ngle computer, to client‐server tools to be used on a company network, to web based tools where the serv‐\nice and tools are delivered via the Internet. \nClient/Server based CAT tools\nClient/server computer aided translation tools (CAT) have been in use for approaching twenty years, and are\nwell entrenched within enterprise translation and localisation departments. As a general rule, these tools\nwere developed before the web and cloud based services caught on. These products represent a mature\ntechnology and include nearly every feature users expect from a translation platform.\nThe typical implementation consists of a central server, usually hosted on the customer premises, but not\nalways, which in turn interacts with client software, typically Windows based that is installed on employee\nand translator machines. This was the standard configuration for most types of enterprise software until\nabout ten years ago, when vendors began migrating to web based environments. Newer systems that have\nbeen built from the ground up since then largely bypass this model. \nThese systems, because of their age, offer a complete set of component technologies including translation\nmemory, glossaries, document editing and spellchecking tools, and in some cases, project management\ntools. While they offer a complete feature set, many of these tools have significant disadvantages relative to\nnew tools, among them:\n• Lacks of cross‐platform support, most of them are heavily focused on Windows, a problem for organi‐\nsations that use other operating systems. \n• Lack of native mobile support. Translators and reviewers increasingly demand mobile applications so\nthey can work where and when they want to. \n• Steep learning curve. These systems were designed primarily for translation and localisation profession‐\nals, and can be intimidating to newcomers. They also have user interfaces that are pretty dated by\ntoday’s standards.\nHigh IT costs, due to the need to maintain the servers, update software and install client software on a\npotentially large number of machines. \nIn general, companies that are not already vested in this class of tool are moving to web oriented systems.\nEstablished vendors are re‐tooling their client server solutions as cloud based products as well. On the other\nhand, companies and government agencies that have stringent security requirements will probably want to\ncontinue hosting these services in their own data centres, or at least on computers they directly control. \n",
  "speaker": "SYSTEM",
  "uuid": "90942522-ec9b-4d4a-a094-1bf79957192b"
}