{
  "message": "SYSTEM: D5.3.2.pdf: Página 45\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 45 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n6. Conclusions and Future Work  \nAfter analysing the state of the art in D5.3.1 [ 10], we can say that the degree of maturity of the \nOntology Engineering field is very low if we compare it with the Knowledge Engineering field and, \nspecially, with the Software Engineering field. The long term goal of the Ontology Engineering field \nwill be to reach a degree of maturity similar to the one that the Software Engineering has today. \nDeliverable D5.3.1 [ 10] presented an advance in this sense by means of the following \ncontributions: \n\u0001 First version of the NeOn Glossary of Activities, which identifies and defines the activities \npotentially involved in the ontology network construction, as a first step for solving the lack of a \nstandard glossary in the Ontology Engineering field. \n\u0001 Identification and description of eight scenarios for building network of ontologies \ncollaboratively with special emphasis in reuse, reengineering and merging ontological and non-\nontological resources.  \n\u0001 The first collection of several theoretical ontology network life cycle models, based on those \ndefined in the Software Engineering field and taking into account the specific features of the \nontology network development.  \n\u0001 Methodological guidelines for scheduling ontology network project and for obtaining the \nconcrete life cycle for an ontology network.  \nIn this deliverable we improve the results presented in deliverable D5.3.1 [ 10] in the following way: \n\u0001 Improvement of the existing NeOn Glossary of Activities by obtaining the NeOn Glossary of \nProcesses and Activities, including new processes and activities and relationships between \nprocesses and activities; and creation of the NeOn Resource Glossary by including other \ndefinitions (ontological resource, non-ontological resource, etc.). \nThis improved version is available in Cicero9 in order to obtain feedback from the ontology \nengineering community outside NeOn project. \nAs current work we have planned to propose to standardization committees, such as the \ntechnical committee ISO/TC37, the standardization of the NeOn Glossary, after collecting the \nfeedback provided by ontology engineering community. \n\u0001 Revision and update of the identified scenarios for building ontology networks, includind the \ndetailed description of the scenario that involves the reuse of ontology design patterns. \n\u0001 Update of the collection of ontology network life cycle models, based on (1) preliminary \nevaluations with the first collection presented in D5.3.1 [ 10], in which it was demonstrated that \nthe distinction among the different iterative models (incremental, iterative, evolving prototyping \nand spiral) is not easy for software developers and ontology practitioners; (2) experiences in \ndifferent ontology developments within different projects; and (3) ideas presented by Larman \n[ 6], who basically  proposes the existence of two different models: waterfall and iterative-\nincremental. \nThe revised collection presented in this deliverable includes the enhanced waterfall model and \nthe new iterative-incremental model.  \n                                                \n9 http://cicero.uni-koblenz.de/wiki/index.php/Prj:NeOn_Glossary_of_Processes_and_Activities \n",
  "speaker": "SYSTEM",
  "uuid": "90a45b43-3d6f-4c30-b53b-5bf24334b892"
}