{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 40\n38\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Low barriers to participation\n• Focus on interoperability, likely to promote standardisation\n• Proxy for formal consolidation with more open flavour (but not open technology)\nExample: iSpeech Cloud ‐ a Peer Ecosystem of start‐up innovators with complementary technologies\nThe US company iSpeech was purportedly founded to develop and deliver ASR and TTS on a cloud platform,\nthough its first product was a more modest Blackberry app. The company claims that its service is intended\nto compete with Nuance as a new platform for speech technology development. It claims to have extreme‐\nly accurate speech recognition, created from large, unique speech datasets, and the ability to generate\nhuman‐quality speech in natural sounding voices. According to the company, out of 12,000 developers who\nhave registered on the iSpeech cloud 3,000 have actually used it, generating more than a billion transactions.\nThe iSpeech self‐service platform allows developers to integrate text to speech and speech recognition into\ntheir own apps, products and devices, as of this year including home electronics and appliances. The service\nis free to all mobile developers with support for iOS, Android and BlackBerry devices. The iSpeech SDKs and\nAPIs provide over 40 text to speech voices with support for more than 25 languages. \nDevelopers have signed up for embedding iSpeech in applications, appliances, automobiles, websites and\nplatforms. iSpeech Cloud handles tens of millions of connections daily, across the globe. \nmylanguage, developers of the Vocre speech translation app for iOS devices that launched in 2011, is a mem‐\nber of this ecosystem. Vocre brands itself as a translation company for the 21st Century focused on dialogue\nand the user experience, and considers its competitors to be Google Translate (which it refers to as an “infe‐\nrior app”) and Jibbigo (which unlike Vocre offers offline translation as well as online). It is also active in the\nlanguage learning space, and considers Rosetta Stone (language learning software) a competitor. It claims\nmillions of downloads, and tens of millions of translations. Claims to have developed its own translation\ntechnology.\nScenario: Peer Alliances\nCompanies with relatively equal market strength partner to share and develop complementary technologies:\n• More traditional partnerships where collaborators are on equal footing\n• No “imbalance of power”\n• Heavyweight exchanges of technology possible with large peer partners\n• Low‐risk access to complementary technology for small peer partners\n• Potential for long‐term joint ventures\nExample: Nuance & IBM (large peers) – merging intelligent technologies for new healthcare solutions\nNuance and IBM collaboration on research to commercialize the Watson computing system’s advanced ana‐\nlytics capabilities in the healthcare industry (announced in 2011). The research and technology initiative will\ncombine IBM’s Deep Question Answering (QA), Natural Language Processing, and Machine Learning capabil‐\nities with Nuance’s speech recognition and Clinical Language Understanding (CLU) solutions for the diagno‐\nsis and treatment of patients that provide hospitals, physicians and payers access to critical and timely infor‐\nmation. The two companies expect the first commercial offerings from the collaboration to be available in\n18‐24 months.\nAdditionally, Columbia University Medical Center and the University of Maryland School of Medicine are con‐\ntributing their medical expertise and research to the collaborative effort. For example, physicians at\n",
  "speaker": "SYSTEM",
  "uuid": "90d5b1f4-7542-4d7a-90a7-cc20790f9ef8"
}