{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 112\nBÚSQUEDA \n \n112 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nde los nodos, pero debe ser entendido como una representación lógica y física de \nlos estados definidos conceptualmente en (b)). \nPuesto que el espacio de estados es un árbol, se sigue que en el algoritmo A nunca \nse revisarán los costes (ni los padres) en ABIERTOS ni en CERRADOS (de hecho, \nCERRADOS no juega ningún papel en el algoritmo A en árbol). Por ello, la \ncaracterística de monotonía de las heurísticas no es especialmente importante para \nel problema del viajante representado de ese modo. Sin embargo, las \naproximaciones heurísticas (y su admisibilidad) siguen siendo muy importantes, \npues el árbol de estados crece enormemente con el número de ciudades, por lo que \nno generar todos los estados es imprescindible para poder resolver el problema en \nla práctica. Por otra parte, si la heurística no es admisible no podremos decir que el \nproblema ha sido realmente resuelto (tal vez encontremos en primer lugar un ciclo \ntotal que no sea óptimo). \nVamos a considerar seis heurísticas para el problema del viajante. Supongamos que \nestamos en un estado e que consta de r aristas. Si el número de ciudades en el \nmapa es n, resultará que para completar un ciclo total a partir de e faltan todavía p = \nn - r aristas. Las heurísticas son las siguientes: \n1) h1(e) = 0. \n2) h2(e) = p * coste mínimo entre los de las aristas que no aparecen en el estado e. \n3) h3(e) = suma de los p menores costes entre los de las aristas que no aparecen \nen el estado e. \n4) h4(e) = suma del coste de p aristas, una elegida por cada uno de los vértices de \nlos que todavía se tiene que salir para completar un ciclo total: para cada vértice \nse elige el coste mínimo entre los de las aristas que inciden en él y que no \naparecen en el estado e. \n5) h5(e) = suma del coste de p aristas, una elegida por cada uno de los vértices a \nlos que todavía se tiene que llegar para completar un ciclo total: para cada vértice \nse elige el coste mínimo entre los de las aristas que inciden en él y que no \naparecen en el estado e. \n6) h6(e) = coste de la arista que une el origen con el otro extremo del estado. \nLa primera heurística señala, en realidad, la ausencia de heurística (el algoritmo A \nse comportará como \"primero el menos costoso\"). Las heurísticas 2 y 3 se \n",
  "speaker": "SYSTEM",
  "uuid": "91b6a4bb-da2b-4dae-9fba-d9d4d32052ef"
}