{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 5\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n5\ntags to multimedia resources is maintained through global URIs, as will\nbe described in section 4.\n\u0015 The centralized components are the following:\n• IMS Enablers. The IP Multimedia Subsystem (IMS) is an architectural\nframework for delivering IP multimedia services. The enablers that we\nhave created allow home gateways to register in the IMS network, to\nestablish secure IMS sessions and to update dynamically the presence\nstatus of each home.\n• Access Policy Server. It provides authorization services with di\u001berent\nlevels of granularity: homes, devices, multimedia resources and meta-\ndata. The access policy server also facilitates tracking and control of\nUPnP session requests. It acts as the Policy Decision Point (PDP) for\nauthorization requests.\n• Ontology server. The ontology server6 stores the ontologies that will be\nused for the annotations to be provided by users. In the current realiza-\ntion of this architecture, this is a state-of-the-art ontology server that has\nbeen initialized with a core set of ontologies that have been considered\nrelevant for the purpose of annotation by users, including multimedia\nontologies (e.g., COMM), and general ontologies about persons, loca-\ntions, events, etc. This component can be replaced by any of the existing\nonline ontology servers or removed completely, relying on the possibility\nto \u001cnd online ontologies through the Linked Data protocols.\nIn the following sections we describe the design principles and implementation\ndetails of these new components or component extensions.\n3\nBasic UPnP Extensions to Handle a Multi-Home\nEnvironment\nOur \u001crst set of extensions is related to the expansion of the standard UPnP\nprotocols to allow the management of users and the creation of UPnP sessions\nbeyond the LAN scope, overcoming some of the limitations of UPnP in multi-\nhome environments.\nWe introduced previously the concept of a UPnP user, which is not de\u001cned\nin standard UPnP. We consider that each home member may have its own set of\nusers, which will be the basis for the granting and denial of user authorization\nrights to remote homes, devices or individual multimedia content. Hence, these\nrights are handled by means of users (and role-based authorization), instead of\nhomes, as it happens in other existing approaches, and this allows users to have\npersonalized views of their media resources. Other scenarios (e.g., parental con-\ntrol, integration with other IMS personalized services like presence, messaging,\netc.) are also applicable following this extension.\n6 It may be argued whether the ontology server should be distributed or not, allowing\ndi\u001berent users to use sets of ontologies. While this is technically possible, the com-\nplexity of providing a management interface for ontologies to our intended users is\nexpected to be too high and we have decide to use this centralized component.\n",
  "speaker": "SYSTEM",
  "uuid": "923c70c1-7fa2-4f24-b670-00336d0f4e44"
}