{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 89\n87\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\npaper based. It provides:\n• Capture capabilities that convert images of scanned documents to text (via an embedded optical char‐\nacter recognition engine). Currently there are three approaches: Optical Character Recognition (OCR),\nIntelligent Character Recognition (ICR) and Optical Mark Recognition (OMR). \n‐ OCR is a specialized type of software that leverages artificial intelligence, pattern recognition, and\nmachine vision to convert scanned documents into machine‐readable text. \n‐ ICR is advanced OCR that is neural network based, and is typically used for handwriting recognition.\n‐ OMR is another capture technology that has been used for forms recognition and is in use today for\nbarcode recognition.\n• Indexing capabilities that automatically generate metadata for the scanned document for search pur‐\nposes, provide an application user interface that facilitates manual indexing, or provide a combination\n• of the two.\n• The ability to store and retrieve imaged documents, whether via the vendor’s own repository and\nsearch services or via integrations with other content management solutions\nScanning solutions typically include one or more of the following functions:\n• Classifiers, which automate the categorization of documents (both scanned and electronic) so that they\ncan be automatically routed for further processing to appropriate subprocesses or applications.\nClassifiers use neural networks or other types of artificial intelligence so that users are spared the effort\nof creating rules, which would otherwise make deployment complex and time consuming, and require\nsignificantly more on‐going maintenance to extend the system to new document types.\n• Intelligent extraction facilities, which extract «fielded» information from the content of scanned and\nelectronic documents so that the information can be mapped to enterprise applications and leveraged\nby business processes.\n• Full text search: often an embedded capability within the solutions, especially those that encompass\nrepository and records management (RM) services and capabilities.\n• Business process automation facilities to implement workflow tasks such as notification, approvals, and\nexception handling.\nText recognition software helps to identify and predict text patterns. In fact, Text‐based input technologies\nseek address user experiences issues around desktop, web, mobile, in‐car navigation, seat‐back entertain‐\nment systems and televisions text input. These technologies can be found in word processors, browsers,\nmobiles and other devices.\nThere are several types of text input technologies: input technologies and optimization techniques.\n• There are two paradigms for input technologies: pen‐based input and (virtual) keyboard‐based input.\nThe latter is becoming more and more the standard the facto for all type of devices.\n‐ Pen‐based input: produces digital ink that should be recognize and it a similar problem as scanning.\n",
  "speaker": "SYSTEM",
  "uuid": "96a9629f-f194-4f42-ba39-9495249c2849"
}