{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 87\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 87 \n \nOtros méritos o aclaraciones que se desee hacer constar \nREVISIONES DE ARTÍCULOS PARA REVISTAS, CONGRESOS Y WORKSHOPS \nRevistas (no miembro del comité editorial):  \n- \nEn JCR: Journal of Web Semantics, International Journal of Human-Computer Studies, IEEE Internet \nComputing, IEEE Intelligent Systems, International Journal on Data & Knowledge Engineering (DKE), IEEE \nTransactions on Knowledge and Data Engineering, Future Generation Computer Systems, Language \nResources and Evaluation, Technovation, Computer, IEEE Transactions in Mobile Computing, Journal of \nUniversal Computer Science; Journal of Information Science; Information Systems Frontiers, special issue \non “Intelligent Systems and Smart Homes”; BMC Bioinformatics, Journal of Network and Computer \nApplications, Quality and Safety in Health Care. \n- \nNo JCR: Applied Ontology; Intenational Journal of Metadata, Semantics and Ontologies; MultiAgent and Grid \nSystems; Journal of Brazilian Computer Society; it - Information Technology: Methods and Applications of \nInformatics and Information Technology; Electronic Commerce Research and Applications, ACM \nTransactions on Autonomous and Adaptive Systems, Inteligencia Artificial. \nConferencias (no miembro del comité de programa): ESWC2007, e-Science 2006 y 2007 (2nd/3rd IEEE \nInternational Conference on e-Science and Grid Computing), ASWC2006 (1st Asian Semantic Web Conference), \nECAI2006, IJCAI’03; WWW2003 y WWW2008; ESWS2004 (First European Semantic Web Symposium), \nKCAP05 (Third International Conference in Knowledge Capture); IUI2002 (Intelligent User Interfaces); KR2002 \n(Knowledge Representation and Reasoning); EKAW02, EKAW04 (13th, 14th International Conference on \nKnowledge Engineering and Knowledge Management); SEKE04 (16th International Conference on Software \nEngineering and Knowledge Engineering); SCI (Software and Conceptual Infrastructure) 2001, 2002, 2003, 2004, \n2005; WMSCI (World Multi-Conference on Systemics, Cybernetics and Informatics) 2005, 2006; CCCT \n(International Conference on Computing, Communication and Control Technologies) 2004, 2005, 2006; ECIS \n(European Conference on Information Systems) 2005, CBMS2007 (20th IEEE International Symposium on \nComputer-Based Medical Systems), CDVE (International Conference on Cooperative Design, Visualization and \nEngineering) 2007, 2008. \nWorkshops (no miembro del comité de programa): ECAI'00 Workshop on Applications of Ontologies and \nProblem Solving Methods; IJCAI'01 Workshop on Applications of Ontologies and Information Sharing; ECAI'02 \nWorkshop on Ontologies and Semantic Integration; ECAI’02 Workshop on Knowledge Transformation for the \nSemantic Web; ECAI’04 Workshop on Semantic Integration, SBIA2004 Workshop on Ontologies and their \nApplications, ISWC2005 Workshop on Semantic Web Enabled Software Engineering (SWESE), Workshop \n“OWL: experiences and directions, 2005”. \nLibros: Emergent Web Intelligence (Springer Verlag, serie Studies in Computational intelligence). \n \nCHARLAS INVITADAS \n35. Data Integration at the Ontology Engineering Group. Project CrEDIBLE Thematic Working Days. 15 Octubre \n2012. \n34. Ingredients for the Semantic Sensor Web. Universidad Pública de Navarra. Pamplona. 12 Marzo 2012. \n33. DynaLearn: Tecnologías semánticas en un contexto de aprendizaje basado en resolución de problemas. \nSeminario eMadrid sobre “Web de datos para la Educación”. Madrid. 20 Enero 2012. \n32. An attempt to build an ontology of Patient Safety. OpenHealth Spain 2011. Barcelona. 28 Noviembre 2011. \n31. Linked Data y Administración Pública. Keynote Speech. LatinAmerican Conference on Network and \nElectronic Media (LACNEM2011). San José. Costa Rica. 17 Noviembre 2011. \n30. Linked Data: oportunidades y riesgos. Jornadas de Ingeniería del Software (JIS2011). La Laguna. 10 \nNoviembre 2011. \n29. Ingredients for the Semantic Sensor Web. Jozef Stefan Institute. Eslovenia. 23 Septiembre 2011. \n28. Estado actual de la combinación de semántica y multimedia. Keynote Speech. LatinAmerican Conference on \nNetwork and Electronic Media (LACNEM2010). Cali, Colombia. 9 Septiembre 2010. \n27. Ontology-based Data Integration. III Seminario de Ontologias no Brasil – ontoBRAS. Florianópolis, Brasil. 31 \nAgosto 2010. \n26. Acquiring context in Ontologies. Cast Pre-Mobile Summit workshop on “Putting Services into Context”. 15 \nJunio 2010. \n25. Semantics in Sensor Networks. Workshop on Semantics and Future Internet. Berlín. 1 Septiembre 2009. \n",
  "speaker": "SYSTEM",
  "uuid": "98208829-125e-4c92-80fb-fbfd34d193fd"
}