{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 17\n15\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nMicrosoft, IBM, Google as well as smaller market leaders such as SDL and Lionbridge), which was supple‐\nmented with data from other specialist analysts. In speech these included Opus Research (voice biometrics),\nVoice Information Associations (Automatic Speech Recognition –ASR‐/Text To Speech –TTS‐), comprehen‐\nsive studies from generalist research firms (Global Industry Analysts, TechNavio), as well as the thorough\ncoverage of the speech industry provided by SpeechTech magazine.\nOnly one analyst firm (Common Sense Advisory) covers the translation industry in a systematic way; while\nthey provide good on‐going intelligence about developments in the Translation Technology space, they do\nnot publish forecasts of that market separately from translation services (the universe of so‐called Language\nService Providers, or LSPs, including interpreting services). The model therefore starts from CSA’s service\nindustry forecasts and adjusts based on criteria used by CSA and input from IDC and other analysts who fol‐\nlow translation software at more distance. \nThis raises the question of what constitutes “services” in the Translation Technology (TT) segment. For the\nLT‐Innovate model, the TT services market includes all companies that provide translation in combination\nwith technology‐based development and management of linguistic resources and processes on behalf of the\nclient. A freelancer or small agency that uses translation memory for personal productivity, but does not\nshare and manage those resources with and for clients, is a Translation Technology user, but not a provider\nof TT services. An agency that, on the other hand, uses Translation Technology to develop terminology and\ntranslation management resources, and maintain and manage them, on behalf of clients, and charges for\nthat as part of its bundle of services, is a company in the Translation Technology services space. For the\nlargest LSPs, these types of services, increasingly supplemented with the direct use of machine translation\nwithin the process, constitute most of their business, and all of their business with large customers. \nReaders should note that current business models in the translation services segment are quite different\nfrom those in speech and content, where services are directly associated with adapting, enabling, and\ndeploying technology for the client’s own use in its business processes. This is sometimes the case with large\ntranslation buyers, but even then the service provider is much more deeply embedded in the client’s\nprocesses (e.g. for multilingual technical publishing) because of reliance on language data as the resource\nthat drives the solution end‐to‐end. However, with the advent of Enterprise cloud services the operating\nmodels of the different LT segments may look more similar over time, as vendors enable and support\nprocesses based on language resources across the spectrum of applications that use LT.\nCSA’s market estimates are controversial within the translation industry, and while they are based on hard\nsurvey data from a respectable sample (around 4%) of the 26,000 companies they estimate are in the indus‐\ntry worldwide, the segmentation between large companies (who they say collectively earn over $5B/year,\ngetting on for 20% of their market estimate) and the “long tail” of thousands more companies, implies aver‐\nage revenues for the small companies that are not supported by evidence. We therefore used the detailed\nstudy carried out by The Language Technology Centre on behalf of DGTranslation (at the European\nCommission), The Size of the European Language Industry, to adjust CSA’s estimates. The LTC study is based on\na painstaking, country‐by‐country review of the industry in Europe (widely believed to command half the\nworld market) using public‐record data and information from local translation associations, supplemented\nwith a survey of 1100 companies (most operating in Europe). That survey provided data about the propor‐\ntion of companies developing and using Translation Technology, which we used to further refine our esti‐\nmate of the proportion of the total market that provides TT services. At the time the survey was carried out\nin 2008, 10% of respondents were developing Translation Technology, 10% were using machine translation,\nhalf were using terminology development and management tools, and over 70% were using CAT (Computer\nAided Translation) technology.\nGlobal Market\nBased on the LT‐Innovate market model the estimate of the size of the 2011 worldwide Language Technology\nmarket, including software and services, is €19.3B. Of that, around a quarter of the market is for software\nsales (€4.5B); the balance is for services (€14.7B).\n",
  "speaker": "SYSTEM",
  "uuid": "9833bff5-7193-460a-99cb-23c4697688b3"
}