{
  "message": "SYSTEM: D5.3.2.pdf: Página 21\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 21 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \nfollowing: assumptions for the scenario, prerequisite resources, sequence of tasks to be carried \nout, and outcomes for the scenario. \n\u0001 Assumptions: It is supposed that software developers and ontology practitioners want to \nreuse ontology design patterns (ODPs) for different purposes: to reduce modelling difficulties, \nto speed up the modelling process, or to check the adequacy of modelling decisions.  \n\u0001 Prerequisite resources: Knowledge about the domain of the ontology network to be \ndeveloped should be available for the building of the ontology network. Furthermore, previous \nknowledge on the existence of design patterns and design patterns repositories should as well \nbe available. Ontology design patterns repositories or catalogues are made available to users. \nThese catalogues contain templates that fully describe design patterns. \n\u0001 Sequences of tasks: In this scenario, software developers and ontology practitioners are \nworking on the development of an ontology and encounter problems regarding the way in \nwhich certain knowledge should be modelled. This could happen during the ontology \nconceptualization activity, the ontology formalization activity, or during the ontology \nimplementation activity. Since they are conscious of the existence of ontology design pattern \nrepositories, they access them for finding modelling solutions. The tasks to be carried out \nduring the ontology design pattern reuse activity by expert users are the following ones:  \n1. To search possible ODPS to be used in a repository or catalogue of ontology design \npatterns. This implies to carry out a careful analysis of the different information sections \nincluded in the ontology design patterns templates in order to find possible ODPs for \nsolving the modelling problem. \n2. To select the ontology design pattern that better matches the modelling problem. This \nimplies to contrast the analyzed ontology design pattern templates against the real use \ncase to find out the overlap level.  \n3. To adapt the ontology design pattern in order to match the modelling issue. Depending \non the selected pattern, an instantiation or an extension of the ontology design pattern \nhas to be performed.  \n4. To \nintegrate \nthe \nontology \ndesign \npattern \ninto \nthe \ncorresponding \nmodel \n(conceptualization, formalization or implementation).  \n\u0001 Outcomes: The principal output of this reuse activity is an ontology design pattern integrated \ninto the ontology network being developed. \nFigure 6 depicts schematically the tasks to be performed during the reuse of ontology design \npatterns. \n",
  "speaker": "SYSTEM",
  "uuid": "9939aff8-51e7-4bc4-bc20-71f1b83eaccb"
}