{
  "message": "SYSTEM: FormularioCPM_asun2.pdf: Página 1\n­ INSTRUCCIONES PARA LA PRESENTACIÓN DE PROPUESTAS ­\nFormulario para la propuesta de soluciones innovadoras para\nsuperar los retos tecnológicos planteados en el\n\"Plan de impulso de las Tecnologías del Lenguaje\"\n1. Envío de propuestas:\nPara la presentación de las propuestas, se deberá rellenar el presente formulario, validarlo y remitirlo\npor correo electrónico a la siguiente dirección: ConsultaPreliminarMercadoPlanTL@minetad.es\n2. Validación de propuestas previa al envío:\nEl formulario se puede guardar parcialmente cumplimentado. No obstante, antes de enviarlo por\ncorreo electrónico deberá comprobar mediante el botón “Validar”, de la página 13, que ha rellenado\ntodos los campos obligatorios.\n3. Tamaño del correo:\nSe podrá acompañar el formulario con la documentación complementaria que se estime oportuna,\nsiempre y cuando el tamaño máximo de toda la documentación, incluido el presente formulario, no\nsupere 15 MB al ser enviado por correo electrónico.\n4. Identificador de propuestas:\nCada propuesta será identificada mediante la dirección de correo electrónico desde la que se remitió.\nDeberá coincidir con la que se indique en el apartado 3.3 de la sección A del presente formulario.\n5. Nombre del fichero del formulario:\nSe\nsolicita\nque\npara\nel\nnombre\ndel\nfichero\ndel\nformulario\nse\nemplee\nla\nnomenclatura\nFormularioCPM_usuario.pdf, donde usuario se deberá sustituir por el nombre de usuario de la\ncuenta\nde\ncorreo\nelectrónico\ndel\nremitente\n(texto\na\nla\nizquierda\nde\nla\narroba\n@).\nEjemplo:\nSi\nel\nremitente\nes\nusuario1@minetad.es,\nel\nfichero\ndel\nformulario\nse\nllamará\nFormularioCPM_usuario1.pdf\n6. Nuevas propuestas:\nEn caso de que un mismo participante envíe varias propuestas, deberá emplear diferentes cuentas de\ncorreo electrónico para diferenciarlas.\n7. Actualización de propuestas anteriores:\nSe podrán enviar sucesivas versiones de una propuesta, siempre que se mantenga la misma\ndirección de correo electrónico. Cada propuesta enviada sustituirá completamente a la anterior\nenviada con dicha dirección de correo. Por ello, la nueva propuesta deberá incluir todo lo que se\nconsidere que sigue siendo válido de las anteriores.\n8. Resolución de dudas:\nSe podrán consultar enviando un correo electrónico a la siguiente dirección:\nDudasConsultaMercadoPlanTL@minetad.es.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\n­1­\nversión 1.2.\n",
  "speaker": "SYSTEM",
  "uuid": "99bfdb3a-05a4-4ba9-aaff-5460fded05b5"
}