{
  "message": "SYSTEM: Descripcion-IULA.pdf: Página 1\n \n \nRoc Boronat, 138 \n08018 Barcelona \n[Tel.] +34 935 422 322 \n[Fax] +34 935 422 321 \niula@upf.edu \nwww.iula.upf.edu \n \n \n \nGrupo de Tecnologías de los Recursos Lingüísticos \nLanguage Resources Tecnologías Group \nJulio 2017 \nhttps://www.upf.edu/es/web/iula \n \nEl Instituto de Lingüística Aplicada, IULA (www.iula.upf.edu) de la UPF fue creado en 1994 y es un \ncentro de investigación y de formación de investigadores  cuyos miembros son profesores del \nDepartamento de Traducción y Ciencias del Lenguaje (DTCL) becarios doctorales e investigadores \nasistentes contratados para los proyectos financiados con fondos externos específicos conseguidos \ncompetitivamente en los programas de investigación e innovación de ámbito europeo y estatal.  \nIULATERM (Léxico, terminología, discurso especializado e ingeniería lingüística) es uno de los grupos \nde investigación del IULA. Desde 2001, IULATERM tiene la consideración de grupo de investigación \nconsolidado en el Plan de Investigación de la Generalitat de Catalunya (20001SGR00273). Se ha \nespecializado en recursos y tecnologías de los recursos lingüísticos (TRL). La sección TRL está dirigida \npor la profesora Núria Bel y trabaja en la creación, desarrollo y aplicación de tecnologías relacionadas \ncon la adquisición, la producción, la formalización, gestión, validación y evaluación de los recursos \nlingüísticos (corpus, vocabularios, léxicos, gramáticas, etc.) que se requieren para las Tecnologías del \nLenguaje y las aplicaciones que las utilizan: traducción automática, extracción de información, Text \nAnalytics, \netc. \n \nDurante los últimos  años, el grupo ha participado en 4 proyectos europeos del 7PM todos ellos con \nparticipación de empresas: Coordinador del Proyecto PANACEA: Platform for the Automatic, \nNormalized Anotación and Cost-Effective Acquisition of Language Resources for Human Language \nTechnologies financiado por Language Technologies Area, Information and Communication \nTechnologies Programme (7FP-ITC-248.064), CLARA Initial Training Network for Common Language \nResources and their Applications, financiado por Marie Curie Programme (7FP-ITN-238.405); \nMETANET4U: Enhancing the European Linguistic Infrastructure, financiado por Competitiveness and \nInnovation Programme, (CIP-PSP-270893);  DASISH: Digital Services Infrastructure for Social Sciences \nand Humanities financiado por el Research Infraestructuras Programme (FP7-INFRAESTRUCTURAS-\n283646), LPS-Bigger -  Línea de Productos Software para BIG data a partir de aplicaciones innovadoras \nen Entornos Reales (Programa CIEN - IDI-20141260). El grupo también ha recibido financiación \nprograma FEDER de la Generalidad de Cataluña para el proyecto \"Adquisición del Equipamien to y \nconstrucción del Centro CLARIN\". El grupo TRL es miembro fundador de la red de excelencia RETELE \ny pertenece a las asociaciones europeas METANET y ELRA.  \n \nEl grupo TRL también ha firmado convenios de colaboración con las siguientes empresas: Media \nPlanning Group SA para proveer recursos lingüísticos para un analizador de opinión y Jobs and Talent, \nS.L. para el desarrollo de tecnología de explotación de textos para un sistema automático de sugerencias \nde ofertas de trabajo a usuarios de jobsandtalent.com. \n \nLos miembros TRL han presentado sus trabajos en más 100 comunicaciones y publicaciones de los \ncongresos y revistas internacionales más prestigiosos, entre ellos: European Association for \nComputational Linguistics, COLING, North American Chapter of the Association for Computational \nLingüístics , European Association for Machine Translation, International Conference on Language \nResources and Evaluation y revistas como Computational Linguistics, Neural Networks i Language \nResources and Evaluation.  \n \n",
  "speaker": "SYSTEM",
  "uuid": "99ea9fbf-df65-4160-ad3d-8bbfbe349f8d"
}