{
  "message": "SYSTEM: FormularioCPM_asunciondemaria.gomez.pdf: Página 8\n2.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n2. Solución II\n2.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n2.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n2.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­8­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN II (marque esta casilla para habilitar los campos asociados a la solución II)\nversión 1.2.\n#\nEl reconocimiento y clasificación de entidades nombradas (en inglés NER) es una de las \nprincipales tareas realizadas en sistemas de extracción de información (IE) y consiste en \nla identificación de entidades reales definidas en documentos mediante un término o un \nnombre propio. Los principales tipos de entidades con los que se trabaja en el estado del \narte clasifican las entidades en tipos genéricos como “persona”, “organización”, “localización“, \n“entidad geopolítica”, “expresión temporal” y “expresión numérica”. En dominios concretos, \nademás es de interés reconocer entidades específicas de dominio; por ejemplo, el \ndominio biomédico reconoce tipos de entidades como “enfermedad”, “medicamento”, “tipo de \ncélula”, “proteína”, “DNA” o “RNA”. \n \nLa librería HNER (Handy Named Entity Recognition), desarrollada por el Ontology \nEngineering Group (OEG), grupo de referencia internacional, pionero en España en \nIngeniería Ontológica, con más de 20 años de experiencia en tecnologías semánticas, \npermite realizar la tarea de reconocimiento de entidades nombradas sobre grandes \ncolecciones de documentos en lenguaje natural (corpus). Para dicha tarea, la librería \nutiliza lexicones y diccionarios (gazetteers), reglas basadas en patrones léxico-sintácticos \ny de formato y técnicas basadas en aprendizaje automático. HNER ha sido desarrollada \npara trabajar con documentos no estructurados en los que el procesamiento del lenguaje \npuede ser complejo (PDFs escaneados, cadenas de mensajes, lenguaje informal, etc.). \nAsí mismo, HNER admite diferentes idiomas (actualmente inglés y español) y funciona \nigualmente en documentos multilingües.  \n \nLas técnicas de aprendizaje automático utilizadas se basan en aprendizaje supervisado. \nEste tipo de técnicas requieren de corpus anotados con entidades para entrenar modelos \ny posteriormente identificar entidades sobre documentos no anotados. HNER genera \nanotaciones sobre documentos mediante una sencilla interfaz gráfica de usuario y crea \nposteriormente un modelo de aprendizaje. Los corpus anotados para el entrenamiento \n(denominados gold standard) pueden ser reutilizados para documentos homogéneos en \ndominios verticales (medicina, turismo, legislativo, etc.). \n \nPor otro lado, la librería cuenta con funcionalidades de análisis exploratorio del corpus, \ntales como la identificación de colocaciones y el contexto de las palabras. Además, la \nlibrería dispone de módulos para otras tareas relacionadas con la extracción de \ninformación: tokenizador, separador de frases, resolución de correferencias e \ninstanciación y mapeo de entidades a ontologías.\n#\n#\n#\n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "9ad1fe36-8d07-49df-b04b-20a5ec196982"
}