{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 8\n8\nAndr´es Garc´ıa-Silva et al.\nextract the keywords and their frequency from the corresponding article. For\ntags in languages diﬀerent than English, we look for English translations in\nWikipedia and using the LabelTranslator tool[7].\nFinally, we extract from DBpedia the semantic resources related to the can-\ndidate senses. In DBpedia English and Spanish Wikipedia articles are linked to\nDBpedia resources by means of the page16 and the wikipage-es17 relations. In\ncase the wikipage-es relation does not exists for an Spanish Wikipedia article,\nwe use the translation found in the previous activity and use the page relation.\nA more complete description of the creation process of MSR can be found in [9].\n4\nExperimental Evaluation Setup\nOur evaluation has focused on determining the precision of our semantic ground-\ning approach, considering diﬀerent alternatives or decisions that can be taken in\nthe tag processing process that we have described in section 3.\nFor this, we have used as test data a set of tagging activities taken from Flickr.\nBy exploring Flickr images we found that some pictures of tourist cities were\nannotated with multilingual tags. Thus, we queried the Flickr API for pictures\ntagged with touristic places in Spain (e.g., Barcelona, Canary Island, Ibiza, etc.).\nWe gathered a total of 764 photos uploaded to Flickr by 719 distinct users.\nOn average those 764 photos were annotated using 12.4 tags with a standard\ndeviation of 7.85. In addition, our data set consists of 9484 tagging activities,\nthat is, 9484 triples of the form ⟨user, tag, photo⟩, where 4153 distinct tags were\nused. Each tag was used on average 2.28 times to annotate the pictures with a\nstandard deviation of 5.69.\nOur baseline attempts to directly match tags with Wikipedia article titles. We\nﬁrst preprocess tags by looking for spaces and replacing them with the ’ ’ charac-\nter. Next, for tags in English we create a URI of the form http://en.wikipedia.\norg/wiki/tag. After that, with that URI we query DBpedia for a semantic re-\nsource using the page18 relation. On the other hand, with tags in Spanish we\ncreate a URI of the form http://es.wikipedia.org/wiki/tag. Then with that\nURI we query DBpedia for a semantic resource using the wikipage-es19 relation.\nAs aforementioned, we wanted to explore the behavior of our process under\ndiﬀerent alternatives. First, we were interested in evaluating how well Sem4Tags\nperforms when the keywords representing each sense are the most frequent terms\nin the whole wikipedia articles, against a more reduced set of terms extracted\nfrom article abstracts (i.e, the ﬁrst paragraph describing the article content).\nOur hypothesis was that large Wikipedia articles can contain as frequent key-\nwords some terms that are not necessarily related to the article main subject. In\ncontrast, abstracts provide more concise information about the article subject\nand thus those terms can lead to better disambiguation results. In addition, we\n16 http://xmlns.com/foaf/0.1/page\n17 http://dbpedia.org/property/wikipage-es\n18 http://xmlns.com/foaf/0.1/page\n19 http://dbpedia.org/property/wikipage-es\n",
  "speaker": "SYSTEM",
  "uuid": "9ae58cc4-c3a3-4b23-a0c4-57fb8c0acf29"
}