{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 7\n1 The Return of the Entity-Relationship Model: Ontological Query Answering\n7\nsuch that every value in ΓN follows all those in Γ . We denote by X sequences (or\nsets) of variables and constants X1,...,Xk, where k > 0; it will be clear from the\ncontext when we regard X as a sequence of symbols, and when as a set of symbols.\nFor an integer n > 1, we denote by [n] the set {1,...,n}.\nA relational schema R (or simply schema) is a set of relational symbols (or\npredicates), each with its associated arity. We write r/n to denote that the predicate\nr has arity n and we refer to the integer n by arity(r). A position r[i], in a schema\nR, is identiﬁed by a predicate r ∈R and its i-th argument (or attribute). A term t\nis either a constant or a null or a variable. An atomic formula (or simply atom) has\nthe form r(t1,...,tn), where r/n is a relation, and t1,...,tn are terms. For an atom a,\nwe denote as dom(a) and pred(a) the set of its terms and its predicate, respectively.\nThese notations naturally extends to sets and conjunctions of atoms. Conjunctions\nof atoms will be often identiﬁed with the sets of their atoms.\nA substitution from a set S1 ⊂Γ ∪ΓN ∪ΓV to a set S2 ⊂Γ ∪ΓN ∪ΓV is a function\nh : S1 →S2 deﬁned as follows: (i) ∅is a substitution, and (ii) if h is a substitution,\nthen h∪{X →Y} is a substitution, where X ∈S1 and Y ∈S2. A homomorphism from\na set of atoms A1 to a set of atoms A2 is a substitution h : dom(A1) →dom(A2) such\nthat: (i) if t ∈Γ , then h(t) = t, and (ii) if r(t1,...,tn) ∈A1, then h(r(t1,...,tn)) =\nr(h(t1),...,h(tn)) ∈A2. If there exists a homomorphism from A1 to A2 and vice-\nversa, then A1 and A2 are homomorphically equivalent. The notion of homomor-\nphism naturally extends to conjunctions of atoms.\n1.2.2 Databases and Queries\nA relational instance (or simply instance) I for a schema R is a (possibly inﬁnite)\nset of atoms of the form r(t), where r/n ∈R and t ∈(Γ ∪ΓN)n. We denote as r(I) the\nset {t | r(t) ∈I}. A database D for R is a ﬁnite instance for R such that dom(D) ⊂Γ .\nFor simplicity, we assume source databases which contain only ground atoms, i.e.,\natoms whose arguments are constants of Γ . However, it is not difﬁcult to show that\nthe results of this paper hold even if we allow incomplete source databases which\nmay include labeled nulls.\nA conjunctive query (CQ) q of arity n over a schema R, written as q/n, is an\nassertion the form p(X) ←ϕ(X,Y), where ϕ(X,Y) is a conjunction of atoms over\nR, and p is an n-ary predicate not occurring in R. ϕ(X,Y) is called the body of q,\ndenoted as body(q). The answer to a CQ q/n of the above form over an instance I,\ndenoted as q(I), is the set of all n-tuples t ∈Γ n for which there exists a homomor-\nphism h : X∪Y →Γ ∪ΓN such that h(ϕ(X,Y)) ⊆I and h(X) = t.\n",
  "speaker": "SYSTEM",
  "uuid": "9b132b48-8c66-4b11-a299-a753c128fc55"
}