{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 97\n95\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Better customer understanding by email mining , call centre interactions, and so forth\n• Find new sales prospects\n• Comply with regulations (risk management)\n• Monitor what people are saying about the company and their products on the Web or in the tradition‐\nal media\n• Publishing uses such as automatically creating specialized topical newsletters and alerts or displaying\nlive, structured news/social media newsfeeds\n• Mine for cause and effect (e.g., determine causes of product or campaign failures — the «why» behind\nthe data from the BI systems)\n• Reduce call centre costs\n• Litigation support \n• Near‐duplicate document detection\n• Precision support of foreign languages\nTrends\nThe enterprise and navigation search market has seen successive waves of change. These upheavals have\nbeen caused by a confluence of factors that change the demands of the market for new features and func‐\ntions. These factors, in order of their appearance, include:\n• Search as a self‐service environment for business users, not designed exclusively for information pro‐\nfessionals.\n• Cross‐organization intranet search as part of a knowledge management portal.\n• An expanded definition of full‐function enterprise search, including both internal uses and outward‐fac‐\ning Web site search.\n• Search deployed as a unification point for multiple content sources, either through integrating content\nin a central index or through federation.\n• Emergence of search‐based applications to address specific business process requirements (e.g.,\neDiscovery, online commerce catalogue search, and expertise location).\n• BI and search converge in unified information access offerings, which take search beyond text and BI\nbeyond transactional data analysis. This demand for unified search of data will push more mergers and\nacquisitions coming, for example, from traditional BI vendors that seeks to add search functionality.\nSearch‐based applications means a disruption point for this submarket as it allows creating workspaces for\ninformation workers that:\n• Are tailored to fit a specific task or workflow\n• Combine multiple technologies and tools, particularly search, collaboration, authoring tools, content\nmanagement, and analytics\n• Integrate information from multiple sources\n• Incorporate domain‐ and organization‐specific term lists, taxonomies, and knowledge bases\n• Hide technical complexity below an easy, compelling UI that may have dashboard‐like qualities\nCurrently the top five drivers for search and navigation acquisition will be: eDiscovery; search engine opti‐\nmization/search marketing; mobile search from handheld devices; tag, classify, and categorize documents\nautomatically; and fraud detection (insurance claims, warranties, financial, etc.). However, new applications\nwill appear like competitive intelligence or cybercrime detection.\nMarket leaders \nThe top 3 vendors in 2011 based on worldwide revenue were HP, Microsoft, and Google Inc., accounting for\n",
  "speaker": "SYSTEM",
  "uuid": "9b7884c2-b0a8-4cbb-b8d3-b10565073688"
}