{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 50\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 50 \n \nAutores (p.o. de firma): Vilches Blázquez LM, Rodríguez Pascual AF, Mezcua Rodríguez J, Bernabé Poveda \nMA, Corcho O \nTítulo: An Approach Towards A Harmonized Framework For Hydrographic Features Domain \nTipo de participación: Comunicación \nCongreso: XXIII International Cartographic Conference (ICC2007). http://www.icc2007.com/key1/lang2.htm \nPublicación: -- \nLugar celebración: Moscú (Rusia) \nFecha: Agosto 2007 \n \nRef: Workshop25 / CLConf17 \nAutores (p.o. de firma): Corcho O, Alper P, Missier P, Bechhofer S, Goble CA, Xing W \nTítulo: Metadata Management in S-OGSA \nTipo de participación: Comunicación \nCongreso: ICCS2007 International Workshop on Collective Intelligence for Semantic and Knowledge Grid \n(CISKGrid 2007). \nPublicación: Springer-Verlag, LNCS 4488, pp 712-719 \nLugar celebración: Beijing (China) \nFecha: Mayo 2007 \n \nRef: CLConf16/Conferencia17 \nAutores (p.o. de firma): Ure J, Procter R, Martone M, Porteous D, Lloyd S, Lawrie S, Job D, Baldock R, Philp A, \nLiewald D, Rakebrandt F, Blaikie A, McKay C, Anderson S, Ainsworth J, van Hemert J, Blanquer I, Sinnott R, \nBarillot C, Gibaud FB, Williams A, Hartswood M, Watson P, Smith L, Burger A, Kennedy J, Gonzalez-Velez H, \nStevens R, Corcho O, Morton R, Linksted P, Deschenes M, McGilchrist M, Johnson P, Voss A, Gertz R, Wardlaw \nJ. \nTítulo: Data Integration in eHealth: A Domain/Disease Specific Roadmap  \nTipo de participación: Comunicación  \nCongreso: 5th HealthGrid Conference (HealthGrid2007) \nPublicación: In (eds): Nicolas Jacq, Henning Müller, Ignacio Blanquer, Yannick Legré, Vincent Breton, \nDominique Hausser, Vicente Hernández, Tony Solomonides, and Martin Hofmann-Apitius; From Genes to \nPersonalized HealthCare: Grid Solutions for the Life Sciences, Studies in Health Technology and Informatics 126, \n144-153, April 2007, ISBN 978-1-58603-738-3 \nLugar celebración: Ginebra (Suiza) \nFecha: Abril 2007 \n \nRef: Workshop24 \nAutores (p.o. de firma): Sánchez-Gestido M, Blanco-Abruña L, Pérez-Hernández MS, González-Cabrero R, \nGómez-Pérez A, Corcho O \nTítulo: Complex Data-intensive Systems and Semantic Grid: Applications in Satellite Missions \nTipo de participación: Comunicación \nCongreso: e-Science 2006 Workshop on Engineering e-Infrastructures for the Benefits of e-Science \nPublicación: IEEE \nLugar celebración: Amsterdam (Holanda) \nFecha: Diciembre 2006 \n \nRef: CLConf15 / Conferencia16 \nAutores (p.o. de firma): Goble CA, Corcho O, Alper P, De Roure D \nTítulo: e-Science and the Semantic Web: a Symbiotic Relationship \nTipo de participación: Comunicación \nCongreso: 9th International Conference on Discovery Science (DS-2006) \nPublicación: Springer Verlag, LNAI 4265, pp 1-12 \nLugar celebración: Barcelona (España) \nFecha: Octubre 2006  \n \nRef: Póster06 \nAutores (p.o. de firma): Corcho O, Gómez-Pérez A, López-Cima A, Suárez de Figueroa MC \nTítulo: EU R&D Project Management with ODESeW \n",
  "speaker": "SYSTEM",
  "uuid": "9b884274-a7ad-4d1d-aec9-e3170312f778"
}