{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 5\nmalisation of the QR vocabulary in OWL the DynaLearn QR ontology5. This ontology\ndeﬁnes the generic building blocks (e.g. the concepts entity, conﬁguration and different\nkinds of causal relations and inequalities) that can be used in a QR model. The Dy-\nnaLearn QR Ontology functions as our generic ontology that extends the ontological\ncommitments made by OWL.\nWhen modellers create QR models, they extend the QR vocabulary by deﬁning do-\nmain speciﬁc model ingredients, called domain building blocks, such as entities, con-\nﬁgurations, and quantities. Creating such a domain speciﬁc vocabulary can be seen as\nreﬁning some of the generic building blocks in the generic ontology to deﬁne a domain\nontology. Note that the domain building blocks correspond to the model ingredient def-\ninitions (Section 2). The generic building blocks in the DynaLearn QR ontology, and\nthe domain building blocks in the QR model ontology (which are all represented as\nclasses) are instantiated in model fragments and scenarios to represent speciﬁc situ-\nations and processes. We refer to these ontologies as QR model ontologies. The QR\nmodel ontologies refer to concepts in the DynaLearn QR ontology. In the rest of this\npaper, when we use the word QR model to refer to QR model ontologies.\nRepresentation\nOntology\nGeneric\nOntology\nDomain\nOntology\nApplication\nOntology\nWeb Ontology\nLanguage\nQualitative\nReasoning\nOntology\nQR Model Ontology\nDomain\nAggregates\nDomain\nBuilding Blocks\nFig. 3. Correspondences between the QR ontologies and ontology types based on the type of\nontological commitments made.\n4\nSemantic Grounding\nThe text above details how QR models can be represented in terms of an ontological\nlanguage. The next step is to link the components of the QR model into well deﬁned\nexternal vocabularies. We refer to this process as grounding (also known as anchoring in\nother contexts [1]), or the task of connecting model concepts to one or more equivalent\nconcepts in a background knowledge ontology (or network of ontologies).\n4.1\nGrounding Process\nFrom a user perspective, the grounding process follows a semiautomatic approach: for\na given model term, a list of candidate ontology terms (representing the possible mean-\nings of the model term) is automatically proposed to the user. Such a list is ranked\n5 http://staff.science.uva.nl/∼jliem/ontologies/QRvocabulary.owl\n",
  "speaker": "SYSTEM",
  "uuid": "9c5c766c-b80d-4d12-9caf-9401c1ea301d"
}