{
  "message": "SYSTEM: Cvn_2016330.MRA.pdf: Página 2\ncb2d39d09dc060b0d8d95bd980f238a5\n2\nSummary of CV\nThis section describes briefly a summary of your career in science, academic and research; the\nmain scientific and technological achievements and goals in your line of research in the medium\n-and long- term. It also includes other important aspects or peculiarities.\n Professional biography\nMariano Rico is a Postdoctoral Researcher (funded by National Spanish Research Ministry\nunder  Juan de la Cierva Programme) at the Ontology Engineering Group (OEG) in the Artificial\nIntelligence Department (DIA) at Universidad Politécnica de Madrid (UPM), Spain.\nHe was also Honorary Professor at the Computer Science and Engineering Department (EPS)\nof the Autonomous University of Madrid (UAM).\nDuring 2010-2013 he was a postdoctoral Teaching Assistant at EPS-UAM in the GHIA\nResearch Group. In 2010 he was a postdoc researcher at  EPS-UAM and  Associate professor\nat the Telematic Engineering Department in the Universidad Carlos III de Madrid (UC3M).\nFrom 2003 to 2009 he was a teaching assistant at the EPS-UAM.\nMariano holds a MSc. in Physics Sciences (1992) (Fundamental Physics specialist), MSc.\n(Advanced Studies Diploma) in Computer Science and Telecommunication (2004) and a\nPhD. in Computer Science and Telecommunicaction (2009) by Universidad Autónoma de\nMadrid (UAM). He is   accredited  as Associate Professor since January 2010 and as\n  Lecturer  since September 2012 by the spanish quality agency ANECA (a full member of\nEuropean Association for Quality Assurance in Higher Education).\nHis research activities are focused on Semantic Web and Linked Data, but he is also interested\nin Natural Language, Virtual Worlds, Human-Computer Interaction and Web Technologies.\nFrom 1992 to 2003 he worked in private R&D centers as Software Engineer, Software Architect\nand Project Manager in different research and applied fields related to new technologies.\nHe had two predoctoral stays at Digital Enterprise Research Institute (DERI) in 2004 and 2005,\nin which he was also Erasmus Teacher at the National University of Ireland, Galway (NUIG).\nIn 2011 he had a short stay at the Web-based Systems Group, Freie Universitat (FU) at Berlin\n(Germany). From 2013 he also is related to the AKSW Research Group (Leipzig University,\nGermany) for his involvement as head of the DBpedia Spanish chapter. From 2014 he is\nrelated to the Semantic Computing Group (univ. Bielefeld, Germany), with activities related to\nLinguistics and Linked Data.\nMain scientific and technological achievements\nDuring his period in private companies (1993-2003) he worked in Human-Computer\nInteraction, Multiplatform User Interfaces and Advanced Web Technologies. In the pre-doctoral\nperiod (2003-2009) he was focused on Semantic Web. Currently, in his first post-doctoral\nperiod (2009-2014) he combined his main line in Semantic Web and Linked Data with a\nresearch line based on non-immersive virtual worlds. From 2014 I also works with Natural\n",
  "speaker": "SYSTEM",
  "uuid": "9cbe764b-a627-4cd2-b594-bcca61325d8f"
}