{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 92\nPage 92 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nare organized into Orders, which are grouped into Main Groups. To store this data in a \nrelational database, the DB designers organized the information into three sorts: a) hierarchy of \ntypes (groups - order - family - species); b) actual instances (i.e. all individual species, families, \norders, and groups are represented as individual items); c) actual hierarchies (i.e. each \nindividual item is linked to its \"sub-item\" along the line). These three sorts of information are \nstored in three tables linked to one another by secondary keys.  \nBy looking at the actual data in the DB the FAO team discovered that the actual hierarchy (as \nstored in the table) did not include Genus (that is, no timeseries is available for that), therefore \nthe ontology model was modified accordingly (this is an example of the iterative process \nmentioned above).  \n6. Population of the models. The FAO team used ODEMapster to automatically populate the \nontology. The FAO team chose one model (the latest resulting from the iterative process \ndescribed above), and also modified slightly the model during the work, considering the \npossibilities of the tool at that time. For example, some properties that were first thought to be \nmodeled as object properties were turned into datatype properties because it was easier to \npopulate the ontology with the version of the tool available at the time. This happened, for \nexample, with names of species in various languages; however, some of the modeling \ndecisions made on these considerations were later deemed appropriate, independently of the \ntool.  \nThe life cycle model used for building FAO ontologies follows an iterative approach, and it is \ngraphically represented in Figure 38 [61].   \n \nFigure 38. Life Cycle Model Selected in FAO Use Case [61] \nThe six activities aforementioned are placed in the first block of steps (1, 2, 3) of Figure 38. The \nsecond block (steps 4 and 5) concerns the validation and update for which there is currently no tool \nor dedicated environment. For this reason, it is necessary that ontology editors inspect and validate \nthe ontologies under development; in the FAO case, the team used the html pages generated by \nOWLdoc (in Protégé).  \nThe third block of Figure 38 (step 6) depicts the production environment. Since the FAO team did \nnot have an integrated tool that would allow them to move from creation to production through \nvalidation, the FAO team itself moved the ontologies to the production environment.  \nIn short, the process that lead to the WP7 fishery ontologies consisted in an iteration of: a) \nconceptualization based on well-known methodologies; and b) population from the database and \nconsequent revision of the previous conceptualization.  \n",
  "speaker": "SYSTEM",
  "uuid": "9cc3dfaf-be45-4122-95c4-77fcd932e149"
}