{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 10\n2.10. Elementos de innovación (nuevas tecnologías y soluciones innovadoras). En caso de haber\nseleccionado en el apartado 2.3 que la solución existe en el mercado, describa cuáles son los elementos\ndiferenciadores de su propuesta frente a otros productos y servicios existentes (máx. 3.000 caracteres)\n2.11. Nivel de desarrollo actual en el que se encuentra su solución propuesta. En caso de conocer el nivel\nde madurez tecnológica TRL (*) en el que se encuentra, indíquelo.\n2.12. Regulaciones y normativa asociadas a la\nsolución propuesta\nNombre del Archivo\nBreve Descripción\nConfidencial*\n*Marcar en el caso de que la documentación correspondiente sea confidencial\n(*) Los códigos TRL se pueden consultar en “HORIZON 2020 – WORK PROGRAMME 2016­2017 General\nAnnexes: G. TRL”\n2.13. Documentación relativa a la Solución I aportada como adjunto al correo electrónico\nEl tamaño máximo de toda la documentación, incluido el presente formulario, no deberá superar 15 MB al ser enviado\npor correo electrónico\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nTRL:\nComentarios TRL:\nNota: En caso de que la solución propuesta sea aplicable a diferentes ámbitos y el nivel de\nmadurez tecnológica (TRL) de su solución sea distinto según el ámbito de aplicación, seleccione\nen el selector de TRL el de mayor madurez y en el apartado \"Comentarios TRL\" detalle el nivel\nde madurez tecnológica (TRL) en cada ámbito.\n­10­\n(*) Campos obligatorios\nRecuerde Validar el formulario antes de su envío\nmediante el botón habilitado para tal fin en la página 13\nversión 1.2.\nLos elementos diferenciadores de la propuesta son: \n.- Integración   de distintas herrmientras sobre un entorno git \n.- Generaciónn   de portales a modo de catálogo   de ontologías  automático \n.- Publicación  de ontologías automatica con w3id \n.- Generación   de negociación   de contenido para ontologías \nTRL5\n*\n",
  "speaker": "SYSTEM",
  "uuid": "9d7d024a-a382-4fe5-8d10-e4b189c463ee"
}