{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 33\n \n \nPág. 35 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nIntroducir el  concepto de datos abiertos de interés lingüístico  en la IODC 2016, en \ncolaboración con Iberoamérica, para dar visibilidad a la política de datos abiertos \nlingüísticos. \n- Medida 2: Seleccionar normas técnicas de interoperabilidad, políticas de licencias abiertas \ny mecanismos de protección de datos personales adecuados. \n- Medida 3: Disponer de las herramientas comunes necesarias para generar y explotar \nestos recursos lingüísticos (anonimizadores, alineadores de texto, flujos de \nprocesamiento…) en la plataforma de procesamiento del lenguaje natural de las \nAdministraciones Públicas prevista en este Plan. \n- Medida 4: Identificar aquellos corpus de información del sector público susceptibles de \nconvertirse en recursos lingüísticos. \n- Medida 5: Catalogar estos recursos lingüísticos abiertos dentro del portal de datos \nabiertos introduciendo una experiencia de usuario avanzada. \n- Medida 6: Facilitar la disponibilidad a estos recursos en las plataformas de procesamiento \nde lenguaje natural y traducción automáticas de las Administraciones Públicas previstas \nen este Plan. \n- Medida 7: Elaborar un plan de generación de recursos lingüísticos a partir de la \ninformación del sector público. \n \nEje IV: PROYECTOS FARO DE TECNOLOGÍAS DE PROCESAMIENTO DEL LENGUAJE NATURAL \nLínea 1: Proyectos faro de tecnologías de procesamiento del lenguaje natural de las \nAdministraciones Públicas  \nMotivo: \nPoner en marcha las demás medidas del Plan, que son de naturaleza horizontal, transversal, con \nactuaciones en servicios públicos concretos de alto impacto social, que abarquen toda la cadena \nde valor y den lugar a productos y servicios acabados, con el fin de poner en valor las \ncapacidades y beneficios de las tecnologías del procesamiento del lenguaje natural y la \ntraducción automática. \nLos proyectos de la Administración en el sector del procesamiento de lenguaje natural y la \ntraducción automática requieren en general de capacidades de escalada horizontal y vertical \npara procesamiento de grandes volúmenes de información y servicio simultáneo a numerosos \nusuarios, orientación a componentes y empleo de estándares que garanticen la máxima \nreutilización e interoperabilidad. Por otra parte, es necesario facilitar también la posibilidad de \ndesplazar el procesamiento al dato por diversas razones, como pueden ser el volumen excesivo \nde los datos o las restricciones de confidencialidad. \n",
  "speaker": "SYSTEM",
  "uuid": "9f30ece8-c73d-4320-82bb-96ce5a42b31f"
}