{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 100\n98\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nPlanning\n• Tactic decision‐making process: Ad‐hoc, exploratory analysis, Root cause analysis, Operational metrics,\nGranular data from multiple sources and of multiple types, Rapid scenario evaluation, Collaboration\n• Strategic decision‐making process: Rules based automation, Pattern and exception identification,\nGuided  navigation, Real‐time monitoring\nTrends\nContent analytics is growing strongly under the influence of the Business Analytics and Big Data markets, as\nit is becoming more and more important to be able to analyse unstructured data. Therefore:\n• Technology convergence: content analytics needs to be automated, on real‐time and integrated into\ncorporate information flow. So it’s expected that in the context of the business analytics platforms, sev‐\neral technologies will converged: content analytics, In‐memory processing, in‐database analytics,\nsearch‐based applications, non‐row databases, and non‐SQL analytics. As a result it is expected that\ncontent analytics functionality will migrate into the database.\n• Market consolidation: This market is living a consolidation. New rounds of M&A will include industry\nand business process specific content analytic vendors. The main IT vendors are completing their infor‐\nmation management portfolio acquiring companies that provide content analytics services and solu‐\ntions. For example, HP acquired Autonomy, IBM acquired Coremetrics, Salesforce acquired Radian6,\nIBM acquired SSPS, SAP acquired Inxight, Oracle acquired Endeca and Accenture acquired Neometrics.\nSo, a growing portion of buyers of content analytics technology will be services providers and applica‐\ntion vendors that incorporate content analytics in their broader offerings.\n• Customer behaviour requires an integrated approach: Although rich media analytics hold an important\npiece of the puzzle of the customer behaviour, it’s not the single source of relevant information.\nCustomers interact with companies through several channels and the social based interactions create\nsocial data that reflects the relationship of people to people, topics, ideas, or locations. So it is required\nto combine and integrate easily online (web, mobile, video and off‐site) and offline content (CRM, POS,\ncall centre).\nMarket leaders\nIn the content analytics industry we observe that there exist a rich open source ecosystem with solutions like\nR, Weka or Rapid miner and commercial solutions with important vendors like SAS, IBM, SAP, Microsoft, etc.\nBig vendors not only include vertical content analytics solutions but also a complete portfolio that covers the\nmain deploying needs (from infrastructure to visualization). \nThe top 3 vendors in 2011 based on worldwide analytics revenue were SAS, IBM and Microsoft. In Europe,\nhundreds of small companies operate in the content analytics market such as Temis, Attensity, Linguamatics\nor Picturesafe. Some provide a single tool or application, while others offer software that spans multiple\nmarket segments. Some of these vendors are highly focused on specific business processes and/or indus‐\ntries, while others offer horizontal technology applicable across the market. There is also a range of business\nmodels (e.g., commercial software and open source) and go‐to‐market strategies (e.g., on premises and soft‐\nware as a service [SaaS]) among these vendors revenue.\n",
  "speaker": "SYSTEM",
  "uuid": "9fcd391f-7887-4674-905b-3271be4f6c1b"
}