{
  "message": "SYSTEM: D5.3.2.pdf: Página 47\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 47 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \nReferences \n1. IEEE Standard Glossary of Software Engineering Terminology. IEEE Std 610.12-1990 \n(Revision and redesignation of IEEE Std 792-1983). \n2. NeOn Consortium. NeOn: Lifecycle Support for Networked Ontologies. NeOn Technical Annex. \n2006. \n3. K. Dellschaft, H. Engelbrecht, J. Monte Barreto, S. Rutenbeck, S. Staab. Cicero: Tracking \nDesign Rationale in Collaborative Ontology Engineering. Proceedings of the ESWC 2008 \nDemo Session. Available at: http://www.uni-koblenz.de/~klaasd/Downloads/papers/Dellschaft2008CTD.pdf. \n4. K. Dellschaft, A. Gangemi, J. Gómez, H. Lewen, V. Presutti, M. Sini. NeOn Deliverable D2.3.1 \nPractical Methods to Support Collaborative Ontology Design. February 2008. Available at: \nhttp://www.neon-project.org/.   \n5. P. Haase, S. Rudolph, Y. Wang, S. Brockmans, R. Palma, and J. Euzenat, M. d'Aquin. NeOn \nDeliverable D1.1.1 Networked Ontology Model. November 2006. Available at: http://www.neon-\nproject.org/. \n6. C. Larman. Applying UML and patterns: an introduction to object-oriented analysis and design \nand the unified process. Second edition. Pearson Education, Inc. Publishing as Prentice Hall \nPTR. 2002. ISBN: 0-13-092569-1. \n7. E. Paslaru-Bontas, C. Tempich, Y. Sure. ONTOCOM: A Cost Estimation Model for Ontology \nEngineering. Proceedings of the 5th International Semantic Web Conference (ISWC 2006). \nVolume 4273. Lecture Notes in Computer Science (LNCS), pp. 625--639. Springer-Verlag \nBerlin Heidelberg, 2006. \n8. S. Pfleeger. Software Engineering: Theory and Practice. 2nd edition. Prentice Hall 2001. ISBN: \n0-13-029049-1. \n9. H. S. Pinto, C. Tempich, S. Staab. DILIGENT: Towards a fine-grained methodology for \nDIstributed, Loosely-controlled and evolvInG Engingeering of oNTologies Proceedings of the \n16th European Conference on Artificial Intelligence (ECAI), 2004 \n10. M. C. Suárez-Figueroa, G. Aguado de Cea, C. Buil, C. Caracciolo, M. Dzbor, A. Gómez-Pérez, \nG. Herrero, H. Lewen, E. Montiel-Ponsoda, V. Presutti. NeOn Deliverable D5.3.1. NeOn \nDevelopment Process and Ontology Life Cycle. NeOn Project. http://www.neon-project.org. \nAugust 2007. \n11. M. C. Suárez-Figueroa, K. Dellschaft, E. Montiel-Ponsoda, B. Villazon-Terrazas, Z. Yufei, G. \nAguado de Cea, A. García, M. Fernández-López, A. Gómez-Pérez, M. Espinoza, M. Sabou. \nNeOn D5.4.1. NeOn Methodology for Building Contextualized Ontology Networks. NeOn \nproject. http://www.neon-project.org. February 2008.  \n12. M. C. Suárez-Figueroa, A. Gómez-Pérez. Towards a Glossary of Activities in the Ontology \nEngineering Field. 6th Language Resources and Evaluation Conference (LREC 2008). \nMarrakech (Morocco). May 2008.  \n",
  "speaker": "SYSTEM",
  "uuid": "a05fd955-f979-4f44-9ace-a3ae71e9a75a"
}