{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 9\n \n \n9\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n10.2. El beneficiario se obliga a cursar estudios de doctorado en la Universidad Politécnica \nde Madrid, lo que justificará cuando sea requerido para ello por el Vicerrectorado de \nInvestigación. \n10.3. El beneficiario asumirá las obligaciones que le correspondan en razón de su  inclusión \nen el Régimen General de la Seguridad Social. \n10.4. Los adjudicatarios de la beca se comprometen a incorporarse en la fecha señalada al \nGrupo de investigación, Departamento, Centro I+D, o Instituto en cuyo seno vayan a \nrealizar la actividad investigadora, entendiéndose como renuncia a la beca la no \nincorporación en la fecha que el Vicerrectorado de Investigación determine. \n10.5. El beneficiario desarrollará su labor con dedicación exclusiva sin que ningún otro \ncompromiso, anterior o futuro, impida o dificulte, durante el período de vigencia de la \nmisma, el cumplimiento ininterrumpido de las obligaciones contraídas.  \nEl Director, con el conocimiento de la Dirección del Departamento, Grupo de \ninvestigación, Centro I+D o Instituto Universitario, deberá señalar la jornada y el \nhorario en que haya de realizar su actividad el beneficiario, que serán similares a los \ndel personal de la Universidad, de lo cual se dará cuenta al Vicerrectorado de \nInvestigación. \nAsí mismo, deberá cumplir con aprovechamiento los distintos hitos del proyecto de \ninvestigación, en los términos que sean autorizados, o se señalen posteriormente, \ndebiendo ajustarse al cumplimiento de las normas propias de la Universidad  \nPolitécnica  de  Madrid.  \nDe cualquier incidencia en la ejecución del programa de trabajo se dará cuenta al \nVicerrectorado de Investigación por los cauces establecidos estatutariamente. El \nDirector podrá solicitar modificación del programa de trabajo. \n10.6. Los beneficiarios de las ayudas quedan responsabilizados de remitir, en sus fechas    \ncorrespondientes, informe y memoria sobre la labor realizada y los resultados \nobtenidos en los formularios al efecto suministrados, con el visto bueno del Director. \nBeneficiario y Director se obligan a realizar un Informe Final al término de la ayuda, se \nproduzca éste como consecuencia de renuncia o por expirar el período total de \ndisfrute. Igualmente, el beneficiario deberá comunicar al Vicerrectorado de \nInvestigación la calificación resultante de la lectura de tesis y la fecha de la misma, en \nlos veinte días posteriores a la lectura.  \nEl beneficiario y el Director están obligados a informar y prestar la colaboración que \nresulte precisa al Vicerrectorado de Investigación de la Universidad Politécnica de \nMadrid. \n10.7. Los beneficiarios realizarán sus actividades en la dependencia adscrita, en su caso al \nGrupo de Investigación, o directamente del Departamento, Centro I+D, o Instituto. \nCualquier cambio de Centro, de Director, de Proyecto de Investigación, paralización, o \nrenuncia deberá contar con la autorización expresa del Vicerrectorado de Investigación \ny tramitarse con el visto bueno del Director, Director del Departamento, Centro I+D, \nInstituto, y/o responsable del Grupo de Investigación. De los cambios autorizados será \ninformado el Director/Decano del Centro. Asimismo, deberá notificarse al \nVicerrectorado toda ausencia por causa de enfermedad. \n",
  "speaker": "SYSTEM",
  "uuid": "a0f08e38-7fbc-4141-af59-8f866c294f21"
}