{
  "message": "SYSTEM: FormularioCPM_ocorcho.pdf: Página 8\n2.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n2. Solución II\n2.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n2.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n2.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­8­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN II (marque esta casilla para habilitar los campos asociados a la solución II)\nversión 1.2.\n#\nTítulo: esDBplus \n \nEl uso de datos enlazados ha demostrado su utilidad para mejorar el procesamiento del \nlenguaje natural. En particular, la disponibilidad de los datos enlazados como base de \nconocimiento mejora las prestaciones de ciertas tecnologías del lenguaje, como la \ndesambiguación, la detección de entidades nombradas, la generación de resúmenes o la \ntraducción automática. \n \nPara dar un mejor soporte a las tecnologías del lenguaje es imprescindible mejorar la \ncalidad de los datos usados como base. El capítulo en español de la DBpedia (esDBpedia), \nmantenido por el Ontology Engineering Group, es el núcleo central en torno al cual se \nenlazan otros conjuntos de datos en español de diferentes dominios (empresas, personas, \nrecursos lingüísticos, \netc.). esDBpedia, al igual que el resto de capítulos de la DBpedia, es \ngenerada semi-automáticamente a partir de los datos de Wikipedia, transformándolos a \nRDF. Esto hace que los datos contengan errores debidos tanto a información incorrecta en \norigen (Wikipedia) como a problemas en el proceso de transformación. \n \nesDBplus es el resultado de aplicar a esDBpedia técnicas de detección de errores y mejora \nde datos, así como enlaces a nuevos datasets, para obtener una versión ampliada y de \nelevada calidad de esDBpedia. Los nuevos datasets incluyen información de empresas y \norganismos públicos, personas de interés, centros de investigación, y todo lo que se \nconsidere relevante para ayudar a los servicios de PLN ofrecidos sobre esta plataforma. \n \nA diferencia de esDBpedia, que únicamente contiene datos el español (castellano), \nesDBplus puede incluir los datos de los capítulos de Wikipedia de las lenguas cooficiales \n(catalán, gallego y euskera). Esto permite proporcionar servicios de NLP en las distintas \nlenguas cooficiales.  \n \nNuestra experiencia en la creación y mantenimiento de esDBpedia nos ha permitido \nidentificar algunas necesidades de los usuarios para acceder a los datos, siendo la más \ndestacable la  incorporación de un API REST. También hemos identificado las necesidades \nde los proveedores de datos, entre las que destaca el proporcionar datos previo pago. \nPara permitir servicios de pago por datos proporcionamos un servicio de acceso \ncondicional a datos sobre algunos datasets.    \n \nLos objetivos de la propuesta son los siguientes: \na) Mejorar de forma automática e incremental los datos de esDBplus a partir de distintas \nfuentes, soportando el desarrollo de mejores aplicaciones y técnicas de procesamiento del \nlenguaje natural. \nb) Enlazar con otros datasets relevantes en diferentes dominios ya existentes (e.g. \nDBpedias en otros idiomas, Wikidata, Biblioteca Nacional, Instituto Geográfico Nacional), \nincrementando así la cantidad de datos accesibles en esDBplus. \n#\n#\n#\n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "a16abed6-ab92-44df-a5f8-634f819dbbb3"
}