{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 16\n \nAutores: Fernández-López, M.; Gómez-Pérez, A. \nTítulo: “METHONTOLOGY” \nTipo de participación: Ponencia \nCongreso: SIG on Enterprise Standard Ontology Environment. Ámsterdam \n \nPublicación:  \n \nLugar celebración: Ámsterdam (Holanda) \nFecha: 12/2001 \n \n \nAutores: Fernández-López, M. \nTítulo: “Bi-phase method, based on meta-models, for building ontologies” \nTipo de participación: Ponencia \nCongreso: SIG on Enterprise Standard Ontology Environment. Ámsterdam \n \nPublicación:  \n \nLugar celebración: Ámsterdam (Holanda) \nFecha: 12/2001 \n \n \nAutores: Arpírez, J.C.; Corcho, O.; Fernández López, M.; Gómez-Pérez, A. \nTítulo: \"WebODE: a Workbench for Ontological Engineering\" \nTipo de participación: Comunicación \nCongreso: First International Conference on Knowledge Capture (K-CAP’01). \n \nPublicación: \n \nLugar celebración: Victoria B. C. (Canada) \nFecha: 10/2001 \n \n \n \nAutores: Fernández López, M.; Gómez-Pérez A.; Rojas, M.D. \nTítulo: “Ontologies’ crossed life cycles” \nTipo de participación: Comunicación (artículo ya mencionado en capítulos de libro) \nCongreso: 12th International Conference on Knowledge Engineering and Knowledge Management EKAW00 in cooperation \nwith the American Association for Artificial Intelligence (AAAI) \n \nPublicación:  \n \nLugar celebración: Juan-les-Pins (Francia) \nFecha: 10/2000 \n \nAutores: Fernández López, M. \nTítulo: “Overview of methodologies for building ontologies” \nTipo de participación: Ponencia \nCongreso: Workshop titulado Ontologies and Problem-Solving Methods: Lessons Learned and Future Trends de la \nconferencia International Joint Conference for Artificial Intelligence (IJCAI’99) \nPublicación: Págs. 4-1 a 4-13 \n \nLugar celebración: Estocolmo (Suecia) \nFecha: 08/1999 \n \nAutores: G. Aguado, A. Bañón, J. Bateman, S. Bernardos, M. Fernández, A. Gómez Pérez, E. Nieto, A. Olalla, R. Plaza, A. \nSánchez \nTítulo: “Ontogeneration: arquitectura basada en ontologías para la generación de textos en castellano” \nTipo de participación: Comunicación \nCongreso: VII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA) \n",
  "speaker": "SYSTEM",
  "uuid": "a2318774-593b-4b1f-844e-589b61141090"
}