{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 18\n16\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nBy 2015, the market should grow to nearly €30B. While the software revenue proportion remains roughly\nthe same, the proportion spent on translation software increases significantly, and the proportion spent on\ncontent software declines.\nAmerica plays in important role in the development of LT industry. In 2011, the software revenue in America\naccounted 48,4% of total software revenue and Europe 25.8%. Americas’ LT software market was 1.9 times\nbigger than European market in 2011. By 2015, the situation will remain similar. Americas’ LT software mar‐\nket is foreseen to be 1.8 times bigger than European market and the markets will weight 40.3% and 25.2%\nrespectively. Thus America is expected to capitalize on software revenues and continue dominating the LT\nsoftware market. \nOpposite to the software, the LT services market is expected to be capitalized in Europe and situation tends\nto benefit this continent. In 2011, the LT services market revenue accounted for 41,9% of total software rev‐\nenue in America, while 40.6% in Europe. Thus, in 2011 the Americas’ LT services market was 1.03 times big‐\nger than European market. Nevertheless, by 2015, the situation will be different. Americas’ LT services mar‐\nket will be 0.97 times bigger than European market, as European market will grow at higher pace. The mar‐\nkets will weight 40.3% and 41.7% respectively. The demand for LT services is expected to growth in Europe.\nCurrently, the European market is competitive with respect to American suppliers, with a stronger academ‐\nic base, however business adoption is faster in America, lowering differences in market in a 4‐5 years’ time. \nFigure 5: Worldwide Language Technology Software & Services Market\nWorldwide Language Technology Software & Services Market 2011 & 2015 (€B)\n",
  "speaker": "SYSTEM",
  "uuid": "a2c90a1c-4425-4d74-a04c-cbf39729b9ce"
}