{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 76\nBÚSQUEDA \n \n76 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEn lo referente a la implementación, las búsquedas heurísticas pueden aprovechar \nla información en dos funciones diferentes: \n \n> expandir-nodo \n \n> reorganizar-nodos-a-expandir \n(En el primer caso se trata de métodos de la familia \"escalada\" y en el segundo, que \ntambién puede aprovechar la información en expandir-nodo, se tiene la familia \n\"primero el mejor\".) \nLa información del problema concreto que estamos intentando resolver se suele \nexpresar por medio de heurísticas. El concepto de heurística es difícil de \naprehender. Newell, Shaw y Simon en 1963 dieron la siguiente definición: \"Un \nproceso que puede resolver un problema dado, pero que no ofrece ninguna garantía \nde que lo hará, se llama una heurística para ese problema\". \nSi nos planteamos seguir concretando como aprovechar la información sobre el \nproblema en sistemas de producción, la siguiente idea consiste en concentrar toda la \ninformación heurística en una única función que se denomina función de evaluación \nheurística. Se trata de una función que asocia a cada estado del espacio de estados \nuna cierta cantidad numérica que evalúa de algún modo lo prometedor que es ese \nestado para acceder a un estado objetivo. Habitualmente, se denota esa función por \nh(e). \nLa función heurística puede tener dos interpretaciones. Por una parte, puede ser una \nestimación de la \"calidad\" de un estado. En este caso, los estados de mayor valor \nheurístico son los preferidos. Por otra parte, la función puede ser una estimación de \nlo próximo que se encuentra el estado de un estado objetivo. Bajo esta perspectiva, \nlos estados de menor valor heurístico son los preferidos. Ambos puntos de vista son \ncomplementarios (de hecho, un cambio de signo en los valores permite pasar de una \nperspectiva a la otra). \nLas funciones heurísticas más interesantes son aquéllas que son bien fundadas. La \ndefinición depende de los dos casos considerados en el anterior párrafo. Si la \nheurística asigna valores altos a los estados preferidos, se dirá que es bien fundada \nsi todos los estados objetivos tienen valores mayores que el resto de estados \n(habitualmente el estado inicial tendrá valor 0 y los valores seán números naturales \no reales positivos). Si la heurística estima la proximidad a un objetivo, se dirá bien \nfundada si a los estados objetivo les asocia el valor 0. \n",
  "speaker": "SYSTEM",
  "uuid": "a351aba6-7cd7-42fc-9c7a-07e9f1e63197"
}