{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 3\n \nOntology based document annotation: trends and open research problems \n49 \n could be applied to a sample HTML page. Let us  \nsuppose that the HTML page shown in Figure 3 belongs to \nthe website of a travel agency and summarises the \ninformation about a flight from Madrid to Seattle on  \n8th February 2003.1 \nLet us see how to apply Dublin Core, a thesaurus about \ngeographical information, and an ontology in the travelling \ndomain to annotate this document. This will provide more \ndetails about the main similarities and differences between \nthese approaches. \nFigure 3 HTML document that describes the details of a flight \n \n \n2.1.1 Sample usage of Dublin Core for document \nannotation \nIf we annotated this HTML page with Dublin Core, we \nwould include information like the following: \nthe contributor and creator is the flight booking service \n‘www.flightbookings.com’ \nthe date would be 1st January 2003, in case that the \nHTML page has been generated on that specific date \nthe description would be something like ‘flight details \nfor a travel between Madrid and Seattle via Chicago on \nFebruary 8th, 2003’ \nthe document format is ‘HTML’ \nthe document language is ‘en’, which stands for \nEnglish, etc. \n2.1.2 Sample usage of thesauri for document \nannotation \nLet us suppose that we want to annotate the document with \na thesaurus like the Getty Thesaurus of Geographic Names \n(TGN). In this case we would include information like the \nfollowing: \nMadrid is a reference to the term with ID 7010413 in the \nthesaurus, which refers to the city of Madrid in Spain \nSpain is a reference to the term with ID 1000095, which \nrefers to the Kingdom of Spain in Europe \nChicago \nis \na \nreference \nto \nthe \nterm \nwith  \nID 7013596, which refers to the city of Chicago in Illinois, \nUSA \nUnited States of America is a reference to the term \n‘United States’ with ID 7012149, which refers to the  \nUS nation \n \n \nSeattle \nis \na \nreference \nto \nthe \nterm \nwith \nID  \n7014494, which refers to the city of Seattle in Washington, \nUSA. \nThis is not the only thesaurus that we can use to \nannotate the document. We could also use the IATA (http:// \nwww.iata.org/index.htm) codes to refer to the different \nairports that appear in the document: \nBarajas is a reference to the IATA code MAD \nO’Hare International is a reference to the IATA code \nCHI \nSeattle/Tacoma International is a reference to the IATA \ncode SEA. \nWe could use other thesauri to refer to airline names, \nplane models, etc. \n2.1.3 Sample usage of ontologies for document \nannotation \nLet us suppose that there is a ontology in the travelling \ndomain that we want to use, to annotate the document in \nFigure 3. This ontology will contain concepts like Flight, \nLocation, Airport, etc., and properties like departure and \narrival place, ticket price, etc. Ontology based document \nannotations usually contain three types of information: \nConcept instances relate a part of the document to one \nor several concepts in an ontology. For example, ‘Flight \ndetails’ may represent an instance of the concept Flight, and \ncan be named as AA7615_Feb08_2003, although concept \ninstances do not necessarily have a name. \nAttribute values relate a concept instance with part of \nthe document, which is the value of one of its attributes. For \nexample, ‘American Airlines’ can be the value of the \nattribute companyName. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "a5a0bd81-1315-417c-9b32-5c8c23e62491"
}