{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 42\nPage 42 of 124\nNeOn Integrated Project EU-IST-027595\n• keep the provenance information of the resource.\n2.5.2\nResults According to Transformation Process\nTable 2.2 and table 2.5 summarize the methods and tools presented according to the characteristics of the\ntransformation process: one-step or incremental transformation, transformation approach, automatic/semi-\nautomatic or manual, ad-hoc wrapper or formal speciﬁcation, transformation aspects, semantics of NOR\nrelationships, full conversion of the resource, use of additional resources to carry out the transformation,\nprovision of methodological guidelines, employed technique, and tool support.\nMethods\n• According to the transformation process, one-step transformation or incremental transformation. The\neighteen methods perform one-step transformation of the non-ontological resource.\n• According to transformation approach. Six methods follow the approach to transforming the resource\nschema into an ontology schema and the resource content into ontology instances, eight methods\nfollow the approach to transforming the resource content into an ontology schema, four methods follow\nthe approach for transforming the resource content into instances of an existing ontology.\n• According to whether the transformation process is automatic, semi-automatic, or manual. Three meth-\nods perform an automatic transformation, fourteen methods perform a semi-automatic transformation,\nand one method performs a manual transformation.\n• According to how the transformation process is carried out, using an ad-hoc wrapper or using a formal\nspeciﬁcation of the conversions. Ten methods perform the transformation by using an ad-hoc wrapper,\nseven methods perform the transformation by using a formal speciﬁcation of the conversions, and one\nmethod does not mention anything about how the transformation process is carried out.\n• According to the transformation aspects contemplated, i.e. syntactic or semantic. Fifteen methods con-\ntemplate syntactic and semantic transformation aspects, since they tackle how symbols are structured\nin the resource and ontology formats, as well the semantic interpretation of the resource elements\nwhen deﬁning transformations to ontology elements. Two methods contemplate syntactic and partially\nsemantic transformation aspects. The remaining method contemplates only the syntactic transforma-\ntion aspects.\n• According to the semantics of the non-ontological resource relationships. Four methods deal with\nsubClassOf and ad-hoc relations; one deals with subClassOf, partOf and ad-hoc relations; three\nmethods deal with ad-hoc relations. The remaining ten methods do not provide information about this\ncriteria.\n• According to whether the method performs a full transformation or not. Fifteen methods perform a full\nconversion of the resource, two methods perform a partial conversion of the resource, and one does\nnot provide information about this criteria.\n• According to whether the method uses additional resources for the transformation or not. Four methods\nuse additional resources, such as, Swoogle, Google, WordNet, and DOLCE ontology, for the transfor-\nmation. The remaining fourteen methods do not use any additional resource for the transformation.\n• According to whether the method provides some methodological guidelines or not. Seventeen methods\nprovide methodological guidelines for the transformation, only one does not provide any methodologi-\ncal guideline for the transformation.\n",
  "speaker": "SYSTEM",
  "uuid": "a7029b92-96df-40f9-909d-0a31c6772640"
}