{
  "message": "SYSTEM: RQRQR.pdf: Página 7\nsearching through a tree in this context. In this case the head of the query would\nact as the root of the tree, the children of the root would be the predicates in the\nbody of the query, and as far as these predicates are in the head of other clauses\nthe process can be repeated, conforming a tree. The leaves of the tree will be a set\nof predicates that are not in the head of any clause. This tree, avoiding loops, is\nthe result of the prune process in REQUIEM, containing only clauses relevant for\nthe current query. Table 1 contains a fragment of an hydrology ontology and its\ntranslation to clauses that will be used as an example for further clariﬁcation.\nnombres traducidos de Hydrontology, al ser lenguaje tcnico pueden contener\nerrores, pendiente de revision\nELHIO clause\nELHIO axiom\n1 Water(x) ←DrainsAt(x, y)\n∃drainsAt ⊑Water\n1 DrainsAt(x, drains(x)) ←RunningWater(x) RunningWater ⊑∃drainsAt\n2 RunningWater(x) ←River(x)\nRiver ⊑RunningWater\n3 River(x) ←Tributary(x)\nTributary ⊑River\n4 RunningWater(x) ←Stream(x)\nStream ⊑RunningWater\n5 Water(x) ←StillWater(x)\nStillWater ⊑Water\n6 StillWater(x) ←Enclosure(x)\nEnclosure ⊑StillWater\n7 Enclosure(x) ←SaltMarsh(x)\nSaltMarsh ⊑Enclosure\n8 SalineGround(x) ←SaltMarsh(x)\nSalineGround ⊑SaltMarsh\n9 Morphology(x) ←FloodableArea(x)\nFloodableArea ⊑Morphology\nTable 1. Axioms in the example ontology and the corresponding clauses\nIn the example the query posed to the ontology in table 1 is Q(x) ←\nWater(x). In this case, the clauses relevant for the query will provide infor-\nmation about Water and thus the starting point are clauses whose head is the\n“Water” predicate, this is clauses 1 and 5. The predicates referred in the body of\nclause 1, DrainsAt lead to clause 2, and so we can continue the process, conform-\ning the tree of the clauses that may be relevant for the rewriting of the query. In\nthis case the only clause pruned is the last one, since it is not connected to any\nother by this procedure, and since the head present in this clause is not present\nin the tree it cannot be uniﬁed in the resolution. Notice that if some clause could\nbe uniﬁed with a predicate in the body of this discarded clause that would still\nbe irrelevant for the resolution of the query, in that case either directly or tran-\nsitively Q could imply Morphology, but the implication of Q by Morphology\nis impossible even transitively given the set of clauses in the example. se puede\nhacer una demostracion mas teorica y estricta, pero es un poco evidente\nNotice that a simple fragment of the ontology has been chosen for the exam-\nple, most of the predicates are unary and all the bodies in the rules are composed\nby one single atom, the focus in the example is on the additional prune that can\nbe done when considering that only some predicates are mapped by a RDB2RDF\n",
  "speaker": "SYSTEM",
  "uuid": "a74d3fd6-a3ee-4c17-b5de-9fad7be13533"
}