{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 73\nMINISTERIO DE LA PRESIDENCIA\n79\n43.- Catálogo de encuestas del Centro de Investigaciones Sociológicas\nDirección Web: http://www.cis.es/cis/opencms/ES/1_encuestas/catalogo.html\nWeb adicional: http://www.micinn.es/ciencia/jsp/plantilla.jsp?area=organismos&id=4\nOrganismo editor: Centro de Investigaciones Sociológicas (CIS).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Recopilación de estudios sociales y políticos realizados por el\norganismo desde 1963. A través de distintos tipos de búsquedas se puede acceder a la informa-\nción de los estudios y, en el caso de que los resultados de la encuesta se hayan puesto en la pági-\nna Web, podrán ser consultados gratuitamente. A disposición de los usuarios están, además de\nlos resultados (distribuciones marginales 1-dimensionales) del estudio, los ficheros de datos\npara un tratamiento estadístico libre, cruces o tabulaciones de variables, series temporales de\npreguntas, estudios cualitativos y colecciones de ficheros de datos en CD-ROM. Hay servicios\nque son de pago. La búsqueda de estudios puede realizarla por: índice temático, índice anual y\nbúsqueda asistida (por número, ámbito, universo, estudios cualitativos, textos, etc.). \n44.- Catálogo publicaciones del Centro de Investigaciones Sociológicas \nDirección Web: http://www.cis.es/cis/opencm/ES/3_publicaciones/catalogo/busqueda.jsp\nOrganismo editor: Centro de Investigaciones Sociológicas (CIS).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Este catálogo recoge la totalidad del fondo editorial produ-\ncido por el Centro de Investigaciones Sociológicas. La búsqueda se puede realizar desde\ndiferentes campos: índice de colecciones, índice de autores, índice de títulos, índice de\nmaterias y búsqueda asistida. \nBASES DE DATOS  1/1/04  03:39  Página 79\n",
  "speaker": "SYSTEM",
  "uuid": "a779bc78-767b-4c2b-b904-31fbe38489b9"
}