{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 2\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13910\nLa reunión-seminario realizada en Salzburgo en febrero de 2005 confecciona un \nconjunto de 10 recomendaciones o principios para el desarrollo futuro de los programas de \ndoctorado de los diferentes países.\nLos derechos de los doctorandos como investigadores en formación se recogen en las \nbases descritas en la Carta Europea del Investigador y en el Código de Conducta para la \nContratación de Investigadores de marzo de 2005 ampliamente aceptados en Europa por \nparte de las Universidades.\nEspaña, como miembro activo de los procesos conducentes a la creación y desarrollo \nde un Espacio Europeo del Conocimiento, ha ido incorporando las reformas legislativas \nque han permitido consolidar una oferta de enseñanzas acorde a los principios del EEES. \nDe igual manera se ha avanzado en la regulación de la figura de investigador en formación, \na través del Estatuto del Personal Investigador en Formación aprobado por Real Decreto \n63/2006, de 27 de enero.\nAsimismo, en un proceso vivo que continúa precisando y profundizando los elementos \nconducentes a hacer de Europa un espacio basado en el conocimiento, atractivo, abierto \ny cooperativo con otras regiones del mundo, con una oferta formativa de alta calidad en \ndocencia e investigación, es necesario seguir avanzando especialmente en el doctorado \ncomo elemento fundamental de encuentro entre el EEES y el EEI y el soporte para buscar \nnuevos motores de crecimiento sostenibles. El proceso europeo ha alcanzado bastante \nnotoriedad internacional toda vez que una de las principales consecuencias del mismo es \nalcanzar una definición clara del estándar de competencias, exigencias y contribución a la \nsociedad de un doctor en el marco nacional y europeo. De esta forma, se define con \nclaridad la misión de los doctores en la nueva sociedad del conocimiento, lo que redundará \nen el reconocimiento profesional y prestigio social, la idoneidad en las perspectivas \nlaborales y en sus aportaciones al nuevo modelo de crecimiento.\nLas estrategias institucionales en material de I+D+i de las universidades deben tener \nal doctorado en el centro de sus actuaciones, permitiendo una amplia flexibilidad y \nautonomía, pero a la vez alcanzando altas cotas de calidad, internacionalización, \ninnovación, reconocimiento y movilidad.\nLa formación de investigadores es, en estos momentos, un elemento clave de una \nsociedad basada en el conocimiento. El reconocimiento social de las capacidades \nadquiridas en esta etapa formativa, la necesidad de incrementar sustancialmente el número \nde personas con competencia en investigación e innovación y el impulso a su influencia y \nempleo tanto dentro como fuera de los ámbitos académicos es uno de los principales \ndesafíos españoles y europeos. Los documentos europeos también destacan la necesidad \nde impulsar la I+D+i en todos los sectores sociales particularmente mediante la colaboración \nen el doctorado de industrias y empresas, con el fin de que jueguen un papel sustancial en \nsus estrategias de innovación y futuro.\nLas especiales características de los estudios de doctorado y la variedad de necesidades \ny métodos de formación investigadora de los distintos ámbitos del conocimiento aconsejan \nun alto grado de flexibilidad en la regulación de estos estudios. De esta forma se promueve \nun modelo de formación doctoral con base en la universidad pero integradora de la \ncolaboración de otros organismos, entidades e instituciones implicadas en la I+D+i tanto \nnacional como internacional, en el que las Escuelas de Doctorado, cuya creación se prevé \nen la presente norma, están llamadas a jugar un papel esencial.\nEn este ámbito de colaboración, ha de corresponder un especial protagonismo a los \nOrganismos Públicos de Investigación como instituciones de carácter público y ámbito \nnacional que junto con las universidades forman el núcleo básico del sistema público de \ninvestigación científica y desarrollo tecnológico español. La experiencia acumulada, \nespecialmente con el Consejo Superior de Investigaciones Científicas, habla de los \nenormes beneficios esperados de una colaboración equilibrada para la formación de \ninvestigadores y doctores.\nAsimismo, se ha de hacer mención al no menos importante papel que han de \ndesempeñar aquellas otras instituciones que canalizan la investigación a su plasmación \nen la sociedad, como empresas, hospitales, fundaciones, etc. que han de convertirse en \ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "aa1048ee-06af-4934-9195-965dd48a8d12"
}