{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 236\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n242\n363.- Balances y cuentas de entidades aseguradoras\nDirección Web: http://www.dgsfp.meh.es/sector/balancesycuentasEA.asp\nOrganismo editor: Dirección General de Seguros y Fondos de Pensiones. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Seguros.\nDescripción y comentarios: La herramienta permite la consulta del balance y cuentas de\nlas entidades atendiendo a las siguientes cuestiones: año del ejercicio, clave de la entidad,\nnombre de la empresa, si opera en España o en terceros países, derecho de establecimien-\nto y libre prestación de servicios. Ofrece una información muy completa: ramos en los que\nopera, consejo de administración, margen de solvencia, balance, cuentas de pérdidas y\nganancias y cobertura de provisiones técnicas. \n364.- Balances y cuentas de planes y fondos de pensiones \nDirección Web: http://www.dgsfp.meh.es/sector/balancesycuentasPF.asp\nOrganismo editor: Dirección General de Seguros y Fondos de Pensiones. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Fondos de pensiones.\nDescripción y comentarios: La herramienta permite la consulta del balance y cuentas de\nplanes y fondos de pensiones atendiendo a las siguientes cuestiones: año del ejercicio,\nclave de la entidad, nombre de la empresa, gestora o fondos de pensiones. Ofrece una\ninformación muy completa: balance, cuentas de pérdidas y ganancias y fondos. La infor-\nmación es cruzada si se interroga por la entidad; esta búsqueda ofrece información com-\npleta además de la entidad por los fondos de pensiones de esa gestora, y a la inversa si la\nconsulta es por fondos la respuesta ofrece información de sus gestoras.\nBASES DE DATOS  1/1/04  03:39  Página 242\n",
  "speaker": "SYSTEM",
  "uuid": "aaf7486e-4770-47c1-956c-9bea087860df"
}