{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 29\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11178\n3.  El INIA reintegrará a los beneficiarios de la ayuda el desembolso por ellos realizado, \nen concepto de la matriculación en Universidades y Escuelas Técnicas superiores de los \ncursos y tasas académicas necesarios para obtener su doctorado, siempre que el pago se \nhubiera realizado después de obtener la condición de becario INIA.\n4.  Las dotaciones reseñadas en los tres puntos anteriores serán abonados a los \nbecarios, una vez realizado el gasto, tras la presentación de los justificantes originales del \nmismo.\nArtículo 59.  Presentación de solicitudes.\n1.  Las solicitudes de participación en este Subprograma podrán ser presentadas por \nlos candidatos que cumplan los requisitos establecidos en el artículo 54 de este \nSubprograma, de conformidad con el procedimiento que se describe en este y siguientes \nartículos.\n2.  El plazo de presentación de solicitudes será del 9 al 23 de marzo de 2010, ambos \ninclusive.\n3.  En la dirección electrónica www.inia.es estará disponible el formulario de solicitud \nque será necesario cumplimentar por los candidatos. El formulario deberá cumplimentarse \na través de los medios telemáticos habilitados para ello en la citada web. En dicha dirección \ntambién podrá encontrarse la relación de temas que se ofertan, así como tutores y centros. \nUna vez debidamente cumplimentado el formulario a través de la web, se deberá imprimir \núnicamente la primera página y presentarla firmada y acompañada de la documentación \nadicional que se indica en el punto 6 de este mismo artículo, en los lugares indicados en \nel punto siguiente. Solo serán válidas las solicitudes presentadas según el formato de la \nweb www.inia.es.\n4.  Las solicitudes, dirigidas a la Secretaría de Investigación, podrán presentarse en el \nRegistro General del INIA, Carretera de la Coruña km 7,5, 28040 Madrid, o en cualquiera de \nlos lugares señalados en el artículo 38.4 de la Ley 30/1992, de 26 de noviembre, de Régimen \nJurídico de las Administraciones Públicas y del Procedimiento Administrativo Común. En el \ncaso de que los solicitantes optaran por presentar su solicitud en una oficina de Correos, lo \nharán en sobre abierto para que la instancia sea fechada y sellada por el funcionario de \nCorreos antes de ser certificada. Se considerará presentada la solicitud en la fecha en la que \nse presente ante el registro el impreso de solicitud en soporte papel firmado.\n5.  Cada solicitante podrá presentar hasta un máximo de dos solicitudes, que deberá \npriorizar.\n6.  Asimismo, deberá acompañar a la solicitud la siguiente documentación:\na)  Fotocopia del D.N.I. o su equivalente en casos de ciudadanos de la Unión Europea \no de la tarjeta de residentes en vigor en el caso de ciudadanos de otros países.\nb)  Fotocopia del certificado de estudios, donde conste la fecha en la que se han \nfinalizado los estudios y constancia expresa de que las materias relacionadas constituyen \nel programa completo de la titulación correspondiente, las calificaciones obtenidas y fechas \nde obtención de las mismas.\nc)  Los solicitantes que hayan cursado los estudios en el extranjero y posean \ncertificación académica extendida en idioma distinto del español deberán acompañarla de \nla correspondiente traducción oficial. En tales casos, la certificación indicará cuáles son las \ncalificaciones máxima y mínima dentro del sistema de evaluación correspondiente y cuál \nes la calificación mínima para aprobar; asimismo deberá constar la fecha en la que se han \nfinalizado los estudios y constancia expresa de las materias que constituyen el programa \ncompleto de la titulación correspondiente, las calificaciones obtenidas y fechas de obtención \nde las mismas.\nd)  En el supuesto previsto en el artículo 17.1 c) de esta Resolución, el interesado \ndeberá acreditar documentalmente, mediante un certificado de la universidad \ncorrespondiente, que reúne los requisitos para ser admitido en los programas de doctorado \nde una universidad española.\ne)  Las personas que se acojan al supuesto contemplado en el artículo 172.c)2, deben \nhacerlo constar en el formulario de solicitud y acreditarlo documentalmente.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "abeab08a-6dc3-4d58-8007-1dadf6a005e5"
}