{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 15\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 15 de 42 \nTítulo del proyecto: BigStorage: Storage-based Convergence between HPC and Cloud to handle Big \nData (H2020-642963) \nEntidad financiadora: Unión Europea \nEntidades participantes: UPM, BSC, UMC-Mainz, INRIA, FORTH, XYRATEX, DKRZ, CEA, CA, Fujitsu \nDuración, desde: \n01-01-2015 \nhasta: 31-12-2018 \nInvestigador responsable por la UPM: María de los Santos Pérez \nCoordinador del proyecto: María de los Santos Pérez \n \nTítulo del proyecto: Red Temática de Datos Abiertos en las Ciudades Inteligentes (TIN2014-53161) \nEntidad financiadora: Ministerio de Economía y Competitividad \nEntidades participantes: UPM, ULleida, UniZar, ULleida, U. Iglesia Deusto, URL, UNEX, UCoruña, UJI, \nUMálaga \nDuración, desde: \n01-12-2014 \nhasta: 31-11-2016 \nInvestigador responsable por la UPM: Óscar Corcho García \nCoordinador del proyecto: Óscar Corcho García \n \nTítulo del proyecto: 4V: Volumen, Velocidad, Variedad y Validez en la gestión innovadora de datos \n(TIN2013-46238) \nEntidad financiadora: Ministerio de Economía y Competitividad \nEntidades participantes: UPM, UPM, UDC, Unizar \nDuración, desde: \n01-01-2014 \nhasta: 31-12-2016 \nInvestigador responsable por la UPM: Asunción Gómez Pérez, Oscar Corcho García \n \nTítulo del proyecto: DrInventor – Promoting Scientific Creativity by Utilising Web-based Research \nObjects (FP7-611383) \nEntidad financiadora: Unión Europea \nEntidades participantes: Univ. of Bedfordshire (United Kingdom), Univ. Pompeu Fabr (Spain), UPM, \nNUI Maynooth (Ireland), Bournemouth Univ. (United Kingdom), ANSMART LTD (United Kingdom), \nImagemetry S.R.O. (Czech Republic), Intellixir SARL (France) \nDuración, desde: \n01-11-2013 \nhasta: 31-10-2016 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Ready4SmartCities – ICT Roadmap and Data Interoperability for Energy Systems in \nSmart Cities (FP7-608691) \nEntidad financiadora: Unión Europea \nEntidades participantes: DAPP (Italy), UPM, CSTB (France), CERTH/ITI (Greece), VTT (Finland), \nINRIA (France), AIT (Austria), AEC3 (United Kingdom), POLITO (Italy), EMP (Deutschland) \nDuración, desde: 01-10-2013 hasta: 30-09-2016 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: LiDER – Linked Data as an Enabler of Cross-Media and Multilingual Content \nAnalytics for Enterprises Across Europe (FP7-610782) \nEntidad financiadora: Unión Europea \nEntidades participantes: UPM, Trinity College of Queen Elizabeth Dublín (Ireland), DFKI (Germany), \nNUIG (Ireland), INFAI (Germany), University of Bielefeld (Germany), Univ. Roma La Sapienzia (Italy), \nERCIM (France) \nDuración, desde: 01-11-2013 hasta: 31-12-2015 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nCoordinador del proyecto: Asunción Gómez Pérez \n \nTítulo del proyecto: SemData (FP7-612551) \nEntidad financiadora: Unión Europea \nEntidades participantes: Univ. Huddersfield, Karlsruhe Institute of Technology, Univ. Southampton, \nPanepistimio Kritis – Univ. Crete, Wright state Univ., Southeast Univ., Royal Melbourne of Technology, \nState Higher Educational Establishment Zporizhzhya National Univ., Commonwealth Scientific and \nIndustrial Research Organisation, Universidad de Chile, The Board of Trustees of the Leland Stanford \nJunior Univ. \nDuración, desde: \n01-10-2013 \nhasta: 31-09-2017 \nInvestigador responsable por la UPM: Óscar Corcho García \n",
  "speaker": "SYSTEM",
  "uuid": "ad423b77-8747-40fa-9694-7db7296fe604"
}