{
  "message": "SYSTEM: CVIdafenSP_CICYT_29Marzo2016.pdf: Página 7\nCurriculum Vitae, Idafen Santana Pérez, 28/3/2016 \nPágina 7 \n \nContribuciones a Congresos \n \n \n \nRef: CLConf07/Conferencia07 \nAutores (p.o. de firma): Ahmad Alobaid, Daniel Garijo, María Poveda-Villalón, Idafen Santana-Perez, \nOscar Corcho \nTítulo: OnToology, a tool for collaborative development of ontologies \nTipo de participación: Poster \nCongreso: International Conference on Biomedical Ontology 2015. \nLugar de celebración: Lisboa, Portugal                 Fecha: Julio 2015 \n \n \nRef: CLConf06/Conferencia06 \nAutores (p.o. de firma): Doug James, Nancy Wilkins-Diehr, Victoria Stodden, Dirk Colbry, Carlos \nRosales, Mark Fahey, Justin Shi, Rafael F. Silva, Kyo Lee, Ralph Roskies, Laurence Loewe, Susan \nLindsey, Rob Kooper, Lorena Barba, David Bailey, Jonathan Borwein, Oscar Corcho, Ewa Deelman, \nMichael Dietze, Benjamin Gilbert, Jan Harkes, Seth Keele, Praveen Kumar, Jong Lee, Erika Linke, \nRichard Marciano, Luigi Marini, Chris Mattman, Dave Mattson, Kenton McHenry, Robert McLay, Sheila \nMiguez, Barbara Minsker, Maria Perez-Hernandez, Dan Ryan, Mats Rynge, Idafen Santana-Perez, \nMahadev Satyanarayanan, Gloriana St. Clair, Keith Webster, Elvind Hovig, Daniel S. Katz, Sophie Kay, \nGeir Sandve, David Skinner, Gabrielle Allen, John Cazes, Kym Won Cho, Jim Fonseca, Lorraine Hwang, \nLars Koesterke, Pragnesh Patel, Line Pouchard, Ed Seidel, Isuru Suriarachchi \nTítulo: Standing Together for Reproducibility in Large-Scale Computing: Report on \nreproducibility@XSEDE \nTipo de participación: Workshop \nCongreso: reproducibility@XSEDE: An XSEDE14 Workshop. \nPublicación: eprint arXiv:1412.5557 \nLugar de celebración: Atlanta, Estados Unidos                Fecha: Diciembre 2014 \n \n \nRef: CLConf05/Conferencia05 \nAutores (p.o. de firma): Santana-Perez I, Ferreira Da Silva R, Rynge M, Deelman E, Perez-Hernandez \nM, Corcho O \nTítulo: A Semantic-Based Approach to Attain Reproducibility of Computational Environments in \nScientific Workflows: A Case Study \nTipo de participación: Workshop \nCongreso: REPPAR (1st International Workshop on Reproducibility in Parallel Computing) in conjunction \nwith Euro-Par 2014. \nPublicación: Proceedings of the Euro-Par workshops ISBN: 978-3-319-14325-5  \nLugar de celebración: Porto, Portugal                       Fecha: Agosto 2014 \n \n \n \nRef: CLConf04/Conferencia04 \nAutores (p.o. de firma): Santana-Perez, Idafen and Ferreira da Silva, Rafael and Rynge, Mats and \nDeelman, Ewa and Pérez-Henández, María S and Corcho, Oscar. \nTítulo: Leveraging Semantics to Improve Reproducibility in Scientific Workflows \n",
  "speaker": "SYSTEM",
  "uuid": "adb79b2b-e285-4fb7-b9e7-39986b7b7f6f"
}