{
  "message": "SYSTEM: CVA_jorge_2016_03.pdf: Página 2\n \n \n2 \n \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nCoordinator”. Ha pasado más de 13 meses de estancias investigadoras (pre y post-doctorales) en el \nextranjero, en centro de investigación de alto nivel como INRIA (Francia), Knowledge Media Institute \n(Open University, Reino Unido) o la Universitá di Roma \"La Sapienza\" (Italia).  \n \nEl investigador ha sido miembro del comité de programa en multitud de workshops y conferencias de \nreferencia en su área, y ha organizado diversos tutoriales y workshops en conferencias de alto nivel \n(como ISWC, EKAW, ESWC, LREC). Actualmente dirige el community group del World Wide Web \nConsortium (W3C) sobre “Best Practices for Multilingual Linked Open Data”, y participa activamente \nen otros grupos de estandarización del W3C (\"Linked Data for Language technlogy\", \"Ontlogy \nLexica\") y de la Open Kowledge Foundation (\"Open Linguistics\"). El investigador ha co-dirigido una \ntesis doctoral y varias tesis de master, y actualmente co-dirige otra tesis doctoral que está próxima a su \nfinalización   \n \nJorge ha publicado más de treinta artículos en el área de la Web, la Web Semántica, y el \nmultilingüismo en los datos enlazados. Siete de ellos han sido publicados en revistas  indexadas en \nJCR (IEEE Internet Computing, Journal of Web Semantics, AI Magazine, etc.) y otros como “full \npapers” en conferencias del más alto nivel en su campo (CORE A o A+) como la World Wide Web \nConference o la International Semantic Web Conference. Su trabajo científico acumula más de 800 \ncitas y un índice-h de 13 según Google Scholar (Marzo 2016). \n \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \n \nAutores (p.o. de firma): John P. McCrae, Mihael Arcan, Kartik Asooja, Jorge Gracia, Paul Buitelaar, \nPhilipp Cimiano \nTítulo: “Domain adaptation for ontology localization\"  \nRef. revista / Libro: \n Web Semantics: Science, Services and Agents on the World Wide Web, ISSN \n15708268  \nVolumen: \n 36 \nPáginas, inicial: 23 \n \nfinal: 31  \nFecha: January 2016 \nEditorial (si libro): Elsevier \nLugar de publicación: Paises Bajos \n \nAutores (p.o. de firma): Esther Lozano, Jorge Gracia, Oscar Corcho, Richard A. Noble and Asunción \nGómez-Pérez \nTÍtulo: “Problem-based learning supported by semantic techniques\" \nRef. revista / Libro: \n Interactive Learning Environments, ISSN 1049-4820 \nVolumen: \n 23 \nPáginas, inicial: 37 \n \nfinal: 54 \nFecha: 2015 \nEditorial (si libro):   \n Routledge,  \nLugar de publicación: Norwood, N.J. \n \nAutores (p.o. de firma): Bert Bredeweg, Jochem Liem, Wouter Beek, Floris Linnebank, Jorge Gracia, \nEsther Lozano, Michael Wissner, Rene Bühling, Paulo Salles, Richard Noble, Andreas Zitek and Petia \nBorisova \nTítulo: “DynaLearn - An Intelligent Learning Environment for Learning Conceptual Knowledge\" \nRef. revista / Libro: \n Artificial Intelligence Magazine, ISSN 0738-4602 \nVolumen: \n34 \nPáginas, inicial:  \n46 \nfinal: 65 \nFecha: Diciembre 2013 \nEditorial (si libro):  AAAI \nLugar de publicación: California (USA) \n \n \nAutores (p.o. de firma): Jorge Gracia, Elena Montiel-Ponsoda, Philipp Cimiano, Asunción Gómez-\nPérez, Paul Buitelaar and John McCrae \nTÍtulo: “Challenges for the Multilingual Web of Data\" \nRef. revista / Libro: \n Journal of Web Semantics, ISSN 1570-8268 \nVolumen: \n 11 \nPáginas, inicial: 63 \n \nfinal: 71 \n \n \nFecha: 2012 \nEditorial (si libro):  Elsevier \n",
  "speaker": "SYSTEM",
  "uuid": "adcc925a-5b93-4562-bde4-89b1a934d2ba"
}