{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 14\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11163\n2.  Durante los dos últimos años de la ayuda, los Centros de I+D tendrán la obligación \nde contratar laboralmente, de acuerdo con la legislación laboral vigente y con la duración, \nretribución y demás requisitos que se indiquen en este subprograma, al personal \ninvestigador en formación que tras haber finalizado los dos primeros años de beca haya \nobtenido el Diploma de Estudios Avanzados o el certificado académico que acredita que \nse encuentra en el periodo de investigación del Programa de Doctorado al que se refiere \nal artículo 20 del Real Decreto 1393/2007. Los Centros de I+D podrán contratar al personal \ninvestigador en formación que tras haber finalizado los dos primeros años de beca no haya \nobtenido el Diploma de Estudios Avanzados o el citado certificado académico, siempre que \nsu actividad investigadora haya sido evaluada positivamente por la Comisión Nacional de \nEvaluación de la actividad Investigadora.\n3.  En el caso de que se produzca un cambio de Centro de I+D de adscripción de la \nayuda, el nuevo centro beneficiario asumirá todas las obligaciones recogidas en este artículo \nliberando de ellas al centro inicialmente receptor. Además en este caso, en lo referido al \npago de las ayudas en la fase de contrato, se estará a lo dispuesto en el artículo 35.3.\nArtículo 29.  Obligaciones del personal investigador en formación.\n1.  El personal investigador en formación deberá incorporarse a su Centro de I+D en el \nprimer día hábil de cualquiera de los cuatro meses siguientes al de la publicación de la \nResolución de concesión de las ayudas de este subprograma, a la que se refiere el artículo 8, \nen la página web del Ministerio de Ciencia e Innovación http://www.micinn.es, y remitir a la \nDirección General de Investigación y Gestión del Plan Nacional de I+D+i los documentos \ncorrespondientes a la incorporación, que se encontrarán disponibles en la página web \nanteriormente mencionada. Adicionalmente, aquellos beneficiarios que reúnan los requisitos \nrecogidos en el artículo 17 posteriormente a la fecha de finalización del plazo de presentación \nde solicitudes, deberán además adjuntar copia del certificado de estudios y, en su caso, del \ntitulo académico, de acuerdo a lo indicado en el artículo 31.7.b1. Esta documentación deberá \nser enviada dentro de los diez días hábiles siguientes al de la fecha de incorporación. Se \nentenderá la no incorporación o la no presentación de la documentación indicada correctamente, \nen este plazo, como renuncia a la ayuda.\nLos beneficiarios extranjeros deberán aportar además, una fotocopia del Número de \nIdentidad de Extranjero (NIE).\nEn casos excepcionales y debidamente justificados el órgano concedente, previa \nsolicitud dentro del periodo de incorporación indicado en este apartado, podrá ampliar el \nplazo de incorporación. No obstante lo anterior, la fecha de cumplimiento de los requisitos \nrecogidos en el artículo 17 no podrá ser aplazada y, en caso de aplazamiento de la \nincorporación, se deberá acreditar el cumplimiento de tales requisitos en el último día hábil \nprimeramente establecido para la incorporación según lo indicado en el párrafo primero.\n2.  El personal investigador en formación deberá realizar su labor en el Centro de I+D \nen el que se encuentre incorporado, siendo necesario para cualquier cambio de Centro, de \ndirector de tesis o de proyecto de I+D, que el Centro de I+D inicialmente receptor obtenga \nautorización expresa del órgano concedente, así como la aceptación del cambio por parte \ndel investigador y, en su caso, del nuevo Centro de I+D receptor. En el caso de cambio de \nproyecto de I+D, será necesario que el nuevo proyecto esté financiado por el Plan Nacional \nde I+D+I y que haya aceptación del cambio por parte de los Investigadores Principales de \nambos proyectos, así como de todos los Centros de I+D implicados. No obstante, el órgano \nconcedente podrá, en casos excepcionales y debidamente justificados, autorizar cambios \nque no cumplan los requisitos indicados anteriormente.\nArtículo 30.  Características del desarrollo de la ayuda.\n1.  Podrá ser director de tesis cualquier doctor que forme parte del grupo de \ninvestigación, con vinculación laboral o estatutaria al Centro de I+D en el que se realiza el \nproyecto de I+D durante su período de ejecución. En el caso de que la vinculación del \ndirector de tesis al citado Centro no sea de esa duración, deberá figurar un tutor que \ncumpla con las condiciones anteriormente citadas.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "b15dea31-6e22-479f-9e9a-a451d38149c7"
}