{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 39\n37\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nand research tool. Because it was clear from day one that this product would have to process and integrate\nhuge amounts of diverse data, the developers adhered to rigorous software engineering standards to create\na robust, modular, and highly scalable platform encompassing various data loading, transformation, analysis\nand visual exploration models. When the first version of KNIME was released in 2006, several pharmaceuti‐\ncal companies began using it and, soon thereafter, software vendors started building KNIME‐based tools.\nToday, KNIME users can be found in large‐scale Enterprises across a wide range of industries including life\nsciences, financial services, publishers, Retailers and E‐tailers, manufacturing consulting firms, government\nand research – in over 50 countries.\nKNIME Development Partners provide extension to KNIME for Life Sciences, Chemo‐ and Bioinformatics, but\nalso high performance data analysis and other industry areas.\nChannel Partners are officially entitled to resell KNIME Enterprise Products and to provide Support and\nMaintenance for KNIME Desktop and KNIME Report Designer.\nKNIME Consulting partners provide consulting services in the area of business intelligence, CRM analysis,\nfinancial services, LIMS integration, Life Sciences and other industries. \nScenario: Open Alliances\nPartners share intellectual capital, R&D risk, and rewards without long‐term commitments:\n• Foster more speculative development projects, potentially more early‐stage (like seeding, but doesn’t\nhave to be with start‐ups)\n• Suitable for small scale\n• Could use open technology but doesn’t have to\nExample: AppCampus ‐ an open alliance between major IT companies and start‐ups\nAppCampus is a mobile application development program based at Aalto University in Espoo, Finland.\nAppCampus is a pre‐seed funding program that was announced in March 2012 by Microsoft and Nokia and\nhosted at the Aalto centre for Entrepreneurship. The AppCampus program has been set up to foster the cre‐\nation of innovative mobile applications for the Windows Phone ecosystem and other Nokia platforms,\nincluding Symbian and Series 40. The program aims to create a new generation of successful mobile start‐\nups by attracting and supporting thousands of students, entrepreneurs and other talented people with var‐\nious backgrounds from all over the world. AppCampus has committed to invest up to €18 million over three\nyears into new applications and services. Apart from grant funding, the program offers mobile entrepreneurs\ncomprehensive coaching, marketing support and training in mobile technology, design and usability. \nThe sponsors don’t take equity or commission from the investment, but successful apps are expected to be\navailable exclusively on Windows Phone and other Nokia platforms for the first six months after launch.\nScenario: Peer Ecosystems\nCompanies with relatively equal market strength exchange technologies across a network of overlapping\napplication areas:\n• Industry driven, organic growth\n",
  "speaker": "SYSTEM",
  "uuid": "b1be9152-76b6-42cb-9f5e-478e09b0c4bb"
}