{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 6\n6\nGraeme Hirst\nthis; see also Lakoff 1987). Indeed, some critics have suggested that word senses\nare derived, created, or modulated in each context of use, and can’t just be speciﬁed\nin a lexicon (Ruhl 1989, Kilgarriff 1997).\nNonetheless, one position that could be taken is that a word sense is a category.\nThis is particularly appealing in simple practical applications, where the deeper\nphilosophical problems of meaning may be ﬁnessed or ignored. The problems are\npushed to another level, that of the ontology; given some ontology, each word sense\nis represented simply as a pointer to some concept or category within the ontology.\nIn some technical domains this may be entirely appropriate (see section 1.5.1 be-\nlow). But sometimes this move may in fact make matters worse: all the problems\nof categorization remain, and the additional requirement is placed on the ontology\nof mirroring some natural language or languages, which is by no means straightfor-\nward (see section 1.4 below); nonetheless, an ontology may act as an interpretation\nof the word senses in a lexicon (see section 1.5.4 below).\nIn addition to the denotative elements of meaning that refer to the world, word\nsenses also have connotation, which may be used to express the user’s attitude: a\nspeaker who chooses the word sozzled instead of drunk is exhibiting informality,\nwhereas one who chooses inebriated is being formal; a speaker who describes a\nperson as slim or slender is implying that the person’s relative narrowness is attrac-\ntive to the speaker, whereas the choice of skinny for the same person would imply\nunattractiveness.\n1.3.2 Lexical relationships\nRegardless of exactly how one conceives of word senses, because they pertain in\nsome manner to categories in the world itself, lexical relationships between word\nsenses mirror, perhaps imperfectly, certain relationships that hold between the cate-\ngories themselves. The nature of lexical relationships and the degree to which they\nmay be taken as ontological relationships are the topics of most of the rest of this\nchapter. In the space available, we can do no more than introduce the main ideas of\nlexical relationships; for detailed treatments, see Cruse (1986), Evens (1988), and\nGreen, Bean, and Myaeng (2002).\nThe “classical” lexical relationships pertain to identity of meaning, inclusion of\nmeaning, part–whole relationships, and opposite meanings. Identity of meaning is\nsynonymy: Two or more words are synonyms (with respect to one sense of each)\nif one may substitute for another in a text without changing the meaning of the\ntext. This test may be construed more or less strictly; words may be synonyms in\none context but not another; often, putative synonyms will vary in connotation or\nlinguistic style (as in the drunk and slim examples in section 1.3.1 above), and this\nmight or might not be considered signiﬁcant. More usually, “synonyms” are actually\nmerely near-synonyms (see section 1.4.1 below).\nThe primary inclusion relations are hyponymy and its inverse hypernymy (also\nknown as hyperonymy) (Cruse 1986, 2002). For example, noise is a hyponym of\nsound because any noise is also a sound; conversely, sound is a hypernym of noise.\n",
  "speaker": "SYSTEM",
  "uuid": "b2af4116-9069-4e8d-a712-d105f8255b2c"
}