{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 254\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n260\n399.- Normativa del Ministerio de Economía y Hacienda\nDirección Web: http://www.meh.es/Portal/Normativa+y+doctrina/Normativa/\nOrganismo editor: Ministerio de Economía y Hacienda.\nClase de información:\nFormato de presentación:\nNormas y jurisprudencia\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nSimple\nMateria: Economía.\nDescripción y comentarios: Se clasifica en dos tipos, principal y complementaria. Se con-\nsideran normativa principal las leyes, los reales decretos y excepcionalmente aquella norma-\ntiva de rango inferior que los centros directivos señalen como regulación fundamental en la\nmateria que se trate, ordenada según la importancia de las mismas. Estos textos se muestran\nactualizados permanentemente, incluyéndose en los artículos modificados la referencia de\nla norma que lo modifica. Cuando la norma no esté aún actualizada, debido al inevitable\ndesfase entre su publicación y la preparación del texto para ser incorporado a Internet, se in-\ncluye el mensaje “pendiente de actualización” junto al enunciado de la norma. Normativa\ncomplementaria son las normas relacionadas con la materia que no son consideradas prin-\ncipales, ordenadas atendiendo en primer lugar a su rango normativo y dentro del mismo ran-\ngo a la fecha de publicación, colocando primero las más modernas. En el caso de normas no\npublicadas en diarios oficiales se valorará por los centros directivos su inclusión. El texto de\nestas normas no recoge necesariamente todas las modificaciones que se hayan producido en\nla misma, indicándose en el enunciado de la norma “actualizada el día xx/xx/xxxx” en caso\nde incluirse una versión revisada. Cuando la norma en cuestión no este disponible se inclu-\nye junto a su enunciado el mensaje “en preparación”. El texto de las normas se muestra en\nformato pdf.\n400.- Empresas del grupo Sociedad Española de Participación Industrial\nDirección Web: http://www.sepi.es/default.aspx?cmd=0001&IdContainer=90&paginacion=0\nOrganismo editor: Sociedad Estatal de Participaciones Industriales.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nSimple\nMateria: Empresas.\nDescripción y comentarios: Empresas mayoritarias, minoritarias, adscritas y fundaciones\nque conforman el grupo SEPI. La información que proporciona es muy desigual; en algu-\nnas empresas sólo aparecen los datos mínimos de referencia, en otras la información es\nmuy completa.\nBASES DE DATOS  1/1/04  03:39  Página 260\n",
  "speaker": "SYSTEM",
  "uuid": "b6402eef-154f-4ca4-babd-f979efa93fb1"
}