{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 3\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11152\nArtículo 3.  Órganos competentes para la instrucción y resolución del procedimiento.\n1.  Los órganos competentes para la instrucción del procedimiento serán:\na)  En el subprograma FPI-MICINN: el Subdirector General de Formación e \nIncorporación de Investigadores.\nb)  En el subprograma FPI-INIA: el Subdirector General de Prospectiva y Coordinación \nde Programas del INIA.\n2.  Los órganos competentes para dictar la resolución de concesión serán:\na)  En el subprograma FPI-MICINN: por delegación del Secretario de Estado de \nInvestigación, el Director General de Investigación y Gestión del Plan Nacional de I+D+i.\nb)  En el subprograma FPI-INIA: el Director General del INIA.\nArtículo 4.  Financiación de las ayudas.\n1.  La cuantía total máxima de ayuda que se concederá con cargo a los Presupuestos \nGenerales del Estado para todas las anualidades, en los subprogramas que se convocan \nen esta resolución, asciende a 87.714.273,00 euros.\n2.  La financiación de las ayudas a las que se refiere esta resolución se imputará a las \nsiguientes aplicaciones presupuestarias o equivalentes del presupuesto de gastos de las \nsiguientes entidades para el año 2010 y ejercicios posteriores, de acuerdo con las \ndisponibilidades presupuestarias:\na)  Subprograma \nFPI-MICINN: \naplicaciones \npresupuestarias \n21.04.463B.784, \n21.04.000X.713, 21.04.000X.730, 21.04.463B.740, 21.04.463B.754, 21.04.463B.760 y \n21.04.463B.780 del presupuesto de gastos del Ministerio de Ciencia e Innovación (en \nadelante MICINN).\nb)  Subprograma \nFPI-INIA: \naplicaciones \npresupuestarias \n21.204.467D.780, \n21.204.467D.131 y 21.204.467D.160 del presupuesto de gastos del INIA.\n3.  La distribución estimativa por anualidades de la financiación de los diferentes \nsubprogramas es la siguiente:\nAño\n2010\n2011\n2012\n2013\n2014\n2015\nTotal\nSubprograma FPI-MICINN  .  .  .  . . . . .\n7.762.722,00 23.025.044,00\n7.762.722,00\n21.960.664,00\n21.960.664,00\n0,00\n82.471.816,00\nSubprograma FPI-INIA .  .  .  .  .  . . . . . .\n450.000,00\n935.000,00\n1.247.894,00\n1.634.510,00\n975.053,00\n0,00\n5.242.457,00\n    Total .  .  .  .  .  .  .  .  .  .  . . . . . . . . . . . .\n8.212.722,00 23.960.044,00\n9.010.616,00\n23.595.174,00\n22.935.717,00\n0,00\n87.714.273,00\n4.  La cuantía total máxima de las ayudas correspondientes a estos subprogramas \npodrá ser incrementada con una cuantía adicional de 30.000.000 euros cuando, como \nconsecuencia de la concurrencia de alguna de las circunstancias previstas en el artículo \n58.2.a) del Reglamento de la Ley General de Subvenciones, se produzca un aumento de \nlos créditos disponibles antes de la concesión de las ayudas.\nLa efectividad de la cuantía adicional queda condicionada a la declaración de \ndisponibilidad del crédito como consecuencia de las circunstancias antes señaladas y, en \nsu caso, a la previa aprobación de la modificación presupuestaria que proceda, en un \nmomento anterior a la resolución de la concesión de la subvención.\nEn todo caso, la declaración de los créditos finalmente disponibles y su distribución \ndefinitiva se publicará en el BOE, sin que tal publicidad implique la apertura de plazo para \npresentar nuevas solicitudes ni el inicio de nuevo cómputo de plazo para resolver.\n5.  Las ayudas que se concedan a los diferentes beneficiarios se podrán cofinanciar \ncon recursos procedentes del Fondo Social Europeo (FSE).\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "b67d3e04-1fdd-4a82-b1e7-48b6d9a6be38"
}