{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 12\nBodil Nistrup Madsen & Hanne Erdman Thomsen  \ntion model and physical data model that represent three levels in data mod-\nelling, where the first step is development of a conceptual data model.  \n An important issue to be discussed here is the distinction between ontol-\nogy, understood as “concept model”, i.e. a model that may be defined as \n“model for the description of knowledge about concepts”, and ontology, un-\nderstood as “conceptual data model”, i.e. a “data model that represents an \nabstract view of the real world”. This distinction is for example found in \nCEN CWA 15045 (2004), but in many cases the two concepts are not \nclearly distinguished, and confusion may arise because of the word “con-\nceptual” in the term “conceptual data model”. There are some similarities \nbetween ontologies (concept models) and conceptual data models, but they \nalso differ considerably.  \n Ontologies give information about concepts in the form of feature specifi-\ncations and concept relations (information about meaning). Conceptual data \nmodels give information about the classes in the form of attributes and asso-\nciations between the classes. The attributes of the data model give no infor-\nmation about the meaning of the classes, only a specification of what kind of \ninformation will be given about the entities represented by the classes in \nquestion. \n Figure 10 shows an example of an extract of an ontology for terminologi-\ncal information categories, i.e. some concepts that may be relevant when one \nwants to establish a terminology database (source reference, e.g. for defini-\ntions, terms etc.). \nFigure 10: Extract of an ontology for terminological information \n \n On the basis of the feature specifications it is possible to write definitions \nof the concepts. \n Figure 11 shows the corresponding part of a conceptual data model for a \nterminology database (source reference, e.g. for definitions, terms etc.). \n \n12\n \n",
  "speaker": "SYSTEM",
  "uuid": "b6e1a783-8180-4a63-a41d-2f3b4ea34982"
}