{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 124\nBÚSQUEDA \n \n124 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEjercicio. Estudiar que sucede en el árbol de la figura 12 si expandimos de derecha \na izquierda. \nAhora es necesario aplicar la idea contenida en el anterior procedimiento al cálculo \ndel valor MiniMax. Este problema es más difícil por dos razones: la existencia de un \nnúmero de capas (límite de profundidad) y porque el trabajo debe ser realizado con \nvalores numéricos y no con un par de valores simbólicos. \nLa idea para llevar a la práctica esa generalización es la siguiente. En lugar de \nconstruir una lista con los valores de los sucesores de una posición y, después, \ncalcular el máximo (o mínimo) de esa lista, procedemos a calcular el máximo (o \nmínimo) secuencialmente, pero si el valor máximo (o mínimo) provisional cruza una \ncierta cota, entonces se para el proceso de cálculo y se devuelve la cota como valor; \nsi el máximo (o mínimo) no llega a cruzar la cota es el máximo (o mínimo) lo que es \ndevuelto. \nTenemos el siguiente algoritmo V(N,alfa,beta,r), donde r es el número de capas y \nalfa, beta son dos parámetros numéricos tales que alfa <= beta. El algoritmo calcula \nel valor MiniMax de N con r capas si dicho valor se encuentra entre alfa y beta. Si el \nvalor MiniMax de N es menor o igual que alfa, devuelve alfa. Y si el valor MiniMax de \nN es mayor o igual que beta, devuelve beta. Así pues si queremos calcular el valor \nMiniMax de r capas bastará hacer una llamada V(N,-infinito,+infinito,r). (Los valores -\ninfinito y +infinito pueden ser reemplazados, respectivamente, por un número menor \no mayor que el mínimo o máximo de los valores que puede tomar la función \nheurística, si disponemos de esa información.) Es importante observar que en el \nsiguiente algoritmo recursivo los 4 parámetros pasan por valor y que el contador \"i\" \nutilizado, debe ser entendido como una variable local a cada una de las llamadas. \n \nFunción alfa-beta V(N,alfa,beta,r) devuelve un número; \n1. Si N está en la frontera de búsqueda (es decir, r = 0) o es una posición \nterminal, entonces devuelve (h(N)); en otro caso: sean (N1, …,Ni, …,Nk) las \nposiciones sucesoras de N. \n2. i := 1 \n3. mientras i <= k hacer \n4.  Si N es una posición MAX \n \n  \n \nentonces – alfa := máximo de alfa y V(Ni,alfa,beta,r-1) \n \n  \n \n \n \n \n – Si alfa >= beta entonces devuelve (beta) \n \n  \n \n \n \n \n – Si i = k entonces devuelve (alfa) \n \n  \n \nsi no  \n– beta := mínimo de beta y V(Ni,alfa,beta,r-1) \n",
  "speaker": "SYSTEM",
  "uuid": "b6f86c6c-e2c5-4f7e-9371-191f93957391"
}