{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 135\nMINISTERIO DE CULTURA\n141\n166.- Censo-Guía de Archivos de España e Iberoamérica\nDirección Web: http://aer.mcu.es/sgae/index_censo_guia.jsp\nOrganismo editor: Subdirección General de Archivos Estatales. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCensos y directorios\nImagen/Texto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Archivística.\nDescripción y comentarios: Datos referentes a los archivos españoles e iberoamericanos.\nEl censo guía proporciona información de los archivos, definidos como la institución, uni-\ndad administrativa o persona privada encargada de la custodia y servicio de la documen-\ntación; de los fondos y colecciones documentales que custodia cada archivo, descritos de\nacuerdo con las normas ISAD-G, y del fichero de autoridades con información de contex-\nto sobre los productores de la documentación. Por ello el usuario, a la hora de plantearse\nuna estrategia de búsqueda en el Censo Guía de Archivos, podrá hacerlo sobre la informa-\nción relativa a los archivos o sobre la referente a los fondos / colecciones documentales\nque custodian dichos centros, o bien podrá combinar ambas. Desde el punto de vista geo-\ngráfico, el Censo Guía de Archivos tiene como referente al mundo hispánico. Actualmente,\nademás de los archivos radicados en España, registra información de Argentina, Bolivia,\nBrasil, Colombia, Costa Rica, Cuba, Chile, Ecuador, Guatemala, México, Nicaragua,\nParaguay, Perú, Puerto Rico, el Salvador y Venezuela.\n167.- Guías de fuentes documentales de archivos\nDirección Web: http://www.mcu.es/guiafuentesdoc/cargarFiltro.do?layout=\nguiafuentesdoc&cache=init&language=es\nOrganismo editor: Subdirección General de Archivos Estatales. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Archivística.\nDescripción y comentarios: Bases de datos temáticas de documentos procedentes de\narchivos públicos y privados de España y de otros países europeos e iberoamericanos. Se\ntrata de bases de datos independientes sobre historia de España, Guerra Civil española, his-\ntoria de Europa, historia de América y ciencia y tecnología, reunidas en una sola llama-\nda CIDA. \nBASES DE DATOS  1/1/04  03:39  Página 141\n",
  "speaker": "SYSTEM",
  "uuid": "b78b4fa4-3e16-4d1e-abe0-ad2947c333bc"
}