{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 6\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13914\ne)  Integrar conocimientos, enfrentarse a la complejidad y formular juicios con \ninformación limitada.\nf)  La crítica y defensa intelectual de soluciones.\nArtículo 6.  Requisitos de acceso al doctorado.\n1.  Con carácter general, para el acceso a un programa oficial de doctorado será \nnecesario estar en posesión de los títulos oficiales españoles de Grado, o equivalente, y \nde Máster Universitario.\n2.  Asimismo podrán acceder quienes se encuentren en alguno de los siguientes \nsupuestos:\na)  Estar en posesión de un título universitario oficial español, o de otro país integrante \ndel Espacio Europeo de Educación Superior, que habilite para el acceso a Máster de \nacuerdo con lo establecido en el artículo 16 del Real Decreto 1393/2007, de 29 de octubre \ny haber superado un mínimo de 300 créditos ECTS en el conjunto de estudios universitarios \noficiales, de los que, al menos 60, habrán de ser de nivel de Máster.\nb)  Estar en posesión de un título oficial español de Graduado o Graduada, cuya \nduración, conforme a normas de derecho comunitario, sea de al menos 300 créditos ECTS. \nDichos titulados deberán cursar con carácter obligatorio los complementos de formación a \nque se refiere el artículo 7.2 de esta norma, salvo que el plan de estudios del correspondiente \ntítulo de grado incluya créditos de formación en investigación, equivalentes en valor \nformativo a los créditos en investigación procedentes de estudios de Máster.\nc)  Los titulados universitarios que, previa obtención de plaza en formación en la \ncorrespondiente prueba de acceso a plazas de formación sanitaria especializada, hayan \nsuperado con evaluación positiva al menos dos años de formación de un programa para la \nobtención del título oficial de alguna de las especialidades en Ciencias de la Salud.\nd)  Estar en posesión de un título obtenido conforme a sistemas educativos extranjeros, \nsin necesidad de su homologación, previa comprobación por la universidad de que éste \nacredita un nivel de formación equivalente a la del título oficial español de Máster \nUniversitario y que faculta en el país expedidor del título para el acceso a estudios de \ndoctorado. Esta admisión no implicará, en ningún caso, la homologación del título previo \ndel que esté en posesión el interesado ni su reconocimiento a otros efectos que el del \nacceso a enseñanzas de Doctorado.\ne)  Estar en posesión de otro título español de Doctor obtenido conforme a anteriores \nordenaciones universitarias.\nArtículo 7.  Criterios de admisión.\n1.  Las Universidades, a través de las Comisiones Académicas a que se refiere el \nartículo 8.3 de este real decreto, podrán establecer requisitos y criterios adicionales para \nla selección y admisión de los estudiantes a un concreto programa de doctorado.\n2.  La admisión a los Programas de Doctorado, podrá incluir la exigencia de \ncomplementos de formación específicos.\nDichos complementos de formación específica tendrán, a efectos de precios públicos \ny de concesión de becas y ayudas al estudio la consideración de formación de nivel de \ndoctorado y su desarrollo no computará a efectos del límite establecido en el artículo 3.2.\n3.  Los requisitos y criterios de admisión a que se refiere el apartado uno, así como el \ndiseño de los complementos de formación a que se refiere el apartado dos, se harán \nconstar en la memoria de verificación a que se refiere el artículo 10.2.\n4.  Los sistemas y procedimientos de admisión que establezcan las universidades \ndeberán incluir, en el caso de estudiantes con necesidades educativas especiales derivadas \nde la discapacidad, los servicios de apoyo y asesoramiento adecuados, que evaluarán la \nnecesidad de posibles adaptaciones curriculares, itinerarios o estudios alternativos.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "bb94468d-2bd7-41eb-8e08-aa39cb0fe9c8"
}