{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 12\ndon't try and change what is difficult to some other situation which is easily done but is still important, and\n \nthey keep giving themselves alibis why they don't. They keep saying that it is a matter of luck. I've told you\n\f\nhow easy it is; furthermore I've told you how to reform. Therefore, go forth and become great scientists!\n\u001a\n(End of the formal part of the talk.)\n1\nDISCUSSION - QUESTIONS AND ANSWERS\nA. G. Chynoweth:\n\u0013\n Well that was 50 minutes of concentrated wisdom and observations accumulated over a\nfantastic career; I lost track of all the observations that were striking home. Some of them are very very\ntimely. One was the plea for more computer capacity; I was hearing nothing but that this morning from\n\f\nseveral people, over and over again. So that was right on the mark today even though here we are 20 - 30\n\u0006\nyears after when you were making similar remarks, Dick. I can think of all sorts of lessons that all of us can\n!\ndraw from your talk. And for one, as I walk around the halls in the future I hope I won't see as many closed\n \ndoors in Bellcore. That was one observation I thought was very intriguing.\n \nThank you very, very much indeed Dick; that was a wonderful recollection. I'll now open it up for\nquestions. I'm sure there are many people who would like to take up on some of the points that Dick was\n\u0010\nmaking.\n\u0014\nHamming:\n2\n First let me respond to Alan Chynoweth about computing. I had computing in research and for\n\u0012\n10 years I kept telling my management, ``Get that !&@#% machine out of research. We are being forced to\nrun problems all the time. We can't do research because were too busy operating and running the\n\u0018\ncomputing machines.'' Finally the message got through. They were going to move computing out of\n\u0007\nresearch to someplace else. I was persona non grata to say the least and I was surprised that people didn't\nkick my shins because everybody was having their toy taken away from them. I went in to Ed David's\noffice and said, ``Look Ed, you've got to give your researchers a machine. If you give them a great big\n\u000e\nmachine, we'll be back in the same trouble we were before, so busy keeping it going we can't think. Give\n\u0014\nthem the smallest machine you can because they are very able people. They will learn how to do things on\n\f\na small machine instead of mass computing.'' As far as I'm concerned, that's how UNIX arose. We gave\n\t\nthem a moderately small machine and they decided to make it do great things. They had to come up with a\n\f\nsystem to do it on. It is called UNIX!\n\u0006\nA. G. Chynoweth:\n\u0013\n I just have to pick up on that one. In our present environment, Dick, while we wrestle\nwith some of the red tape attributed to, or required by, the regulators, there is one quote that one\n\nexasperated AVP came up with and I've used it over and over again. He growled that, ``UNIX was never a\n\b\ndeliverable!''\n \nQuestion: What about personal stress? Does that seem to make a difference?\nHamming: Yes, it does. If you don't get emotionally involved, it doesn't. I had incipient ulcers most of the\nyears that I was at Bell Labs. I have since gone off to the Naval Postgraduate School and laid back\n!\nsomewhat, and now my health is much better. But if you want to be a great scientist you're going to have to\n\u0006\nput up with stress. You can lead a nice life; you can be a nice guy or you can be a great scientist. But nice\n\u000f\nguys end last, is what Leo Durocher said. If you want to lead a nice happy life with a lot of recreation and\n\u0017\neverything else, you'll lead a nice life.\n\b\nQuestion: The remarks about having courage, no one could argue with; but those of us who have gray hairs\nor who are well established don't have to worry too much. But what I sense among the young people these\n\u000e\ndays is a real concern over the risk taking in a highly competitive environment. Do you have any words of\n \nwisdom on this?\n\nHamming: I'll quote Ed David more. Ed David was concerned about the general loss of nerve in our\nsociety. It does seem to me that we've gone through various periods. Coming out of the war, coming out of\n\u0006\nLos Alamos where we built the bomb, coming out of building the radars and so on, there came into the\nmathematics department, and the research area, a group of people with a lot of guts. They've just seen\n\u0014\nthings done; they've just won a war which was fantastic. We had reasons for having courage and therefore\n\f\nwe did a great deal. I can't arrange that situation to do it again. I cannot blame the present generation for not\n\nhaving it, but I agree with what you say; I just cannot attach blame to it. It doesn't seem to me they have the\ndesire for greatness; they lack the courage to do it. But we had, because we were in a favorable\n \ncircumstance to have it; we just came through a tremendously successful war. In the war we were looking\n\u0007\n",
  "speaker": "SYSTEM",
  "uuid": "bc3726cd-52f0-4061-830f-cb4a6dc123a2"
}