{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 14\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 14 of 21\n \nContract type and Work condition depend on the job offer’s country. They are not \nincluded in the SEEMP deliverable D1.1 “User Requirement Definition”, but we will \nacquire their information. \n1.1.2 Selecting the standards that cover most of the identified necessities. \nIn this section we present how we have selected the standards that cover the objects \nalready identified in the above section. We present in different sections how we have \nselected the human resources management standards, the time ontology, the currency \nclassification, the location (geographic location) classification and language classification. \n \nSelecting human resources management standards \nWe have already described some human resources management standards in section 2.2 of \nthe SEEMP deliverable D2.1 “Semantic and Technical Aspects in e-Gov Software \nDevelopment” and they are: \nOccupation classifications: SOC1, ISCO-882 and ISCO-88 (COM)3. \nClassification of Economic Activities: ISIC Rev. 3.14, NACE Rev. 1.13 and NAICS5. \nApprenticeship classifications: ISCED 973 and Classification of Fields of Education and \nTraining (FOET)3. \nIn order to choose the most suitable standards for modeling CVs and job offers, the following \ncriteria have been considered: \nC1.  The degree of coverage. This aspect has been evaluated taking into account the scope \nand size of the standard. However, a too wide coverage of the standard may move us \nfurther away the European reality, therefore we have tried to find a trade off between this \naspect and the following one. \nC2. The current European needs. It is important that standard focuses on the current \nEuropean reality. The user partners involved in the SEEMP project have a deep \nknowledge of the European employment market and the outcome prototype will be \nvalidated in European scenarios. \nSince it has been clearly identified by partners involved in the project that the recommended \nstandard for occupation classifications is ISCO-88(COM), for classification of economic \nactivities is NACE Rev. 1.1 and for apprenticeship classifications is Classification of Fields of \nEducation and Training (FOET). \nThe following three tables compare the coverage of the previous standards using the set of \nobjects identified in section 4.2.1; Table 4-3 summarizes the comparison between three \noccupation classifications standards (SOC, ISCO-88 and ISCO-88(COM)). Table 4-4 \n                                                 \n1 http://www.bls.gov/soc/ \n2 http://www.ilo.org/public/english/bureau/stat/class/isco.htm \n3 \nAvailable \nthrough \nRAMON \nEurostat's \nClassifications \nServer \nat \nhttp://ec.europa.eu/comm/eurostat/ramon/ \n4 http://unstats.un.org/unsd/cr/registry/regcst.asp?Cl=17&Lg=1 \n5 http://www.census.gov/epcd/www/naics.html \n",
  "speaker": "SYSTEM",
  "uuid": "bc620997-e7ac-442c-9106-ff27c6b3ea2e"
}