{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 9\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n2. ISMN - International Standard Music Number. Número de identificación para \npartituras, música escrita en papel, CD-ROM, archivos de Internet. El estándar ISO \n10957 proporciona las reglas básicas del sistema ISMN. Está formado por 4 elementos \ncomprendiendo 10 dígitos. Por ejemplo: M-2306-7118-7.  \n- \nM: El prefijo M distingue el ISMN de otros estándares. Identifica las ediciones \nde música. \n- \n2306: Prefijo editorial, de cuatro o más dígitos que identifica a un editor \nespecífico y que se le asigna en razón de su producción editorial. \n- \n7118: número del título que identifica a un documento concreto. \n- \n7: Dígito de comprobación que permite revisar la correcta asignación del ISMN y \nevitar, por ejemplo, dar números replicados. \n- \nTodo el proceso de implantación en España, que ha sido efectuado \nrecientemente, ha sido desarrollado, impulsado y controlado, por el Centro de \nDocumentación de Música y Danza del INAEM, donde radica la Agencia \nEspañola del ISMN (International Standard Music Number). Para ello se contó \ncon el asesoramiento de la Agencia Internacional ISMN, desde su sede de Berlín, \nde cuya organización forma parte la Agencia Española.  \n- \nDescargada la ficha de solicitud de ISMN en formato .doc. \n3. ISRC - International Standard Recording Code. Número de identificación para \nregistros sonoros y videograbaciones. \n4. ISSN - International Standard Serial Number. El ISSN es el código internacional de \nidentificación de las publicaciones seriadas (revistas, periódicos, boletines, anuarios, \nseries de monografías...) \n5. ISWC - International Standard Works Code. Sirve para codificar las obras musicales \npero no el producto sino la creación en sí. \n2.3.2 Sistemas de Clasificación Bibliográficos \nLa importancia de estas clasificaciones está en la extensión de su uso y la consecuente \nposibilidad de intercambio de información que generan. En el mundo occidental podemos \ndistinguir: CDU (Clasificación Decimal Universal), LCC (Library of Congreso \nClasification) y DDC (Sistema Deway de Clasificación). \n1. CDU (Clasificación Decimal Universal). Es el sistema oficial de clasificación en España \npara las bibliotecas de titularidad estatal. Siendo la base para la ordenación de la \nBibliografía Española. Está basado en el Sistema Dewey de Clasificación (véase punto 2 \nde este apartado), siendo más poderoso y flexible que el Dewey. Aplicado en la mayoría \nde los países de lengua latina y en general en Europa Oriental. El Dewey es más \nutilizado sobretodo en países anglosajones. \n \n9\n",
  "speaker": "SYSTEM",
  "uuid": "bcca44a3-1ff5-40c5-b5e0-f7c005954207"
}