{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 2\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97727\nhumanos del Plan Nacional de Investigación Científica, Desarrollo e Innovación Tecnológica \n(I+D+i) 2008-2011, publicadas en el Boletín Oficial del Estado de 9 de febrero de 2008.\nEn resumen, esta convocatoria refuerza y complementa actuaciones propias de \nplanificación estratégica de las Universidades, de los Organismos Públicos de Investigación \ny de las Comunidades Autónomas; además, introduce factores que persiguen el fomento \nde la cohesión universitaria en todo el Estado y la valoración de los méritos de todos los \nsolicitantes en un marco común dentro de su campo científico. Asimismo, persigue la \npotenciación de los estudios de doctorado que han obtenido la Mención de Calidad.\nPor las razones expuestas, he dispuesto publicar la convocatoria de ayudas del \nPrograma de Formación de Profesorado Universitario, que será difundida a través de la \npágina Web del Ministerio de Educación.\nCAPÍTULO I\nObjeto y condiciones del programa\nArtículo 1.  Objeto.\n1.  La finalidad de esta convocatoria es promover la formación del profesorado \nuniversitario en programas de doctorado de solvencia formativa e investigadora, en \ncualquier área del conocimiento científico, que facilite su futura incorporación al sistema \nespañol de educación superior e investigación científica.\n2.  La convocatoria de ayudas regulada por la presente convocatoria se realiza al \namparo de la Orden ECI/266/2008, de 6 de febrero, por la que se establecen las bases \nreguladoras de la concesión de subvenciones públicas en el marco de la línea instrumental \nde actuación en recursos humanos del Plan Nacional de Investigación Científica, Desarrollo \ne Innovación Tecnológica (I+D+i) 2008-2011.\nArtículo 2.  Número y tipo de ayudas.\n1.  Se convocan 950 becas que se concederán régimen de publicidad, objetividad y \nconcurrencia competitiva, de las que hasta un máximo del 5% se reservan a estudiantes \ncon una discapacidad igual o superior al 65 por ciento. El número de ayudas previstas \npodrá ser ampliado en función de las disponibilidades presupuestarias, atendiendo al \ncarácter variable de su duración.\n2.  El programa financiará, además, ayudas para estancias breves y traslados \ntemporales al extranjero que en su caso procedan, así como los precios públicos de la \nmatrícula en el doctorado, de acuerdo con lo dispuesto en los capítulos V, VI y VII de la \npresente convocatoria.\n3.  Las ayudas que se concedan al amparo de la presente convocatoria, quedarán \nsujetas al ámbito de aplicación del Real Decreto 63/2006, por el que se aprueba el Estatuto \ndel personal investigador en formación.\nArtículo 3.  Financiación.\n1.  El gasto de las ayudas que se concedan se realizará con cargo a la aplicación \npresupuestaria 21.04.463A.781 de los Presupuestos Generales del Estado, hasta un \nmáximo de 67.928.854,00 € euros, con la siguiente distribución estimativa por \nanualidades:\nAño\nTotal\n2010\n2011\n2012\n2013\n2014\n67.928.854,00 €\n8.934.332,00\n13.401.498,00\n18.180.685,00\n20.562.929,00\n6.849.410,00\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "bd502f1f-c5e4-4d9c-bce1-2c636420a890"
}