{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 7\n1 El Gobierno aprueba el Proyecto de Ley sobre Reutilización de la Información del Sector Público, nota de pren-\nsa del Ministerio de Cultura, [Madrid], 1 de mayo de 2007, en: http://www.mcu.es/notas/docs/2007/mayo/PROYEC-\nTO_LEY_REUTILIZACION.pdf (última consulta: 04.07.08).\n2 RAMOS SIMÓN, Luis Fernando. “La reutilización de la información del sector público. Aproximación al conte-\nnido de la propuesta de directiva 2002”. En: Revista General de Información y Documentación. 13, n.º 2 (2003),\npp. 59-96.\nASPECTOS DE LA DIRECTIVA DE 2003/98/CE DEL\nPARLAMENTO EUROPEO Y DEL CONSEJO DE\n17 DE NOVIEMBRE DE 2003 RELATIVA A LA\nREUTILIZACIÓN DE LA INFORMACIÓN DEL SECTOR\nPÚBLICO Y SU ADAPTACIÓN A ESPAÑA\nDra. Iuliana Botezan\nibotezan@ccinf.ucm.es\n1. INTRODUCCIÓN\nHasta hace relativamente poco tiempo, en España las prácticas relacionadas con la\nreutilización de la información pública se desarrollaban de una forma esporádica, caóti-\nca o no se desarrollaban. Por ello la aparición de la Ley 37 de 16 de noviembre de 2007\nsobre la reutilización de la información del sector público basada en la Directiva de\n2003/98/CE del Parlamento Europeo y del Consejo de 17 de noviembre de 2003 (relati-\nva a la reutilización de la información del sector público) vino a cubrir un campo que\nreclamaba desde hacía tiempo unas normas claras que especificaran qué información\npodría ser pública y reutilizable, cuándo, en qué condiciones, etc. La ley matiza en este\ncaso las particularidades administrativas de España, que son totalmente diferentes al\ncaso inglés o alemán en el “concierto” de países que desde 2003 se esfuerzan en adap-\ntar dicha Directiva.\n1.1. Acercamiento conceptual\nReutilización de la información\nLa Ley española entiende la reutilización como el uso de documentos que obran en\npoder de las Administraciones y organismos del sector público, por personas físicas o jurí-\ndicas, con fines comerciales o no comerciales, y siempre que dicho uso no constituya una\nactividad administrativa pública. La reutilización de la información del sector público\nimplica un gran potencial económico, ya que representa una materia prima importante para\nnuevos servicios y productos de información de valor añadido1.\nLa ley prevé que cualquier persona pueda solicitar información, sea a título individual\n(incluidos los extranjeros), sean asociaciones, empresas u organismos gubernamentales\nnacionales o extranjeros2.\nBASES DE DATOS  1/1/04  03:39  Página 11\n",
  "speaker": "SYSTEM",
  "uuid": "bd6c826c-1deb-4544-a291-21e1aa0166e3"
}