{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 30\n28\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nOf course many European LT companies have gained access to markets by being acquired by larger compa‐\nnies. This has been a particularly strong trend in language services, where huge companies that can address\nglobal clients have been built through the consolidation of many smaller, independent agencies; those same\ncompanies snapped up a range of translation tools in the process, and created the technology‐based trans‐\nlation industry we know today, an innovation dynamic that was driven from the European base of the indus‐\ntry. That phenomenon owed a lot to Irish government policy to encourage software “manufacturing” (in the\ndays of packed software that came in boxes) in Ireland, creating an entirely new industry called localisation\nto serve the multilingual needs of the European software market. Contrast that with the situation today,\nwhen the most visible innovations in translation technology – and business models for translation – are\nlargely driven from outside Europe.\nSome small and medium‐sized European technology companies have been picked off by large US players: the\nDutch semantic search company Q‐go is now part of Oracle; UK intelligence analytics firm i2 is now part of\nIBM; Loquendo, the speech company spawned by Telecom Italia, is the most recent European acquisition by\nNuance; Spain’s NeoMetrics Analytics is now part of Accenture; the speech search engine of UK‐based Aurix\nis now part of leading contact centre supplier Avaya and another call centre company Syntellect acquired\nFluency Voice Technologies. And of course Europe’s most successful “intelligent search” company,\nAutonomy, is now part of HP.\nSimilar acquisitions of small US LT companies by US software giants are equally common. IBM alone has\ninvested $14B in analytics acquisitions in the last five years, not to mention its internal development of\nWatson (and predicts it will achieve $16B in analytics sales by 2015). Microsoft bought FAST, Oracle bought\nEndeca. Nuance has acquired literally dozens of companies to build its market‐leading portfolio of speech\nand natural‐language offerings. \nNot all acquisitions are going to the US: Dassault Systèmes acquired the French intelligent search company\nExalead; Experian, the global information services group based in Dublin, bought the UK speech‐verification\ncompany 192business; OnMobile (spinoff of the Indian IT services giant Infosys) acquired the French speech\ncompany Telisma, and Wolters Kluwer acquired the US special‐domain semantics company Health Language\nInc. SDL in the UK acquired Language Weaver, the main statistical MT engine in the market developed for\nEnterprise (or government) markets, rather than as an online platform.\nThis consolidation in the industry is healthy, and it moves LT up the food chain into mainstream applications\nand markets. It does not, however, promote the evolution of a strong and self‐sustaining LT industry across\nEurope, as evidenced by the patchy language coverage of solutions in the speech and content markets, a key\nconstraining factor in Europe’s share of those segments of the market.\nFigure 11:  European LT vendors (by length of time active on the market)\n",
  "speaker": "SYSTEM",
  "uuid": "bed01c30-940f-49ec-b20f-eacccf2cd378"
}