{
  "message": "SYSTEM: Eswc2010webofdatatrack_submission_2.pdf: Página 10\n3.3.1 WS-based access to RDF repositories \nWS-DAI (Web Service Data Access and Integration) [3] is a recommendation of the \nOpen Grid Forum that defines interfaces to access data resources as web services. The \ngeneral WS-DAI specification has two extended realizations, one for accessing \nrelational databases (WS-DAIR) and another for accessing XML databases (WS-\nDAIX), and work is being done in providing another extended realization for RDF \ndata (WS-DAI-RDF [5]). The key elements of the WS-DAI specification are data \nservices. A data service is a Web service that implements one or more of the DAIS-\nWG13 specified interfaces to provide access to data resources (relational or XML \ndatabases, file systems, RDF datasets, etc.).  \nIn WS-DAI, there are two access modes to data resources, as shown in Figure 3:  \n• \nDirect access. Data resources are accessed like a regular service: a request \ncontaining a query is sent to the data resource and the web service returns a \nrowset with the requested data. \n• \nIndirect access. It implements a factory pattern for data requests. When a data \nresource is queried the data resource creates a new data resource where the query \nresults will be populated incrementally when they are available.  \n \nFigure 3: Direct and Indirect access to data resources respectively \nOGSA-DAI [2] is a framework that was primarily intended as the WS-DAI \nreference implementation but which evolved differently, extending it. It executes \ndata-centric workflows involving heterogeneous data resources for the purposes of \ndata access, integration, transformation and delivery. OGSA-DAI is integrated in \nApache Tomcat14 and within the Globus Toolkit15, and is used in OMII-UK16, the UK \ne-Science platform. \nOGSA-DAI relies on two key elements: data resources, which implement some of \nthe WS-DAI methods, and activities, which are operations or named units of \nfunctionality (data goes in, something is done, data comes out) that can be combined \nto create workflows, by combining inputs and outputs from the activities that access \nthe different resources. OGSA-DAI uses a tuple-based format for the internal \n                                                           \n13 https://forge.gridforum.org/projects/dais-wg \n14 http://tomcat.apache.org/ \n15 http://www.globus.org/toolkit \n16 http://www.omii.ac.uk/ \n",
  "speaker": "SYSTEM",
  "uuid": "bf329e7c-598f-4eeb-b676-b66a74cf9e22"
}