{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 10\n10\nGraeme Hirst\nword for the German gem¨utlich or for the French bavure ‘embarrassing bureaucratic\nerror’. On the face of it, this seems to argue for deriving a language-independent\nontology from the union of the lexicons of many languages (as attempted by Emele\net al. (1992)); but this is not quite feasible.\nQuite apart from lexical gaps in one language relative to another, there are many\ncategories that are not lexicalized in any language. After all, it is clear that the num-\nber of categories in the world far exceeds the number of word senses in a language,\nand while different languages present different inventories of senses, as we have\njust argued, it nonetheless remains true that, by and large, all will cover more or less\nthe same “conceptual territory”, namely the concepts most salient or important to\ndaily life, and these will be much the same across different languages, especially\ndifferent languages of similar cultures. As the world changes, new concepts will\narise and may be lexicalized, either as a new sense for an existing word (such as\nbrowser ‘software tool for viewing the World Wide Web’), as a ﬁxed phrase (road\nrage), or as a completely new word (demutualization ‘conversion of a mutual life\ninsurance company to a company with shareholders’, proteomics, DVD). That large\nareas remain unlexicalized is clear from the popularity of games and pastimes such\nas Sniglets (“words that don’t appear in the dictionary but should”) (Hall 1987) and\nWanted Words (Farrow 2000), which derive part of their humour from the identiﬁ-\ncation of established concepts that had not previously been articulated and yet are\nimmediately recognized as such when it is pointed out.\nBut even where natural languages “cover the same territory”, each different lan-\nguage will often present a different and mutually incompatible set of word senses,\nas each language lexicalizes somewhat different categorizations or perspectives of\nthe world. It is rare for words that are translation equivalents to be completely\nidentical in sense; more usually, they are merely cross-lingual near-synonyms (see\nsection 1.4.1 above).\nAn area of special ontological interest in which the vocabularies of natural lan-\nguages tend to be particularly sparse is the upper ontology (see Borgo et al., this\nvolume). Obviously, all natural languages need to be able to talk about the upper\nlevels of the ontology. Hence, one might have thought that at this level we would\nﬁnd natural languages to be in essential agreement about how the world is catego-\nrized, simply because the distinctions seem to be so fundamental and so basic to our\nbiologically based, and therefore presumably universal, cognitive processes and per-\nception of the world. But natural languages instead prefer to concentrate the richest\nand most commonly used parts of their vocabulary in roughly the middle of the hier-\narchy, an area that has come to be known as the basic-level categories; categories in\nthis area maximize both informativeness and distinctiveness (Murphy and Lassaline\n1997). A standard example: one is more likely to choose the word dog for X in the\ncontext Be careful not to trip over the X than entity, living thing, animal, mammal, or\nBeddlington terrier, even though the alternatives are equally ontologically correct.\nCertainly, all languages have words similar to the English thing, substance, and pro-\ncess; but these words tend to be vague terms and, even here, vary conceptually from\none language to another. That this is so is clear from the difﬁculty of devising a\n",
  "speaker": "SYSTEM",
  "uuid": "bf33b934-71e7-46a8-8b02-062514cbcc12"
}