{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 3\nSemantic Grounding of Cross-Lingual Folksonomies\n3\ncontext. The result of this process is that tags in diﬀerent languages referring to\nthe same concept are associated with a unique semantic resource. For instance,\nthe NYC, and nueva york 4 tags used in the sense of New York City, can be\nrelated to the semantic entity New York City5\nThe rest of the paper is structured as follows. Section 2 introduces related\nwork showing how our proposal diﬀers from the others. Section 3 presents our\nproposed process for the semantic grounding of multilingual tags, and for the\ngeneration of our multilingual sense repository. Section 4 describes the experi-\nmental evaluation setup. In Section 5 we discuss the evaluation results, which\nserve as the conclusions of our study. Finally, section 6 presents the future works.\n2\nRelated Work\nFolksonomies have been subject of study by researchers in last years. From the\nsemantic point of view two diﬀerent problems aﬀecting folksonomies have been\naddressed. The First problem is that folksonomies lack a uniform repre-\nsentation to facilitate their sharing and reuse. Some Web 2.0 applications\nprovide APIs to export their folksonomies. However, they do it in proprietary\nformats. To overcome this problem, ontologies have been proposed to model the\ntagging activities in folksonomies, with semantic concepts to represent users,\ntags, resources, etc. A survey in this respect is presented in [15].\nThe second problem is the lack of formal and explicit semantic of tags.\nResearchers have proposed techniques to discover tag semantics in folksonomies.\nWe have identiﬁed three kinds of approaches in this respect. 1) clustering ap-\nproaches [3, 17, 13] aiming at ﬁnding groups of tags relying on relatedness mea-\nsures among them [6]. 2) Ontology-based approaches [1, 5, 20] whose goal is to\nassociate ontology entities to tags. The ontology can be a domain ontology, or\na set of ontologies retrieved by a semantic search engine. Finally, 3) Hybrid ap-\nproaches [10] use a mix of clustering techniques and ontologies. A survey in this\nrespect is presented in [8]. We want to note that none of the aforementioned\napproaches deals with multilingual tags explicitly.\nOur research work aims at resolving the lack of semantics by grounding tags\nwith semantic entities, unlike [3, 10, 17]. In addition, while we use DBpedia as\nsemantic resource, the approaches presented in [1, 5] use ontologies retrieved by\nWatson6, and declared domain ontologies respectively. In addition, authors in\n[6] use WordNet senses to ground tags.\nOn the other hand, our multilingual sense repository was inspired by the\nTagora sense repository [19]. The Tagora sense repository, similarly to Tagpedia7,\nwas created taking advantage of wikipedia information. However, none of these\nsense repositories, include multilingual information.\n4 The Spanish translation of New York\n5 http://dbpedia.org/resource/New_York_City\n6 http://watson.kmi.open.ac.uk/WatsonWUI/\n7 http://www.tagpedia.org/\n",
  "speaker": "SYSTEM",
  "uuid": "c1085de3-6d56-4477-92e6-1da3db05f4c8"
}