{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 120\nPage 120 of 124\nNeOn Integrated Project EU-IST-027595\n[ECD+04]\nO.\nEtzioni,\nM.\nCafarella,\nD.\nDowney,\nS.\nKok,\nA.\nPopescu,\nT.\nShaked,\nS.\nSoderland,\nD.\nS.\nWeld,\nand\nA.\nYates.\nWeb-scale\nInforma-\ntion\nExtraction\nin\nKnowItAll.\nIn\nProceedings\nof\nWWW-2004,\n2004.\nhttp://www.cs.washington.edu/research/knowitall/papers/www-paper.pdf.\n[FB06]\nD. Foxvog and C. Bussler. Ontologizing EDI Semantics. In ER (Workshops), pages 301–\n311, 2006.\n[Fel98]\nChristiane Fellbaum, editor. WordNet - An Electronic Lexical Database. MIT Press, 1998.\n[FH02]\nM. Fleischman and E. Hovy. Fine grained classiﬁcation of named entities. In Proceedings\nof the 19th International Conference on Computational Linguistics (COLING’02), Taipei,\nTaiwan, 2002.\n[FTB+07]\nA. Funk, V. Tablan, K. Bontcheva, H. Cunningham, B. Davis, and S. Handschuh. Clone:\nControlled language for ontology editing. In Proceedings of the 6th International Semantic\nWeb Conference (ISWC 2007), Busan, Korea, November 2007.\n[GC05]\nR. García and O. Celma. Semantic Integration and Retrieval of Multimedia Metadata. In\nProceedings of the ISWC 2005 Workshop on Knowledge Markup and Semantic Annotation\n(Semannot’2005), 2005.\n[GGMO03]\nA. Gangemi, N. Guarino, C. Masolo, and A. Oltramari.\nSweetening WORDNET with\nDOLCE. AI Mag., 24(3):13–24, 2003.\n[GH06]\nS. Golder and B. Huberman. Usage patterns of collaborative tagging systems. Journal of\nInformation Science, 32(2):198–208, 2006.\n[GNV03]\nA. Gangemi, R. Navigli, and P. Velardi. The OntoWordNet Project: Extension and Axioma-\ntization of Conceptual Relations in WordNet. In CoopIS/DOA/ODBASE, 2003.\n[GPC08]\nJose Manuel Gómez-Pérez and Oscar Corcho. Problem-solving methods for understanding\nprocess executions. Computing in Science and Engg., 10(3):47–52, 2008.\n[GPS98]\nA. Gangemi, D. Pisanelli, and G. Steve. Ontology integration: Experiences with medical\nterminologies. Ontology in Information Systems, pages 163–178, 1998.\n[Hah03]\nV. Hahn. Turning informal thesauri into formal ontologies: a feasibility study on biomedical\nknowledge re-use. Comparative and Functional Genomics, 4:94–97(4), January/February\n2003.\n[Har68]\nZ.S. Harris. Mathematical Structures of Language. Wiley (Interscience), New York, 1968.\n[HdB07]\nM. Hepp and J. de Brujin. GenTax: A generic Methodology for Deriving OWL and RDF-\nS Ontologies from Hierarchical Classiﬁcations, Thesauri, and Inconsistent Taxonomies.\nIn Proceedings of the 4th European Semantic Web Conference (ESWC2007). Springer-\nVerlag, 2007.\n[Hea92]\nM. A. Hearst. Automatic acquisition of hyponyms from large text corpora. In Conference\non Computational Linguistics (COLING’92), Nantes, France, 1992. Association for Compu-\ntational Linguistics.\n[HFP+06]\nL. Han, T. Finin, C. Parr, J. Sachs, and A. Joshi. RDF123: a mechanism to transform\nspreadsheets to RDF. In Proceedings of the Twenty-First National Conference on Artiﬁcial\nIntelligence (AAAI-06), 2006.\n",
  "speaker": "SYSTEM",
  "uuid": "c1708937-d87a-4219-9bdc-d6fcf2107b92"
}