{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 64\n62\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nWeb based CAT tools\nWeb based CAT tools are an important new class of translation tool, and are likely to replace traditional\nclient/server tools (e.g. Windows products) in many use scenarios for several reasons:\nCross‐platform access via Windows, Mac, Linux and other operating systems.\nAbility to support users on mobile devices either via native mobile apps or HTML5/JavaScript, Java is also\nan attractive language for building highly capable, cross platform apps. \nSupport for agile development processes, where server side software is continually improved without forc‐\ning labour intensive client software upgrades\nCloud based asset management, translation memory, and other features to centralize project and asset\nmanagement. Users can work on a job from different devices at different times without losing work\nSaaS business models, with per user or volume based licenses enable customers to scale up and down as\nneeded\nWeb based translation agencies typically develop their own translation workbench and CAT tools, with vary‐\ning levels of sophistication depending on the company and its customer base. Examples of companies in this\ncategory include: Gengo, Straker Translations, Fox Translate, Elanex (aka ExpressIT), and One Hour\nTranslations. These companies provide clients with web based and API based ordering and project manage‐\nment interfaces (front end), and provide translators with an entirely web based editing and CAT environment\n(back end). \nThe Google Translator Toolkit (GTT), which is offered as a standalone CAT tool for translators, is an interest‐\ning example of how powerful web based tools can be. It is fully integrated with Google Translate, so trans‐\nlators can pre‐translate and post‐edit texts using machine translation followed by human review. GTT was\nalso recently integrated with YouTube to support user‐generated captions.\nSome client/server CAT tools, such as those provided by Across Systems, have web accessible interfaces.\nHowever in these systems, web access tends to be a second‐class citizen compared to the native client app,\nwhich is typically written for Microsoft Windows. This is often explained by the product’s history and the tim‐\ning of its development. Most of the client/server tools trace their origins to the late 90s and early 00s, before\nSaaS had caught on, and before non‐Windows operating systems such as Mac OS X, Android and iOS became\ncommonplace.\nMobile translation tools \nMobile translation tools are currently a novelty in the computer aided translation space, but will become a\nmaterial requirement in most translation management systems because translators, especially in developing\neconomies, use mobile devices as their primary means of accessing the Internet. Tools that do not support\nmobile access, either via HTML5/JavaScript, or via native iOS/Android applications, will find it increasingly\ndifficult to bring these translators into their workforce.\nHong Kong based OneSky (www.oneskyapp.com) offers an example of how translation can be done via\nmobile devices. Their service is specifically geared to mobile app localisation, so it fits well with a mobile\ntranslation‐editing tool. The primary challenge in making CAT environments accessible via mobile devices is\nto deal with the restrictive display and user input interfaces common to these devices. Typically this means\nconstraining the type of work mobile translators can do, for example, by having them work on shorter texts\nand documents. This limitation is less of an issue for tablet type devices since their displays are similar in size\nand resolution to a PC or laptop display.\n",
  "speaker": "SYSTEM",
  "uuid": "c1a660d1-89cc-45f2-a794-ca215dc895d1"
}