{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 76\n74\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nThe type of machine translation they need varies depending on the type of clients they have. Gengo typical‐\nly focuses on fairly generic texts, so consumer/web translation engines are suitable for them. LSPs that work\nwith less common languages or domains of expertise will probably want to use a custom MT engine such as\nLetsMT or AsiaOnline.\nConsumer/Individuals Direct\nGoogle Translate and Microsoft Translator (Bing Translator) are the two dominant machine translation serv‐\nices for consumers in the US and Europe. In addition to machine translation, there is also a well‐developed\nmarket for web based professional translation, where the customer uploads a Word document, PDF file, etc.\nto have it translated by professional translators. Several companies including Gengo, One Hour Translation,\nexpressIT (Elanex), Straker Translations and others offer some version of this type of service. \nWe expect hybrid translation service to become a standard offering, as it enables customers to use free\nmachine translation when they need to comprehend the contents of a document, but don’t need to publish\nit or share it with customers. By offering the ability to easily switch over to paid, professional translation, as\nBabelfish does, these providers can offer a convenient all‐in‐one solution for day to day translation requests. \nSME and Enterprise Direct\nSome companies, such as SDL BeGlobal, AsiaOnline, and others offer products that can be sold direct to cus‐\ntomers, enterprise clients in particular. They frequently have a very large volume of material to be translat‐\ned, and cannot afford or wait for professional translation. The companies best suited to sell direct have a\ngood outbound sales capability, as the direct to enterprise sales channel has a slow sales cycle (months or 1‐\n2 years). \nIn this scenario, the machine translation platform can be used either as a standalone service, or can be inte‐\ngrated into other systems where automation is a requirement. If the customer has a fairly standard work‐\nflow (for example, to upload documents for translation, and then post‐edit as needed), they can often use\nthe built in toolset provided with the translation engine. If the customer needs to integrate machine trans‐\nlation into a highly automated system, for example an e‐commerce server with tens of thousands of prod‐\nuct SKUs, they’ll probably need to do some system integration work. Nearly all of the translation engines\nwe’ve seen provide some sort of web services API, so they can be integrated into external systems in a rela‐\ntively straightforward way.\nGovernment/Institutions\nGovernment is an important market for machine translation technology, especially investigative and intelli‐\ngence agencies, which use it to sift through vast amounts of source material before it is reviewed by ana‐\nlysts. Machine translation is a vital tool in making information visible to analysts. This is an example of a mar‐\nket that will be well served by hybrid translation platforms, where machine translation is used for a first pass.\nThe machine translated documents are then fed into automated and human assisted search tools to flag\npotentially interesting documents, which are then queued for professional translation, and then for review\nby analysts and specialists.\nThe downside of this market is that the procurement process is quite arduous. Some governments also\nimpose considerable security requirements that commercial clients are less concerned with. The decision to\npursue this market is a strategic one, as it requires considerable investment in ancillary services, as well as a\nsales force that is experienced at securing public sector accounts, and military/intelligence agencies in par‐\nticular.\nTrends for Machine Translation\n",
  "speaker": "SYSTEM",
  "uuid": "c1c730fc-2a30-48f3-ae50-47235cde3765"
}