{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 34\nPage 34 of 124\nNeOn Integrated Project EU-IST-027595\n2.4\nNon-ontological Resource Re-engineering Tools\nIn this section, we describe the most signiﬁcant non-ontological resource re-engineering tools according to\nthe characteristics identiﬁed in section 2.2. We organize this section in two subsections: tools centered in\nthe non-ontological resource type, section 2.4.1, and tools centered in the non-ontological resource imple-\nmentation, section 2.4.2. Some of these tools give support to the methods presented in section 2.3.\n2.4.1\nTools Centered in the Non-ontological Resource Type\nIn this section we present some of the tools we found in the literature relating to the building of ontologies\nby re-engineering non-ontological resources. We introduce some tools to transform classiﬁcation schemes,\nfolksonomies, lexica and thesauri into ontologies are described.\nTool for Transforming Classiﬁcation Schemes into Ontologies\nSKOS2GenTax36 is an online tool that converts hierarchical classiﬁcations available in the W3C SKOS37\nformat into RDF(S) or OWL DL ontologies. SKOS2GenTax uses the GenTax algorithm described in [HdB07].\nThe input resource can be speciﬁed by its URL or it can be uploaded directly to the Web site. This resource\nhas to be available in SKOS RDF format.\nTool for Transforming Folksonomies into Ontologies\nT-ORG, a system to organize folksnomies by classifying the tags attached to them into predeﬁned categories\nis presented by Abbasi et al. in [ASC07]. The input resource is a ﬂat folksonomy tagspace. T-ORG gives\ntechnological support to the method described in [ASC07].\n2.4.2\nTools Centered in the non-ontological resource implementation\nIn this section we present some of the tools we found in the literature related with the re-engineering of non-\nontological resources centered in their implementation. We introduce some research to transform databases,\nXML ﬁles, spreadsheet ﬁles and ﬂat ﬁles into ontologies.\nTools for Transforming Databases into Ontologies\nThe four main tools for transforming databases are KAON-REVERSE, ODEMapster, D2R Server and Top-\nBraid Composer. In the following we describe each one of them.\n• KAON-REVERSE38 is a tool that supports the reverse engineering method presented in [SSV02] for\ntransforming databases into ontologies.\n• ODEMapster39 is the processor in charge of carrying out the exploitation of the mappings deﬁned\nusing R2O [Bar07]. This tool is intended to create instances of an existing ontology on demand or in a\nbatch processing.\n• D2R Server40 is a tool for publishing the content of relational databases on the Semantic Web.\n36http://www.heppnetz.de/projects/skos2gentax/\n37http://www.w3.org/2004/02/skos/\n38http://kaon.semanticweb.org/alphaworld/reverse/\n39http://parla.dia.fi.upm.es/software/index.jsp?sw=http//www.oeg-upm.net/software/\nsoftware.owl#ODEMapster\n40http://www4.wiwiss.fu-berlin.de/bizer/d2r-server\n",
  "speaker": "SYSTEM",
  "uuid": "c1dd0cef-2703-4636-9639-4fa53bb4617e"
}