{
  "message": "SYSTEM: CV-Cicyt_Elena_Mar2016_v1_.pdf: Página 12\nAutores (p.o. de firma): Elena Montiel-Ponsoda (UPM), Wim Peters (USFD). Other Authors: Guadalupe Aguado de \nCea(UPM), Mauricio Espinoza (UPM), Asunción Gómez-Pérez (UMP), Margherita Sini (FAO) . \nTítulo: NeOn Deliverable 2.4.2: NeOn Multilingual and Localization Support for Ontologies \nRef. \n revista \n Libro \nClave: S  Volumen:  \nPáginas, inicial: final:  \nFecha: Agosto 2008  \nEditorial (si libro):  \nLugar de publicación: \nAutores (p.o. de firma): Mari Carmen Suárez-Figueroa (UPM). Other Authors: Guadalupe Aguado de Cea (UPM), Carlos Buil \n(iSOCO), Klaas Dellschaft (UKO-LD), Mariano Fernández-López (CEU), Andrés García (UPM), Asunción Gómez-Pérez \n(UPM), German Herrero (ATOS), Elena Montiel-Ponsoda (UPM), Marta Sabor (OU), Boris Villazon-Terrazas (UPM), and \nZheng Yufei (UPM). \nTítulo: NeOn Deliverable 5.4.1: NeOn Methodology for Building Contextualized Ontology Networks. \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Febrero 2008  \nEditorial (si libro):  \nLugar de publicación: \nAutores (p.o. de firma): Valentina Presutti (CNR). Other Authors: Aldo Gangemi (CNR), Stefano David (CNR), Guadalupe \nAguado de Cea (UPM), Mari Carmen Suárez-Figueroa (UPM), Elena Montiel-Ponsoda (UPM), María Poveda (UPM). \nTítulo: NeOn Deliverable 2.5.1: A Library of Ontology Design Patterns: reusable solutions for collaborative design of \nnetworked ontologies. \nRef. \n revista \n Libro \nClave: S  Volumen:  \nPáginas, inicial: final:  \nFecha: Febrero 2008  \nEditorial (si libro):  \nLugar de publicación: \nAutores (p.o. de firma): Elena Montiel-Ponsoda (UPM); Wim Peters (USFD); Guadalupe Aguado de Cea (UPM); Mauricio \nEspinoza (UPM). Other Authors: Mari Carmen Suárez-Figueroa (UPM); José Ángel Ramos Gargantilla (UPM); Asunción \nGómez-Pérez (UPM); Inmaculada Álvarez-de-Mon (UPM); Margherita Sini (FAO); Aldo Gangemi (CNR); Óscar Muñoz \n(UMP); Raúl Palma (UPM) \nTítulo: NeOn Deliverable 2.4.1. Multilingual Ontology Support \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Agosto 2007 \nEditorial (si libro):  \nLugar de publicación: \nAutores (p.o. de firma): Mari Carmen Suárez-Figueroa (UPM). Other Authors: Guadalupe Aguado de Cea (UPM), Carlos Buil \n(iSOCO), Caterina Caracciolo (FAO), Martin Dzbor (OU), Asunción Gómez-Pérez (UPM), German Herrrero (ATOS), Holger \nLewen (UKARL), Elena Montiel-Ponsoda (UPM), Valentina Presutti (CNR) \nTítulo: NeOn D5.3.1 NeOn Development Process and Ontology Life Cycle  \nRef. \n revista \n Libro \nClave: S Volumen:  \nPáginas, inicial: final:  \nFecha: Agosto 2007 \nEditorial (si libro):  \nLugar de publicación: \nAutores (p.o. de firma): G. Aguado de Cea, E. Montiel-Ponsoda, J.A. Ramos Gargantilla \nEn: Revista de la Sociedad Española para el Procesamiento de Lenguaje Natural (SEPLN) \nTítulo: Multilingualidad en una aplicación basada en el conocimiento \nRef. \n revista \n Libro ISSN: 1135-5948 \nClave: A Volumen:  Volume 38/2007  \nPáginas, inicial: final: 77-97   \nFecha: Abril 2007 \nEditorial (si libro):  \nLugar de publicación: \n \nAutores (p.o. de firma): O. Múñoz-García, C. Buil Aranda, S. Brockmans, C. Catenacci, M. Esteban-Gutiérrez, R. García-\nCastro, A. Gómez-Pérez,P. Haase, J. Lehmann, H. Lewen, P. López Atau, A López-Cima, E. Montiel-Ponsoda, R. Palma, V. \nPresutti, M. Sabou, M.C. Suárez-Figueroa, W. Waterfeld, M. Weiten, Y. Wang \nTítulo:  NeOn. Deliverable 5.2.1. NeOn Protocols for Exchanging and Sharing Ontologies \n",
  "speaker": "SYSTEM",
  "uuid": "c253bc5c-deae-470e-bdd4-41d67c60285f"
}