{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 16\n16\nGraeme Hirst\n1.5.3 Finding covert categories\nOne way that a hierarchy derived from a machine-readable dictionary might become\nmore ontological is by the addition of categories that are unlexicalized in the lan-\nguage upon which it is based. Sometimes, these categories are implicitly reiﬁed by\nthe presence of other words in the vocabulary, and, following Cruse (1986), they\nare therefore often referred to as covert categories. For example, there is no single\nEnglish word for things that can be worn on the body (including clothes, jewellery,\nspectacles, shoes, and headwear), but the category nonetheless exists “covertly” as\nthe set of things that can substitute for\nX in the sentence Nadia was wearing (an)\nX. It is thus reiﬁed through the existence of the word wear as the category of things\nthat can meaningfully serve as the object of this verb.\nBarri`ere and Popowich (2000) showed that these covert categories (or some of\nthem, at least) can be identiﬁed and added as supplementary categories to a lexi-\ncally derived semantic hierarchy (such as those described in section 1.5.2 above).\nTheir method relies on the deﬁnitions in a children’s dictionary, in which the lan-\nguage of the deﬁnitions is simple and, unlike a regular dictionary, often emphasizes\nthe purpose or use of the deﬁniendum over its genus and differentia; for example,\na boat carries people and things on the water. The central idea of Barri`ere and\nPopowich’s method is to ﬁnd frequently recurring patterns in the deﬁnitions that\ncould signal the reiﬁcation of a covert category. The ﬁrst step is to interpret the\ndeﬁnitions into a conceptual-graph representation (see Sowa, this volume). Then,\na graph-matching algorithm looks in the conceptual-graph representations for sub-\ngraph patterns whose frequency exceeds an experimentally determined threshold.\nFor example, one frequent subgraph is\n[X]  (agent) [carry] !(object)!(person),\nwhich could be glossed as ‘things that carry people’. This pattern occurs in the def-\ninitions of many words, including boat, train, camel, and donkey. It thus represents\na covert category that can be named and added to a semantic hierarchy as a new\nhypernym (or subsumer, now) of the nodes that were derived from these words,\nin addition to any other hypernym that they already had. The name for the covert\ncategory may be derived from the subgraph, such as carry-object-person-agent for\nthe example above. The hierarchy thus becomes more than just lexical relations, al-\nthough less than a complete ontology; nonetheless, the new nodes could be helpful\nin text processing. The accuracy of the method is limited by the degree to which\npolysemy can be resolved; for example, in the category of things that people play,\nit ﬁnds, among others, music, baseball, and outside, representing different senses\nof play. Thus the output of the method must be regarded only as suggestions that\nrequire validation by a human.\nAlthough Barri`ere and Popowich present their method as being for general-\npurpose, domain-independent hierarchies and they rely on a particular and very\nsimple kind of dictionary, their method might also be useful in technical domains\nto help ensure completeness of an ontology derived from a lexicon by searching for\nunlexicalized concepts.\n",
  "speaker": "SYSTEM",
  "uuid": "c26964a0-6ff7-49ad-b8ff-9e9a05dd7429"
}