{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 17\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13925\n[2]  Competencias.\nSe valorará:\nSi las competencias a adquirir por el doctorando son evaluables y garantizan, como \nmínimo, las competencias básicas detalladas en el artículo 5 de este Real Decreto o bien \nson coherentes con las correspondientes al nivel de doctorado.\n[3]  Acceso y admisión de estudiantes.\nSe valorará:\nLa claridad y adecuación de los procedimientos de admisión y selección de los \nestudiantes.\nAdaptación de los complementos de formación específicos a los diversos perfiles de \ningreso, en el caso de que existan.\nEl número de estudiantes (nacionales y extranjeros) matriculados en el programa de \ndoctorado en los últimos 5 años o valoración de la estimación prevista.\n[4]  Actividades formativas.\nSe valorará:\nLa organización de la formación que se proporcione a los doctorandos, en particular \nsobre conocimientos disciplinares y metodológicos (seminarios, cursos, talleres, etc.), \ncompetencias transversales, experiencias formativas (jornadas de doctorandos, congresos \nnacionales o internacionales, etc.) y su planificación a lo largo del desarrollo del \nprograma.\n[5]  Organización del programa.\nSe valorará:\nLa adecuación de las actividades previstas de fomento de la dirección de tesis \ndoctorales al desarrollo del programa.\nLa adecuación de los procedimientos anteriormente descritos a los objetivos del \nprograma.\nLa presencia de expertos internacionales en las comisiones de seguimiento, informes \nprevios y en los tribunales de tesis.\nEn la fase de renovación de la acreditación se revisarán las estimaciones facilitadas en \neste criterio, atendiendo a las justificaciones aportadas y las acciones derivadas de su \nseguimiento.\n[6]  Recursos humanos.\nSe valorará:\nQue un porcentaje mínimo del 60% de los investigadores doctores participantes en el \nprograma tengan experiencia acreditada (excluidos los invitados y visitantes de corta \nduración).\nNúmero de profesores extranjeros que participan en el programa.\nQue los grupos de investigación incorporados al programa de doctorado cuentan con, \nal menos, un proyecto competitivo en los temas de las líneas de investigación del \nprograma.\nLa calidad de las contribuciones científicas del personal investigador que participa en \nel programa en los últimos 5 años/ tener un tramo de investigación vivo/haber alcanzado \nel número máximo de tramos posible. Contribuciones conjuntas con investigadores \nextranjeros.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "c3f2cab3-5ec5-48d1-965d-0abb312ed2c6"
}