{
  "message": "SYSTEM: Mpoveda-CVA-Marzo-2016.pdf: Página 4\n\t\r  \n\t\r  \n4 \n \n\t\r  \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nFecha concesión: 9 de marzo de 2015 \nEntidad titular: Universidad Politécnica de Madrid \n \nC.4. Patentes \nN/A \n \n \nC.5. Organización de actividades de I+D \n• \nTítulo: Linked Data in Architecture and Construction (LDAC). Tipo de \nparticipación: organización. Tipo de actividad: Workshop. Ambito: Web semántica y \narquitectura. Fecha: 15-17 de Julio 2015 \n• \nTítulo: The 1st Summer School on Smart Cities and Linked Open Data (LD4SC-\n15). Tipo de participación: asistente para prácticas. Tipo de actividad: Summer \nschool. Ambito: Web semántica y ciudades inteligentes. Fecha: 07-12 de Junio 2015 \n• \nTítulo: Linked Energy Data Vocamp. Tipo de participación: organización. Tipo de \nactividad: VoCamp (tutorial) Ambito: Web semántica y ciudades inteligentes. Fecha: \n22-23 de Abril 2015 \n• \nTítulo: Linked Energy Data Generation Tutorial (En conferencia: Sustainable \nPlaces 2014). Tipo de participación: organización. Tipo de actividad: Tutorial. \nAmbito: Web semántica y ciudades inteligentes. Fecha: 2 Octubre 2014 \n \nC.6. Participación en comités de programa \n• \nUso de datos enlazados en español – Presente y futuro (UDEEPF). Workshop. \n• \n3rd International Workshop on Methods, Evaluation, Tools and Applications for the \nCreation and Consumption of Structured Data for the e-Society.  \n• \n6th Workshop on Ontology and Semantic Web Patterns (WOP2015)  \n• \n11th OWL: Experiences and Directions Workshop (OWLED2014) \n• \n5th Workshop on Ontology and Semantic Web Patterns (WOP2014) \n• \n3rd International Workshop on Methods, Evaluation, Tools and Applications for the \nCreation and Consumption of Structured Data for the e-Society \n• \n4th Workshop on Ontology and Semantic Web Patterns (WOP2013) \n• \n3th Workshop on Ontology and Semantic Web Patterns (WOP2012) \n \nC.7. Estancias de investigación \n• \nCentro: Mondeca. Localidad: Paris. País: Francia. Fecha: 01/03/2013 – 28/06/2013. \nDuración (semanas): 16. Estancia doctoral. \n• \nCentro: Free University of Berlin. Localidad: Berlin. País: Alemania. Fecha: \n12/03/2012 – 01/06/2012. Duración (semanas): 12. Estancia doctoral. \n• \nCentro: University of Liverpool - Computer Science Department. Localidad: \nLiverpool. País: Reino Unido. Fecha: 23/03/2011 – 24/06/2011. Duración (semanas): \n12. Estancia doctoral. \n \nC.8. Charlas invitadas \n• \n“Vocabularios abiertos para datos abiertos”. Encuentro de datos abiertos 2016 de la \nUniversidad de Alicante. 17 de marzo de 2016. \n \nC.9. Premios \n• \nDiploma a una de las tres tecnologías mejor valoradas durante el “III Curso de \nComercialización de Tecnologías UPM” de 2014.  \n• \nPREMIO ACTUAUPM 2015 a las 10 mejores ideas de negocio de la UPM. Marzo \n2015. \n \n",
  "speaker": "SYSTEM",
  "uuid": "c4564ba8-1d4c-47c0-891f-e0f1fb5311e2"
}