{
  "message": "SYSTEM: CV-Cicyt_EMP_Enero2010.pdf: Página 19\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \nDOCTORADO: \n \nJunio 2007: Obtención de la Suficiencia Investigadora (Diploma de Estudios Avanzados) \n \nEnero 2007: Obtención de una beca de investigación de la Universidad Politécnica de Madrid, cofinanciada con \nel proyecto europeo Lifecycle support for networked ontologies (NeOn) (FP6-027595). \n \nCurso 2006-2007: Segundo curso del Doctorado en “Lenguas para Fines Específicos: un enfoque \nmultidisciplinar” del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la UPM. Periodo de \ninvestigación.  \n \nCurso 2005-2006: Primer curso del Doctorado en “Lenguas para Fines Específicos: un enfoque \nmultidisciplinar” del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la UPM. Realización \nde cursos de doctorado. \nREVISIONES EN CONFERENCIAS: \n \nAgosto 2010: miembro del comité de programa ECAI2010 \n \nJunio 2010: miembro del comité de programa para pósters y demostraciones EKAW2010 \n \nJunio 2009: revisora adicional de la Conferencia RANLP \n \nDiciembre 2008: revisora adicional de la Conferencia BIS2009 \n \nDiciembre 2008: revisora adicional del Workshop ESAIR09 \n \nNoviembre 2008: revisora del Workshop SWAP2008 \n \nDiciembre 2007: revisora adicional de la revista JIS \nESTANCIAS EN EL EXTRANJERO DURANTE LOS ESTUDIOS SUPERIORES: \n \nSeptiembre 2000- Febrero 2003: Estudiante en la Hochschule Magdeburg-Stendal, Alemania.  \n \nCurso 1999-2000 (1º cuatrimestre): Participante del programa europeo de intercambio de estudiantes Sócrates-\nErasmus con la Universidad de Middlesex (Middlesex University), Londres, como estudiante de Traducción e \nInterpretación. \n \nCurso 1998-1999 (1º cuatrimestre): Participante del programa europeo de intercambio de estudiantes Sócrates-\nErasmus con la Universidad de Ciencias Aplicadas de Magdeburgo, Alemania, como estudiante de Traducción e \nInterpretación. \nOTRAS TITULACIONES ACADÉMICAS: \n \nSeptiembre 2000: Ciclo Superior de Inglés. Escuela Oficial de Idiomas de Alicante. 7 Notable. \n \nSeptiembre 2001: Ciclo Superior de Alemán. Escuela Oficial de Idiomas de Alicante. 7 Notable. \n \nJulio 1999: Título Superior de Valenciano (Grau Superior) de la Junta Qualificadora de Coneixements de Valencià.  \nCURSOS Y SEMINARIOS RECIBIDOS: \n \n27-31 agosto 2009: GATE Summer School 2009. En el Natural Language Processing Group de la Universidad de \nSheffield, Reino Unido. \n \n8-10 junio 2009: Cursos Avanzados en “Introduction to Ontological Semantics” y “Multi-Agent Simulation Systems \nfor Clinical Medicine”, dentro del módulo Ciencia de la Computación del Programa Oficial de Posgrado de la \nFacultad de Informática de la UPM, por los profesores Sergei Nirenburg y Marjorie McShane del Department of \nComputer Science and Electrical Engineering, University of Maryland, Baltimor Contry, USA (21 horas). \n \n6-8 mayo 2009: Curso en “Gramática Discursivo-Funcional”, dentro del módulo de Másters en Lingüística Inglesa, \norganizado por la prof. Elena Martínez Caro en la Universidad Complutense de Madrid (9 horas). \n",
  "speaker": "SYSTEM",
  "uuid": "c47e6a54-e5d0-4a4a-ab11-d6b8f2326630"
}