{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 13\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 13 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n1.2. Our Approach \nWith this new vision of the ontologies and the Semantic Web, it is important to provide strong \nmethodological support for the collaborative and context-sensitive development of ontology \nnetworks.  \nYet, we do not start from scratch. Our work is based on Software Engineering methodological work \n(terminology, models, ideas, etc.), on existing methodologies for ontology construction, particularly \nMETHONTOLOGY [32] (from the UPM team), On-To-Knowledge [53] and DILIGENT [47] (from \nUKARL team), and on the experience of people involved in building the ontologies for the fishery \nand pharmaceutical domains in the NeOn use cases. It is also based on the experience gained by \nsome of the consortium members from participating in other international and national projects. \nWhenever it is possible, we present the WP5 results through a Software Engineering approach \nwith different levels of complexity to facilitate a promptly assimilation by software developers and \nontology practitioners.      \nMethodological frameworks are widely accepted in different mature fields, like in Software \nEngineering. Taking into account that single ontologies and ontology networks could be seen as \n“software artifacts” and as part of software products, current software methodologies could be \nrelevant to the Ontology Engineering field; at least, to take them as inspiration.   \nIn order to provide the methodological support for collaborative and context-sensitive development \nof ontology networks, we have taken IEEE standard definitions related to development process, life \ncycle models, and life cycle in Software Engineering as a starting point and we have adapted these \ndefinitions to the specific features of the development of single ontologies and ontology networks. \nThus, the ontology network development process can be seen as a specific case of software \ndevelopment process, and an ontology network life cycle, as a specific case of software life cycle. \n1.3. Main Contributions \nThe new definitions provided in this deliverable are the following: \n The ontology network development process is defined in NeOn as the process by which \nuser needs are translated into an ontology network. The main goal of the ontology network \ndevelopment process is to identify and define which activities are carried out when an \nontology network is developed.  \n An ontology network life cycle model is defined as the framework, selected by each \norganization, on which to map the activities identified in the ontology network development \nprocess to produce the ontology network life cycle. \n The ontology network life cycle is defined as the project-specific sequence of activities \ncreated by mapping the activities identified in the ontology network development process \nonto a selected ontology network life cycle model. \nTherefore, in the NeOn project we argue that it is not enough to support the ontology network \ndevelopment process; the ontology network life cycle needs also be supported. Consequently, in \naddition to the previous definitions, we have included other important results in this deliverable \nsuch as the following ones: \n The NeOn Glossary of Activities, which identifies and defines the activities carried out when \nontology networks are collaboratively built. In order to facilitate the identification of which \nactivities are important in the ontology network life cycle, in a first draft we identified which \n",
  "speaker": "SYSTEM",
  "uuid": "c4d1a405-54b9-486f-98b8-f58c9556803c"
}