{
  "message": "SYSTEM: Cicyt_Asun-19-05-10.pdf: Página 7\nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 01-09-04 hasta: 31-08-07 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 1 \n \nTítulo del proyecto: Preparación de propuesta de proyecto europeo OntoGrid (TSI2004-20384-E ) \nEntidad financiadora: Ministerio de Educación y Ciencia \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 01-11-05 hasta:  30-11-06 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 1 \n \nTítulo del proyecto: OntoGrid: Paving the way for Knowledgeable Grid Services and Systems (FP6-511513) \nEntidad financiadora: Unión Europea \nEntidades participantes: Universidad Politécnica de Madrid; University of Liverpool; University of Manchester; Intelligent \nSoftware Components S.A., Ackin B.V., Technical University of Crete, DEIMOS Space S.L., Boyd International B.V.i.o \nDuración, desde: 01-09-2004 \nhasta: 31-08-2007 \nInvestigador responsable: Asunción Gómez Pérez (coordinadora del proyecto) \nNúmero de investigadores participantes: 36 \n \nTítulo del proyecto: Knowledge Web (FP6-507482) \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Innsbruck, Institut für Informatik; École Polytechnique Fedérale de Lausanne; France \nTelecom; Freie Universität Berlin; Free University of Bozen-Bolzano; Institut National de Recherche en Informatique et en \nAutomatique; Informatics and Telematics Institute; Learning Lab Lower Saxony; National University of Ireland Galway; The \nOpen University; Universidad Politécnica de Madrid; University of Karlsruhe; University of Liverpool; University of \nManchester; University of Sheffield; University of Trento; Vrije Universiteit Amsterdam; Vrije Universiteit Brussel \nDuración, desde: 01-01-2004 \nhasta: 31-12-2007 \nInvestigador responsable: Dieter Fensel \nNúmero de investigadores participantes: 32 \n \nTítulo del proyecto: Infraestructura Tecnológica de Servicios Semánticos para la Web Semántica (TIN-2004-02660) \nEntidad financiadora: Ministerio de Ciencia y Tecnología. Dirección General de Investigación. Subdirección General de \nProyectos de Investigación. \nEntidades participantes: Universidad Politécnica de Madrid y Universidad de Santiago de Compostela \nDuración, desde: 13-12-2004 \nhasta: 13-12-2007 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:  \n \nTítulo del proyecto: REIMDOC: Recuperación e integración multilingüe de documentos jurídicos (FIT-340100-2004-22) \nEntidad financiadora: Ministerio de Industria, Comercio y Turismo.  \nEntidades participantes: Atos Origin, Universidad Politécnica de Madrid, Universidad de Zaragoza, Derecho.com \nDuración, desde: 01-01-2004 \nhasta: 31-12-2005 \nInvestigador responsable:  \nNúmero de investigadores participantes:  \n \nTítulo del proyecto: Descubrimiento dinámico de servicios en WebODE (HF-2002-0013) \nEntidad financiadora: Ministerio de Ciencia y Tecnología. Secretaría de Estado de Política Científica y Tecnológica. \nSubdirección General de Formación y Movilidad del Personal Investigador \nEntidades participantes: UPM y Universidad Blaise-Pascal, Clermont-Ferrant \nDuración, desde: 22-04-2003 \nhasta: 22-04-2005 \nInvestigador responsable: Asunción Gómez-Pérez, Farouk Toumani \nNúmero de investigadores participantes: 9 \n \nTítulo del proyecto: Preparación de propuesta proyecto europeo KEMIME (TIC2002-12333-E) \nEntidad financiadora: Cicyt \nEntidades participantes: UPM \nDuración, desde: 01-04-2004 \nhasta: 31-12-2004 \nInvestigador responsable: Asunción Gómez-Pérez \nNúmero de investigadores participantes: 2 \n \nTítulo del proyecto: Complemento de proyecto europeo Esperonto Services (TIC2002-12353-E) \n",
  "speaker": "SYSTEM",
  "uuid": "c4f8ea77-1c88-4988-8c8b-c0a7f1423b05"
}