{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 9\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13917\neuropeas e internacionales, publicaciones conjuntas con investigadores extranjeros, \norganización de seminarios internacionales, o cualquier otro criterio que se determine al \nrespecto.\nArtículo 11.  Supervisión y seguimiento del doctorando.\n1.  Los doctorandos admitidos en un programa de doctorado se matricularán \nanualmente en la universidad correspondiente, en su Escuela de Doctorado o en la unidad \nresponsable del programa por el concepto de tutela académica del doctorado. Cuando se \ntrate de programas conjuntos, el convenio determinará la forma en que deberá llevarse a \ncabo dicha matrícula.\n2.  Las personas incorporadas a un programa de doctorado se someterán al régimen \njurídico, en su caso contractual, que resulte de la legislación específica que les sea de \naplicación.\n3.  Una vez admitido al programa de doctorado, a cada doctorando le será asignado \npor parte de la correspondiente comisión académica un tutor, doctor con acreditada \nexperiencia investigadora, ligado a la unidad o a la Escuela que organiza el programa, a \nquien corresponderá velar por la interacción del doctorando con la comisión académica.\nLa comisión académica, oído el doctorando, podrá modificar el nombramiento del tutor \nde un doctorando en cualquier momento del periodo de realización del doctorado, siempre \nque concurran razones justificadas.\n4.  En el plazo máximo de seis meses desde su matriculación, la comisión académica \nresponsable del programa asignará a cada doctorando un director de tesis doctoral que \npodrá ser coincidente o no con el tutor a que se refiere el apartado anterior. Dicha asignación \npodrá recaer sobre cualquier doctor español o extranjero, con experiencia acreditada \ninvestigadora, con independencia de la universidad, centro o institución en que preste sus \nservicios.\nLa comisión académica, oído el doctorando, podrá modificar el nombramiento de \ndirector de tesis doctoral a un doctorando en cualquier momento del periodo de realización \ndel doctorado, siempre que concurran razones justificadas.\n5.  Una vez matriculado en el programa, se materializará para cada doctorando el \ndocumento de actividades personalizado a efectos del registro individualizado de control a \nque se refiere el artículo 2.5 de este real decreto. En él se inscribirán todas las actividades \nde interés para el desarrollo del doctorando según regule la universidad, la escuela o la \npropia comisión académica y será regularmente revisado por el tutor y el director de tesis \ny evaluado por la comisión académica responsable del programa de doctorado a que se \nrefiere el artículo 8.3.\n6.  Antes de la finalización del primer año el doctorando elaborará un Plan de \ninvestigación que incluirá al menos la metodología a utilizar y los objetivos a alcanzar, así \ncomo los medios y la planificación temporal para lograrlo. Dicho Plan se podrá mejorar y \ndetallar a lo largo de su estancia en el programa y debe estar avalado por el tutor y el \ndirector.\n7.  Anualmente la comisión académica del programa evaluará el Plan de investigación \ny el documento de actividades junto con los informes que a tal efecto deberán emitir el \ntutor y el director. La evaluación positiva será requisito indispensable para continuar en el \nprograma. En caso de evaluación negativa, que será debidamente motivada, el doctorando \ndeberá ser de nuevo evaluado en el plazo de seis meses, a cuyo efecto elaborará un \nnuevo Plan de investigación. En el supuesto de producirse nueva evaluación negativa, el \ndoctorando causará baja definitiva en el programa.\n8.  Las universidades establecerán las funciones de supervisión de los doctorandos \nmediante un compromiso documental firmado por la universidad, el doctorando, su tutor y \nsu director en la forma que se establezca. Este compromiso será rubricado a la mayor \nbrevedad posible después de la admisión y habrá de incluir un procedimiento de resolución \nde conflictos y contemplar los aspectos relativos a los derechos de propiedad intelectual o \nindustrial que puedan generarse en el ámbito de programas de doctorado.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "c5360ee6-d6da-440a-b1e4-21e352f8eaec"
}