{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 2\n2\nGraeme Hirst\nthe writers of dictionary deﬁnitions try to do, is not possible (see also sections 1.2.3\nand 1.3.1 below).\nOn the other hand, morphological variants of a word, such as plurals of nouns\nand inﬂected forms of verbs might scarcely warrant their own complete lexical entry.\nRather, the entry for such forms might be little more than a pointer to that for the\nbase form of the word. For example, the entries for takes, taking, took, and taken\nmight just note that they are inﬂected forms of the base-form verb take, and point\nto that entry for other details; and conversely, the entry for take will point to the\ninﬂected forms. Similarly, ﬂaps will be connected both to the noun ﬂap as its plural\nand to the verb ﬂap as its third-person singular. The sharing of information between\nentries is discussed further in section 1.2.2 below.\nA lexicon may be just a simple list of entries, or a more-complex structure may\nbe imposed upon it. For example, a lexicon may be organized hierarchically, with\ndefault inheritance of linguistic properties (see section 1.2.2 below). However, the\nstructures that will be of primary interest in this chapter are semantic, rather than\nmorphological or syntactic; they will be discussed in section 1.3.2 below.\n1.1.2 Computational lexicons\nAn ordinary dictionary is an example of a lexicon. However, a dictionary is intended\nfor use by humans, and its style and format are unsuitable for computational use in a\ntext or natural language processing system without substantial revision. A particular\nproblem is the dictionary’s explications of the senses of each word in the form of\ndeﬁnitions that are themselves written in natural language; computational applica-\ntions that use word meanings usually require a more-formal representation of the\nknowledge. Nonetheless, a dictionary in a machine-readable format can serve as the\nbasis for a computational lexicon, as in the ACQUILEX project (Briscoe, de Paiva,\nand Copestake 1993)—and it can also serve as the basis for a semantic hierarchy\n(see section 1.5.2 below). (An alternative or complementary source of lexical infor-\nmation is inference from the usage observed in text corpora; see, e.g., Boguraev and\nPustejovsky (1996).)\nPerhaps the best-known and most widely used computational lexicon of English\nis WordNet (Fellbaum 1998). The primary emphasis of WordNet is on semantic re-\nlationships between words; it contains little syntactic and morphological data and no\nphonetic data. The basic lexical entry in WordNet is the synset (for “synonym set”),\nwhich groups together identical word senses. For example, the synonymous nouns\nboarder, lodger, and roomer are grouped together in a synset. WordNet includes an\nextensive network of relationships between synsets; this will be discussed in detail\nin section 1.3.2. Following the success of WordNet for English, wordnets with a\nsimilar (but not necessarily identical) structure have been (or are being) developed\nfor a number of other languages, including several European languages (some as\npart of the EuroWordNet project (Vossen 1998)), Hindi, Tamil, and Basque (see\nwww.globalwordnet.org).\nSome other important general-purposelexicons include CELEX (Baayen, Piepen-\nbrock, and van Rijn 1993), which is a set of large, detailed lexicons of Dutch, Ger-\n",
  "speaker": "SYSTEM",
  "uuid": "c61f0997-fead-4763-9486-120f4a3aa18e"
}