{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 88\nBÚSQUEDA \n \n88 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n \nTEMA 5. Búsqueda de una \nsolución óptima \n \n5.1. Estrategias no informadas para la \nbúsqueda de una solución óptima. \nComenzamos planteando el problema a resolver. Este tipo de estrategias aparece \ncuando en el sistema de producción el disparo de las reglas tiene asociado un coste, \nque, en lo que sigue, será un número (real o natural) estrictamente mayor que cero. \nEsta condición es equivale a que en el espacio de estados cada arista tenga \nasociado como peso un coste numérico mayor que cero. Llamaremos coste de un \ncamino en el espacio de estados a la suma de los costes de las aristas que lo \nconstituyen. Como es habitual, la longitud de un camino es su número de aristas. Si \nel coste de cada arista es 1, coste y longitud coinciden. Este es el caso en sistemas \nde producción para los que ninguna noción de coste es adecuada, pero para los que \nqueramos aplicar las estrategias de búsqueda de una solución óptima. \nEl problema consiste pues en encontrar una solución óptima, es decir un camino \nsolución cuyo coste sea mínimo entre los de los caminos solución. A un tal camino, \nse le denomina camino solución óptimo y a su coste, coste óptimo. \nPor ejemplo, en el problema del tren introducido en el apartado 4.1 podríamos estar \ninteresados no sólo en encontrar un trayecto entre la ciudad de partida y la de \nllegada, sino en encontrar uno de duración mínima. En ese caso el peso de cada \narista debería ser la duración del viaje. Si estuviésemos interesados en minimizar el \nnúmero de kilómetros, entonces deberíamos disponer para cada arista del número \nde kilómetros. Por último, si nos interesase tan solo encontrar el trayecto con el \nmínimo número de trasbordos, daríamos a cada arista el peso 1. \nUna primera estrategia para resolver el problema planteado consiste en mantener la \nlista de ABIERTOS ordenada, pero en lugar de hacerlo respecto a los valores \nheurísticos como sucedía en \"primero el mejor\", se ordena respecto al coste de los \ncaminos definidos por los nodos (apoyándonos en la información relativa al padre). \n",
  "speaker": "SYSTEM",
  "uuid": "c6e931db-8970-4fbd-9547-3a334fa39dbf"
}