{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 47\nBÚSQUEDA \n \n47 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nque en el caso de los grafos dirigidos acíclicos. Por todo lo anterior, vemos que este \nalgoritmo sólo es recomendable en el caso de que el espacio de estados sea un \nárbol. Por eso, lo denominaremos búsqueda en anchura en árbol, aunque ya hemos \nvisto que puede funcionar correctamente (es decir, encontrar una solución) en casos \nmás generales. Independientemente de estas consideraciones, podemos afirmar \nque la búsqueda en anchura es demasiado ineficaz como para ser aplicada en \ncasos prácticos reales. \nEjercicio. Como ejemplo de que en un espacio de estado infinito si existe una \nsolución la búsqueda en anchura la encuentra, descríbase el árbol de búsqueda en \nanchura del sistema de reescritura presentado en el apartado 2.5, donde el estado \ninicial es ABAB y son estados objetivo aquellas cadenas en las que no aparece A. \nPara estudiar la implementación  en Common Lisp de la búsqueda en anchura en \nárbol vamos a presentar dos apartados. En el primero, se explica como trabajar con \nvariables locales y como realizar iteraciones (el algoritmo de 3.1 puede ser \nfácilmente trasformado utilizando como auxiliar un algoritmo recursivo, pero razones \nde eficiencia desaconsejan esa trasformación) en Common Lisp, así como ciertas \nprimitivas auxiliares que serán empleadas en la implementación. En el siguiente, \naparece el texto de un fichero evaluable Common Lisp con el esquema del programa \nde busqueda en profundidad y ciertos ejemplos de funcionamiento. Para favorecer la \nportabilidad del fichero, los comentarios han sido escritos sin acentos y sin los \ncaracteres especiales del castellano (ñ, …). \n \n3.3. Más sobre Common Lisp: variables \nlocales, iteración, miscelánea. \nImaginemos que queremos intercambiar los valores (globales) de dos símbolos x e \ny.  \n \n> (setq x 8) \n ===> \n8 \n \n> (setq y 5) \n ===> \n5 \nPodríamos hacerlo utilizando una variable global tmp con la siguiente secuencia de \ninstrucciones: \n",
  "speaker": "SYSTEM",
  "uuid": "c7133bf0-8214-46a5-a40d-a13e2047a582"
}