{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 32\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11181\nLa comprobación formal para la liquidación de la subvención se realizará de modo \nexhaustivo sobre las cuentas justificativas presentadas. Las facturas o documentos de \nvalor probatorio análogo que sustenten dichos informes serán objeto de comprobación en \nlos cuatro años siguientes sobre la base de una muestra representativa, a cuyo fin el \nórgano instructor podrá requerir a los beneficiarios la remisión de los justificantes que \ncompongan dicha muestra, así como realizar los controles recogidos en cada uno de los \nplanes anuales de actuación mencionados en el artículo 85 de la Ley General de \nSubvenciones.\nEn caso de extinción o de rescisión de la ayuda para la que se hubiese concedido \nfinanciación, los fondos no invertidos deberán ser reintegrados al Tesoro Público.\nArtículo 64.  Seguimiento y control.\n1.  El seguimiento científico-tecnológico del trabajo realizado por el personal \ninvestigador en formación corresponde al órgano concedente, que establecerá los \nprocedimientos adecuados para ello y que podrá designar los órganos, comisiones o \nexpertos que estime necesarios para realizar las oportunas actuaciones de seguimiento y \ncomprobación de la aplicación de la ayuda y recabar la presentación de la información \ncomplementaria que considere oportuna.\n2.  Para la realización del mencionado seguimiento el personal investigador en \nformación deberá presentar al órgano concedente:\na)  En el plazo de diez días hábiles desde la fecha en que hayan finalizado la fase de \nbeca, un informe, con una extensión aproximada de 1000 palabras, con las actividades \nrealizadas y sus resultados durante este periodo, el grado de cumplimiento del plan de \ntrabajo propuesto y el plan de trabajo previsto para la etapa de contrato. Se deberá hacer \nuna referencia específica a la situación y evolución de la tesis doctoral y a la realización de \nlos cursos de doctorado.\nSe incluirá asimismo un informe del Tutor, en el que se explique con claridad y precisión \nel grado de aprovechamiento del doctorando y el desarrollo de los trabajos realizados.\nb)  En el plazo de un mes desde la fecha de finalización de la ayuda, una memoria de 2000 \npalabras como máximo, que contemple la totalidad del trabajo realizado y sus resultados, \nhaciendo especial referencia a los resultados de la tesis doctoral y a los objetivos logrados con el \nprograma de formación. A la memoria se acompañará necesariamente un informe del Tutor.\n3.  La evaluación del informe de seguimiento de los primeros 24 meses corresponderá \na una Comisión formada por expertos creada en el seno de la Dirección General del INIA \nque podrá determinar la continuidad en la ayuda.\n4.  En las publicaciones y otros resultados a los que pueda dar lugar las investigaciones \nrealizadas al amparo de este subprograma deberá hacerse referencia a la financiación con \ncargo al Subprograma de Formación de Personal Investigador en agroalimentación en los \ncentros de investigación INIA-CCAA para promover la formación en investigación \nagroalimentaria y, en su caso, por el Fondo Social Europeo.\n5.  Los beneficiarios de ayudas estarán sujetos a las actuaciones de control que lleven \na cabo las instituciones facultadas para ello por la Ley General de Subvenciones y, en su \ncaso, por la normativa comunitaria de los Fondos Estructurales.\nArtículo 65.  Renuncias e incorporación de reservas.\n1.  Las renuncias del personal investigador en formación a las ayudas objeto de esta \nresolución deberán ser comunicadas al Centro de I+D al que están adscritos, y éste a su \nvez dará traslado de este hecho al órgano concedente.\n2.  Las comunicaciones de renuncias de ayudas objeto de esta resolución, recibidas \ndentro de los cuatro meses siguientes a partir de la fecha de publicación en la web del INIA \nde la resolución de concesión, podrán dar lugar a la sustitución por alguno de los candidatos \nde la lista de reserva, siempre que las disponibilidades presupuestarias lo permitan, de \nacuerdo al procedimiento siguiente:\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "c7339c75-60ff-4b70-868b-0c7466bcfb82"
}