{
  "message": "SYSTEM: 2_Ontolog%C3%ADas-long.pdf: Página 46\n©Asunción Gómez-Pérez\n11/10/2007 11:08 - 46\nLinguistic Ontologies\n•WordNet (http://www.hum.uva.nl/~ewn/gwa.htm)\n•EuroWordNet (http://www.hum.uva.nl/~ewn/)\n•The Generalized Upper Model \n(http://www.darmstadt.gmd.de/publish/komet/gen-um/newUM.html)\n•The Mikrokosmos ontology (http://crl.nmsu.edu/mikro [user and password are required])\n•SENSUS (http://www.isi.edu/natural-language/projects/ONTOLOGIES.html)\nBateman JA, Fabris G, Magnini B (1995) The Generalized Upper Model Knowledge Base: Organization \nand Use. In: Mars N (ed) Second International Conference on Building and Sharing of Very Large-Scale \nKnowledge Bases (KBKS '95). University of Twente, Enschede, The Netherlands. IOS Press, \nAmsterdam, The Netherlands, pp 60–72\nSwartout B, Ramesh P, Knight K, Russ T (1997) Toward Distributed Use of Large-Scale Ontologies. In: \nFarquhar A, Gruninger M, Gómez-Pérez A, Uschold M, van der Vet P (eds) AAAI’97 Spring Symposium \non Ontological Engineering. Stanford University, California, pp 138–148\n•Miller GA (1995) WordNet: a lexical database for English. Communications of the ACM 38(11):39–41\n•Miller GA, Beckwith R, Fellbaum C, Gross D, Miller K (1990) Introduction to WordNet: An on-line lexical database. International Journal of Lexicography 3(4):235–244\n•Vossen P (ed) (1999) EuroWordNet General Document. Version 3. http://www.hum.uva.nl/ewn/\n•Vossen P (ed) (1998) EuroWordNet: A Multilingual Database with Lexical Semantic Networks. Kluwer \nAcademic Publishers, Dordrecht, The Netherlands\n•Mahesh K (1996) Ontology development for machine translation: Ideology and Methodology. Technical \nReport MCCS-96-292. Computing Research Laboratory, New Mexico State University, Las Cruces, New \nMexico. http://citeseer.nj.nec.com/mahesh96ontology.html\n•Mahesh K, Nirenburg S (1995) Semantic classification for practical natural language processing. In: \nSchwartz RP, Kwasnik BH, Beghtol C, Smith PJ, Jacob E (eds) 6th ASIS SIG/CR Classification Research \nWorkshop: An Interdisciplinary Meeting. Chicago, Illinois, pp 79–94\n",
  "speaker": "SYSTEM",
  "uuid": "c73b3e95-aac3-4788-b698-fe98f231d80c"
}