{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 68\n66\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Tools to review and post‐edit translations\nSeveral vendors, including dotSub, Amara, and Viki specialize in video captioning and subtitling. dotSub and\nAmara provide tools that enable video content producers to generate captions using a combination of\ncrowdsourced translations, and optional professional translators. Viki, meanwhile, is a purely crowd based\nsystem, and has created a vibrant translation community (several million active users) around captioning\nvideo programs from around the world. \nInterpretation systems\nInterpretation systems and services enable users to have telephone calls translated in real time, using either\nsequential or simultaneous interpretation (simultaneous interpretation enables both parties to converse\nnaturally without pausing for an interpreter to repeat what they said). Like video captioning, this is also a\nspecialist market, with a different set of dominant vendors compared to other sectors of the translation\nindustry. \nThese services are typically accessed via a telephone or voice over IP (VoIP) call to the interpretation service\nwhich, in turn, bridges on or more interpreters onto the call. \nThe leading providers in this category include: Language Services Associates, Language Line.\nBusiness models\nLicensed\nUntil recently, most translation tools were sold as licensed software, typically priced per user/seat. This is\nhow most enterprise software was sold prior to the transition to cloud/SaaS based services. Even now, many\nenterprise software vendors sell their software this way. Cloud based offerings will, however, force many\nvendors to rethink their pricing model because these offerings enable customers to scale their tools budget\nup and down in response to usage, and to avoid committing to expensive upfront purchases. \nCloud/SaaS\nCloud based (SaaS) offerings are becoming more common in the translation industry, and are the over‐\nwhelming favourite among new companies. These services are typically priced as monthly subscriptions,\nwith the fee based on any number of factors including:\n• Number of registered or active users\n• Number of target languages supported\n• Number of projects or assets stored on system\n• Number of words hosted on the system\n• Translation volume per month\nIn all cases, customers are largely able to avoid up front commitments, and can also evaluate a product at\nrelatively low cost and risk prior to scaling up to production use. Vendors that fail to offer a viable SaaS\noption will risk losing market share to emerging companies and services that do.\nTranslation services\nAnother business model employed by some tools and platforms is a bundling strategy, where the software\nor platform is offered for free, while the vendor charges for professional translations brokered through their\nsystem. Cloudwords, for example, operates a hosted marketplace and translation/project management serv‐\n",
  "speaker": "SYSTEM",
  "uuid": "c8a25ff4-16e3-4cb4-ae4e-5c1f0e64adfe"
}