{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 25\n23\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nto operate in the local market and develop local linguistic talent and resources. Moreover, translation tech‐\nnology development has historically been a European strength.\nEurope’s share of the worldwide market will increase slightly to 38% over the five year period, compared to\n42% in the Americas. However due to the imbalance between LT segments, that share is significantly lower\n(24% in 2015) for the software portion of the market; as we have noted, sales of technology‐supported\nhuman translation services far outweigh sales of translation software, and will continue to do so during the\nforecast period. The strength of the European market for translation reflects both the depth and excellence\nof the industry in Europe, and the need for translation into the many languages of Europe on a large scale.\nLarge‐scale multilinguality, in turn, is an inhibitor for growth in both the speech and content markets, where\nproducts and applications must be deployable in local languages.\nFactors that could change the assumptions behind the market model:\n• Faster and more extensive deployment of content applications in more European languages, in a coher‐\nent framework for all languages\n• Development – and integration – of speech components (for recognition, generation, and identifica‐\ntion/verification) in more European languages, affordably available for European app and solution\ndevelopers\n• Large‐scale deployment of open source machine translation in open environments using shared\nresources\n• Large‐scale sharing of resources (paid and free) throughout the European industry\n• Development of vertical and industry‐specific platforms for LT development and deployment, engaging\nwhole industries in cooperative initiatives (analogous to SWIFT in banking)\nFigure 9: European Language Technology  Market\nEuropean Language Technology Market 2011‐2015 (€B)\n",
  "speaker": "SYSTEM",
  "uuid": "c948ea90-85d7-4fa9-ac75-274e3f0bc383"
}