{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 29\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 29 de 42 \n43. Gómez-Pérez A, Matínez-Romero M, Rodríguez-González A, Vázquez G, Vázquez-\nNaya JM. Ontologies in Medicinal Chemistry: Current Status and Future Challenges \n2013. Current Topics in Medicinal Chemistry. Vol. 13 (5), pp: 576-590. Bentham \nScience Publishers. Marzo 2013. \n44. Gómez-Pérez A, Vila-Suero D, Montiel-Ponsoda E, Gracia J, Aguado-de-Cea G. \nGuidelines for multilingual linked data. 3rd International Conference on Web \nIntelligence, Mining and Semantics (WIMS’13), Madrid, Spain, June 2013, ISBN 978-1-\n4503-1850-1. \n45. Gracia J, Asooja K. Monolingual and Cross-lingual Ontology Matching with CIDER-CL: \nEvaluation Report for OAEI 2013. 8rd Ontology Matching Workshop (OM'13), at 12th \nInternational Semantic Web Conference (ISWC'13), Sidney (Australia). CEUR-WS \n1111. ISSN-1613-0073. \n46. Holl S, Garijo D, Belhajjame K, Zimmermann O, De Giovanni R, Obst M, Goble C. On \nspecifying and sharing scientific workflow optimization results using research objects. In \nProceedings of the 8th Workshop on Workflows in Support of Large-Scale Science, \npage 28-37, Denver, USA, 2013. ACM. \n47. Jiménez A, Suárez-Figueroa MC, Mateos A, Gómez-Pérez A, Fernández-López M. A \nMaut approach for Reusing Domain Ontologies on the Basis of the NeOn Methodology. \nInternatinal Journal of Information Technology & Decision Making (IJITDM). Vol 12 (5), \npp: 945-968. World Scientific Publishing Company. 2013 \n48. Keet CM, Suárez-Figueroa MC, Poveda-Villalón M. The Current Landscape of Pitfalls in \nOntologies. Accepted as short paper at 5th International Conference on Knowledge \nEngineering and Ontology Development (KEOD2013). Vilamoura, Algarve, Portugal, 19 \n- 22 September 2013. \n49. Lebo T, Sahoo S, McGuinness D, Belhajjame K, Cheney J, Corsar O, Garijo D, Soiland-\nReyes S, Zednik S, Zhao J. Prov-o: The prov ontology. 2013/3. W3C Recommendation, \n30th April \n50. Martín-Recuerda F, Walther D. Towards Fast Atomic Decomposition using Axiom \nDependency Hypergraphs. WoMO 2013 (CEUR Workshop Proceedings). Volume 1081. \nPages 61-72. \n51. Mihindukulasooriya N, García-Castro R, Esteban-Gutiérrez M. Linked Data Platform as \na novel approach for Enterprise Application Integration. 4th International Workshop on \nConsuming Linked Data (COLD2013). CEUR, Vol. 1034, ISSN: 1613-0073. Sydney, \nAustralia. 22 octubre 2013. \n52. Montes J, Sánchez A, Memishi B, Pérez MS, Antoniu G. GMonE: a complete approach \nto cloud monitoring. Future Generation Computer Systems 29(8), 2026–2040. 2013. \n53. Montiel-Ponsoda E, Mccrae J, Aguado-De-Cea G, Gracia J. Multilingual Variation in the \ncontext of Linked Data. 10th International Conference on Terminology and Artificial \nIntelligence (TIA'13), Paris (France), October 2013, ISBN: 978-2-9174-9025-9. Pp: 19-\n26. \n54. Mora J, Corcho O. Engineering optimisations in query rewriting for OBDA. In \nProceedings of the 9th International Conference on Semantic Systems (I-SEMANTICS \n’13) (pp. 41–48). Graz, Austria: ACM. 2013. \n55. Mora J, Corcho O. Towards a systematic benchmarking of ontology-based query \nrewriting systems. In The 12th International Semantic Web Conference (ISWC2013) \n(pp. 369–384). Sydney, Australia. 2013. \n56. Muñoz O-García, García-Silva, A, Corcho O. Towards Concept Identification using a \nKnowledge-Intensive Approach. Making Sense of Microposts (#MSM2013). Rio de \nJaneiro, Brazil. 2013 \n57. Pérez IS, Garijo D, Corcho O. Science, Semantic Web and Execuses. Sepublica 2013, \n2013. \n58. Pérez-Hernández MS, Brinkmann A, Anastasiadis SV, Fiore S, Lebre A, Magoutis K. \nTopic 5: Parallel and Distributed Data Management - (Introduction). European \nConference on Parallel Processing (Euro-par) 2013. Lecture Notes in Computer \nScience, 215. Aachen, Germany, August 2013. \n59. Pinzón, de Paz, Herrero, Corchado, Bajo, Corchado. Idmas-Sql: Intrusion Detection \nBased on Mas to Detect And Block Sql Injection Through Data Mining. Information \nSciences. ISSN 0020-0255. 2013. \n60. Poveda-Villalón M, Vatant B, Suárez-Figueroa MC, Gómez-Pérez A. Detecting Good \nPractices and Pitfalls when Publishing Vocabularies on the Web. WOP 2013 – \n",
  "speaker": "SYSTEM",
  "uuid": "caedcd98-d76b-4291-97cb-34d0e8cf396a"
}