{
  "message": "SYSTEM: Ejercicios.pdf: Página 6\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n6 \n \nEjercicio 3: Retenciones de Hacienda \n \nSe desea construir un SBM para el Ministerio de Hacienda. En el, los contribuyentes se \nencuentran clasificados por el porcentaje de retención (%Retención). Las únicas consultad \npermitidas a los inspectores son las relacionadas con el sueldo bruto (Sueldo-Bruto), sueldo \nneto (Sueldo-Neto) y la retención (Retención) de los contribuyentes. Además, se sabe que \nestas cuatro variables se relacionan según las fórmulas. \n \n \nSueldo-Bruto = Sueldo-Neto + Retención \n \n(1) \n \n \nSueldo-Neto = Sueldo-Bruto * (1-%Retención)  \n(2) \n \n \nRetención = Sueldo-Bruto* %Retención  \n \n(3) \n \nSe pide: \n \nA) Construir una jerarquía de marcos con un marco instanciado. \n \nB) Especificar completamente cada marco clase. \n \nC) Supóngase un individua llamado  Pepe, con NIF 1.234.567, al cual se la aplica \nuna retención del 15%. \n \nC.1) ¿Qué técnica de inferencia  debe utilizar el SBM para introducir esta \nentidad en el SBM? \n \nC.2) ¿Qué respondería el SBM al preguntar por el porcentaje de retención que \nse aplica a Pepe?, ¿Qué técnicas de inferencia utilizaría para responder a esta \npregunta? \n \nC.3) ¿Qué respondería el SBN al preguntar  por el Sueldo-Bruto de Pepe?, \n¿Qué técnicas de inferencia se utilizarían para responder a ala pregunta?, \n¿Qué procedimientos y en qué orden se ejecutarían? \n \nC.4) Ídem pero preguntando por el Sueldo-Neto de Pepe. \n \nC.5) Ídem pero preguntando por el Sueldo-Neto de Juan. \n \nC.6) Si el marco instanciado que representa a Juan estuviera unido por una \nrelación Instancia con el marco clase Contribuyente-15% ¿Cuáles serían las \ntécnicas de inferencia que permiten calcular el Sueldo-Neto de Juan y en qué \norden se aplicarían éstas?. \n \n",
  "speaker": "SYSTEM",
  "uuid": "cc114600-d6ec-4afa-a65a-a2cad78567a4"
}