{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 7\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n2. No pagar con la tarjeta OTT: \n- Gastos personales \n- Gastos cuyo anticipo se hubiera solicitado \n- Peajes de autopistas \n- Comidas en restaurantes \n- Taxis, salvo que éstos superen los 50 euros y se tenga permiso para cogerlo \n- Tickets de metro y autobús \n- Gastos inferiores a 10€ \n \n3. Es muy importante que las facturas vayan a nombre de la persona a la que se haya autorizado el \ngasto en la hoja previaje. En el caso de que un único miembro pague gastos “comunes” de dos o más \nmiembros con la tarjeta OTT, se solicitarán facturas individuales de forma que, en la factura de cada \nuno de ellos figuren su nombre y apellidos. \n \nB4. En todos los casos  \n1. Los miembros del OEG se comprometen a entregar al equipo de gestión sus hojas previaje con 15 \ndías de antelación (independientemente de que se solicite anticipo); así como sus declaraciones de \ngastos debidamente cumplimentadas (conforme a las instrucciones aquí reflejadas y las que se \npudieran recoger en la propia hoja de viaje), junto con la  documentación  que acredite dichos gastos, \nen el plazo máximo de 7 días naturales, desde la finalización del viaje. Se exceptuarán de este plazo, \nlos casos en que un miembro deba realizar dos viajes seguidos, es decir, dos viajes sin acudir a la \nUPM entre uno y otro. \n \n2. Igualmente los miembros se comprometen a cumplir, en la medida de lo posible, las medidas de \nracionalización del gasto. \n \n3. Durante el viaje los miembros deberán conservar todos los tickets, facturas, billetes, tarjetas de \nembarque... que documenten gastos que deseen justificar. Por lo que se refiere a los gastos de \nmanutención, se pagará en todos los casos el total del importe justificado mediante facturas. Estos \ngastos deberán reflejarse en la hoja posviaje en forma de múltiplos de dietas, de forma que habrá que \ncalcular el total de gastos por ese concepto, y aproximarlo a dietas medias o enteras. \n \n",
  "speaker": "SYSTEM",
  "uuid": "cc261f0d-99b0-4bb6-afed-1cc3161ca36a"
}