{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 7\n \n \nPág. 9 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nFORTALEZAS \nDEBILIDADES \na la innovación y al desarrollo. \n \nPotencialidad de la reutilización de la \ninformación del  Sector Público (RISP)  \ncomo recursos lingüísticos muy valiosos \npara la industria y la investigación. \n \nEste diagnóstico se podría resumir en las siguientes ideas clave: \n• \nEl sector de las tecnologías del lenguaje representa un sector emergente \ntransversal vinculado a la innovación con capacidad para promover el crecimiento, \nla competitividad y el empleo de calidad. \n• \nSu desarrollo es imparable, pero si no aprovechamos la oportunidad, serán otros \nlos que ocupen este espacio.  \n• \nEspaña tiene los medios, pero es necesario impulsar y coordinar las actuaciones \ndesde la Administración General del Estado, en coordinación con las \nComunidades Autónomas y en colaboración con Iberoamérica y la Unión \nEuropea, para aprovechar la oportunidad. \nEn consecuencia, el objetivo general del Plan de Impulso de las Tecnologías del Lenguaje es \nfomentar el desarrollo del procesamiento del lenguaje natural y la traducción automática en \nlengua española y lenguas cooficiales por medio de los siguientes objetivos específicos: \n1. \nAumentar el número, calidad y disponibilidad de las infraestructuras lingüísticas en \nespañol y lenguas cooficiales. \n2. \nImpulsar la Industria del lenguaje fomentando la transferencia de conocimiento \nentre el sector investigador y la industria. Ayudar a la internacionalización de las \nempresas e instituciones que componen el sector. Mejorar la difusión de los \nproyectos actuales. \n3. \nMejorar la calidad y capacidad del servicio público incorporando las tecnologías de \nprocesamiento de lenguaje natural y de la traducción automática, actuando, \nademás, como tractor de la demanda. Apoyar la generación, estandarización y \ndifusión de recursos lingüísticos creados en el contexto de la actividad de gestión \npública propia de la Administración. \nEl Plan pretende que el impulso a las tecnologías del lenguaje se realice de forma coordinada, \nbuscando sinergias y evitando duplicidad de esfuerzos, conforme a las recomendaciones de la \nComisión para la Reforma de las Administraciones Públicas (CORA). \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "cc71383d-077d-4469-b26e-2e7016d04c7a"
}