{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 15\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n15\n2. Bloehdorn, S., Petridis, K., Saatho\u001b, C., Simou, N., Tzouvaras, V., Avrithis, Y.,\nHandschuh, S., Kompatsiaris, Y., Staab, S., Strintzis, M.: Semantic annotation of\nimages and videos for multimedia analysis. In: Proceedings of the 2nd European\nSemantic Web Conference (ESWC 2005). LNCS, vol. 3532, pp. 592\u0015607. Springer\n(2005)\n3. Buil Aranda, C., Corcho, O.: Federating Queries to RDF repositories. Tech. rep.,\nOntology Engineering Group. Computer Science Department. Universidad Politéc-\nnica de Madrid. (2010), http://oa.upm.es/3302/\n4. Chakravarthy, A., Ciravegna, F., Lanfranchi, V.: Cross-media document annota-\ntion and enrichment. In: Proceedings of the 1st Semantic Web Authoring and\nAnnotation Workshop (SAAW2006), co-located with 5th International Semantic\nWeb Conference (ISWC2006) (2006)\n5. Chin, J.P., Diehl, V.A., Norman, K.L.: Development of an instrument measuring\nuser satisfaction of the human-computer interface. In: Soloway, E., Frye, D., Shep-\npard, S.B. (eds.) Interface Evaluations. Proceedings of ACM CHI'88 Conference\non Human Factors in Computing Systems. pp. 213\u0015218 (1988), june 15-19, 1988.\nWashington, DC, USA\n6. Óscar Corcho., Alper, P., Kotsiopoulos, I., Missier, P., Bechhofer, S., Goble, C.: An\nOverview of S-OGSA: A Reference Semantic Grid Architecture. Journal of Web\nSemantics. Science, Services and Agents on the World Wide Web. 4(2), 102\u0015115\n(2006)\n7. Efron, B., Tibshirani, R.: Bootstrap methods for standard errors, con\u001cdence inter-\nvals, and other measures of statistical accuracy. Statistical Science 1 (1) Publised by\nInstitute of Mathematical Statistics (Feb 1986), http://www.jstor.org/stable/\n2245500\n8. Esteban-Gutiérrez, M., Kojima, I., Pahlevi, S., Corcho, O., Gómez-Pérez, A.: Ac-\ncessing RDF (S) Data Resources in Service-Based Grid Infrastructures. Concur-\nrency and Computation: Practice & Experience 21(8), 1029\u00151051 (2009)\n9. Hartig, O.: Provenance Information in the Web of Data. In: Bizer, C., Heath, T.,\nBerners-Lee, T., Idehen, K. (eds.) Proceedings of the 2nd Workshop on Linked\nData on the Web (LDOW2009). vol. 538. CEUR-WS (2009), http://ceur-ws.\norg/Vol-538/ldow2009_paper18.pdf\n10. Lynden, S., Mukherjee, A., Hume, A., Fernandes, A., Paton, N., Sakellariou, R.,\nWatson, P.: The Design and Implementation of OGSA-DQP: A Service-Based Dis-\ntributed Query Processor. Future Generation Computer Systems 25(3), 224\u0015236\n(2009)\n11. Perlman, G.: Web-based user interface evaluation with questionnaires, http://\noldwww.acm.org/perlman/question.html\n12. Perlman, G.: Practical usability evaluation. In: CHI '97: CHI '97 extended abstracts\non Human factors in computing systems. pp. 168\u0015169. ACM, New York, NY, USA\n(1997), los Angeles, USA. April 18-23\n13. Petridis, K., Anastasopoulos, D., Saatho\u001b, C., Timmermann, N., Kompatsiaris, Y.,\nStaab, S.: M-OntoMat-Annotizer: Image Annotation Linking Ontologies and Mul-\ntimedia Low-Level Features. In: Knowledge-Based Intelligent Information and En-\ngineering Systems. Proceedings of the 10th International Conference KES. LNCS,\nvol. 4253, pp. 633\u0015640. Springer (2006)\n14. UPnP Forum: UPnP Device Architecture Version 1.0 (June 2000), http://www.\nupnp.org/\n",
  "speaker": "SYSTEM",
  "uuid": "cc9df3d5-89f5-4fcd-b8f7-8994b1f096b7"
}