{
  "message": "SYSTEM: Cicyt_Asun-19-05-10.pdf: Página 62\n- \nSpecial Issue sobre Software/Knowledge Sharing and Reuse Via Networks para el International Journal of \nSoftware Engineering and Knowledge Engineering. 1999 \n- \nRevisora del número especial sobre “organizational Memory and Knowledge Management” Domingue 2005 \n• \nEditora de: \n- \nProceedings of teh Workshop on Ontologies and Problem Solving Methods: Lessons Learned and Future Trends. \nIJCAI’99 and CEUR. \n- \nProceedings of the Workshop on Ontological Engineering on the Global Information Infrastructure. (EKAW’99) \n- \nProceedings of the Workshop on Applications of Ontologies and Problem Solving Methods (ECAI’98) \n- \nProceedings of the Workshop on Ontological Enginieering. Spring Symposium Series (AAAI’97) \n- \nProceedings of the Workshop on Ontological Engineering. (ECAI’96) \n• \nExaminadora externa tesis Programa de Doctorado: Degree of Doctor in Philosophy. Título: “An Ontology-Based \nApproach to Web Site Design and Development. Autor: Yuangui Lei. Enero de 2005 \n• \nImpartido seminario de la red europea Athens: “Ontology engineering and the Semantic Web”. 17-21 Marzo 2003. 30 \nhoras. \n• \nModeradora de Conferencia Invitada del Dr. Fensel en CAEPIA’99 \n• \nModeradora de Sesión en EKAW99 \n• \nModeradora de la sesión de Ontologías. Workshop on Ontologies and Problem-Solving Methods: Lessons Learnt and \nFuture Trends. IJCAI’99. 31 de Julio a 6 de Agosto. Estocolmo. 1999 \n• \nAdjunta a la coordinación del Área de Transferencia de Tecnología de la Agencia Nacional de Evaluación y \nProspectiva. Secretaría de Estado de Universidades e Investigación. Ministerio de Educación y Ciencia. Desde 1 de \nnoviembre de 2006 hasta 31 de octubre de 2009. \n• \nDirectora del Grupo de Investigación Ontological Engineering Group adscrito al Laboratorio de Inteligencia Artificial de \nla Facultad de Informática de la Universidad Politécnica de Madrid. Desde 14 de junio de 2005. \n• \nAsesora Científica del Laboratorio de Inteligencia Artificial. Facultad de Informática. Universidad Politécnica de Madrid. \nDiciembre 1998-Actualidad. \n• \nDirectora Adjunta del Laboratorio de Inteligencia Artificial. Facultad de Informática. Universidad Politécnica de Madrid. \nMayo 1994 – Diciembre 1998. \n• \nResponsable del Curso “Sistemas Expertos” SYSOFT Computer. 620 horas. Julio 1998 – Febrero 1999 \n• \nMiembro de la Asociación Española para la Inteligencia Artificial. Septiembre 1996. \n• \nMiembro vitalicio de la AAAI nº 37232 desde mayo de 1994 \n• \nMiembro nº 034M0680I de la International Association for Knowledge Engineers (IAKE) desde 1992 \n• \nMiembro de la Asociación de Licenciados en Informática \n• \nMiembro del Laboratorio de Inteligencia Artificial de la Facultad de Informática. Desde Febrero de 1988 \n• \nParticipante seleccionado para la primera olimpiada del Juego del Othello. Paderborn. Alemania. Octubre de 1993 \n• \nTraducción al español del Certification in Knowledge Engineer (CKE) de la International Association of Knowledge \nEngineer. Septiembre 1993 \n• \nRevisora del libro “Inteligencia Artificial: Técnicas y Métodos”. Borrajo, D., Juristo, N., Martínez, V., Pazos, J. Ed. \nCEURA. Julio 1993 \n",
  "speaker": "SYSTEM",
  "uuid": "ccb152a8-da09-4821-939d-51ad372d9c22"
}