{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 16\n`moved his office' to the Naval Postgraduate School in Monterey, California where he taught, supervised\nresearch, and wrote books.\nWhile at Bell Laboratories, he took time to teach in Universities, sometimes locally and sometimes on a full\n\u0019\nsabbatical leave; these activities included visiting professorships at New York University, Princeton\n\u0006\nUniversity (Statistics), City College of New York, Stanford University, 1960-61, Stevens Institute of\n9\nTechnology (Mathematics), and the University of California, Irvine, 1970-71.\n$\nRichard Hamming has received a number of awards which include: Fellow, IEEE, 1968; the ACM Turing\nPrize, 1968; the IEEE Emanuel R. Piore Award, 1979; Member, National Academy of Engineering, 1980;\nand the Harold \n\t\nPender Award, U. Penn., 1981. In 1987 a major IEEE award was named after him, namely\nthe Richard W. Hamming Medal, ``For exceptional contributions to information sciences and systems'';\n\f\nfittingly, he was also the first recipient of this award, 1988. In 1996 in Munich he received the prestigious\n+\n$130,000 \n:\nEduard Rhein Award for Achievement in Technology for his work on error correcting codes. He\nwas both a Founder and Past President of ACM, and a Vice Pres. of the AAAS Mathematics Section.\n\nHe is probably best known for his pioneering work on error-correcting codes, his work on integrating\ndifferential equations, and the spectral window which bears his name. His extensive writing has included a\n \nnumber of important, pioneering, and highly regarded books. These are:\n&\n• \nNumerical Methods for Scientists and Engineers\n;\n, McGraw-Hill, 1962; Second edition 1973;\n<\nReprinted by Dover 1985; Translated into Russian.\n• \nCalculus and the Computer Revolution, Houghton-Mifflin, 1968.\n<\n• \nIntroduction to Applied Numerical Analysis\n7\n, McGraw-Hill, 1971.\n<\n• \nComputers and Society, McGraw-Hill, 1972.\n<\n• \nDigital Filters\n=\n, Prentice-Hall, 1977; Second edition 1983; Third edition 1989; translated into\n<\nseveral European languages.\n\u0006\n• \nCoding and Information Theory, Prentice-Hall, 1980; Second edition 1986.\n<\n• \nMethods of Mathematics Applied to Calculus, Probability and Statistics\n>\n, Prentice-Hall, 1985.\n<\n• \nThe Art of Probability for Scientists and Engineers, Addison-Wesley, 1991.\n<\n• \nThe Art of Doing Science and Engineering: Learning to Learn , Gordon and Breach, 1997.\n<\nHe continued a very active life as Adjunct Professor, teaching and writing in the Mathematics and\nComputer Science Departments at the Naval Postgraduate School, Monterey, California for another twenty-\n\u0012\none years before he retired to become Professor Emeritus in 1997. He was still teaching a course in the fall\n\u000e\nof 1997. He passed away unexpectedly on January 7, 1998.\n\u000e\nACKNOWLEDGEMENT\nI would like to acknowledge the professional efforts of Donna Paradise of the Word Processing Center who\ndid the initial transcription of the talk from the tape recording. She made my job of editing much easier.\n \nThe errors of sentence parsing and punctuation are mine and mine alone. Finally I would like to express my\n$\nsincere appreciation to Richard Hamming and Alan \n\u0006\nChynoweth for all of their help in bringing this\n\u0012\ntranscription to its present readable state.\n\f\nJ. F. Kaiser\n\u0001\n.\n?\n",
  "speaker": "SYSTEM",
  "uuid": "cd12988d-e3b4-4524-a0bb-2437fa10c890"
}