{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 29\n27\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n3. Innovation in the LT Industry\n3.1 An Overview of the European Industry\nLT‐Innovate estimates there are around 500 companies in Europe either actively developing Language\nTechnology, or embedding its features in their products and services in an innovative way. This excludes most\nof the Translation Technology service companies described in the market model, which are a separate case.\nIt does include translation service companies that also develop and sell technology separate from translation\nservices, a practice that used to be common in the industry but has receded as professional software com‐\npanies that focus exclusively on technology have become more common.\nSo far we have reviewed around 400 companies, and certain features of the market are notable. The indus‐\ntry comprises mostly small companies, concentrated in the western and northern regions of the EU, with a\nmix of long‐established players but also a significant number of new entrants. A quarter of companies are\nmicro‐enterprises with fewer than 10 employees, while only 6% have more than 200 employees; almost the\nentire industry are SMEs. \nThe European LT industry is a curious mix of start‐ups and companies that have been active in the field for a\nvery long time, some for 20 years or more. As a maturing technology in a benign market context, this is a\nhealthy cocktail of technological experience and entrepreneurial enthusiasm, and no doubt reflects the fact\nthat LT is both a very “old” technology that has been in the market in various guises for decades, but at the\nsame time “new” as improvements in functionality, new approaches, and in particular new paths to market\nand business models have given LT a boost.\nOver half the industry comprises companies active for more than 10 years, many that remain small. The fact\nthat so many companies fail to scale, even after years in business, is unusual in a technology industry, and\nindicative of the market context for LT in Europe: local/national companies with expertise in local languages\nserve local markets with services based on their own languages. This state of affairs is not likely to be sus‐\ntainable, as cloud‐based language‐enabled services are launched on a large scale. At present, few European\ncompanies are in a position to compete in an ecosystem where access to technology, rather than narrow lin‐\nguistic expertise, is the driving factor.\nFigure 10:  European LT vendors (by size)\n",
  "speaker": "SYSTEM",
  "uuid": "cd15fe91-1543-4545-9590-c827be0b8cc7"
}