{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 1\nSemantic Techniques for Enabling\nKnowledge Reuse in Conceptual Modelling\nJorge Gracia1, Jochem Liem2, Esther Lozano1, Oscar Corcho1, Michal Trna1,\nAsunci´on G´omez-P´erez1, and Bert Bredeweg2\n1 Ontology Engineering Group, Universidad Polit´ecnica de Madrid, Spain\n{jgracia, elozano, ocorcho, mtrna, asun}@fi.upm.es\n2 Informatics Institute, University of Amsterdam, the Netherlands\n{j.liem, b.bredeweg}@uva.nl\nAbstract. Conceptual modelling tools allow users to construct formal represen-\ntations of their conceptualisations. These models are typically developed in isola-\ntion, unrelated to other user models, thus losing the opportunity of incorporating\nknowledge from other existing models or ontologies that might enrich the mod-\nelling process. We propose to apply Semantic Web techniques to the context of\nconceptual modelling (more particularly to the domain of qualitative reasoning),\nto smoothly interconnect conceptual models created by different users, thus facil-\nitating the global sharing of scientiﬁc data contained in such models and creating\nnew learning opportunities for people who start modelling. This paper describes\nhow semantic grounding techniques can be used during the creation of qualita-\ntive reasoning models, to bridge the gap between the imprecise user terminology\nand a well deﬁned external common vocabulary. We also explore the application\nof ontology matching techniques between models, which can provide valuable\nfeedback during the model construction process.\nKeywords: Qualitative Reasoning, Semantic Grounding, Ontology Matching\n1\nIntroduction\nThe Qualitative Reasoning (QR) area of Artiﬁcial Intelligence (AI) researches con-\nceptual representation of systems, and the prediction of their behaviour through rea-\nsoning. QR has been successfully applied in a variety of domains, e.g., environmental\nscience [6, 27], autonomous spacecraft support, failure analysis and on-board diagnosis\nof vehicle systems, automated generation of control software for photocopiers [7], etc.\nOf particular relevance to this paper is the use of QR in science and education. QR\nmodels can be used as a means for learners to formally express and test their conceptual\nknowledge about systems in an educational context [3]. A desirable feature would be\nthe possibility of uploading expert and learner models to a shared learning environment,\nand receiving feedback from the common knowledge contained in such a resource. This\npaper addresses the issue of how this environment can be created and used effectively.\nIn the current state of the art in qualitative modelling and simulation tools [5, 4, 28,\n17], modellers are free to choose their own domain vocabulary. However, this results in\ndifferent modellers using different terms to denote the same concept (e.g. death rate and\nmortality). Different languages and spelling variations further exacerbate the issue. This\n",
  "speaker": "SYSTEM",
  "uuid": "cd2b6ec1-efda-4cff-86d9-38c9f0c2ad93"
}