{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 59\n57\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nTranslation Technology Overview\n4.8 Background\nWe can debate whether the translation industry’s response to rapid globalisation and growth in content has\nbeen the right one. Has the industry made best use of technology to raise its capacity and stay profitable?\nOr has the content explosion marginalized an industry of artisans?\nTo understand the current landscape we need to take a ride into translation technology history. The onset\nof the cold war highlighted the need for machines that could translate with both the US and Russia wanting\nto keep tabs on each other. However, despite significant investment, by the late 1960s it became clear that\nmachines could not translate anywhere near well enough. Machines and translation were rarely sighted\ntogether for the next fifteen years. A notable exception was the European Commission’s use of Systran’s sys‐\ntems for registering purposes beginning in 1976.\nBy the mid‐1980s a few service providers in a burgeoning localisation industry began to provide translation\nmemory tools, which enable recycling of translations, alongside glossary tools to their translators. This they\nfelt at least left translators in control.\nWhile these translation technology tools became more scalable and the feature set matured, the core tech‐\nnology for improving capacity in commercial translation services was left largely untouched for the next\ntwenty years. \nThe localisation industry continued to grow rapidly, if not innovate, and many in the traditional translation\nindustry were largely left in its wake. Many translators demonstrated reluctance to adopt translation tech‐\nnology for a range of reasons ‐ some well‐founded, others based on ill‐informed fears of replacement. \nThe lack of innovation also meant low barriers to entry to the translation technology segment. Many trans‐\nlation services companies developed their own computer‐aided translation tools, creating panoply of\nmediocre systems with no differentiation. While the translation services industry flourished, the technology\nsegment remained minuscule. \nIn that same period the cold war ended, economic growth began shifting from English speaking to non‐\nEnglish speaking nations, digital communications largely replaced print, consumers and citizens became pub‐\nlishers en masse, and people all over the world got connected via mobile phones. \nIt is only in the last 5 years that we begin to see wholesale changes in the technology and business models\nbeing used for translation; for the large part change leaders have entered from outside the industry.\n4.9 Technology for Professional Translation\nTranslation Processes and System Features\nTranslation technology can be broken down into several major components. Translation tools, also known\nas CAT (computer aided translation), enhance the productivity and consistency of human translators, and\ninclude several component technologies, including: translation memory (which enables translators to re‐use\nand learn from previous work), translation management systems (which automate project management and\npublication), terminology management systems (which encourage the use of standard terms, names, and\ntranslations) and quality assurance tools.\nThe workflow diagram below provides an overview of the many stages that may be needed for translation\nand localisation. The translation technologies outlined in this section seek to optimize and where possible\n",
  "speaker": "SYSTEM",
  "uuid": "cdf5cf1b-64df-4487-b1a0-e92a38cb0ec7"
}