{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 101\n99\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nChallenges / Opportunities\nOpportunities\n• Data has become the more valuable asset and companies are looking forward to exploiting vertically in\norder to create competitive advantages.\n• Companies lack specific resources to exploit data, so content analytics services providers have a strong\nopportunity rather than pure product vendors.\n• Content analytic vendors should approach with packaged business solutions rather than with an open\ntechnology / platform approach to focus on ROI benefits.\nChallenges\n• Content analytics is just a small part of the analytics market and companies still lack having the proper\nanalytics infrastructure. \n• Companies lack of sufficient computing resources. Vendors should include cloud‐based solutions to\novercome this issue.\n• Big vendors already have a wide portfolio of content analytics vertical solutions and they can focus on\nservices. Small vendors should focus on innovation and niche solutions to survive. \n• Data integration complexity and poor data quality are the two main corporate problems that vendors\nshould help companies to solve. \n• IC Works well into the intranet, still standardization needed for interoperability in the internet and\ncloud platforms. \nIntelligent Content Technology Drivers and Inhibitors\nThe following table presents macroeconomics, global megatrends, specific market trends and labour supply\nfactors that might affect the Intelligent Content Technology market.\nMarket Force\nAssumption\nImpact\nTime\nFrame\nAccelerator/\nInhibitor/\nNeutral\nCertainty of\nAssumption\nMacroeconomics\nEconomic situation\nThere is a strong correlation between the economy\nand IT expenditures. The global economy situation is\nimpacting IT budgets, business and consumer confi-\ndence, the availability of credit and private invest-\nment, and internal funding.\nHigh\nShort-term\nInhibitor\n\n\nRegulations\nNew regulation of data and information compliance\nwill require LT investments\nHigh\nMedium-\nterm\nAccelerator\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "cea576f6-57e4-44d0-9d41-5f78ad4d97d6"
}