{
  "message": "SYSTEM: CV-Cicyt_MariaPoveda-Abril2016.pdf: Página 3\nParticipación en Proyectos de I+D financiados en Convocatorias públicas. \n \n \n(nacionales y/o internacionales)  \n \nTítulo del proyecto: Vicinity: Open virtual neighbourhood network to connect intelligent buildings and smart objects \n(H2020-688467) \nEntidad financiadora: Union Europea. \nEntidades participantes: Technische Universitaet Kaiserslautern, Atos Spain SA, Ethniko Kentro Erevnas Kai Technologikis \nAnaptyxis, Aalborg Universitet, Gorenje Gospodinjski Aparati D.D., Hellenic Telecommunications Organization S.A. - OTE \nAE (Organismos Tilepikoinonion, Tis Ellados OTE AE), Bavenir, s.r.o., Climate Associates Limited, Intersoft a.s., Universidad \nPolitecnica de Madrid, Gnomon Informatics sa, Tiny Mesh, Hafenstrom, Enercoutim - Associação Empresarial de Energia \nSolar de Alcoutim, Municipality of Pilea-Hortiatis \nDuración, desde: 01-01-2016 hasta: 31-12-2019  \nCoordinador del proyecto europeo:  \nInvestigador responsable por la UPM: Asunción Gómez Pérez  \nNúmero de investigadores participantes:  \nFinanciación del proyecto en UPM:  \n \nTítulo del proyecto: Ready4SmartCities \"ICT Roadmap and Data Interoperability for Energy Systems in Smart Cities\" \n(FP7-608711) \nEntidad financiadora: Union Europea. \nEntidades participantes: D´APPOLONIA SPA (coordinador), UNIVERSIDAD POLITECNICA DE MADRID, CENTRE \nSCIENTIFIQUE ET TECHNIQUE DU BATIMENT, CENTRE FOR RESEARCH AND TECHNOLOGY HELLAS, \nTEKNOLOGIAN TUTKIMUSKESKUS VTT, INSTITUT NATIONAL DE RECHERCHE EN INFORMATIQUE ET EN \nAUTOMATIQUE, AIT Austrian Institute of Technology GmbH, AEC3 LTD, POLITECNICO DI TORINO, EMPIRICA \nGESELLSCHAFT FUER KOMMUNIKATIONS- UND TECHNOLOGIE FORSCHUNG MBH \nDuración, desde: 01-10-2013 hasta: 30-09-2015  \nCoordinador del proyecto europeo: Asunción Gómez Pérez (Directora científica del proyecto)  \nInvestigador responsable por la UPM: Asunción Gómez Pérez  \nNúmero de investigadores participantes: 176  \nFinanciación del proyecto en UPM: 216.087€  \n \nTítulo del proyecto: BuscaMedia: Hacia una Adaptación Semántica de Medios Digitales Multirred-Multiterminal (CEN-\n20091026) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: ATOS Origin, Activa Multimedia, GFI, Indra, CCMA, Bilbomática, Fractalia, BMAT, ISID, iSOCO, \nDaedalus, Universidad Politécnica de Madrid, Universidad Nacional de Educación a Distancia, Robotiker Tecnalia, \nUniversitat Pompeu Fabra, Universitat Politécnica de Catalunya, Universidad Carlos III de Madrid, Fundació Barcelona \nMedia, Fundación CTIC \nDuración,  desde: 01/10/2009  hasta: 31/12/2012   \n \nCuantía de la subvención: 10.420.464€, 290.791,80€ (UPM) \nFechas de trabajo en proyecto: 01/10/2009 – 31/12/2012 \nInvestigador responsable: John Paul Moore Olmstead (proyecto), Oscar Corcho (UPM) \nNúmero de investigadores participantes: +100 \n \n \n \nTítulo del proyecto: mIO! Tecnologías para prestar servicios en movilidad en el futuro universo inteligente \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: Telefónica I+D, Telvent, AT4 Wireless, iSOCO, Worldnet 21, Instalaciones Inabensa, TreeLogic, \nCaja Navarra, Sugar Factory, TB Solutions, CICtourGUNE, Robotiker-Tecnalia, Universidad Politécnica de Madrid, \nUniversidad Politécnica de Valencia, Universidad de Cantabria, Universidad de Deusto, Universidad de Granada, \nUniversidad de Valladolid, Universidad de Málaga, Universidad de Cantabria, Universidad Rey Juan Carlos, \nUniversidad de Castilla la Mancha, Universidad de Vigo, Universidad Politécnica de Cartagena, Centre Tecnològic \nde Telecomunicacions de Catalunya (CTTC), European Centre for Soft Computing, Fundación CTIC, European \nSoftware Institute \nDuración,  desde: 01/09/2008 \nhasta: 31/12/2011  \n \nCuantía de la subvención:  21.952.412€ (total), 312.742,76€ (UPM) \nFechas de trabajo en proyecto: 01/09/2008 – 31/12/2011  \n",
  "speaker": "SYSTEM",
  "uuid": "cee30448-a96a-47f6-b3f7-6b2cc3e5e883"
}