{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 3\nagreement among ontology engineers, users and domain experts on what requirements \nthe ontology should cover. \nWhen building knowledge intensive systems, the ORSD will be decisive along the \nontology development process because it will facilitate, among other activities, the \nsearch and reuse of existing knowledge-aware resources for re-engineering them into \nontologies; the search and reuse of existing ontologies, ontology modules, ontology \nstatements (e.g., using Watson5 or Swoogle6), or ontology design patterns; and the \nverification of the ontology during the whole ontology development. The \nmethodological guidelines presented in this paper have been created in the context of \nthe NeOn Methodology [4] within the NeOn project7. They have been validated by \nusers in different ontology-based applications inside and outside the NeOn project. \n In addition to the guidelines, we also present a particular ORSD resulting from the \nontology requirements specification activity carried out within the SEEMP project8, \nwhose goals were to develop a knowledge intensive and interoperable architecture \nbased on ontologies for public e-Employment services (PES), and to enable a \nfederated market place of employment mediation agencies through a peer-to-peer \nnetwork based on interoperation. \nThe rest of the paper is organized as follows: Section 2 includes the \nmethodological guidelines for the ontology requirements specification activity, and \nthe ORSD obtained in the SEEMP project as an example. Section 3 shows how the \nmethodological guidelines and the ORSD were used in different cases. Section 4 \nexplains in detail how the ORSD was used within the SEEMP project to search and \nreuse knowledge-aware resources and to evaluate the resultant ontology. Finally, \nSection 5 provides the conclusions. \n2 \nMethodological \nGuidelines \nfor \nOntology \nRequirements \nSpecification \nIn this section we explain the guidelines set out to help ontology developers in the \nontology requirements specification activity. Such guidelines have been created in the \ncontext of the NeOn Methodology [4] for building ontology networks. This \nmethodology takes into account the existence of multiple ontologies in ontology \nnetworks, the collaborative ontology development, the dynamic dimension, and the \nreuse and re-engineering of knowledge-aware resources. One of the key elements in \nthis methodology is the set of 9 scenarios identified for building ontologies and \nontology networks.  \nIt is worth also mentioning that in the framework of the NeOn Methodology there \nare prescriptive methodological guidelines9 for carrying out different processes and \nactivities involved in the ontology development: ontology requirements specification \n(presented in this paper), scheduling ontology projects, reuse and re-engineering non-\n                                                           \n5 http://watson.kmi.open.ac.uk/WatsonWUI/ \n6 http://swoogle.umbc.edu/ \n7 http://www.neon-project.org \n8 http://www.seemp.org \n9 Deliverables D5.4.1, D5.3.2, and D5.4.2 (http://www.neon-project.org/) \n",
  "speaker": "SYSTEM",
  "uuid": "cff015fc-a9e0-4df4-b207-428669fa8566"
}