{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 1\nSemantic Grounding of Cross-Lingual\nFolksonomies\nAndr´es Garc´ıa-Silva1, Cesar Monta˜na1, Iv´an Cantador2, and Oscar Corcho1\n1 Ontology Engineering Group,\nFacultad de Inform´atica, Universidad Polit´ecnica de Madrid, Spain\n{hgarcia,cmontana,ocorcho}@fi.upm.es,\n2 Information Retrieval Group,\nEscuela Polit´ecnica Superior, Universidad Autonoma de Madrid, Spain\nivan.cantador@uam.es\nAbstract. Folksonomies emerge as the result from the free tagging ac-\ntivity of a large number of users over a variety of resources. Though\nthey can be considered as a valuable resource for the classiﬁcation and\nexchange of information, several problems have been already identiﬁed\nwhen it comes to understanding the meaning of tags appearing in folk-\nsonomies, mainly related to the appearance of synonymous and ambigu-\nous tags, and speciﬁcally in the context of multilinguality. In this paper\nwe evaluate our approach for the semantic grounding of tags to deﬁne for-\nmally the meaning of multilingual tags. We associate tags with DBpedia\nresources, according to the context where they were used, by measuring\nthe overlap of terms between the tag context and terms in the Wikipedia\narticles deﬁning the tag meaning, and we beneﬁt from user translations\nin Wikipedia to deal with multilingual tags and senses. A conducted ex-\nperiment shows that the proposed approach achieves high precision for\ncontexts that contain tags in English and Spanish.\n1\nIntroduction\nWeb 2.0 systems such as blogs, wikis, multimedia sharing sites, and social net-\nworking sites facilitate the creation of user generated content which can be pro-\nvided in various forms. Among the formats in which user-generated content can\nbe created, tagging has become a popular practice as a lightweight mean to clas-\nsify and exchange information. Users can assign tags to a wide range of resources\nincluding photos, products, urls, and publications among others.\nFolksonomies (i.e., the classiﬁcation scheme emerging from tagging systems)\nmay be considered as a valuable knowledge resource, [11] reports that after\nsome user annotations of a URL, the set of tags used in the annotations tends\nto stabilize leading to a set of most common used tags to annotate a URL.\nSimilarly, in [16] authors reported the identiﬁcation of a vocabulary, in terms of\ntags, among related users in Flickr.\nHowever, folksonomies are aﬀected by the lack of semantics associated with\ntags [1, 5, 20]. That is, systems are not aware of the use of misspelled tags as\n",
  "speaker": "SYSTEM",
  "uuid": "d0d43aba-4d4c-43e6-8bd4-5e6c151491fc"
}