{
  "message": "SYSTEM: FormularioCPM_ocorcho.pdf: Página 12\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n3.6. Coste estimado del desarrollo de su solución propuesta\n€\n3.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n3.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n3.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n3.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 3.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\nOtro(s) Retos(s):\n­12­\n(*) Campos obligatorios\nversión 1.2.\n#\n24\n139.992,00\nLa solución tendrá un impacto inmediato en diferentes ámbitos de la vigilancia tecnológica y de \nevaluación de la calidad investigadora: (i) facilitando la evaluación de individuos y \norganismos por parte de organismos como la ANECA o análogos; (ii) facilitando el \ndescubrimiento de tendencias tecnológicas, empresas competidoras o investigadores \nclave; (iii) facilitando la búsqueda de personal clave altamente especializado; (iv) facilitando \nla comparación de la investigación española.\nLa creación de una base de conocimiento de alta calidad que enlace diferentes conjuntos \nde datos independientes será un recurso de extraordinario valor para el reconocimiento de \nentidades nombradas (universidades, investigadores, organismos de investigación) cuyo \naprovechamiento tendrá un impacto en diferentes dominios (inteligencia tecnológica, \nvigilancia tecnológica, evaluación del impacto de proyectos de investigación, creación de \nmapas tecnológicos, estudios de mercado, etc.).  \n \nLa industria del lenguaje podrá usar los recursos producidos por esta solución: (las patentes \neuropeas constituyen un corpus de textos paralelos en diferentes lenguas).\nLos beneficios de esta propuesta apuntados en las secciones anteriores, tanto en lo \nrelativo al servicio público con su impacto en las tecnologías del lenguaje, se propagarán con \nel tiempo a un ámbito más amplio. \nLa solución presentada pone en valor el trabajo realizado desde diferentes instituciones \n(OEPM, BNE) al integrarse en un conjunto de datos de mayor provecho y que posibilita \nmúltiples aprovechamientos.\n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "d1dfeb3f-1246-4af6-b05b-5a2d17a920f4"
}