{
  "message": "SYSTEM: D5.3.2.pdf: Página 24\nPage 24 of 48 \nNeOn Integrated Project EU-IST-027595 \n \nmodels used were those based on waterfall ideas and on iterative ones, we decided to use these \nideas valid in software engineering and apply them in ontology engineering modifying the existing \nproposed collection of ONLCMs in deliverable D5.3.1 [ 10] by means of committing to only two \ndifferent ONLCMs: \n\u0001 Waterfall ontology network life cycle model. A model representing the stages as a waterfall, \nwhere a concrete stage must be completed before the following stage begins and where \nbacktracking is permitted from the maintenance phase to the phase after the requirements one.  \n\u0001 Iterative-Incremental ontology network life cycle model. Instead of distinguishing among \nincremental, iterative, evolving prototyping and spiral ontology network life cycle models, based \non Larman’s ideas [ 6], we propose here a unique iterative-incremental ONLCM. This approach \nis simpler, and thus, it will be easier to introduce in the ontology development by software \ndevelopers and ontology practitioners.  \nIn this section we propose the revised collection of ONLCMs, which includes the enhanced \nwaterfall model and the new iterative-incremental model, in line with the rationale described above. \n3.2.1. Waterfall Ontology Network Life Cycle Models \nThe main characteristic of the proposed waterfall life cycle model family for the ontology network \ndevelopment is the representation of the stages of an ontology network as sequential phases. This \nmodel represents the stages as a waterfall. In this model a concrete stage must be completed \nbefore the following stage begins, and not backtracking is permitted except in the case of the \nmaintenance phase. \nThe main assumption for using the proposed waterfall ontology network life cycle model is that the \nrequirements are completely known, without ambiguities and unchangeable at the beginning of the \nontology network development. That is, the set of requirements is closed. \nThis model could be used in the following situations: \n\u0001 In ontology projects with a short duration (e.g., 2 months). \n\u0001 In ontology projects in which the goal be to develop an existing ontology in a different \nformalism or language. \n\u0001 In ontology projects in which the requirements are closed. E.g. to implement an ontology \nbased on an ISO standard, or based on resources with previous consensus in the included \nknowledge.  \n\u0001 In ontology projects when ontologies should cover a small, well-understood domain. \nTaking into account characteristics of the ontology development, this model includes a set of \nsupport activities that should be performed in all of the phases. This set of support activities \nincludes the acquisition of knowledge in the domain, in which the ontology network is being \ndeveloped, the evaluation (from technical perspective) and the assessment (from user and need \nperspectives) of the different phase outputs, project and configuration management and \ndocumentation.   \nTaking into account the importance of knowledge resources reuse and reengineering and ontology \nmerging, we define and propose the following five different versions of the waterfall ontology \nnetwork life cycle model.  \n \n                                                                                                                                                            \n7 http://knowledgeweb.semanticweb.org \n8 http://www.seemp.org/ \n",
  "speaker": "SYSTEM",
  "uuid": "d21255bc-adb8-4964-bd93-5a2e4841e392"
}