{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 6\nPage 6 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nMari Carmen Suárez-Figueroa, \nMartin Dzbor (Q.A. reviewer) \nInclusion of general Q.A. reviewer’s \ncomments \n0.49 \n28-09-2007 \nMari Carmen Suárez-Figueroa  \nRevision of the whole deliverable and \nreferences \n0.50 \n1-10-2007 \nMari Carmen Suárez-Figueroa, \nRosario Plaza \nRevision of Chapter 1 (from a linguistic point \nof view) \n0.60 \n3-10-2007 \nMari Carmen Suárez-Figueroa, \nRosario Plaza \nRevision of Chapters 2 and 3 (from a \nlinguistic point of view) \n0.70 \n5-10-2007 \nMari Carmen Suárez-Figueroa, \nRosario Plaza \nRevision of Chapters 4 and 5 (from a \nlinguistic point of view) \n0.80 \n8-10-2007 \nMari Carmen Suárez-Figueroa, \nRosario Plaza \nRevision of Chapters 6 and 7 (from a \nlinguistic point of view) \n0.90 \n9-10-2007 \nMari Carmen Suárez-Figueroa \nRevision of the whole deliverable and \nreferences \n0.95 \n13-10-2007 \nMari Carmen Suárez-Figueroa, \nMartin Dzbor (Q.A. reviewer) \nInclusion of Q.A. reviewer’s comments on \nChapter 5 \n1.0 \n14-10-2007 \nMari Carmen Suárez-Figueroa \nFinal version \nExecutive Summary \nThis deliverable deals with ontology network development process, ontology network life cycle \nmodels and ontology network life cycle, that are necessary to provide methodological guidelines for \nthe development of ontology networks. The deliverable also provides the following new definitions:  \n The ontology network development process is defined in NeOn as the process by which \nuser needs are translated into an ontology network. The main goal of the ontology network \ndevelopment process is to identify and define which activities are carried out when an \nontology network is developed.  \n An ontology network life cycle model is defined as the framework, selected by each \norganization, on which to map the activities identified in the ontology network development \nprocess to produce the ontology network life cycle. \n The ontology network life cycle is defined as the project-specific sequence of activities \ncreated by mapping the activities identified in the ontology network development process \nonto a selected ontology network life cycle model. \nThe deliverable contains five main chapters, which deal with critical methodological issues \n(development process, models and life cycle). \nThe first chapter presents the state of the art of the aforementioned issues (development process, \nmodels and life cycle) in three different fields: Software Engineering, Knowledge Engineering and \nOntology Engineering. \nThe second chapter describes the ontology network development process in NeOn by: \n \ndefining the NeOn Glossary of Activities; and  \n \nproposing required and dispensable activities. \nThe  third chapter of the deliverable identifies and describes 8 scenarios for collaboratively building \nnetwork of ontologies with special emphasis in reusing and reengineering knowledge resources \n(ontological and non ontological) and in merging ontologies. \n",
  "speaker": "SYSTEM",
  "uuid": "d2e839af-07c6-4428-8863-7e04c115dad7"
}