{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 14\n14\nAndr´es Garc´ıa-Silva et al.\n–\nSem4Tags and Sem4TagsAC were the approaches that obtained\nthe best results both in term of precision and recall. Almost all of\nthese results present statistical signiﬁcant diﬀerences with results obtained\nwith the baseline. Comparing Sem4Tags and Sem4TagsAC, we do not ﬁnd\na clear enhancement of semantic associations when exploiting the active\ncontext. In some cases, it seems that Sem4TagsAC obtains better P@1 and\nR@1 values, but the improvements are supported by no or low statistically\nevidence. This observation could be biased by the way in which statistical\ntests were conducted, as explained before.\n– Sem4TagsAbs and Sem4TagsAbsAC are clearly the worst approaches.\nThe exploitation of Wikipedia contents carried out by Sem4Tags, and Sem4TagsAC\nis essential to correctly associate DBpedia resources to tags. In this case, the\nuse of the active context also seems to slightly improve precision and recall\nresults, but again there is no statistical evidence to support this claim.\n5.2\nAmbiguity and Multilinguality\nUsing information from MSR and the Sem4Tags relevant semantic associations\nwe can report some statistics and conclusions about ambiguity and multilingual-\nity of tags. 61% of TAS correspond to ambiguous tags in English and 42% in\nSpanish26 (see left hand side of Figure 3). In addition, for the 83% and 80% of\nambiguous TAS in English and Spanish, the sense selected by Sem4Tags coin-\ncided with the Wikipedia default sense of the tag (i.e, those wikipedia pages that\neditors have deﬁned to display ﬁrst in case of ambiguous terms). This shows\nthat in the 17% and 20% of the ambiguous TAS in English and Span-\nish we required a disambiguation activity to select the proper sense,\nwhat supports the need for our work.\nThe baseline always retrieves the default sense for a tag regardless of its\nambiguity. Its high P@1 value can be due to the fact that in the 90% of TAS\nin English and 91% in Spanish the selected sense corresponds with\nthe default sense (not ambiguous TAS plus default sense selected for\nambiguous TAS). Nevertheless, the coverage of the baseline, deﬁned as the\nnumber of semantic associations produced by the baseline divided by the total\nnumber of TAS, is extremely low: 27.7% in English and 19.4% in Spanish. This\ncontrast, with the 79.1% of Sem4Tags coverage in English and 81.4% in Spanish.\nFinally, tags multilinguality is clearly present in our analyzed dataset (See\nright hand side of Figure 3). A detailed analysis of the data shows us that 53%\nof pictures were tagged with tags considered valid in both languages. This fact\nshows that approaches addressing tags in a unique language are not\nenough as to getting beneﬁt of the whole information contained in a\nFolksonomy.\n26 The average of senses was 23.3 for English and 10.35 for Spanish\n",
  "speaker": "SYSTEM",
  "uuid": "d412a789-0529-4803-9be8-2d4a49235b48"
}