{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 39\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 39 de 42 \nAsunción Gómez Pérez. ETSI Informáticos. Universidad Politécnica de Madrid. Febrero \n2016. Mención Internacional. \n4. David Buján Carballal. Nuevas capacidades en el descubrimiento de recursos GRID \nbasadas en tecnologías semánticas. Directores: Jesús Luis Díaz Labrador, Oscar \nCorcho García. Fac. Informática, Universidad de Deusto. Enero 2016 \n5. Javier Sánchez Soriano. Enriquecimiento de fuentes de datos con descripciones \nlingüísticas mediante bases de datos geográficas externas. Directores: Martín Molina \nGonzález, Oscar Corcho García. ETSI Informáticos, UPM. Enero 2016 \n6. Francisco Martín-Recuerda Moyano. Strong Connectivity in Directed Hypergraphs and \nits Application to the Atomic Decomposition of Ontologies. Directores Asunción \nGómez Pérez y Dirk Walther. ETSI Informáticos. Universidad Politécnica de Madrid. \nFebrero 2016. Mención Internacional. \n7. Bunjamin Memishi. Optimizing the reliability and resource efficiency of MapReduce-\nbased systems. Directores María de los Santos Pérez Hernández y Gabriel Antoniu. ETSI \nInformáticos. Universidad Politécnica de Madrid. Enero 2016. Mención internacional. \n8. Idafen Santana Pérez. Conservation of Computational Scientific Execution \nEnvironments for Workflow-based Experiments Using Ontologies. Directores María de \nlos Santos Pérez Hernández y Óscar Corcho García. ETSI Informáticos. Universidad \nPolitécnica de Madrid. Enero 2016. Mención Internacional. \n9. Freddy Priyatna. Methods and Techniques for the Geneeration and Efficient \nExplotation of RDB2RDF Mappings. Director Óscar Corcho García. Diciembre 2015. \nMención internacional. \n10. Daniel Garijo Verdejo. Mining Abstractions in Scientific Workflows. Directores: Óscar \nCorcho García y Yolanda Gil. ETSI Informáticos. Universidad Politécnica de Madrid. \nDiciembre 2015. Mención internacional. \n11. José Mora López. Query Rewriting Optimisation Techniques for Ontology-based Data \nAccess. Director: Óscar Corcho García. ETSI Informáticos. Universidad Politécnica de \nMadrid. Diciembre 2015. Mención internacional. \n12. Óscar Muñoz García. Methods and Techniques for Segmentation of Consumers in \nSocial Media. Directores: Asunción Gómez Pérez y Raúl García Castro. ETSI Informáticos. \nUniversidad Politécnica de Madrid. Diciembre 2015. \n13. Mikel Emaldi Manrique. Recomendación de conjuntos de datos enlazados basada en \nminería de grafos. Directores: Diego López de Ipiña González de Artaza, Oscar Corcho \nGarcía. Fac. Informática, Universidad de Deusto. Noviembre 2015 \n14. José Ángel Ramos Gargantilla. Descubrimiento de mappings en recursos \ngeoespaciales. Directores: Asunción Gómez Pérez y Mariano Fernández López. ETSI \nInformáticos. Universidad Politécnica de Madrid. Septiembre 2015. \n15. Esther Lozano Hontecillas. A Semantic Approach to Problem-Based Learning with \nConceptual Models. Directores: Asunción Gómez Pérez y Jorge Gracia del Río. ETSI \nInformáticos. Universidad Politécnica de Madrid. Junio 2015. Mención Europea. \n16. Víctor Hugo Saquicela Galarza. Semantic Annotation of RESTful and WFS OGC \nServices. Directores: Óscar Corcho y Luis Vilches. ETSI Informáticos. Universidad \nPolitécnica de Madrid. Abril de 2015. \n17. Isabella Hinterleitner. Generation of Inner and Outer Speech by Means of Situational \nContext. Directores: Dietmar Dietrich, Óscar Corcho García. Faculty of Electrical \nEngineering, Vienna University of Technology, Septiembre 2014 \n18. Jorge Mauricio Espinoza Mejía. Ontology Localization. Directores: Eduardo Mena y \nAsunción Gómez Pérez. Departamento de Informática e Ingeniería de Sistemas. \nUniversidad de Zaragoza. Junio de 2014. \n19. Carola Álvarez-Bolado Sánchez. El léxico del videojuego: análisis contextual  en un \ngénero periodístico. Directora: Inmaculada Álvarez de Mon y Rego. Universidad \nPolitécnica de Madrid. 2013. \n20. Jean Paul Calbimonte. Ontology-based Access to Sensor Data Streams. Director: Óscar \nCorcho García. Facultad de Informática. Universidad Politécnica de Madrid. Enero 2013. \nMención europea. Premio extraordinario. \n21. Hector Andrés García Silva. A Method for Developing Ontologies from User-Generated \nClassication Systems. Codirectores: Óscar Corcho García, Asunción Gómez Pérez. \nFacultad de Informática. Universidad Politécnica de Madrid. Diciembre 2012. Mención \neuropea. \n22. Antonio Pareja Lora. OntoTag - A Linguistic and Ontological Annotation Model \n",
  "speaker": "SYSTEM",
  "uuid": "d4449ad1-c11b-4084-911f-704566c947e8"
}