{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 2\nthe prevention of making pitfalls, in [8] authors provide several guidelines to avoid \ntypical errors when modelling ontologies. Such guidelines help the ontology \ndeveloper to prevent specifically errors related to the definition of classes, class \nhierarchies, and properties. \nOur goal in this paper is to present a catalogue of recurrent pitfalls in ontology \nmodelling that has been obtained as a result of an empirical analysis of 26 ontologies. \nIn addition we aim to propose some guidelines to avoid the inclusion of pitfalls in \nontology modelling as well as some help to correct common anomalies in ontologies.  \nThe remainder of the paper is structured as follows: Section 2 presents the state of \nthe art on errors when modelling ontologies. Section 3 describes the experiment \ncarried out to obtain the ontologies that are the subject of our analysis, whose main \ngoal was to find pitfalls already identified in the literature and new common pitfalls. \nSection 4 includes the catalogue of pitfalls together with their definitions. Section 5 \nshows the analysis of the pitfalls in the aforementioned set of ontologies; it includes \nthe confirmation of recurrent existing pitfalls. Section 6 includes some guidelines to \navoid and to correct a subset of the identified pitfalls. Finally, Section 7 includes the \nconclusions drawn and future lines of work. \n2   State of the Art \nThe ontology modelling is a crucial activity in ontology engineering. However, it is \nwell known that the ontology modelling involves several difficulties. As reported in \n[11], the development of ontologies using directly ontology languages, such as OWL \nDL, is not trivial. In [11] it is stated that for most people it is very difficult to \nunderstand the logical meaning and potential inferred statements of any DL \nformalism, including OWL DL. Such a paper [11] presents (a) the most common \nproblems, errors, and misconceptions on understanding OWL DL as well as (b) tips \non how to avoid such pitfalls in building OWL DL ontologies besides some help with \nthe precise meaning of OWL-DL through questions and paraphrases. The common \nerrors are mainly related to (a) the failure to make information explicit, (b) the \nmistaken use of universal and existential restrictions, (c) the open world reasoning, \nand (d) the effect of domain and range constraints.  \nWith respect to the prevention of pitfalls, in [8] authors provide several guidelines \nto avoid typical errors when modelling ontologies. Such guidelines help the ontology \ndeveloper to prevent errors related to the definition of classes, class hierarchies, and \nproperties. \nOther authors have mainly focused their efforts on the identification of errors that \nappear when modelling taxonomies in ontologies. In this context, the author of [6] \nrelates a set of errors in ontologies with the dimensions of consistency, completeness, \nconciseness, expandability and sensitiveness. In addition, some examples of these \ntypes of errors when modelling taxonomies are presented in [6]. Besides, in [7] a \nmethodology for validating taxonomical relationships based on the philosophical \nnotions of essence, identity, and unity is presented.  \n",
  "speaker": "SYSTEM",
  "uuid": "d49a10b4-bf0a-44a3-8298-3a9398382114"
}