{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 13\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97738\npara ello por la Ley General de Subvenciones. Dichas acciones se extenderán igualmente \na los directores de tesis, en el ámbito de las funciones generales que deben desempeñar \nde conformidad con el artículo 10.3 b) de esta convocatoria.\nAsimismo, los organismos perceptores de las ayudas estarán sujetos a las actuaciones \nde control que lleven a cabo las instituciones facultadas para ello por la Ley de \nSubvenciones.\n3.  A los efectos de lo indicado en el punto 1 de este artículo, se considerarán acciones \nde seguimiento ordinarias:\na)  La memoria anual requerida para el período de régimen de beca y para el período \nde contrato en prácticas que se fijan en el apartado IV de esta Orden.\nb)  Las memorias y documentación requerida para la justificación de las estancias \nbreves y el traslado temporal al extranjero, a las que se refieren los Capítulos V y VI de \nesta convocatoria.\nc)  La memoria final que debe presentarse en caso de baja o por finalización de la \nayuda, conforme a lo señalado en el artículo 17.4 de la presente convocatoria.\n4.  Serán acciones de seguimiento y control extraordinarias, las que se inicien de \noficio por el órgano gestor que se deriven de la documentación contenida en el expediente \no las sobrevenidas como consecuencia de informes de los directores, de los centros de \nadscripción de las ayudas, inclusive de los correspondientes a las estancias breves y \ntraslados temporales, o de los organismos de los que estos centros dependan. Así mismo \npodrá realizar cuantas comprobaciones se consideren oportunas con relación al \ncumplimiento de las condiciones del programa.\n5.  Los directores de tesis y las entidades de adscripción de los beneficiarios de las \nayudas quedan obligados a realizar funciones de seguimiento y control de las ayudas y \ncomunicar a la Dirección General de Política Universitaria cualquier incidencia o \ncircunstancia que modifique las condiciones de concesión de las mismas.\nArtículo 19.  Incumplimientos.\n1.  El incumplimiento total o parcial de los requisitos y obligaciones establecidas en la \npresentes bases y demás normas aplicables, así como las que se establezcan en la \ncorrespondiente resolución de concesión, dará lugar a la apertura de un expediente de \nincumplimiento, cuya resolución, previa audiencia del interesado, podrá dar lugar a la \nrevocación de la ayuda concedida parcial o totalmente y la obligación de reintegrar la \ncuantía que se establezca en función de los criterios aplicables y los intereses de demora \ncorrespondientes, conforme a lo dispuesto en el Título II (reintegro de subvenciones), \nTítulo III (control financiero) y en el Título IV (infracciones y sanciones) de la Ley General \nde Subvenciones, y en el Real Decreto 887/2006, de 21 de julio, por el que se aprueba el \nReglamento de la Ley 38/2003, de 17 de noviembre, General de Subvenciones.\n2.  Los criterios proporcionales de graduación de incumplimientos serán los que se \nindican a continuación:\na)  El incumplimiento total y manifiesto de los objetivos de formación docente y \ncientífica para los que se concedió la ayuda, determinado a través de los mecanismos de \nseguimiento y control científico técnico, será causa de reintegro total de la subvención y, \nen su caso, de pérdida del derecho al cobro de las cantidades pendientes de percibir.\nb)  La realización de modificaciones no autorizadas en las condiciones iniciales de la \nayuda y de incumplimiento de los objetivos parciales, conllevará la devolución de la \ncantidad afectada a las mismas y, en su caso, de pérdida del derecho al cobro de las \ncantidades pendientes de percibir.\nc)  En los casos de no comunicar otras actividades incursas en incompatibilidad, \npodrá requerirse el reintegro de la ayuda por el tiempo en que se haya producido dicha \nincompatibilidad de forma parcial o total o proceder a la revocación de la misma.\nd)  La falta de presentación, de acuerdo con lo establecido en esta convocatoria, \nprevio requerimiento expreso de la Dirección General de Política Universitaria, de las \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "d4fb7a28-f859-4b80-a4b9-fa876dfe553f"
}