{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 2\nDynaLearn exercises  \n2 \n \nTable 1: The quantities in the Tree & Shade model and their quantity spaces \nQuantity  \nQuantity Space \nSize  \n{Small, Medium, Large} \nShade \n {Small, Medium, \nLarge} \nGrowth rate  \n{Zero, Plus} \nDo the following: \n• Define a quantity space called 'sml' with the values {Small, Medium, Large} \n(Small and Large should be intervals, and Medium a point). \n• Define the quantity Size and associate it with the quantity space 'sml'. \n• Define the quantity Shade and associate it with the quantity space 'sml'. \n• Define a quantity space called 'zp' with the values {Zero, Plus} (Zero should be a \npoint). \n• Define the quantity Growth rate and associate it with the quantity space 'zp'. \n \nStep 3: Creating a Scenario \nA scenario is the starting point for a simulation. It is a description of a (typical) situation \nto which the knowledge captured in the model will be applied when simulating. A model \nusually has multiple scenarios that can be used to run simulations. But in this \nassignment we consider only one scenario, namely: ‘a tree with a small size’. \nDo the following: \n• Define a new scenario: 'A small growing tree'. \n• Open the scenario in the scenario editor. \n• Add the entity Tree to the scenario. \n• Add the quantity Size attached to the entity Tree to the scenario. \n• Set the value of the Size quantity to Small. \n• Add the quantity Shade attached to the entity Tree to the scenario. \n• Set the value of the Shade quantity to Small. \n  \nStep 4: Static Model Fragment with Knowledge about Size and Shade \nIn this step a model fragment will be created which represents the relationship between \nSize and Shade. Changes in the shaded area (Shade) are the consequence of changes \nin the Size of the Tree. In this case, when Size increases the Shade also increases, and \nwhen Size decreases the Shade also decreases. This relation can be modelled using a \npositive proportionality. \nDo the following: \n• Define a new static model fragment: ‘Tree with shade’. \n• Open the model fragment in the model fragment editor. \n• Add the entity Tree to the model fragment as a condition. \n• Add the quantity Size attached to the entity Tree to the model fragment as a \nconsequence. \n",
  "speaker": "SYSTEM",
  "uuid": "d51c850c-2f3e-48ae-b4f3-1baf1d5f6b16"
}