{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 15\nAutores (p.o. de firma): García Castro R. \nTítulo: A vueltas con la programación \n \nDestinatarios: Alumnos de la asignatura de Programación II del Grado de Ingeniería Informática de la Facultad de \nInformatica de la Universidad Politécnica de Madrid, o cualquier persona interesada en aprender programación en Java \nURL: http://programacion-fi.blogspot.com/ \n \n \nDOCUMENTOS CIENTÍFICO-TÉCNICOS RESTRINGIDOS  \n \nAutores (p.o. de firma): Calbimonte J.P.; García Castro R.; Corcho O. \nTítulo: SSG4Env. Deliverable 4.4 Evaluation of the Ontology-based Data Integration Service and the Ontologies \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Agosto 2011 \n \n \nAutores (p.o. de firma): Tymaniuk S.; Winkler D.; García Castro R.; Schneider M.; Bock J. \nTítulo: SEALS. Deliverable 10.5 Iterative implementation of services for the automatic evaluation of ontology engineering \ntools v1.0-FR \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Julio 2011 \n \n \nAutores (p.o. de firma): García Castro R.; Martin-Recuerda F.; Wrigley S. \nTítulo: SEALS. Deliverable 3.8 SEALS Methodology for Evaluation Campaigns v2 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Julio 2011 \n \n \nAutores (p.o. de firma): Schneider M.; García Castro R.; Radulovic F.; Tymaniuk S. \nTítulo: SEALS. Deliverable 10.4 Evaluation design and collection of test data for ontology engineering tools v2 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Mayo 2011 \n \n \nAutores (p.o. de firma): Wrigley S.; García Castro R.; Cabral L.; Trojahn dos Santos C.; Meilicke C.; Nixon L.; Yatskevick M. \nTítulo: SEALS. Deliverable 3.5 Design of the Second Evaluation Campaign \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Mayo 2011 \n \n \nAutores (p.o. de firma): Radulovic F.; García Castro R. \nTítulo: SEALS. Deliverable 3.4 Requirements and Guidelines for the Identification of Semantic Technology Roadmaps \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Mayo 2011 \n \n \nAutores (p.o. de firma): Martin-Recuerda F.; Burghart C.; Nixon L.; García Castro R. \nTítulo: SEALS. Deliverable 2.5v1 Proposed Plans for SEALS Sustainability v1 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Mayo 2011 \n \n \nAutores (p.o. de firma): Burghart C.; Nixon L.; García Castro R. \nTítulo: SEALS. Deliverable 2.4v4 Report for Community Building and Dissemination v4 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Mayo 2011 \n \n \nAutores (p.o. de firma): Bock J.; Schneider M.; Moya C.; Esteban-Gutiérrez M.; García Castro R. \nTítulo: SEALS. Deliverable 8.2 Language for Describing Evaluations v2 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Marzo 2011 \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "d6a6bdc5-e2ba-4f92-80ed-7472280c68eb"
}