{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 3\n1. Ontology and the Lexicon\n3\nman, and English, and the PAROLE project (www.hltcentral.org/projects/PAROLE)\nand its successor SIMPLE (Lenci et al. 2000), which are large, rich lexicons for 12\nEuropean languages.\nTwo important sources for obtaining lexicons are these:\nELDA: The Evaluations and Language resources Distribution Agency (www.elda.fr)\ndistributes many European-language general-purpose and domain-speciﬁc lexi-\ncons, both monolingual and multilingual, including PAROLE and EuroWordNet.\nLDC: The Linguistic Data Consortium (www.ldc.upenn.edu), although primarily a\ndistributor of corpora, offers CELEX and several other lexicons.\nIn addition, English WordNet is available free of charge from the project’s Web page\n(www.cogsci.princeton.edu/\u0018wn).\n1.2 Lexical entries\n1.2.1 What’s in a lexical entry?\nAny detail of the linguistic behaviour or use of a word may be included in its lexical\nentry: its phonetics (including pronunciations, syllabiﬁcation, and stress pattern),\nwritten forms (including hyphenation points), morphology (including inﬂections\nand other afﬁxation), syntactic and combinatory behaviour, constraints on its use,\nits relative frequency, and, of course, all aspects of its meaning. For our purposes\nin this chapter, the word’s semantic properties, including relationships between the\nmeaning of the word and those of other words, are the most important, and we will\nlook at them in detail in section 1.3.2 below.\nThus, as mentioned earlier, a lexical entry is potentially quite a large record. For\nexample, the CELEX lexicons of English, Dutch, and German (Baayen, Piepenbrock,\nand van Rijn 1993) are represented as databases whose records have 950 ﬁelds. And\nin an explanatory combinatorial dictionary (ECD) (e.g., Mel’ˇcuk 1984, Mel’ˇcuk\nand Zholkovsky 1988), which attempts to explicate literally every aspect of the\nknowledge that a speaker needs to have in order to use a word correctly, lexical\nentries can run to many pages. For example, Steele’s (1990) ECD-style entry for\neight senses of hope (noun and verb) is 28 book-sized pages long, much of which\nis devoted to the combinatory properties of the word, such as that the noun hope\npermits ﬂicker of to denote a small amount (whereas expectation, in contrast, does\nnot).\nMany linguistic applications will require only a subset of the information that\nmay be found in the lexical entries of large, broad-coverage lexicons. Because of\ntheir emphasis on detailed knowledge about the linguistic behaviour of words, these\nlarge, complex lexicons are sometimes referred to as lexical knowledge bases, or\nLKBs. Some researchers distinguish LKBs from lexicons by regarding LKBs as\nthe larger and more-abstract source from which instances of lexicons for particular\napplications may be generated. In the present chapter, we will not need to make this\ndistinction, and will just use the term lexicon.\n",
  "speaker": "SYSTEM",
  "uuid": "d7686b18-cd16-4f79-bbf6-32ce3a485469"
}