{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 33\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 33 de 42 \n43. Rodríguez-Doncel V, Santos C, Casanovas P. A model of Air Transport Passenger \nIncidents and Rights. 27th International Conference on Legal Knowledge and \nInformation System (JURIX). ISBN: 978-1-61499-467-1. Cracovia, Polonia. 2014. \n44. Rodríguez-Doncel V, Villata S, Gómez-Pérez A. A Dataset of RDF Licenses. 27th \nInternational Conference on Legal Knowledge and Information System (JURIX). ISBN: \n978-1-61499-467-1. Cracovia, Polonia. 2014. \n45. Santana-Pérez I, Ferreira da Silva R, Rynge M, Deelman E, Pérez-Hernández MS, \nCorcho O. Leveraging Semantics to Improve Reproducibility in Scientific Workflows. \nReproducibility@XSEDE workshop. Atlanta EEUU. July 2014. \n46. Santana-Pérez I, Ferreira da Silva R, Rynge M, Deelman E, Pérez-Hernández MS, \nCorcho O. Semantic-Based Approach to Attain reproducibility of Computational \nEnvironments in Scientific Workflows: A Case Study. 1st International Workshop on \nreproducibility in Parallel Computing, Europar 2014. Porto, Portugal, August 2014. \n47. Vila-Suero D, Gómez-Pérez A, Montiel-Ponsoda E, Gracia J, Aguado-de-Cea G. \nPublishing Linked Data on the Web. The Multilingual Dimension. Libro: Towards the \nmultilingual semantic web. 2014. ISBN: 978-3-662-43584-7. \n48. Villarrubia G, Juan F. De Paz, Javier Bajo, Juan M. Corchado. Ambient Agents: \nEmbedded Agents for Remote Control and Monitoring Using the PANGEA Platform. \nVol.14, Issue 8, pp. 13955-13979. ISSN: 1424-8220. July 2014. \n49. Villarrubia G, Juan F. De Paz, Javier Bajo, Juan M. Corchado. Monitoring and detection \nplatform to prevent anomalous situations in home care. Vol.14, Issue 6, pp. 9900-9921. \nISSN: 1424-8220. June 2014. \n50. Villarrubia G,  Juan Francisco De Paz,  Javier Bajo,  Juan Manuel Corchado. EKG \nMobile. ASTL Volume 49, 2014: Advances in Industrial Software Technology. May \n2014. \n51. Villarrubia G, Juan Francisco De Paz Santana, Javier Bajo, and Juan M. Corchado. \nOpen multi-agent architecture for information fusion. 17th International Conference on \nInformation Fusion (FUSION), 2014. July 2014. \n52. Villarrubia G, Juan Francisco De Paz Santana, Fernando De la Prieta, and Javier Bajo. \nHybrid Indoor Location System for Museum Tourist Routes in Augmented Reality. 17th \nInternational Conference on Information Fusion (FUSION), 2014. July 2014. \n53. Villarrubia G, Juan F. De Paz, Javier Bajo, Yves Demazeau. Context-aware module for \nsocial computing environments. ISBN: 978-3-319-07595-2, Advances in Intelligent \nSystems and Computing Vol. 291, pp 183-191. ISSN: 2194-5357. Ambient Intelligence - \nSoftware and Applications. June 2014. \n54. Villarrubia G, Juan F. De Paz, Javier Bajo, Juan M. Corchado. Sistema de localización \nen interiores basado en la fusión de información. ISBN: 978-84-15688-76-1, pp. 553-\n558. ESTYLF 2014. XVII congreso español sobre tecnologías y lógica fuzzy. Febrero \n2014. \n55. Zato C, Sara Rodríguez, Sigeru Omatu, Javier Bajo, Juan M. Corchado. The \nReplanification Model of the agent-platform PANGEA. ASTL Volume 49, 2014: \nAdvances in Industrial Software Technology. May 2014. \n2015: \n1. Alobaid A, Garijo D, Poveda-Villalón M, Santana-Pérez I, Corcho O. OnToology, a tool \nfor collaborative development of ontologies. Demo. 6th International Conference on \nBiomedical Ontology (ICBO 2015). Lisboa, Portugal. Julio 2015. \n2. Arias J, Corcho O, Fernández JD, Fernández N, Llaves A, Sánchez L. On the Road to \nthe Evaluation of RDF Stream Compression Techniques. ESWC2015 Workshop on \nRDF Stream Processing. Portoroz, Eslovenia. Mayo 2015. \n3. Belhajjame K,  Zhao J, Garijo D, Gamble M, Hettne K, Palma R, Mina E, Corcho O, \nGómez-Pérez JM, Bechhofer S, Klyne G, Goble C. A Suite of Ontologies for Preserving \nWorkflow-Centric Research Objects (DOI: 10.1016/j.websem.2015.01.003). Journal of \nWeb Semantics. ISSN: 1570-8268. Elsevier B.V., Holanda. Volumen: 32 Páginas: 16-\n42. Mayo 2015. \n4. Chihoub H, S. Ibrahim, Y. Li, G. Antoniu, M.S. Perez, L. Bouge. Exploring Energy-\nConsistency Trade-o in Cassandra Cloud Storage System. International Symposium on \nComputer Architecture and High Performance Computing 2015. Florianopolis, Brazil. \n18-21 octubre 2015. \n",
  "speaker": "SYSTEM",
  "uuid": "d813fe54-953e-4828-a852-a75ecc196dbc"
}