{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 23\nBÚSQUEDA \n \n23 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n(A su vez, dependiendo de las estructuras permitidas en un lenguaje de \nprogramación concreto, para cada una de ellas  son posibles diferentes elecciones, \npero esto nos interesa menos: es más un problema de programación que de IA.) \nEn cualquier caso, la elección de la representación para los estados está muy ligada \na la que se haga para los operadores, puesto que ambos elementos deben \n\"cooperar\" para la resolución del problema. \nEn cuanto a los operadores, deben ser tan generales como sea posible para así \nreducir el número de reglas distintas. En el caso del 8-puzzle: \n• 4 x 9! operadores para pasar de un estado cualquiera a sus, como máximo \n4, estados sucesores; \n• 4 x 8 operadores que mueven cualquier ficha arriba, abajo, derecha o \nizquierda; \n• 4 operadores que mueven el hueco arriba, abajo, derecha o izquierda. \nEvidentemente, la última representación es la más adecuada. \nLa elección de una representación para los estados y los operadores define \nimplícitamente una relación de adyacencia en el conjunto de estados factibles para \nel problema. A este conjunto con la estructura de adyacencia definida se le \ndenomina espacio de estados. El espacio de estados es una noción clave en los \nsistemas de producción, puesto que es el lugar en el que se va a desarrollar la \nbúsqueda, y en el que se van a poder comprender las distintas variantes \ninvolucradas (en particular, las taxonomías: hacia adelante/hacia atrás, etc.). Un \nfragmento del espacio de estados para el 8-puzzle, donde se ha elegido como \nrepresentación para los operadores los 4 operadores citados antes, puede verse en \nla Figura 3. \nVeamos qué sucede con la representación del problema de las garrafas de vino. \nConceptualmente, los únicos datos relevantes en cada momento para el sistema son \nlas cantidades de vino que contienen las garrafas de cuatro y tres litros (puesto que \nla cantidad de vino que haya en el depósito no influye en la resolución del problema, \ncomo ha quedado fijado al explicar los medios de que se dispone en el problema). \nLos operadores sobre esos estados serían: \n• llena-cuatro: llenar, cogiendo del depósito, la garrafa de cuatro litros; \n• llena-tres: llenar, cogiendo del depósito, la garrafa de tres litros; \n",
  "speaker": "SYSTEM",
  "uuid": "d8d852d2-dfec-4f30-93c4-ddb616d78573"
}