{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 111\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 111 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n46. S. Pfleeger. Software Engineering: Theory and Practice. 2nd edition. Prentice Hall 2001. ISBN: \n0-13-029049-1. \n47. H. S. Pinto, C. Tempich, S. Staab. DILIGENT: Towards a fine-grained methodology for \nDIstributed, Loosely-controlled and evolvInG Engineering of oNTologies. In Ramón López de \nMantaras and Lorenza Saitta, Proceedings of the 16th European Conference on Artificial \nIntelligence (ECAI 2004), August 22nd - 27th, pp. 393--397. IOS Press, Valencia, Spain, \nAugust 2004. ISBN: 1-58603-452-9. ISSN: 0922-6389. \n48. W. W. Royce. Managing the development of large software systems: concepts and techniques. \nIn Proceedings Western Electronic Show and Convention (WESCON), Los Angeles. August \n25th-28th 1970. \n49. S. Saint, J. R. Lawson. Rules for Reaching Consensus. A Modern Approach to Decision \nMaking. Jossey-Bass, San Francisco (1994). \n50. G. Schreiber, B. Wielinga, R. de Noog, H. Akkermans, W. van de Volde. CommonKADS: A \ncomprehensive methodology for KBS development. IEEE Expert: Intelligent Systems and Their \nApplications. Volume 9, Issue 6 (December 1994). Pages: 28-37. ISSN:0885-9000. \n51. G. Schreiber, H. Akkermans, A. Anjewierden, R. de Hoog, N. Shadbolt, W. van de Velde, B. \nWielinga. Knowledge engineering and management. The CommonKADS Methodology. MIT \npress, Cambridge, Massachusetts. 1999. \n52. I. Sommerville. Software Engineering. Eighth Edition 2007. Addison-Wesley. ISBN 0-321-\n31379-8. \n53. S. Staab, H.P. Schnurr, R. Studer, Y. Sure. Knowledge Processes and Ontologies. IEEE \nIntelligent Systems 16(1):26–34. (2001). \n54. L. Stojanovic. Methods and Tools for Ontology Evolution. Dissertation. 2004. Referee: Rudi \nStuder, Christof Weinhardt, Asunción Gómez-Pérez. \n55. L. Stojanovic, N. Stojanovic, S. Handschuh. Evolution of the Metadata in the Ontology-based \nKnowledge Management Systems. 1st German Workshop on Experience Management: \nSharing Experiences about the Sharing of Experience. Berlin. March 7-8, 2002. \n56. R. Studer, V. R. Benjamins, D. Fensel. Knowledge Engineering: Principles and Methods. Data \n& Knowledge Engineering 25 (1998). PP. 161-197. \n57. F. B. Viégas, M. Wattenberg, K. Dave. Studying cooperation and conflict between authors with \nhistory flow visualizations. Conference on Human Factors in Computing Systems 2004. \nVienna, Austria. Pages. 575-582. ISBN:1-58113-702-8. \n58. D. A. Waterman. A Guide to Expert Systems. Addison-Wesley, Boston, Massachusetts. 1986. \n59. Y. Zhao. Develop the Ontology for Internet Commerce by Reusing Existing Standards. \nInternational Workshop on Semantic Web Foundations and Application Technologies. Nara \nPrefecture Public Hall, Nara, Japan. March 12th 2003.  \n60. NeOn Deliverable D7.2.2. Revised and Enhanced Fisheries Ontologies. NeOn project report. \nAugust 2007. \n61. NeOn Deliverable D7.4.1a. Software architecture for managing the fishery ontologies lifecycle \nbased on the NeOn architecture and tools. NeOn project report. August 2007. \n",
  "speaker": "SYSTEM",
  "uuid": "d8f44706-80bc-444a-b30a-30c7f5fac475"
}