{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 37\n35\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nThese partnerships could be oriented to one or more components in the value flow from data through devel‐\nopment platforms to applications. No doubt there could (and should) be many different kinds of partner‐\nships and collaborations, developing data resources in different domains, services based on those data, plat‐\nforms for product development, and actual (cloud) applications.\nThe current European industry is concentrated in the Enterprise applications space, outside a sharable lan‐\nguage infrastructure. Today that infrastructure (where it exists) is private and owned by major IT companies.\nIn future there could, in principle, be an open infrastructure, available to any organisation that wanted to\nuse its resources. The dynamics of the general software market, and the limits of what is currently possible\nfor niche LT SMEs, strongly suggest that a Digital Language Infrastructure for Europe could both unlock\npotential for the industry, and help meet the need for pervasive multilinguality in Europe’s digital economy.\nThe industry itself should define the nature and content of the infrastructure, what features are appropri‐\nately shared and open, what should remain in the commercial IP realm.\nInnovation Scenarios\nThe review of conditions in the LT industry suggests that collaborative approaches to the market could break\nthrough the fragmentation that is evident. The following discussion explores different types of collaborative\nmodels, with scenarios that illustrate their potential use.\nStyles of Collaboration\nDifferent styles and structures of collaboration are suited to different market conditions and the incentives\nof partners. Styles may be open, between or among peers, or asymmetric; collaboration structures may be\nconventional partnership alliances or ecosystem networks. An ecosystem implies a platform intended for a\nlarge network of developers, whereas alliances partner around a particular product or business solution.\nThe table summarises a set of collaborative scenarios; the types of LT‐industry collaborations most suitable\nfor publicly funded projects are shaded blue. \nFigure 16: Collaborative Innovation\n",
  "speaker": "SYSTEM",
  "uuid": "da2bc673-b411-4f92-8cd7-d9a50d65b2e7"
}