{
  "message": "SYSTEM: D5.3.2.pdf: Página 35\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 35 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \nthis task use as technique (1) a set of natural language questions proposed here, whose answers \nrefer to a particular set of scenarios for building ontology networks, and (2) Table 3, which \ncorresponds scenarios with processes and activities. \nThe natural language questions to be used in this task in order to obtain which scenarios should be \nfollowed during the ontology network development are the following ones: \n\u0001 Have you planned to use any non-ontological resource such as thesauri, data bases, etc. in \nyour ontology network development? \no If so, then your ontology network development should follow scenario 2. \n\u0001 Have you planned to use any existing ontological resource in your ontology network \ndevelopment? \no If so, then your ontology network development should follow scenario 3. \n\u0001 Have you planned to use and modify any existing ontological resource in your ontology \nnetwork development? \no If so, then your ontology network development should follow scenario 4. \n\u0001 Have you planned to use and merge a set of existing ontological resources in your ontology \nnetwork development? \no If so, then your ontology network development should follow scenario 5. \n\u0001 Have you planned to use, merge, and modify a set of existing ontological resources in your \nontology network development? \no If so, then your ontology network development should follow scenario 6. \n\u0001 Have you planned to use ontology design patterns in your ontology network development? \no If so, then your ontology network development should follow scenario 7. \n\u0001 Have you planned to restructure your ontology network? \no If so, then your ontology network development should follow scenario 8. \n\u0001 Have you planned to develop your ontology network in different natural languages? \no If so, then your ontology network development should follow scenario 9. \nAfter answering the previous set of questions, the actors involved in this task obtain the set of \nscenarios applicable in the ontology development. Using such a set of scenarios, Table 3 and the \ntable of ‘Required-If Applicable’ activities presented in deliverable D5.3.1 [ 10], software developers \nand ontology practitioners obtain the set of processes and activities selected for the ontology \ndevelopment. \nTable 3 relates scenarios with processes and activities in the following way: (1) a process or an \nactivity can be carry out in a particular scenario (S1); (2) a process or an activity can be carry out in \na list of scenarios (S4, S6, S8); and (3) a process or an activity can be carry out in a set of \nscenarios (S1-S9). \n",
  "speaker": "SYSTEM",
  "uuid": "db6408ba-36b9-4fa3-9d14-b081e80fea4b"
}