{
  "message": "SYSTEM: CV-Cicyt_MCSFB_Noviembre2013.pdf: Página 6\nDuración, desde: 01-01-2004 \nhasta: 31-12-2007  \nInvestigador responsable: Dieter Fensel \nNúmero de investigadores participantes: 91 \n \n \nTítulo del proyecto: Esperonto Services. Application Service Provision of Semantic Annotation, Aggregation, \nIndexing and Routing of Textual, Multimedia, and Multilingual Web Content. (IST-2001-34373) \nEntidad financiadora: Unión Europea \nEntidades participantes: Intelligent Software Components, Universidad Politécnica de Madrid, Vrije University, DFKI, \nUniversity of Liverpool, Biovista, Fundación Residencia de Estudiantes, CIDEM \nDuración, desde: 01-09-2002 \nhasta: 28-02-2005 \nInvestigador responsable: Richard Benjamins \nNúmero de investigadores participantes: 25 \n \n \nTítulo del proyecto: OntoWeb: Ontology-based information exchange for knowledge management and electronic \ncommerce (IST-2000-29243)  \nEntidad financiadora: Unión Europea \nEntidades participantes: 95 participantes \nDuración, desde: 01-05-2002 \nhasta: 13-05-2004 \nInvestigador responsable: Dieter Fensel \nNúmero de investigadores participantes: 400 \n \n \nTítulo del proyecto: PIKON: Personal Information and Knowledge Organizer Network (IST-2001-33487) \nEntidad financiadora: Unión Europea (FP5, Action Line IST-2001-2.1.2) \nEntidades participantes: Consorzio per la Zona Industriale Apuana (CZIA), University of Sunderland, ALTEC S.A. Information \nSystems, TXT E-Solutions SPA, Universitaet Bremen, ISD - Informacao, sistemas e desenvolvimento S.A.; TIBA, Comercio e \nIndustria de Materiais de Construcao, SA; Centro Ricerche FIAT Societa Consortile per Azioni \nDuración, desde: 11 de octubre de 2002 \nhasta: 28 de febrero de 2004 \nInvestigador responsable: Francesco Molinari \nNúmero de investigadores participantes: 21 \n \n \nTítulo del proyecto: RIADA: Modelos de Análisis de Riesgo de Avenidas para Decisión Asistida en Tiempo Real \n(C01-1015 -01) \nEntidad financiadora: Ministerio de Ciencia y Tecnología \nEntidades participantes: Universidad de Málaga, Dirección General de Obras Hidráulicas y Calidad de las Aguas (Ministerio \nde Medio Ambiente), Empresa SYNCONSULT S.L. \nDuración, desde: 01-04-2002 \nhasta: 30-4-2002 \nInvestigador responsable: Martín Molina González \nNúmero de investigadores participantes: \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "dccfa803-aa06-4396-a0fb-6dbcb6d037a7"
}