{
  "message": "SYSTEM: D5.3.2.pdf: Página 15\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 15 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n \nFigure 4. NeOn Glossary of Processes and Activities \nThe NeOn Resource Glossary was created to fix the problem of using different terminology for \nwhat is essentially the same purpose, and to promote good ontology design (and labelling) \npractices. This glossary includes the following twelve definitions in an alphabetical order, and is \nlocated in a private wiki page internal to the NeOn project. This glossary is not intended to be \nexhaustive, because it is still in progress within the NeOn project. \n\u0001 Concept is defined as an abstract idea or a mental symbol, typically associated with a \ncorresponding representation in a particular language. \n\u0001 Entity is defined as something that has a distinct, separate existence, though it need not be \na material existence. This term refers to a superset for concepts, individuals, objects, etc. \n\u0001 Individual is defined as a specific, unique member of a set of all objects of the same type, \nwhich has been represented by a given concept; thus individuals are representations of \nspecific but different realizations of a given abstract concept. \n\u0001 Metadata is defined as an association of an entity (usually a label or textual explanation) to \nanother entity (e.g., concept X can be annotated using metadata explaining its authorship). \n\u0001 Module is defined as a specialization of concept '''ontology''', module can be seen as ''a \nrole for a particular ontology'' – when module is self-contained we talk about ontology X, \nwhen X becomes a part of a larger whole, we may talk about module X in Y.  \n\u0001 Modular ontology is defined as an ontology designed by integrating at least two other \nontologies in the role of modules (''ontology X importing another ontology Y may be seen \nas a modular ontology, for example''). \n\u0001 Networked ontologies are defined as a set of ontologies among which certain allowed \nproperties are defined using the official NeOn Metamodel (''e.g., '''previousVersionOf''', \n'''importsModule''', etc.). \n",
  "speaker": "SYSTEM",
  "uuid": "dd6ca013-847d-4d79-bb57-0d4f5ae07699"
}