{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 107\nBÚSQUEDA \n \n107 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nSegún el criterio anterior, la heurística idénticamente nula define el algoritmo A* peor \ninformado. O dicho de otro modo, \"primero el menos costoso\" es el algoritmo que \nmás estados expande entre los algoritmos A que garantizan que si se encuentra una \nsolución, ésta será óptima. \nEn cualquier caso, es conveniente no extraer consecuencias precipitadas. El criterio \nanterior sólo se refiere a la cantidad de cálculo empleada para la expansión de \nestados, pero no hace referencia al número de operaciones necesario para calcular \nlos valores h(e). Es un fenómeno bastante común que heurísticas mejor informadas \nrequieran también más tiempo para su cálculo. Los dos casos extremos son h = 0, \ncon coste de cálculo mínimo, pero ninguna potencia heurística, y h = h*, de máxima \npotencia heurística (de hecho es un conocimiento seguro), pero muy difícil de \ncalcular (en el caso general, para calcular h* es necesario realizar una búsqueda, lo \nque, evidentemente, limita su interés como heurística). \nEjercicios. Hacia el final del apartado 4.1 se introdujeron cuatro heurísticas para el      \n8-puzzle y en un ejercicio una quinta. Supondremos que el coste de cada \nmovimiento es 1. Se pide estudiar la admisibilidad y monotonía de las cinco \nheurísticas (una ya ha sido someramente comentada en el texto), así como cuáles \nestán mejor informadas. \nEl final del apartado y del tema está dedicado a un problema clásico en Inteligencia \nArtificial y también en optimización: el problema del viajante de comercio. Este \nproblema fue brevemente introducido en un ejercicio del apartado 2.1. De él existen \nmuchas variantes. La que nos interesa aquí responde al siguiente enunciado \ninformal: \"Un vendedor tiene una lista de ciudades, cada una de las cuales debe \nvisitar exáctamente una vez. Existen carreteras directas entre cada pareja de \nciudades de la lista. Encontrar la ruta más corta posible que debe seguir el vendedor \nque empiece y termine en alguna de las ciudades\". \nAl estudiar con mayor precisión el problema, observamos que más que una lista de \nciudades necesitamos un mapa con las ciudades y las distancias de las carreteras \nque las unen. Un tal mapa puede ser representado matemáticamente por medio de \nun grafo no dirigido (sin direcciones en las aristas) y simple (es decir, sin aristas que \nunan un vértice a sí mismo y con a lo más una arista entre dos vértices). \nUn grafo completo es un grafo como los anteriores y en el que entre dos vértices \ndistintos siempre existe una arista. Estos grafos quedan determinados por su \nnúmero de vértices. En grafo completo con n vértices suele ser denotado por Kn. En \nla figura 13 aparece el grafos K4. \n",
  "speaker": "SYSTEM",
  "uuid": "de359fdf-f155-4309-b187-8d6dddef9f95"
}