{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 24\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n2.8 Otros recursos \nA continuación, aparecen una serie de recursos que aunque no se pueden encasillar en ninguno \nde los apartados que hemos tratado anteriormente, consideremos que nos pueden ser de utilidad \na la hora de diseñar la ontología requerida. \n http://www.object-id.com/ \n Object ID es un estándar internacional que especifica cómo describir los objetos \nculturales. En su desarrollo ha colaborado la comunidad de museos, agencias de policía, \nindustrias del negocio del arte y anticuarios. El proyecto Object ID fue iniciado por J. \nPaul Getty Trust en 1993 y se convirtió en estándar en 1997. Fue promovido por las \nagencias más poderosas, incluyendo el FBI, Scotland Yard,  INTERPOL, museos, \npatrimonio cultural, la industria del arte, las organizaciones de valoración del arte y las \ncompañías de seguros. \n http://witcombe.sbc.edu/ARTHLinks.html \n \nEn esta fuente se proporcionan enlaces a conceptos y estilos artísticos, artistas, museos, \netc. de todos los lugares del mundo. \n http://www.vivirasturias.com/turismo/indice/lista_92_25_Obras%20de%20arte.html \n \nBuscador de obras de arte en el Principado de Asturias. Nos puede proporcionar los \ndistintos campos de información que se necesitan para definir una obra de arte. \n http://siris-artinventories.si.edu/ipac20/ipac.jsp?profile=ariall#focus \n \nCatalogo/inventario de las obras de arte del Smithsoniam American Art Museum. \n http://www.cgac.org/ \n \nCentro Galego de Arte Contemporánea \n http://consciousness.anu.edu.au/thomasson/The%20Ontology%20of%20Art.doc \n \nDocumento que indica cómo construir una ontología sobre el arte. \n http://www.ercim.org/publication/Ercim_News/enw35/vercoustre.html \n \nArtículo sobre un proyecto de procesamiento automático de fuentes de información \nculturales. \n http://www.wga.hu/index1.html \n \nGalería Web de arte que contiene las fuentes que utilizaron para su desarrollo (libros, \nenciclopedias, etc.) \n \n24\n",
  "speaker": "SYSTEM",
  "uuid": "deae3894-13aa-4812-8933-e2eb655d0858"
}