{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 1\nSemantic Annotation of Geospatial RESTful Services \nUsing External Resources \nVíctor Saquicela, Luis. M. Vilches-Blázquez, Oscar Corcho \n \nOntology Engineering Group, Departamento de Inteligencia Artificial  \nFacultad de Informática, Universidad Politécnica de Madrid, Spain \n{vsaquicela, lmvilches, ocorcho}@fi.upm.es  \n \nAbstract. RESTful services are increasingly gaining traction over WS-* ones. \nAs with WS-* services, their semantic annotation can provide benefits in tasks \nrelated to their discovery, composition and mediation. In this paper we present \nan approach to automate the semantic annotation of RESTful services using a \ncross-domain ontology, two semantic resources like DBpedia and GeoNames, \nand additional external resources (suggestion and synonym services). We also \npresent a preliminary evaluation in the geospatial domain that proves the \nfeasibility of our approach in a domain where RESTful services are \nincreasingly appearing and highlights that it is possible to carry out this \nsemantic annotation with satisfactory results.   \nKeywords: REST, semantic annotation. \n1   Introduction \nIn recent years, since the advent of Web 2.0 applications and given some of the \nlimitations of “classical” Web services based on SOAP and WSDL, Representational \nState Transfer (REST) services have become an increasing phenomenon. Machine-\noriented Web applications and APIs that are conformant to the REST architectural \nstyle [23], normally referred to as RESTful Web services, have started appearing \nmainly due to their relative simplicity and their natural suitability for the Web. \nHowever, using RESTful services still requires much human intervention since the \nmajority of their description pages are given in the form of unstructured text in a Web \npage (HTML), which contains a list of the available operations, their URIs and \nparameters (also called attributes), expected output, error messages, and a set of \nexamples of their execution. This hampers the discovery, composition and mediation \nbetween services, which may be required in the development of simple and complex \napplications, and which are also important tasks in WS-* approaches. \nTraditionally, semantic annotation approaches for services have focused on \ndefining formalisms to describe services, and have been normally applied to WS-* \nservice description formalisms and middleware. More recently, these (usually \nheavyweight) approaches have started to be adapted in a more lightweight manner for \nthe semantic description of RESTful services [1, 5, 8]. However, most of the \n",
  "speaker": "SYSTEM",
  "uuid": "df11fdd0-926d-43f9-8539-7a664c86a8cf"
}