{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 60\nPage 60 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nManagement activity group and some activities of the Support activity group are required, that is \nare mandatory for all development projects. Depending on the concrete development case and on \nthe life cycle model chosen, activities in the Pre-Development, Development, and Post-\nDevelopment activity groups may or may not be required, that is they are “If Applicable” [4].  \nIn order to speed up the ontology network development by software developers and ontology \npractitioners, for each activity included in the NeOn Glossary of Activities (Section 3.2) we identify \nwhich activities are required and which activities are optional (or if-applicable) during the ontology \nnetwork building process.  \n Required activities refer to those activities that should be carried out when developing \nnetworks of ontologies.  \n If Applicable or Optional activities refer to those activities that can be carried out or not, \ndepending on the case, when developing ontology networks. \nThe table of ‘Required-If Applicable’ activities presented in this section is a first version. After \ndelivering this document, such table will evolved and the final version of the table will be included \nin D5.3.2 (at month 36)  \nTo carry out the identification of which activities are required and which ones are optionals during \nthe ontology network building process, we invited in an open call to ontology developers from the \nontology engineering community participating in projects (NeOn, KWeb, X-Media, etc.) and \nworking in universities and companies (iSOCO, OEG group, DERI group, etc.) to participate in an \non-line survey9. This survey/questionnaire began on July 27th 2007 and the results were collected \non Agust 21st 2007. 35 people answered to this survey during the aforementioned period. \nThe analyzed results of this survey, taking into account also our own experience on developing \nontologies, are shown in Table 3.  \nTable 3. Required-If Applicable Activities \n \nRequired \nIf Applicable \nOntology Aligning \n \nX \nOntology Annotation \nX \n \nOntology Assessment \nX \n \nOntology Comparison \nX \n \nOntology Conceptualization \nX \n \nOntology Configuration Management \nX \n \nControl \nX \n \nOntology Customization \n \nX \nOntology Diagnosis \nX \n \nOntology Documentation \nX \n \nOntology Elicitation \nX \n \n                                                 \n9 http://droz.dia.fi.upm.es/survey/index.jsp \n",
  "speaker": "SYSTEM",
  "uuid": "df1b5889-1871-4e38-b2ca-de795173a485"
}