{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 27\n \n \nPág. 29 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n- Medida 3: Elaborar y ejecutar un plan de desarrollo de infraestructuras lingüísticas. \nRealizar un inventario de infraestructuras lingüísticas actualmente disponibles. Evaluar la \nevolución de la cantidad, calidad y disponibilidad de infraestructuras lingüísticas. \n- Medida 4: Facilitar el acceso público a las infraestructuras lingüísticas existentes. \nEje II: IMPULSO DE LA INDUSTRIA DE LAS TECNOLOGÍAS DEL LENGUAJE \nLínea 1: Mejora de la visibilidad y de la transferencia del sector  \nMotivo: \nEl sector de la traducción automática y más aún el sector del procesamiento de lenguaje natural \nes poco conocido por las Administraciones Públicas y por la mayoría de los sectores productivos \nde nuestro país. Por otro lado, se hace necesario incrementar el número de expertos en \nprocesamiento de lenguaje natural y traducción automática para garantizar el crecimiento del \nsector. En el ámbito académico la situación es similar, no hay una oferta formativa adecuada.   \nObjetivos: \nLos objetivos perseguidos por esta línea de actuación son los siguientes: \n \nMejorar la visibilidad del sector del procesamiento de lenguaje natural y de la traducción \nautomática.  \n \nTrasladar la excelencia investigadora española a la industria. Garantizar la disponibilidad \nde doctores especialistas y formar nuevos investigadores y desarrolladores en estas \náreas.  \nMedidas: \n- Medida 1: Elaborar un plan de mejora de la visibilidad y de la transferencia. \n- Medida 2: Planificar y coordinar acciones encaminadas a la mejora de la visibilidad y la \nformación en el sector con otras Administraciones y especialmente con Iberoamérica. \n- Medida 3: Elevar la formación: Inclusión de asignaturas específicas sobre tecnologías del \nlenguaje en el currículum académico, impulso de la creación de contenidos formativos en \nlínea [MooCs], hackathones, apoyo a programas de doctorado industrial, másters y becas \nespecializadas. \n- Medida 4: Elevar la visibilidad: Jornadas de formación básica para PyMES y profesionales; \nCongresos, foros y participación en ferias nacionales e internacionales. Impulso a centros \ndemostradores en línea (SaaS). Coordinación con el portal propuesto en el Eje 1. \n \n \nLínea 2: Apoyo a la internacionalización y comercialización del sector  \n",
  "speaker": "SYSTEM",
  "uuid": "df6a551a-9714-4215-9823-fbf967f7939f"
}