{
  "message": "SYSTEM: CVIdafenSP_CICYT_Resumido_20160329_.pdf: Página 3\n \n3 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nUniversity of Mannheim (Alemania); University of Zurich (Suiza); STI International; \nOpen University (Reino Unido) y Oxford University (Reino Unido). Presupuesto \nFacultad de Informática: 1.030.067 €. 01/06/2009 – 30/06/2012.  Investigador \nresponsable: Asunción Gómez Pérez (coordinadora). Participación: investigador. \n \nLPS-BIGGER (IDI-20141259) CDTI. Indra, Havas Media, Fractalia, Playence. \nPresupuesto \nFacultad \nde \nInformática: \n250.000€. \n2015-2018. \nInvestigador \nresponsable por la UPM: Asunción Gómez Pérez y Óscar Corcho García. \nParticipación: investigador. \n \n3cixty: A Platform for Apps and Services Offering Comprehensive Views for \nCity Visitors (EIT ICT Labs-14523). Unión Europea. Eurecom, UMilano, CEFRIEL, \nDFKI, Telecom Italia, Fundazione Politecnico di Milano, Inria, Politecnico di Milano, \nTUDelft, University College London. Presupuesto Facultad de Informática: 135.000€. \n01-01-2015 – 31-12-2016. Investigador responsable por la UPM: Óscar Corcho \nGarcía. Coordinador del proyecto: Anthony Jameson. Participación: investigador. \n \nC.3. Contratos, méritos tecnológicos o de transferencia \nN/A. \n \nC.4. Patentes \n \nN/A. \n \nC.5. Organización de eventos científicos \n \n2014 IEEE International Conference On Cluster Computing, Miembro del comité de \nprograma local. \n \n2012 International Conference on High Performance Computing & Simulation,  \nMiembro del comité de programa. \n \n5th International Conference on Cloud Computing IEEE CLOUD 2012, Session Chair. \n \nC.6. Revisión de contribuciones científicas en conferencia \n \nIEEE Cluster 2015 \n \nESWC 2015 \n \nEuro-Par 2014 \n \nEuro-Par 2013 \n \nISPA 2012 \n \nEuro-Par 2011 \n \nCloudcom 2010. \n",
  "speaker": "SYSTEM",
  "uuid": "e012974b-a20b-4f77-b608-f042a1a5a016"
}