{
  "message": "SYSTEM: Cicyt_Vilches.pdf: Página 14\nAutores: Vilches Blázquez, L.M.; Cañete Pérez, J.A.; Corcho, O. y Bernabé Poveda, M.A. \nTítulo: Interrelaciones entre las tecnologías de la información geográfica y la ingeniería ontológica para la mejora de la \ngestión de los recursos geoespaciales \nTipo de participación: Póster \nCongreso: XIII Congreso Nacional de Tecnologías de la Información Geográfica  \nPublicación: Actas del XIII Congreso Nacional de Tecnologías de la Información Geográfica. Hernández Calvento, L.; \nParreño Castellano, J.M. (eds.) ISBN: 978-84-96971-53-0 \nLugar celebración: Las Palmas de Gran Canaria.  \nFecha: 15-19 de septiembre de 2008. \n \n \nAutores: Gómez-Pérez A, Ramos JA, Rodríguez-Pascual AF, Vilches-Blázquez LM \nTítulo: The IGN-E case: Integrating through a hidden ontology \nCongreso: The 13th International Symposium on Spatial Data Handling (SDH 2008) \nPublicación: The In Headway in Spatial Data Handling. 13th SDH’08. Lecture Notes in Geoinformation and Cartography, \nRuas, A., Gold, C. (Eds.) pp. 417-435. ISBN: 978-3-540-68565-4 \nLugar celebración: Montpellier, Francia \nFecha: 23-25 de junio de 2008 \n \n \nAutores: Luis Manuel Vilches Blázquez, Alberto Fernández Wyttenbach, Mabel Álvarez, Miguel Ángel Bernabé. \nTítulo: “Thesauri Design to improve access to Cartographic Heritage in the context of the Spatial Data Infrastructures” \nTipo de participación: Comunicación \nCongreso: Tenth International Conference for Spatial Data Infrastructure (GSDI) \nPublicación: En GSDI 10 conference proceedings \nLugar celebración: St. Augustine, Trinidad & Tobago. \nFecha: 25 – 29 February, 2008.  \n \n \nAutores: Luis Manuel Vilches Blázquez, José Antonio Cañete Pérez, Oscar Corcho, Miguel Ángel Bernabé Poveda, Antonio \nF. Rodríguez Pascual \nTítulo: Pertinencia de Aplicación de la Ingeniería Ontológica a la Planificación Hidráulica del Territorio \nTipo de participación: Comunicación \nCongreso: 5th International Congress for Spatial Planning  \nPublicación: Actas del 5th International Congress for Spatial Planning. Páginas 270-279. ISBN: 978-84-691-9144-6 \nLugar celebración: Málaga (Spain)    \nFecha:22 – 24th November, 2007.  \n \n \nAutores: López-Pellicer, F.J.; Vilches-Blázquez, L.M.; Nogueras-Iso, J.; Corcho, O.; Bernabé, M.A.; Rodríguez, A.F. \nTítulo: “Using a hybrid approach for the development of an ontology in the hydrographical domain” \nTipo de participación: Comunicación \nCongreso: 2nd Workshop Ontologies for urban development: Conceptual models for practitioner \nPublicación: Conceptual Models for Urban Practitioners. J. Teller; C. Tweed; G. Rabino (Eds.). Società Editrice Esculapio, \npp. 43 – 56. Bologna, Italy. 2008, ISBN 88-7488-208-4 \nLugar celebración: Castello del Valentino, Turín (Italy) \n Fecha 17 – 18th October, 2007.  \n \n6 \n \nAutores: Antonio F. Rodríguez Pascual, Sebastián Mas Mayoral, Paloma Abad Power, José Ángel Alonso Jiménez, Juan \nEmilio Ayuso, Alejandra Sánchez Maganto, Luis Manuel Vilches Blázquez. \nTítulo: “Una nueva etapa: hacia la IDE 2.0” \nTipo de participación: Comunicación \nCongreso: IV Jornadas de la Infraestructura de Datos Espaciales de España (JIDEE) \nPublicación: La Infraestructura de Datos Espaciales en 2007. Proyectos, servicios y nodos. Gallego Priego, M.; Garaboa \nFernández, X.; González Pérez, P. A.; Landeira Vega, F.; Ríos Viqueira, J. R. (eds.). ISBN: 84-690-8674-2 \nLugar celebración: Santiago de Compostela   \nFecha 17 – 19 Octubre, 2007 \n \n \n                                                      \nNota: Si necesita más casos, añádalos utilizando las funciones de copiar y pegar con el 2º caso. \n",
  "speaker": "SYSTEM",
  "uuid": "e0f4df02-72e7-4bc4-9584-f276d545dad5"
}