{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 5\nLleida, Universidad Europea de Madrid, Universidad San Pablo CEU, Universidad de Zaragoza, Universidad de Santiago de \nCompostela, Universidad de Murcia, Universidad de Málaga, Universidad Carlos III de Madrid, Universidad de Extremadura, \nUniversidad de Sevilla, Fundación CTIC, Universidad de Oviedo \nDuración,  desde: Enero 2011 \nhasta: Marzo 2012  \nCuantía de la subvención: 22.000 € (total) \nInvestigador responsable: Oscar Corcho García  \nInvestigador responsable por la UPM: Oscar Corcho García  \nNúmero de investigadores participantes: 287 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: SEALS. Semantic Evaluation at Large Scale (FP7-238975)  \n \nEntidad financiadora: Unión Europea \nConvocatoria: Framework Programme 7 \nEntidades participantes: Universidad Politécnica de Madrid, University of Sheffield, FZI, University of Innsbruck, INRIA, \nUniversity of Mannheim, University of Zurich, STI International, Open University, Oxford University \nDuración,  desde: Junio 2009 \nhasta: Junio 2012  \nCuantía de la subvención: 3.500.000 € (total) \n834.865 € (UPM) \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 38 \nTipo de participación: Quality Assurance Coordinator y Miembro del equipo investigador \n \n \nTítulo del proyecto: DynaLearn. Engaging and informed tools for learning conceptual system knowledge (FP7-231526)  \n \nEntidad financiadora: Unión Europea \nConvocatoria: Framework Programme 7 \nEntidades participantes: University of Amsterdam, Universidad Politécnica de Madrid, University of Augsburg, University of \nBrasilia, Tel Aviv University, University of Hull, Bulgarian Academy of Sciences  y University of Natural Resources and \nApplied LifeSciences \nDuración,  desde: Febrero 2009 \nhasta: Abril 2012  \nCuantía de la subvención: 2.450.000 € (total) \n \n \n \n \n \n \n \n \n \n \n418.842 € (UPM) \nInvestigador responsable: Bert Bredeweg \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nNúmero de investigadores participantes: 32 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: España Virtual (CENIT2008-1030) \n \nEntidad financiadora: Centro para el Desarrollo Tecnológico Industrial (CDTI). Ministerio de Ciencia e Innovación \nConvocatoria: Programa de creación de Consorcios Estratégicos Nacionales de Investigación Técnica (CENIT) 2008 \nEntidades participantes: Deimos Space, Androme Iberica, Centro Nacional de Información Geográfica, Dnextep Consulting, \nGrid Systems, GeoSpatiumLab, GeoVirtual, Indra Espacio. OPIs y CITs subcontratadas: Universidad Politécnica de Madrid, \nUniversidad de Zaragoza, UNED, Universidad Politècnica de Catalunya, Universidad Jaume I, Universidad de Valladolid, \nUniversidad de las Islas Baleares, Universidad Carlos III de Madrid, Universidad de Málaga, Barcelona Media. \nDuración,  desde: Octubre 2008 \nhasta: Enero 2012  \nCuantía de la subvención: 25.192.648 € (total) \n \n \n \n \n \n \n \n \n \n             1.010.504 € (UPM) \nInvestigador responsable: Carlos Fernández de la Peña  \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nNúmero de investigadores participantes: más de 100 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: SemsorGrid4Env. Semantic Sensor Grids for Rapid Application Development for Environmental \nManagement (FP7-223913) \n \n",
  "speaker": "SYSTEM",
  "uuid": "e12a415f-7d8c-48fd-a4e6-8246f695e85a"
}