{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 16\n16\nAndr´es Garc´ıa-Silva et al.\nIn 1st International Workshop on Collective Semantics: Collective Intelligence & the\nSemantic Web (CISWeb 2008). Tenerife, Spain (2008)\n6. Cattuto, C., Benz, D., Hotho, A., and Stumme, G.: Semantic Grounding of Tag\nRelatedness in Social Bookmarking Systems. In the 7th international Conference on\nthe Semantic Web. Karlsruhe, Germany (2008)\n7. Espinoza, M., G´omez-P´erez, A., Mena, E.: Enriching an ontology with multilingual\ninformation. In the 5th European Semantic Web Conference. (2008)\n8. Garc´ıa-Silva, A., Corcho, O., Alani, H., G´omez-P´erez, A.: Review of the state of the\nart: Discovering and Associating Semantics to Tags in Folksonomies. To appear in\nThe Knowledge Engineering Review (2010)\n9. Garc´ıa-Silva, A., Corcho, O., Gracia, J.: Associating Semantics to Multilingual Tags\nin Folksonomies (Poster). To appear in the 17th International Conference on Knowl-\nedge Engineering and Knowledge Management EKAW. Lisbon, Portugal (2010).\n10. Giannakidou, E., Koutsonikola, V., Vakali, A., Kompatsiaris, Y.: Co-Clustering\nTags and Social Data Sources. In 9th International Conference On Web-Age Infor-\nmation Management (WAIM 2008). (2008)\n11. Golder, S. A. and Huberman, B. A. 2006. Usage patterns of collaborative tagging\nsystems. J. Inf. Sci. 32, 2 (2006), 198-208.\n12. Gracia, J., Mena, E.: Multiontology semantic disambiguation in unstructured web\ncontexts. In Workshop on Collective Knowledge Capturing and Representation (CK-\nCaR09) at K-CAP 2009, Redondo Beach, California (USA), 2009.\n13. J¨aschke, R., Hotho, A., Schmitz, C., Ganter, B. Stumme, G.: Discovering shared\nconceptualizations in folksonomies. Journal of Web Semantics 6(1), 38–53 (2008)\n14. Kaplan, A.: An experimental study of ambiguity and context. Mechanical Trans-\nlation 2(9), 39–46 (1955)\n15. Kim, H. L., Scerri, S., Breslin, J. G., Decker, S. & Kim, H. G.: The state of the art in\ntag ontologies: a semantic model for tagging and folksonomies. In the international\nConference on Dublin Core and Metadata Applications. Berlin, Germany (2008)\n16. Marlow, C., Naaman, M., Boyd, D., Davis, M.: HT06, tagging paper, taxonomy,\nFlickr, academic article, to read. In the seventeenth conference on Hypertext and\nhypermedia (HYPERTEXT ’06). Odense, Denmark (2006)\n17. Mika, P.: Ontologies are us: A uniﬁed model of social networks and semantics.\nJournal of Web Semantics 5(1), 5–15 (2007)\n18. Qiu, Y., Frei, H.P.: Concept Based Query Expansion. In 16th ACM International\nConference on Research and Development in Information Retrieval (SIGIR-93).\nPittsburgh, USA (1993)\n19. Tagora sense repository, http://tagora.ecs.soton.ac.uk/tsr/index.html\n20. Tesconi, M., Ronzano, F., Marchetti, A., Minutoli, S.: Semantify del.icio.us: Auto-\nmatically Turn your Tags into Senses. In Social Data on the Web, Workshop at the\n7th International Semantic Web Conference. Karlsruhe, Germany (2008)\n21. Vossen, P.: Eurowordnet: a Multilingual Database with Lexical Semantic Networks.\nKluwer Academic Publishers. (1998)\n22. Baeza-Yates, R. A. Ribeiro-Neto, B.: Modern Information Retrieval. Addison-\nWesley Longman Publishing Co., Inc. (1999)\n23. Jarvelin, K., Kekalainen, J.: Cumulated Gain-based Evaluation of IR Techniques.\nACM Transactions on Information Systems 20(4), 422-446 (2002)\n24. Voorhees, E. M.: TREC-8 Question Answering Track Report. In the 8th Text\nRetrieval Conference, 77-82 (1999)\n25. Fleiss, J. L., Cohen, J.: The Equivalence of Weighted Kappa and the Intraclass\nCorrelation Coeﬃcient as Measures of Reliability. Educational and Psychological\nMeasurement 33, 613-619 (1973)\n",
  "speaker": "SYSTEM",
  "uuid": "e143fe04-a97d-4adf-b6d1-960fb3919b2f"
}