{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 18\nmen de mercado pero en cuyo capital participa el Estado, al menos en un cincuenta por\nciento31. Esta fórmula otorga gran flexibilidad a las empresas así constituidas para conse-\nguir fines de interés público, pero mediante su regulación por el ordenamiento jurídico pri-\nvado, salvo en materia presupuestaria, contable, control financiero y contratación32.\nLa personalidad jurídica de las fundaciones públicas radica en el porcentaje de partici-\npación de capital del Estado en ellas, que debe ascender al menos al cincuenta por ciento,\ny al igual que las sociedades mercantiles, se rigen por el derecho privado, por lo que tam-\npoco pueden ejercer potestades públicas. La diferencia entre ambas viene determinada\nfundamentalmente por su forma organizativa, y no por su actividad o régimen jurídico. Por\nsi tal variedad de entidades no bastara se han ido configurando en los últimos años una\ngran cantidad de organismos, básicamente de derecho privado, que cuentan con estatutos\npropios de funcionamiento y al margen de las configuraciones generales de los organismos\npúblicos. Esta categoría nació como complementaria de las generales ante la necesidad de\ndotar a unos pocos entes de un mayor grado de independencia, ya que por sus específicas\ncaracterísticas no encajaban en el régimen establecido. Algunos autores los agrupan bajo\nla denominación “entes públicos o apátridas” 33, mientras que otros prefieren la expresión\n“administración independiente” 34. \nEl Estado mediante la actual Ley 28/2006, de 18 de julio, de Agencias estatales para la\nmejora de los servicios públicos pretende implantar un modelo de gestión que equilibre\nadecuadamente los principios de autonomía, control y responsabilización por resultados,\nasí como establecer un régimen general lo suficientemente operativo para dar cabida a\naquellos Organismos para los que la categoría de Organismo Autónomo es insuficiente,\nsin tener que acudir, como sucede en la actualidad, a soluciones particulares para cada\ncaso. Por esta razón los diversos organismos públicos existentes se irán reconduciendo a\nesta nueva fórmula.\nLas agencias estatales se definen en la ley como entidades de Derecho público, dota-\ndas de personalidad jurídica pública, patrimonio propio y autonomía en su gestión, facul-\ntadas para ejercer potestades administrativas, que son creadas por el Gobierno para el cum-\nplimiento de los programas correspondientes a las políticas públicas que desarrolle la\nAdministración General del Estado en el ámbito de sus competencias35. \nAnte la compleja situación que presenta la Administración Instrumental, como se ha\nexpuesto, y la imposibilidad de abarcarla en su totalidad, se optó por seleccionar aquellos\nentes regulados por el derecho público, incluyendo aquí algunos de los denominados apá-\ntridas por su especial relevancia y significación, pero dejando fuera de la investigación\naquellas otras entidades públicas sujetas al derecho privado: consorcios, entidades públi-\ncas empresariales, sociedades mercantiles y fundaciones del sector público. Asimismo\nquedan al margen de este estudio las universidades, las reales academias y los colegios\nLA ADMINISTRACIÓN GENERAL DEL ESTADO Y SUS BASES DE DATOS\n23\n31 Definición tomada de OLÍAS DE LIMA. Manual, p. 155.\n32 LOFAGE. Disposición adicional duodécima.\n33 PARADA. Derecho Administrativo, pp. 270-72.\n34 OLÍAS DE LIMA. Manual, pp. 152-153.\n35 Art. 21 de la citada Ley de Agencias Estatales. Se creaban ya las siguientes: Consejo Superior de Investigaciones\nCientíficas, Agencia Estatal Antidopaje de España, Agencia Estatal de Inmigración y Emigración, Agencia Estatal de\nSeguridad Aérea, Agencia Estatal de Seguridad del Transporte Terrestre, Agencia Estatal de Artes Escénicas y\nMusicales, Agencia Estatal de Meteorología, Agencia Española de Cooperación Internacional para el Desarrollo,\nAgencia Estatal de Investigación en Biomedicina y Ciencias de la Salud Carlos III, y Agencia Estatal de Evaluación,\nFinanciación y Prospectiva de la Investigación Científica y Técnica (Disposición adicional tercera).\nBASES DE DATOS  1/1/04  03:39  Página 23\n",
  "speaker": "SYSTEM",
  "uuid": "e35ca063-a35c-48a7-9881-60a70ea9006b"
}