{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 21\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n2.6 Metadatos \n1. Iniciativa Dublin Core Metadata \n- \nhttp://dublincore.org/ \n- \nDublin Core Metadata Initiative (DCMI) is una organización dedicada a \npromover la adopción generalizada de estándares de metadatos interoperables y \nel desarrollo de vocabularios de metadatos especializados para describir fuentes \nde forma que representen una información más inteligente para los sistemas. \n2.7 Ontologías \nEl objetivo de estas prácticas es desarrollar una ontología para el dominio del arte en el Camino \nde Santiago. Sin embargo, no es necesario ni eficiente crear una nueva ontología desde cero sino \nque podemos utilizar ontologías ya existentes y consensuadas que se adapten completa o \nparcialmente a nuestro dominio. A continuación aparece un conjunto de ontologías que nos \npueden ser de gran utilidad en el problema. \n1. CIDOC - Conceptual Reference Model (CRM) \n- \nhttp://cidoc.ics.forth.gr/ \n- \nhttp://www.bnf.fr/pages/version_espagnole/normes/no-acCRM_spa.htm \n- \nPublicado por: International Council of Museums \n- El modelo CIDOC CRM es un modelo semántico de referencia elaborado \ndesde 1994 por el Grupo de normalización documental (Documentation \nStandards Group) del Comité internacional para la documentación del Consejo \ninternacional de museos (ICOM-CIDOC). La versión 4.0 (con fecha de marzo de \n2004) \nestá \ndisponible \nen \nlínea \nen \nlas \ndirecciones: \n<http://cidoc.ics.forth.gr/docs/cidoc_crm_version_4.0.doc> en formato Word \n(1.04Mo) \ny \n<http://cidoc.ics.forth.gr/docs/cidoc_crm_version_4.0.pdf> \nen \nformato PDF (701 Ko). \n- \nEl CIDOC CRM ha sido publicado por la ISO como norma internacional (ISO \nDIS 21127:2006) en la segunda mitad de 2005. \n- \nSe trata de un modelo semántico que constituye una “ontología” de la \ninformación relativa al patrimonio cultural, es decir una formalización de las \nrelaciones que unen los conceptos fundamentales de este tipo de información. Su \npresentación se basa en el enfoque “orientado al objeto”.El modelo CRM trata \nfundamentalmente de proporcionar un lenguaje común a yacimientos de \ninformación heterogéneos y permitir que se integren, independientemente de sus \nposibles incompatibilidades tanto semánticas como estructurales. Se trata pues de \nfacilitar el intercambio y la búsqueda de informaciones en el ámbito del \npatrimonio cultural y permitir a los museos hacer compatibles sus respectivas \n \n21\n",
  "speaker": "SYSTEM",
  "uuid": "e35e137d-2e2c-49a0-af92-bbc4873bf7f7"
}