{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 18\nGu´ıa de orientaci´on para investigadores noveles\n18\nelegir un centro de destino que tenga cierto prestigio en nuestro\ncampo de investigaci´on, ya que el intercambio nos enriquecer´a mucho\nprofesionalmente. Existen p´aginas Web d´onde se ordenan las universi-\ndades de todo el mundo en funci´on de su prestigio. Seg´un uno de estos\nsitios Web (v´ease el anexo A), la Universidad de Harvard (EE.UU.)\nes la que ocupa la primera posici´on, seguida de la Universidad de\nStanford (EE.UU.) y la Universidad de California-Berkeley (EE.UU.).\nLa primera universidad europea que encontramos en este listado se\nsit´ua en la cuarta posici´on y se trata de la Universidad de Cambridge\n(Reino Unido). En este apartado se puede obtener una puntuaci´on\nm´axima de 9 puntos, por tanto ser´a siempre conveniente realizar como\nm´ınimo una estancia en otro centro (si es internacional, mejor) y se\nvalorar´a m´as si ese centro es de reconocido prestigio. Si el investigador\nes beneﬁciario de una beca FPI o FPU, la estancia en otros centros\nestar´a contemplada dentro de la beca y se dar´an ayudas espec´ıﬁcas\npara tal ﬁn. Si no se es beneﬁciario de ninguna beca, existen ayudas\nespec´ıﬁcas desde el Ministerio correspondiente, la universidad o en\nocasiones, desde el propio departamento o grupo, para ﬁnanciar\ndichas estancias.\nB.3. Experiencia docente\nEn este apartado se valora la amplitud, la intensidad, los ciclos\ny el tipo de la docencia en su ´ambito disciplinar universitario, en\nense˜nanzas regladas y no regladas. Se tienen en cuenta las evaluaciones\nsobre la calidad de su docencia que aporte el solicitante as´ı como\nla participaci´on en proyectos de innovaci´on docente, y en planes y\nequipos de trabajo relacionados con el Espacio Europeo de Educaci´on\nSuperior (EEES). En la Universidad de Alicante peri´odicamente se\nles proporciona a los alumnos unas encuestas para que eval´uen a\nlos profesores que les han impartido docencia en alguna asignatura.\nHace algunos a˜nos someterse a dicha evaluaci´on era completamente\nvoluntario, pero en la actualidad se enmarca dentro de una serie\nde acciones que la Universidad de Alicante va a llevar a cabo para\nmedir la calidad del profesorado bajo el nombre del programa “DO-\nCENTIA”, de car´acter obligatorio y, por lo tanto, todo el personal\ndocente deber´a ser evaluado. Est´a evaluaci´on comprender´a periodos\nde docencia de cinco a˜nos. Por otra parte, el Instituto de Ciencias de\nla Educaci´on (ICE) de la Universidad de Alicante, organiza programas\ny seminarios relacionados con la docencia y el EEES destinados,\nprincipalmente, al PDI de la universidad (los becarios de investigaci´on\ntambi´en se pueden apuntar, pero s´olo en caso de quedar plazas\nvacantes, podr´an asistir, y generalmente, no suelen quedar muchas\n",
  "speaker": "SYSTEM",
  "uuid": "e372a6a9-f90c-4d0b-8d2f-8eb77024fb4a"
}