{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 272\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n278\n435.- Buscador del canal de video del ICEX\nDirección Web: http://player27.narrowstep.tv/nsp.aspx?player=ix27_ca\nOrganismo editor: Instituto Español de Comercio Exterior (ICEX).\nClase de información:\nFormato de presentación:\nNoticias y actualidad\nImagen/Texto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Comercio Exterior.\nDescripción y comentarios: Buscador de documentos audiovisuales relacionados con el\nICEX. Permite una búsqueda por materias relacionadas con la exportación: agroalimenta-\nción y bebidas, formación, moda y hábitat, y por submaterias o subcategorías encuadradas\ndentro de éstas. Cada resultado permite el acceso directo a un reproductor de documentos\naudiovisuales que permite la visualización total.\n436.- Buscador por sectores de comercio exterior\nDirección Web:\nhttp://www.icex.es/icex/cda/controller/pageICEX/0,6558,5518394_5518995_5602209_0\n_0_-1,00.html\nOrganismo editor: Instituto Español de Comercio Exterior (ICEX).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nImagen/Texto\nTipo de información: \nTipos de consulta: \nTexto completo\nAvanzada\nMateria: Comercio Exterior\nDescripción y comentarios: Presenta información de los sectores de comercio exterior.\nAunque la página del enlace no es en realidad una base de datos, sí se puede acceder a toda\nuna colección de bases de datos dentro de cada sector. En cada una de ellas se puede acce-\nder a datos relacionados con el comercio con los países seleccionados en el sector en el\nque se realiza la búsqueda. Los sectores son el agroalimentario, bebidas, bienes de consu-\nmo, industria y tecnología y servicios. Dentro de cada uno de ellos las subcategorías con-\ntienen la base de datos a la que nos hemos referido.\nBASES DE DATOS  1/1/04  03:39  Página 278\n",
  "speaker": "SYSTEM",
  "uuid": "e39d1d03-f998-4cda-a863-6721ac789c31"
}