{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 27\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 27 de 42 \n1. Aguado de Cea G, Barrios MA, Campanella I, Montiel E, Muñoz O, V. Rodríguez V. \nAnálisis de sentimientos en un corpus de redes sociales. 31er Congreso Asociación \nEspañola de Lingüística Aplicada. \"Comunicación, Cognición y Cibernética\" (2013). La \nLaguna, 18-20 abril 2013. \n2. Alonso, Tapia, Bajo, Corchado. Implementing a Hardware-Embedded Reactive Agents \nPlatform Based on a Service-Oriented Architecture over Heterogeneous Wireless \nSensor Networks. Ad Hoc Networks. ISSN 1570-8705. Enero 2013. \n3. Alvarez de Mon I, Aguado de Cea G. \"De perlas\", \"de pena\" y otras expresiones \nvalorativas frecuentes en los blogs de viajes en español. XII Congreso de la Asociación \nEuropea de Lenguas para fines específicos, A Coruña. 2013 \n4. Arias Gallego M, Corcho O, Fernández J, Martinez-Prieto M, Suárez-Figueroa MC. \nCompressing Semantic Metadata for Efficient Multimedia Retrieval \nMulticonference \nCAEPIA 2013.  Madrid (Spain). Septiembre 2013 \n5. Bajo. Intelligent Systems in Context-Based Distributed Information Fusion. International \nJournal of Distributed Sensor Networks. ISSN: 1550-1329. 2013 \n6. Bajo. Personalization of the workplace through a proximity detection system using user \nprofiles. International Journal of Distributed Sensor Networks. ISSN: 1550-1329. 2013. \n7. Bajo (Ed). Special Issue on Artificial Intelligence and Distributed Systems. International \nJournal of Artificial Intelligence (IJAI). ISSN: 0974-0635. 2013 \n8. Bajo. A multiagent system for resource distribution into a Cloud Computing \nenvironment. Advances in Practical Applications of Agents and Multiagent Systems. \nSpringer Verlag. ISBN: 978-3-642-38072-3. 2013 \n9. Bajo. Cloud: United Platform for Compilation and Execution Processes in a Cloud. \nAdvances in Artificial Intelligence. Springer-Verlag. ISBN: 978-3-642-40642-3. 2013. \n10. Bajo (Ed). Highlights in Practical Applications of Agents and Multiagent Systems. \nProceedings International Workshops of PAAMS 2013 Salamanca, Spain, May 22-24, \n2013. \n11. Bajo. A multiagent system for resource distribution into a Cloud Computing \nenvironment. 11th International Conference, PAAMS 2013, Salamanca, Spain, May 22-\n24, 2013. ISBN: 978-3-642-38072-3. \n12. Bajo. A new generation of Learning Object Repositories based on Cloud Computing. \nSecond International Symposium on Management Intelligent Systems. ISBN: 978-3-\n319-00568-3. Berlín, Alemania. May 22-24, 2013. \n13. Bajo. Agentes embebidos para la gestión de sonidos. International Symposium on \nArtificial Intelligence and Assistive Technology. ISBN: 978-84-695-8320-3. Madrid, \nEspaña. September 17-20, 2013. \n14. Bajo. Applying classifiers in indoor location system. Trends in Practical Applications of \nAgents and Multiagent Systems 11th International Conference on Practical Applications \nof Agents and Multi-Agent Systems. ISBN: 978-3-319-00562-1. Berlín, Alemania. May \n22-24, 2013. \n15. Bajo. Asignación de roles automática en organizaciones virtuales de agentes. CAEPIA \n2013. ISBN: 978-84-695-8348-7. Madrid, España. September 17-20, 2013. \n16. Bajo. .Cloud: Unified Platform for Compilation and Execution Processes in a Cloud. \n15th Conference of the Spanish Association for Artificial Intelligence, CAEPIA 2013, \nMadrid, Spain, September 17-20, 2013. \n17. Bajo. Cloud-based platform to labor integration of deaf people. 10th International \nSymposium on Distributed Computing and Artificial Intelligence. ISBN: 978-3-319-\n00550-8. Berlin, Alemani. May 22-24, 2013. \n18. Bajo. Data Integration in Cloud Computing Environment. Eureka-2013. Fourth \nInternational Workshop. ISBN: 978-90-78677-86-4. Mazatlan (Mexico). November 6-8, \n2013. \n19. Bajo. Real time positioning system using different sensors. 16th International \nConference on Information Fusion. ISBN: 978-605-86311-1-3. Istanbul, Turkey. July 9-\n12, 2013. \n20. Bajo. Sistema para la telemonitorización y la gestión del rastro asistencial de personas \nancianas. International Symposium on Artificial Intelligence and Assistive Technology \n(CEDI 2013). ISBN: 978-84-695-8320-3. Madrid, España. September 17-20, 2013. \n21. Bajo. Technological platform to facilitate the labor integration of people with auditory \nimpairements. International Symposium on Management Intelligent Systems. ISBN: \n978-3-319-00568-3. Salamanca, España. May 22-24, 2013. \n",
  "speaker": "SYSTEM",
  "uuid": "e5a79916-b4b3-48f2-9ceb-3dbce5200761"
}