{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 25\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 25 of 124\n– To augment a number of concepts with additional slots and ﬁllers, for example, concepts repre-\nsenting a style or period were augmented with slots time period from, time period to, general style\nand region.\n– To add knowledge of the relation between possible values of ﬁelds and nodes in the knowledge\nbase.\nThe method produces one ontology. The ontology components generated are classes, attributes,\nand relations and they are implemented in RDF(S).\n• Hyvönen et al. in [HVTS08] present a method for transforming thesauri into ontologies. The method\nhas been applied to the YSA thesaurus22.\nDOLCE23 was employed for the transformation. The\nauthors point out that although a syntactic transformation into SKOS [MB05] can be useful, it is not\nenough from a semantic viewpoint. They also stated that unless the meaning of the semantic relations\nof a thesaurus is made more explicit and accurate for the computer to interpret, the SKOS version is as\nconfusing to the computer as the original thesaurus. Therefore, this method for thesaurus to ontology\ntransformation is not a syntactic one since it is done by reﬁning and enriching the semantic structures\nof a thesaurus. It follows the approach used for transforming resource content into an ontology\nschema. To accomplish this, the transformation is made automatically with an ad-hoc tool, and then is\nreﬁned by hand in order to distinguish multiple meanings and to build a full subClassOf hierarchy based\non NT/RT relationships of thesauri. However, no information about the implementation of the YSA the-\nsaurus is provided. This method contemplates syntactic transformation aspects and how symbols\nare structured in the thesaurus and ontology formats. It also contemplates semantic transformation\naspects and the semantic interpretation of the resource elements when deﬁning transformations to\nontology elements. This method tackle the internal data model of the thesaurus, since it describes\nhow the resource data is represented and accessed for the transformation. The method provides\nresource provenance information, so the resultant ontology keeps the reference to the thesaurus. It\nis based on the following semantic reﬁnements and extensions in the thesaurus structure:\n– Missing links in the subClassOf hierarchy.\nThe Broader Term (BT) relations do not, usually,\nstructure the terms into a full-blown hierarchy but into a forest of separate smaller subhierarchies.\nTheir central structuring principle in constructing the hierarchies is to avoid multiple inheritance.\n– Ambiguity of the BT relations. BT relation may mean either subClassOf relation, partOf relation\nor instanceOf relation.\n– Non-transitivity of the BT relation. The transitivity of the BT relation chains is not guaranteed from\nthe instance-class-relation point of view.\n– Ambiguity of concept meanings. Many terms in thesauri are ambiguous and cannot be related\nproperly to each other in the hierarchy using the subClassOf relation.\nThe resultant ontology, based on the YSA thesaurus, is the General Finnish Ontology YSO24. The\nontology components generated are classes, attributes, and relations and they are expressed in\nRDF(S).\n• Soergel et al. in [SLL+04], and Lauser et al. in [LS06] present a method for the re-engineering of\ntraditional thesaurus, AGROVOC25, into a fully-ﬂedged ontology. The original AGROVOC thesaurus\nis stored in a database.\nSoergel et al. explore the applicability of the rules-as-you-go approach to improve the re-engineering\nprocess. The method is based on the approach to transforming resource content into an ontology\n22http://vesa.lib.helsinki.fi/\n23http://www.loa-cnr.it/DOLCE.html\n24http://www.yso.fi/onto/yso\n25http://www.fao.org/aims/ag_intro.htm\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "e790a882-d052-4126-8837-b0e00c53938e"
}