{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 119\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 119 of 124\n[BS 05a]\nBritish Standards Institution, BSI. Documentation – Structured vocabularies for information\nretrieval - Guide - Part 1: Deﬁnitions, symbols and abbreviations., 2005. Report BS 8723-1.\n[BS 05b]\nBritish Standards Institution, BSI. Documentation – Structured vocabularies for information\nretrieval - Guide - Part 2: Thesauri., 2005. Report BS 8723-2.\n[BS 05c]\nBritish Standards Institution, BSI. Documentation – Structured vocabularies for information\nretrieval - Guide - Part 5: Exchange formats and protocols for interoperability., 2005. Report\nBS 8723-5.\n[Car02]\nB.\nCarkenord.\nWhy\nBuild\na\nLogical\nData\nModel.\nhttp://www.embarcadero.com/resources/tech_papers/datamodel.pdf, 2002.\n[Chi98]\nNancy A. Chinchor.\nProceedings of the Seventh Message Understanding Conference\n(MUC-7) named entity task deﬁnition.\nIn Proceedings of the Seventh Message Under-\nstanding Conference (MUC-7), page 21 pages, Fairfax, VA, April 1998.\nversion 3.5,\nhttp://www.itl.nist.gov/iaui/894.02/related_projects/muc/.\n[CMB+02]\nH. Cunningham, D. Maynard, K. Bontcheva, V. Tablan, and C. Ursu. The GATE User Guide.\nhttp://gate.ac.uk/, 2002.\n[CMBT02]\nH. Cunningham, D. Maynard, K. Bontcheva, and V. Tablan. GATE: A Framework and Graph-\nical Development Environment for Robust NLP Tools and Applications. In Proceedings of\nthe 40th Anniversary Meeting of the Association for Computational Linguistics (ACL’02),\n2002.\n[CMT00]\nH. Cunningham, D. Maynard, and V. Tablan. JAPE: a Java Annotation Patterns Engine\n(Second Edition). Research Memorandum CS–00–10, Department of Computer Science,\nUniversity of Shefﬁeld, November 2000.\n[Col02]\nM. Collins. Ranking algorithms for named entity extraction: Boosting and the voted percep-\ntron. In Proceedings of the 40th Annual Annual Meeting of the Association for Computa-\ntional Linguistics (ACL’02), Philadelphia,PA, 2002.\n[Cor05]\nO. Corcho, editor. A Layered Declarative Approach to Ontology Translation with Knowledge\nPreservation. IOS Press, 2005.\n[CV05]\nP. Cimiano and J. Voelker. Text2Onto - A Framework for Ontology Learning and Data-driven\nChange Discovery. In Proceedings of the 10th International Conference on Applications of\nNatural Language to Information Systems (NLDB), Alicante, Spain, 2005.\n[CV07]\nR. Cilibrasi and P. Vitanyi. The google similarity distance. Transactions on Knowledge and\nData Engineering, IEEE, 19(3):370–383, 2007.\n[CW03]\nS. Cederberg and D. Widdows. Using lsa and noun coordination information to improve the\nprecision and recall of automatic hyponymy extraction. In Proceedings of the 7th conference\non Natural language learning at HLT-NAACL, pages 111–118, Morristown, NJ, 2003.\n[CXH04]\nI. F. Cruz, H. Xiao, and F. Hsu. An ontology-based framework for xml semantic integration.\nIn IDEAS ’04: Proceedings of the International Database Engineering and Applications\nSymposium, pages 217–226, Washington, DC, USA, 2004. IEEE Computer Society.\n[dCGPMPSF08] G. Aguado de Cea, A. Gómez-Pérez, E. Montiel-Ponsoda, and M-C. Suárez-Figueroa. Nat-\nural language-based approach for helping in the reuse of ontology design patterns. In Pro-\nceedings of the 16th International Conference on Knowledge Engineering and Knowledge\nManagement Knowledge Patterns (EKAW 2008), pages 32–47, Acitrezza, Italy, September\n2008.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "e7bfc26f-b077-4752-afe5-f897189d61c6"
}