{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 7\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 7 of 21\n \nCQ41. Given the objectives (desired contract type, desired job, desired working conditions, \ndesired salary) and the profile (current job, education level, work experience, knowledge, \nexpertise, skills) of the job seeker, what job offers are the most appropriate? \nCQ42. Given the personal information (name, nationality, birth date, contact information), \nthe profile (current job, education level, work experience, knowledge, expertise, skill) and \nthe objectives (desired contract type, desired job, desired working conditions, desired \nsalary) of the job seeker, what job offers are the most appropriate? \n \nComposed competency questions that use job offer’s information for obtaining a job seeker: \nCQ43. Given the employer information, economic activity of the employer and the job offer \nprofile (job, contract type, salary, work condition), what job seekers are the most \nappropriate? \nCQ44. Given the employer information, economic activity of the employer and the required \nprofile to seek (required education level, required work experience, required knowledge, \nrequired skills), what job seekers are the most appropriate? \nCQ45. Given the job offer profile (job, contract type, salary, work condition) and the required \nprofile to seek (required education level, required work experience, required knowledge, \nrequired skills), what job seekers are the most appropriate? \nCQ46. Given the employer information, economic activity of the employer, job offer profile \n(job, contract type, salary, work condition) and the required profile to seek (required \neducation level, required work experience, required knowledge, required skills), what job \nseekers are the most appropriate? \n \nComposed competency questions related to date management: \nCQ47. When the job seeker completed his/her first degree and how much time did he/she \nspend completing his/her first degree? \nCQ48. When the job seeker completed his/her first degree and is he/she older than 30 \nyears? \nCQ49. Is the job seeker older than 30 years and how much time did he/she spend \ncompleting his/her first degree?  \nCQ50. Which job offers were posted in last 24 hours and how long is the duration of their \ncontracts? \nCQ51. Which job offers were posted in last 7 days and how long is the duration of their \ncontracts? \nCQ52. Which job offers were posted in last month and how long is the duration of their \ncontracts? \n \nComposed competency questions related to currencies: \nCQ53. Is the job offer’s salary greater than 14000 zlotes and could it be given in US dollars?  \nCQ54. Is the job offer’s salary lower than 25000 kroner and could it be given in Euros?   \n \nComposed competency questions related to job offer, job seeker, currencies and date \nmanagement: \n",
  "speaker": "SYSTEM",
  "uuid": "e9ccfc3b-e35f-4582-83dd-d8bc63b49560"
}