{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 23\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11172\nArtículo 43.  Subsanación de errores en las solicitudes.\nDe acuerdo con lo expuesto en el artículo 6, de ser necesaria la subsanación de la \nsolicitud, se requerirá al solicitante, mediante anuncio en el servidor de información del \nMinisterio de Ciencia e Innovación (http://www.micinn.es), para que en el plazo de 10 días \nhábiles subsane la falta o acompañe los documentos preceptivos. En dicha notificación se \nincluirá la advertencia de que, si no lo hiciese, se le tendrá por desistido de su solicitud. \nAdicionalmente, también podrá comunicarse dicha incidencia por correo electrónico de \nacuerdo con lo indicado en el artículo 31.\nDurante el periodo de subsanación, no se podrán reformular las solicitudes \npresentadas.\nArtículo 44.  Evaluación y selección de solicitudes.\n1.  Las solicitudes serán evaluadas por una Comisión, presidida por el Subdirector \nGeneral de Formación e Incorporación de Investigadores, integrada por los expertos que \ndesigne la Subdirección General de Formación e Incorporación de Investigadores, y un \nrepresentante de la Subdirección General de Formación e Incorporación de Investigadores \nque actuará como secretario, procurándose en su composición la paridad entre hombres \ny mujeres, que valorará el impacto de las estancias solicitadas en la mejora de la formación \ndel personal investigador y/o de la investigación del proyecto para el que se concede la \nayuda en base a criterios como el objeto de la estancia, la duración, la idoneidad y la \ncalidad del centro de destino. La comisión propondrá una relación de solicitudes \nseleccionadas, y determinará para cada solicitud seleccionada una cantidad de días de \nestancia y una ayuda para el viaje. La dotación económica correspondiente a la ayuda \npara la estancia resultará de multiplicar el n.º de días asignado por las correspondientes \ncuantías, establecidas en el artículo 41.3. La cuantía asignada como ayuda para el viaje \nserá determinada por la comisión en base a la ubicación del destino, de conformidad con \nlas cuantías establecidas en el artículo 41.4.\n2.  Esta comisión elevará al Subdirector General de Formación e Incorporación de \nInvestigadores la relación de candidatos seleccionados y cuantías asignadas.\nArtículo 45.  Trámite de audiencia y propuesta de resolución.\n1.  De acuerdo con lo expuesto en el artículo 7, el órgano competente para la \ninstrucción publicará en la página web del Ministerio de Ciencia e Innovación (http://www.\nmicinn.es) la propuesta de resolución provisional, que contendrá la relación de los \ncandidatos seleccionados, los Centros de I+D de adscripción y las condiciones de las \nayudas, concediendo a los interesados, un plazo de 10 días hábiles desde la fecha de \npublicación en la página web para que puedan formular las alegaciones que estimen \noportunas.\nDurante el periodo del trámite de audiencia, no se podrán reformular las solicitudes \npresentadas.\nDe no contestar en dicho plazo los interesados incluidos en la relación de candidatos \nseleccionados, se entenderá que aceptan las condiciones y términos de la propuesta de \nconcesión de la ayuda.\n2.  Examinadas las alegaciones presentadas por los interesados, se formulará la \npropuesta de resolución definitiva.\nArtículo 46.  Pago y justificación de las ayudas.\n1.  El importe de las ayudas para la realización de las estancias breves será transferido \na los Centros de I+D receptores del personal investigador en formación.\n2.  En el mes anterior al inicio de la estancia, los Centros de I+D entregarán por \nanticipado la cantidad correspondiente al personal investigador en formación a quienes se \nles haya concedido dicha estancia.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "ea2c4b01-302a-4d87-9b2c-67b5813b1c59"
}