{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 9\noccupations. In this case we have defined a concept for every element of the \nresulting extended taxonomy in order to preserve the hierarchy. This ontology \ndefines a concept taxonomy based on the aforementioned standards, in which the \nmost general concept is the Occupation concept. The Occupation concept \nhas four binary relations: ‘Occupation is associated with Objective’ (with \nthe Objective concept from the Job Seeker Ontology), ‘Occupation is \nassociated with Offered Work Experience’ (with the Offered Work \nExperience concept from the Job Seeker Ontology), ‘Occupation is \nassociated with Job Vacancy’ (with the Job Vacancy concept from the \nJob Offer Ontology) and ‘Occupation is associated with Requested Work \nExperience’ (with the Requested Work Experience concept from \nthe Job Offer Ontology).  \n• Education Ontology. This ontology models knowledge of education level and \neducation fields. The education fields are based on the FOET8 and the education \nlevels are based on the ISCED9710 (International Standard Classification of \nEducation); both of them are expressed in MS Access database format. FOET has \n127 education fields and ISCED97 has 7 education levels. The resultant \nEducation Ontology has 130 concepts. For the education levels we have defined \nthe Education Level concept; and for every education level specified in \nISCED97 a different instance of the Education Level concept is defined. \nFor the education fields we have defined a concept for every element of the \nFOET taxonomy in order to preserve the hierarchy. The concept Education \nhas four binary relations: ‘Education has education level Education \nLevel’, \n‘Education \nhas \neducation \nfield \nEducation \nField’, \n‘Education is associated with Job Vacancy’ (with the Job Vacancy \nconcept from the Job Offer Ontology) and ‘Education is education of Job \nSeeker’ (with the Job Seeker concept from the Job Seeker Ontology).  \n• Geography Ontology. This ontology is based on the ISO 31669 country codes and \nthe European Dynamics classifications: Continent and Region. The ISO 3166 is \nexpressed in XML format; Continent and Region classifications are stored in \nORACLE database. The ISO 3166 has 244 country codes and names; Region \nclassification has 367 regions and Continent classification has 9 continents. The \nresultant Geography Ontology has four concepts, a Location as main concept, \nwhich is split into three subclasses: Continent, Region and Country. For \nevery country element specified in the ISO 3166 a different instance of the \nCountry concept is defined, so the Country concept has 244 instances. For \nevery region element specified in the Region classification a different instance of \nthe Region concept is defined, so the Region concept has 367 regions. Finally \nfor every continent element specified in the Continent classification a different \ninstance of the Continent concept is defined. An example instance of the \nContinent concept is EU – Europe. An example instance of the Country \nconcept is SPAIN – ES.  An example instance of the Region concept is \n                                                           \n8 Available through RAMON Eurostat's Classifications Server at http://ec.europa.eu/comm/eurostat/ramon/ \n9 http://www.iso.org/iso/en/prods-services/iso3166ma/index.html \n",
  "speaker": "SYSTEM",
  "uuid": "eb4ca9d4-2513-4838-b990-e8745ec31418"
}