{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 7\nGu´ıa de orientaci´on para investigadores noveles\n7\n6/2001 de 21 de diciembre de Universidades, es la ley a la que se tienen\nque acoger las universidades que pertenezcan al estado espa˜nol. Esta ley\ncompuesta por 93 art´ıculos recogidos en catorce (XIV) t´ıtulos recoge, entre\notros temas, las funciones de la universidad y c´omo est´a estructurada, los\ndeberes y derechos de los estudiantes o la contrataci´on del personal docente\ne investigador. La Universidad4 tiene como funciones b´asicas y principales:\nla docencia,\nla investigaci´on,\ny la transferencia de conocimiento.\nLa primera de ellas est´a clara, puesto que la universidad es un centro de\nense˜nanza superior cuya misi´on es formar a alumnos en una determinada\ndisciplina. La investigaci´on en la universidad es tambi´en fundamental, puesto\nque a partir de ella se genera nuevo conocimiento y, por ´ultimo, la ﬁnalidad\nde ese nuevo conocimiento es que se pueda aprovechar y ser transferido a la\nsociedad.\nLas Universidades (por ejemplo, Universidad de Alicante) se organizan\nen Departamentos (por ejemplo, Departamento de Lenguajes y Sistemas In-\nform´aticos), que se encargan de coordinar las ense˜nanzas de una o varias\n´areas de conocimiento. Un ´area de conocimiento es una agrupaci´on de di-\nversas asignaturas que tienen una tem´atica similar dentro de cada clase de\nestudios universitarios, bajo un mismo nombre y un c´odigo un´ıvoco. Por\nejemplo, para el caso de Ingenier´ıa en Inform´atica, un ´area de conocimien-\nto ser´ıa “Lenguajes y Sistemas Inform´aticos (570)” y otra podr´ıa ser, por\nejemplo, “Ciencia de la Computaci´on e Inteligencia Artiﬁcial (075)”. Dentro\nde un Departamento pueden existir uno o varios grupos de investigaci´on.\nCada uno puede centrarse en una l´ınea investigaci´on diferente, dentro del\ncampo de esa ´area de conocimiento. Los Departamentos, a su vez, pueden\npertenecer a una determinada Facultad o Escuela (por ejemplo, Escuela\nPolit´ecnica Superior), que son los centros que organizan y gestionan todo\nlo que est´a relacionado con la obtenci´on de alg´un t´ıtulo. Tambi´en pueden\nexistir los Institutos Universitarios de Investigaci´on (por ejemplo, Instituto\nUniversitario de Investigaci´on Inform´atica), que se dedican fundamental-\nmente a la investigaci´on. Adem´as, debe contemplar en su estructura como\nm´ınimo, los ´organos de gobierno descritos en la Ley Org´anica 4/2007 de 12\nde abril, que recoge entre otros, el Consejo Social, Junta de Gobierno, Junta\nde Escuela, Consejo de Departamento, con sus respectivas ﬁguras al cargo\nde cada uno de ellos como son el Rector, los Vicerrectores, Gerente, Director\nde Escuela o Director de Departamento, por citar algunos.\nPara ﬁnalizar con esta secci´on, vamos a comentar brevemente c´omo se\nestructuran los recursos humanos que forman parte de la Universidad. Pode-\n4En este trabajo nos referimos solamente a universidades p´ublicas.\n",
  "speaker": "SYSTEM",
  "uuid": "ec0c976c-9117-4d2f-8edc-1778318f0ebe"
}