{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 5\nGu´ıa de orientaci´on para investigadores noveles\n5\nen la universidad, y saben que ´esa es una de las maneras de comenzar a\nintroducirse en dicho ´ambito.\n2.1.\nEstudios de tercer ciclo: programas de doctorado\nLos programas de doctorado forman parte de los denominados estudios\nde tercer ciclo.3 Existen diferentes programas de doctorado dentro de una\nuniversidad y algunos de estos programas pueden tener Menci´on de Calidad\ndel Ministerio de Educaci´on y Ciencia (ahora nuevo Ministerio de Ciencia e\nInnovaci´on), que constituye un reconocimiento a la solvencia cient´ıﬁco-t´ecni-\nca y formadora del programa de doctorado en su conjunto y de los grupos\no departamentos que desarrollan la formaci´on doctoral. Dicha menci´on era\notorgada por el Ministerio de Educaci´on y Ciencia (en la actualidad se en-\ncarga el Ministerio de Ciencia e Innovaci´on) a trav´es de la Agencia Nacional\nde Evaluaci´on de la Calidad y Acreditaci´on (ANECA), que es la que se en-\ncarga, entre otras cosas, de evaluar los programas de doctorado y hacer el\nseguimiento de estos durante los cuatro a˜nos siguientes, una vez que se ha\nobtenido la menci´on de calidad. Esto supone una ventaja a˜nadida para el\nalumno que cursa un programa de doctorado con Menci´on de Calidad, ya\nque en un futuro le puede favorecer otorg´andole mayor puntuaci´on en los\nprogramas de evaluaci´on (v´ease secci´on 6). La Universidad de Alicante cuen-\nta para el curso 2007-2008 con catorce programas de doctorado con Menci´on\nde Calidad, y concretamente, el programa “Aplicaciones de la Inform´atica”\nimpartido por el Departamento de Lenguajes y Sistemas Inform´aticos es uno\nde ellos.\nLas asignaturas que comprenden los programas de doctorado pueden ser\nde varios tipos:\nMaterias fundamentales (tipo F): son cursos o seminarios sobre los\ncontenidos fundamentales de los campos cient´ıﬁco, t´ecnico o art´ıstico\na los que est´e dedicado el programa de doctorado correspondiente.\nMaterias metodol´ogicas (tipo M): comprenden cursos o seminarios\nrelacionados con la metodolog´ıa y la formaci´on en t´ecnicas de investi-\ngaci´on.\nMaterias de investigaci´on (tipo I): Trabajos de investigaci´on tutelados.\nMaterias aﬁnes (tipo A): son cursos o seminarios relacionados con cam-\npos aﬁnes al del programa y que son de inter´es para el proyecto de tesis\ndoctoral del doctorando.\nNormalmente, el primer curso es de formaci´on y durante el mismo se im-\nparten una serie de materias, entre las que el alumno se deber´a matricular de\n3En la Universidad de Alicante, el curso 2009-2010 ser´a el ´ultimo curso en el que los\nalumnos podr´an matricularse del primer curso del doctorado tradicional.\n",
  "speaker": "SYSTEM",
  "uuid": "ec16369f-ca03-4add-be09-bc7de8cd26ad"
}