{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 9\n \nOntology based document annotation: trends and open research problems \n55 \n \nClaims of information about the instance. In Figure 7, the \ninstance AA7615_Feb08_2003 claims that it is an instance \nof the class AA7615, that it arrives at Chicago, that its \ndeparture date is February 8, 2003, and that its single fare \ncosts 300$. \nClaims \nof \ninformation \nabout \nother \ninstances.  \nIn 8th Figure, the instance TravelPrice not only  \nclaims that it is an instance of the class Travel  \nAgency, which is located in New York and whose  \nname is ‘TravelPrice Unlimited’, but it also claims  \nthat the single fare for the instance AA7615_Feb08_2003 is \n200$ (there is a cheaper negotiated price between  \nthis travel agency and the American Airlines flight \ncompany). \nThe SHOE code corresponding to these annotations is \nembedded in the original HTML document. \n4.5 UBOT AeroSWARM \nAeroSWARM \n(http://ubot.lockheedmartin.com/ubot/ \nhotdaml/aeroswarm.html) (Kogut and Holmes, 2001) \ngenerates, automatically, RDF annotations from text \ndocuments. It was developed by Lockheed Martin \nCorporation as part of the UBOT (UML Based Ontology \nToolset) project. \n \nAeroSWARM is available both as a Web form and as a \nstandalone application. In the Web version, shown in  \nFigure 9, users send a text file and AeroSWARM  \nsends back the RDF annotations for that text. These \nannotations are created according to the OWL versions of \nOpenCyc, (http://www.cyc.com/2003/04/01/cyc) SUMO, \n(http://reliant.teknowledge.com/DAML/SUMO.owl) \nand \nAeroSWARM (http://ubot.lockheedmartin.com/ubot/2004/ \n04/aeroswarmOntology.owl). \nThe automatic annotation feature of AeroSWARM is \nsupported by the text mining system, AeroText. This system \nparses natural language text and extracts those items that \nhave any correspondence with the underlying ontology \nused. The default extraction rules of this text mining system \ncan also be modified. \nAeroSWARM generates instances of concepts (proper \nnouns, common nouns, dates, currency quantities, etc.), \nattribute values, and instances of properties (a person \nbelongs to an organisation, an organisation is based in a \nlocation, etc.). \nSince the annotations created by AeroSWARM are \nprovided in RDF, any RDF aware tool can use them as long \nas they are appended to the corresponding web page. \nAeroSWARM could also be used as an automatic \nannotation service to provide RDF annotations online. \nFigure 9   UBOT AeroSWARM annotation web server \n \n \n \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "ed6f37b3-f375-4692-b0ff-0a295b30eaf2"
}