{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 74\n72\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Microsoft Bing Translator (free): Microsoft also offers a free web translation service that is similar to\nGoogle Translate, but also includes many options for people to score and post‐edit translations using\nan interactive (WYSIWG) editing tool. This is an especially interesting option for companies that have a\nlarge community of readers who can be tapped to edit and improve translations to benefit other users. \n• Moses (Open Source): Moses is an open source statistical machine translation engine. It is widely used\nwithin the industry to build customized MT engines. Because it is open source, people wishing to devel‐\nop a custom engine can focus on obtaining the training corpora rather than writing their own statisti‐\ncal machine translation engine (a difficult task that is beyond the abilities of most developers). \n• Tilde (customized engine): Tilde is a Latvia based translation technology company that focuses on build‐\ning custom translation engine for poorly resourced languages, and for specific industries. \nHybrid\nHybrid translation engines combine elements from rules based and statistical machine translation to lever‐\nage the strengths of each approach. This is an area of ongoing development, so we expect many systems to\nevolve into hybrid platforms. \nThere are two main categories of hybrid systems: rules based engines that use statistical translation for post\nprocessing and clean‐up, and statistical systems that are guided by rules based engines.\nIn the first case, the text is translated first by a rules based translation engine. This translation is then\nprocessed by a statistical machine translation engine which corrects errors made by the rules based engine,\nor replaces the text entirely if needed. In the second case, the rules based translation engine does not trans‐\nlate the text but assists the statistical translation engine by inserting metadata (e.g. noun/verb/adjective,\npresent/past tense, etc.).\nProducts and Practitioners\nSeveral companies offer hybrid translation platforms, mostly focused on the enterprise market, among\nthem:\n• LinguaSys: they have developed Carabao, a hybrid translation engine that targets the enterprise mar‐\nket.\n• Systran: Systran has been developing machine translation software for 40 years, and has upgraded its\ntools to combine statistical and rules based translation. \nTechnology Providers\nTypes of Providers\nThere are a wide variety of service providers in the machine translation space. These include:\n• Consumer/web translation services, such as Babelfish, Google Translate and Microsoft Translator.\nThese services are trained with general purpose corpora and offer decent translation for comprehen‐\nsion, but not publication quality output. One exception is Babelfish, which provides an option to\nrequest professional translation. \n• Custom/adapted machine translation for specific language pairs or subject matter (domain of expert‐\nise). These providers typically help clients build domain specific translation engines using their own\ntraining corpora (enterprise customers often have very large translation memories which can be used\nfor this purpose). XXXXX are examples of this.\n",
  "speaker": "SYSTEM",
  "uuid": "edea1496-8516-4fdd-909b-b134bd335eca"
}