{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 82\nPage 82 of 124\nNeOn Integrated Project EU-IST-027595\nFigure 5.9: Thesauri Categorization\n5.5\nPatterns for Re-engineering Thesauri into Ontologies\nIn this section we present the re-engineering patterns (PR-NOR) for re-engineering thesauri into ontologies.\nThese patterns come from the experience of ontology engineers in developing ontologies using thesauri.\nThe patterns are:\n• PR-NOR-TSLO-01. Pattern for re-engineering a term-based thesaurus which follows the record-based\ndata model, into a lightweight ontology. In that case, the semantics of the BT/NT relations between\nterms are subClassOf.\n• PR-NOR-TSLO-02.\nPattern for re-engineering a term-based thesaurus which follows the relation-\nbased data model, into a lightweight ontology. In that case, the semantics of the BT/NT relations\nbetween terms are subClassOf.\n• PR-NOR-TSLO-03. Pattern for re-engineering a concept-based thesaurus which follows the record-\nbased data model, into a lightweight ontology. In that case, the semantics of the BT/NT relations\nbetween concepts are subClassOf.\n• PR-NOR-TSLO-04. Pattern for re-engineering a concept-based thesaurus which follows the relation-\nbased data model, into a lightweight ontology. In that case, which the semantics of the BT/NT relations\nbetween concepts are subClassOf.\n5.5.1\nPatterns for re-engineering Thesauri into Lightweight Ontologies\nIn this section we present the re-engineering patterns (PR-NOR) for re-engineering thesauri into lightweight\nontologies. In spite of these patterns consider the semantics of the BT/NT relations as subClassOf, it is\npossible to adapt these patterns for dealing with other relations, e.g. partOf, ad-hoc. These patterns follow\nthe transformation approach, mentioned in section 2.2.2, for transforming resource schema into an ontology\nschema, because it is the suitable for dealing with the resource data models and the target lightweight\nontologies.\n",
  "speaker": "SYSTEM",
  "uuid": "ee540ba5-e2e8-4a5e-9761-c350acb7d9c2"
}