{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 2\nare managed autonomously and model their data according to the needs of the\ndeployment. To integrate the data requires linking the sources to a common\ndata model so that conditions that are likely to cause a ﬁre can be detected,\nand presented to the user in terms of their domain, e.g. ﬁre risk assessments. We\npropose that ontologies can be used as such a common model. For the scenario\npresented here, we use an ontology that extends ontologies from sweet3 and\nthe W3C incubator group’s semantic sensor network ontology4.\nThe work presented in this paper considers advances done by the semantic\nweb and database communities over the last decade. On the one hand, the se-\nmantic web research has produced mapping languages and software for enabling\nontology-based access to stored data sources, e.g. R2O [1] and d2rq [2]. These\nsystems provide semantic access to traditional (stored) data sources by pro-\nviding mappings between the elements in the relational and ontological models\n[3]. However, similar solutions for streaming data mapping and querying using\nontology-based approaches have not been explored yet.\nOn the other hand, the database research community have investigated data\nstream processing where the data is viewed as an append-only sequence of tuples.\nSystems such as stream [4] and Borealis [5] have focused on query evaluation\nand optimisation over streams with high, variable, data rates. Other systems\nsuch as snee [6] and TinyDB [7], have focused on data generated by sensor net-\nworks, which tends to be at a lower rate, and query processing in the sensor net-\nwork where resources are more constrained and energy eﬃciency is the primary\nconcern. There have also been proposals for query processing over streaming\nrdf data [8,9]. However there is still no bridging solution that connects these\ntechnologies coherently in order to answer the requirements of i) establishing\nmappings between ontological models and streaming data source schemas, and\nii) accessing streaming data sources through queries over ontology models.\nIn this paper we focus on providing ontology-based access to streaming data\nsources, including sensor networks, through declarative continuous queries. We\nbuild on the existing work of R2O for enabling ontology-based access to rela-\ntional data sources, and snee for query evaluation over streaming and stored\ndata sources. This constitutes a ﬁrst step towards a framework for the integra-\ntion of distributed heterogeneous streaming and stored data sources through\nontological models and to the provision of Linked Data for streams [10,11,12].\nIn Section 2 we provide more detailed descriptions of R2O and stream query\nprocessing in order to present the foundations of our approach in Section 3. In\nSection 4 we present the syntactic extensions for sparql to enable queries over\nrdf streams, and present S2O for stream-to-ontology mappings. The semantics\nof these extensions are detailed in Section 5 and a ﬁrst implementation of the ex-\necution of the streaming data access approach is explained in Section 6. Related\nwork is discussed in Section 7 and our conclusions in Section 8.\n3 http://sweet.jpl.nasa.gov/ accessed 25 June 2010.\n4 http://www.w3.org/2005/Incubator/ssn/wiki/Semantic_Sensor_Network_\nOntology accessed 25 June 2010.\n2\n",
  "speaker": "SYSTEM",
  "uuid": "ee549a3c-7811-4610-bf90-78dc4f31f111"
}