{
  "message": "SYSTEM: 2016.04.CV-Victor-CICYT.pdf: Página 12\n \nAutores: Víctor Rodríguez, Jaime Delgado \nTítulo: Semantic Expression and Execution of B2B Contracts on Multimedia Content \nCongreso 4th Int. Conference on Semantic and Digital Media Technologies \nPublicación: Proceedings of SAMT2009, pp. 89-100, Springer Verlag, ISBN:978-3-642-10542-5 \nLugar celebración: Graz, Austria \nFecha: 2009 \n \n \nAutores: Víctor Rodríguez, Jaime Delgado \nTítulo: Multimedia Content Distribution Governed by Ontology-Represented Contracts \nCongreso: Workshop on Multimedia Ontologies and Artificial Intelligence Techniques in Law  \nPublicación: Proceedings of JURIX 2007 \nLugar celebración: Leiden, Holanda \nFecha: 2007 \n \n \nAutores: V. Rodríguez, J. Delgado and E. Rodríguez \nTítulo: From Narrative Contracts to Electronic Licenses: A Guided Translation Process for the Case of \nAudiovisual Content Management \nCongreso: 3rd International Conference on Automated Production of Cross Media Content for Multi-Channel \nDistribution  \nPublicación: Proceedings of AXMEDIS 07 \nLugar celebración: Barcelona \nFecha: 2007 \n \n \nAutores: V. Rodríguez, M. Gauvin and J. Delgado \nTítulo: An Ontology for the Expression of Intellectual Property Entities and Relations \nCongreso: International Workshop on Security in Information Systems \nPublicación: Proceedings of WOSIS 2007    \nLugar celebración: Funchal, Portugal \nFecha: 2007 \n \n \nAutores: V. Rodriguez Doncel, N.Nikolaidis, I.Pitas \nTítulo: Watermarking polygonal lines using an optimal detector on fourier descriptors domain \nCongreso: EUSIPCO2005 \n \nPublicación: Proc. of 2005 EURASIP European Signal Processing Conf.    \nLugar celebración: Antalya, Turquía \nFecha: 2005 \n \n \nAutores: Ramón de la Rosa, Alonso Alonso, Roberto Hornero, Daniel Abásolo, Víctor Rodríguez \nTítulo: Herramienta gráfica para control de prótesis mioeléctricas \nTipo de participación:       \nCongreso: XX Conferencia Anual de la Sociedad Española de Ingeniería Biomédica (CASEIB02) \nPublicación: Libro de Actas del XX Congreso Anual de la Sociedad Española de Ingeniería Biomédica \nLugar celebración: Zaragoza \nFecha: 2002 \n \n \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "ef20b709-f94d-403d-9698-69c6400d5e7a"
}