{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 31\nBÚSQUEDA \n \n31 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n \n2.4.4. El nivel físico de la representación para el \nproblema de las garrafas. \nAl elegir una representación física en Lisp lo más adecuado es aplicar los principios \nbásicos sobre la abstracción de datos. En lo que sigue nos centramos tan solo en los \nestados, dejando de lado la representación física de las reglas. Así pues, lo mejor es \naislar las operaciones de acceso para los estados, independientemente de cual sea \nla representación física para ellos. A los estados (x,y) los denominaremos \ngarrafas. En este caso tan sencillo las operaciones son las habituales para tratar \npares de elementos. Por ejemplo, una especificación podría ser: \n \n• (defun construye-garrafas (x y) …) ; devuelve la representación del \nestado (x,y); \n• (defun garrafa4 (garrafas) …) ; devuelve x si el argumento representa \na (x,y); \n• (defun garrafa3 (garrafas) …) ; devuelve y si el argumento representa \na (x,y); \n• (defun modifica-garrafa4 (garrafas n) …) ; si el estado era (x,y) lo \nmodifica para construir (n,y) y devuelve el estado así modificado como valor; \n• (defun modifica-garrafa3 (garrafas n) …) ; si el estado era (x,y) lo \nmodifica para construir (x,n) y devuelve el estado así modificado como valor. \nEn realidad, las dos últimas operaciones no son necesarias para programar el \nsistema de producción (basta con poder acceder a las componentes, para verificar \nlas condiciones de las reglas, y con construir nuevos estados, por disparo de reglas), \npero las incluimos para poder explicar ciertas características de las representaciones \nque serán necesarias en temas siguientes. \nEjercicios. Utilizando los operadores anteriores, se pide: \n• \ndefinir una función estado-inicial que construya y devuelva el estado inicial \npara el problema de las garrafas de vino; \n• \ndefinir un predicado estado-objetivo? que a partir un estado decida si es o \nno un estado objetivo para el problema de las garrafas de vino. \n",
  "speaker": "SYSTEM",
  "uuid": "f96cc505-7a2c-473a-a754-477ab5c91981"
}