{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 7\n \nOntology based document annotation: trends and open research problems \n53 \n \nOntoMat-Annotizer loads OWL ontologies. Annotations \ncreated with this tool are stored in OWL, either as separate \nfiles or embedded in the HTML documents annotated. \nThese annotations can be used by a wide range of \napplications in the semantic web. \n4.3 ONTO-H \nONTO-H (Benjamins et al., 2004) is a tab plugin of the \nProtégé ontology editor that allows creating annotations of \nRTF documents. It has been developed by iSOCO \n(http://www.isoco.com/) in the context of the EU Esperonto \nproject. \nSince ONTO-H is integrated in the Protégé editor,  \nit can reuse many of its features, such as the  \nontology browser, which is similar to the Classes&Instances  \n \ntab \nthat \nis \nprovided \nin \nthe \nProtégé \ndefault  \ndistribution. Besides, ONTO-H users can reuse all the \nfunctionalities provided by the Protégé editor, such as the \nontology editing and browsing functions, ontology \nvisualisation, merge, etc., and more important, all the import \nand export functions of the editor, which give great \nflexibility with respect to the formats in which the \nannotations will be stored. \nFigure \n6 \nshows \nthe \nuser \ninterface \nof \nthis  \nannotation \ntool \nwhile \nannotating \nour \ndocument  \nwith the flight details, which has been previously  \nconverted to RTF format. In the screenshot we can  \nsee that the ‘Flight details’ part of the document  \nhas been selected and dragged&dropped to the instances \npane, giving as a result the creation of an instance of the \nflight AA7462. \nFigure 6   Annotation of the instance AA7615_Feb08_2003 with ONTO-H \n \n \n \nBesides \nthe \ndrag&drop \nfunctions \nfor \ncreating  \nannotations manually, the editor also gives suggestions for \nthe annotation of parts of the text, by recognising  \nnamed entities, annotations already existing with the  \nsame name or with a synonym, etc. In this sense,  \nONTO-H is a tool that can be mainly used for supervised \nannotation, rather than for a completely manual annotation \nprocess. \nFinally, ONTO-H allows using declarative rules \nimplemented in the DROOLS (http://www.drools.org/) rule \nlanguage. These rules are used to prompt the user \nautomatically, with instance edition forms that allow \ncreating new related instances to the one that has just  \nbeen dropped onto the instance pane. This function has \nproven to be very useful in the cultural domain, where \ninstances of a piece of work done by an artist are, most of \nthe time, related to instances of expressions and \nmanifestations of such work. \n4.4 SHOE knowledge annotator \nThe SHOE Knowledge Annotator (http://www.cs.umd.edu/ \nprojects/plus/SHOE/KnowledgeAnnotator.html) (Heflin and \nHendler, 2001) is a tool for creating manual annotations in \nHTML pages with the SHOE language. It was developed by \nthe Parallel Understanding Systems Group, at the \nDepartment of Computer Science, University of Maryland. \nThis tool has been the basis for the creation of SMORE, \n(http://www.mindswap.org/~aditkal/editor.shtml) a more \ncomplex tool. \nThe SHOE Knowledge Annotator is available as a Java \napplet and as a standalone Java application. Both of them \nhave the same functionalities. Annotations can refer to \nconcepts and relations from one or several ontologies \nimplemented in SHOE, which means that this tool creates \nannotations of instances of concepts, of their attribute \nvalues, and instances of relations. \n",
  "speaker": "SYSTEM",
  "uuid": "f9ba6ebb-958c-4b0d-87e1-3c849a7b327a"
}