{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 19\nBÚSQUEDA \n \n19 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n• Medios: una descripción de acciones que puedan transformar un estado del \nmundo en otro, acciones que son consideradas como operadores o reglas. \nTendremos el marco conceptual que permite resolver el problema por medio de un \nsistema de producción. \nUn sistema de producción consiste en: \n• una base de datos/hechos/conocimiento con información sobre el problema; \n• un conjunto de reglas (operadores); \n• una estrategia de control; \n• un aplicador de reglas: ciclo de reconocimiento-actuación. \nLa parte más importante de los sistemas de producción es la estrategia de control \n(también llamada, en el contexto de los sistemas expertos, mecanismo o motor de \ninferencia). Es la que establece el proceso de búsqueda de la solución. Si la \ndescripción del problema viene dada por una noción de estado (del mundo) \npodemos entender que un sistema de producción es empleado para una búsqueda \nen un espacio de estados (así se relacionan estos dos paradigmas clásicos de la \nInteligencia Artificial). Con esta perspectiva, uno de los cometidos de la estrategia de \ncontrol consiste en decidir qué operador aplicar en cada momento: \n• ¿se puede aplicar? \n• ¿produce algún cambio en el estado? \n• ¿qué estado elegir para aplicar los operadores? \n• ¿qué sucede si hay varios operadores posibles a aplicar? (resolución de \nconflictos) \nLos operadores, que admiten una interpretación como reglas, son acciones simples \nque pueden transformar un estado en otro. Generalmente se distinguen en los \noperadores una parte izquierda (el patrón o condición), que determina la \naplicabilidad de la regla (se dice también que si se verifica la condición la regla \nqueda sensibilizada), y una parte derecha que describe la operación o acción a \nllevar a cabo al aplicar el operador (o disparar la regla). Así, una regla u operador \nconsta de dos partes: \n",
  "speaker": "SYSTEM",
  "uuid": "f9f00b8d-9dbb-4cb0-a85d-7b7639c08162"
}