{
  "message": "SYSTEM: FormularioCPM_ocorcho.pdf: Página 11\n3.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n3. Solución III\n3.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n3.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n3.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­11­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN III (marque esta casilla para habilitar los campos asociados a la solución III)\nversión 1.2.\n#\nTítulo: Datos y microservicios para la vigilancia tecnológica \n \nLa solución consiste en un conjunto de microservicios de interés para la vigilancia \ntecnológica. Los microservicios se proveen aprovechando una base de conocimiento \nalrededor de la vigilancia tecnológica creada a partir de fuentes de datos abiertas y \nutilizando tecnologías semánticas y del lenguaje.  \n \nDicha base de conocimiento incluye (i) un modelo de datos en forma de ontología de datos \npara la vigilancia tecnológica; (ii) algoritmos para la recogida continua y transformación de \ndatos procedentes de fuentes heterogéneas; (iii) algoritmos para el enlazado de los datos \ncon fuentes externas y (iv) los datos mismos. Opcionalmente, los servicios pueden hacer \nuso de los algoritmos de librAIry descritos en la solución I de este documento. \n \nLa solución propuesta deberá escalar tanto el modelo como los datos de una primera versión \nya existente y funcional. Las fuentes de datos incluyen al menos: \n• patentes de la OEPM, de la USPTO y de la EPO (esta última no disponible para descarga \nmasiva gratuita) \n• datos bibliográficos de la Biblioteca Nacional y afines. \n• datos bibliográficos de las publicaciones académicas como DBLP, Springer, Arxiv y \nCrossRef entre otras. \n• organizaciones catalogadas por Thomson Reuters PermID así como sus personas \nrelevantes e información afín.  \n• fuentes de datos genéricas como esDBpedia, wikiData o geonames. \n• opcionalmente podrá tomarse como fuentes la bESstDBpedia descrita en la Solución II de \neste mismo documento. \n \nMICROSERVICIOS \n1) SERVICIO DE BÚSQUEDA DE INVESTIGADORES \nEl servicio permite buscar la actividad investigadora de una persona a partir de su \nnombre. Para cada investigador se muestra su actividad científica obtenida tras la \nintegración de información procedente de diversas fuentes, incluyendo patentes, libros y \npublicaciones científicas. También se considerarán como términos de búsqueda las palabras \nclave relacionadas con los temas de investigación, una ubicación geográfica o un marco \ntemporal. La integración inteligente de diferentes fuentes de datos permite desambiguar \ncon mayor fiabilidad. El sistema desambiguará los datos de las diferentes bases de datos \nmediante la acumulación de evidencias (ubicación del investigador, entidades para las \ncuales ha trabajado, palabras clave y tópicos extraídos de las patentes y artículos \ncientíficos).  \n \n2) SERVICIO DE BÚSQUEDA DE EMPRESAS Y CENTROS DE INVESTIGACIÓN \nEl servicio permite buscar la actividad investigadora de una empresa o centro de \ninvestigación a partir de su nombre, su actividad, su ubicación o una combinación de ellos. El \n#\n#\n#\n#\n#\n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "fa9d938f-6f31-4b1a-ab5f-26319ed67e7f"
}