{
  "message": "SYSTEM: Eswc2010webofdatatrack_submission_2.pdf: Página 1\nDistributed Querying to RDF Repositories using \nSPARQL-DQP \nCarlos Buil-Aranda1, Oscar Corcho1 \n \n1 Ontology Engineering Group, Departamento de Inteligencia Artificial, Facultad de \nInformática, Universidad Politécnica de Madrid. Boadilla del Monte, Spain \n{cbuil, ocorcho}@fi.upm.es  \nAbstract. One of the most common mechanisms to access RDF data is by \nmeans of SPARQL endpoints. However, when we need to execute queries that \ninvolve accessing RDF data from multiple SPARQL endpoints, neither the \nprotocol nor the language provide any norms or guidelines about how to \nproceed. In this paper we propose an approach for federating queries to a set of \nSPARQL endpoints, using relational database distributed query processing \ntechniques, and exploiting the added value of OGSA-DAI, a de facto standard \nfor web-service based access to relational and XML databases. \nKeywords: SPARQL, query federation, RDF, Distributed Query Processing. \n1   Introduction \nThe amount of RDF data available in the Web of Data is constantly increasing. New \nRDF datasets are being published regularly, offering several means to be accessed, \nmainly including Linked Data-enabled URLs and SPARQL endpoints. The W3C \nWiki1 lists more than 40 SPARQL Endpoints and more than 70 RDF datasets and \nwrappers offering RDF data and there are even more that are not listed there. There is \nan estimation that there are more than 13 billion RDF triples available on the Web2 .  \nAnswering queries against the data coming from one single dataset may be enough \nin a large number of situations. However, there may be also an added value in the \ncombination of data from different datasets. Let’s imagine that we want to query \nDBPedia for those bands in the Madchester movement in the 1990s, together with \nadditional information such as BBC programs related to those bands, and album \ninformation from MusicBrainz. In this scenario we need to query three SPARQL \nendpoints: DBpedia3, BBC4 and MusicBrainz5 and join together these query results.  \nSeveral approaches to access distributed RDF datasets using SPARQL endpoints \nhave been described in the literature. Some of them use follow-up queries to the \n                                                           \n1 http://esw.w3.org/topic/SparqlEndpoints \n2 http://esw.w3.org/topic/TaskForces/CommunityProjects/LinkingOpenData/DataSets/Statistics \n3 http://dbpedia.org/snorql \n4 http://api.talis.com/stores/bbc-backstage/services/sparql \n5 http://dbtune.org/musicbrainz/sparql \n",
  "speaker": "SYSTEM",
  "uuid": "fad6e539-f97e-4a44-8ea3-3ffc2e1fc3c0"
}