{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 113\nBÚSQUEDA \n \n113 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \ndiferencian de las 4 y 5 en que en las primeras los mínimos son calculados \nglobalmente sobre el conjunto de todas las aristas que no aparecen en el estado e, \nmientras que en las segundas los mínimos son calculados localmente sobre cada \nuno de los vértices involucrados. La heurística 4 se diferencia de la 5 en que en la \nprimera se considera el extremo derecho del estado e, pero no el vértice origen y en \nla 5 sucede justo al contrario. Las cuatro heurísticas 2, 3, 4 y 5 pueden ser \nmejoradas fácilmente, pero su cálculo comenzaría a complicarse, siendo necesario \nhacer cierto tipo (limitado) de búsqueda. En cuanto a la heurística 6, es bastante \npobre y rompe la línea de las anteriores. Tendría más sentido si en el mapa \ndispusiésemos de las coordenadas de las ciudades (como ya se hizo en el problema \ndel tren) y definiésemos como valor heurístico de un estado la distancia en línea \nrecta entre el origen y el otro extremo del estado. \nPor ejemplo, con el mapa de la figura 15 y para el estado e = [A,B,C], tendremos p = \n2 y los siguientes valores heurísticos: h1(e) = 0, h2(e) = 2 * 1 = 2, h3(e) = 1 + 3 = 4 \n(las aristas son respectivamente CD y AD), h4(e) = 1 + 1 = 2 (las aristas \ncorresponden respectivamente a los vértices C y D; de hecho, los dos números \ncorresponden a la misma arista; éste es uno de los aspectos que podría ser \nmejorado en la heurística), h5(e) = 3 + 1 = 4 (las aristas corresponden \nrespectivamente a los vértices A y D) y h6(e) = 4. \nEjercicios. \n1) Con el mapa de la figura 15, dibújese el árbol de búsqueda A con cada una de \nlas seis heurísticas anteriores. \n2) Estúdiese para cada una de las 6 heurísticas anteriores si es monótona y si es \nadmisible. Entre aquellas que sean admisibles, analícese cuáles son las mejor y \npeor informadas (comparándolas por pares). \n \n",
  "speaker": "SYSTEM",
  "uuid": "fc17a97c-8dd6-4a83-848a-635e276e0973"
}