{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 61\n59\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nrelevant pieces as needed. This form of translation memory generally does not yield significant cost savings\n(the translator has to manually decide which texts to use and how), but is best used to reduce errors, and to\nencourage the use of a consistent writing style. \nBoth forms of translation memory are found in most translation and localisation management systems\n(although localisation tools have less need for fuzzy match translation memory, but do rely heavily on exact\nmatch to prevent the redundant translation of strings). \nTranslation memory was first found to be useful when the user documentation was updated for new ver‐\nsions of software. There is typically a high reuse rate in these documents. \nAdvanced Leveraging\nAdvanced leveraging, otherwise known as sub‐segment analysis, is used to construct a translation using sen‐\ntence fragments. This type of CAT tool tries to stitch together translations from different segments, for exam‐\nple by identifying translations for phrases which, in turn, appear in longer texts elsewhere. This technology\nis useful as a translator productivity enhancer, but like fuzzy match translation memory, cannot be fully auto‐\nmated. It is an intermediate approach between translation memory and machine translation.\nAdvanced leveraging has been offered as a feature in a small group of tools, including MultiCorpora’s\nMultiTrans and Atril’s DeJaVu for a number of years now. The main adopters have been public bodies and\nthe finance sector. These sectors do not benefit as greatly from translation memory as their focus is not\nproduct updates. Instead advanced leveraging tools help them to efficiently reuse translations from large\ntranslation datasets, which are called corpora. By using such technology they aim to enhance productivity\nand terminological consistency. \nThere is a general trend away from large sets of documentation to smaller volume, sometimes continuous\nstreams of publication. Given this trend there is scope for growing adoption of advanced leveraging technol‐\nogy for years to come.\nTranslation Process Management\nTranslation process management (TPM) refers to administrative and workflow control tools that enable a\nsystem owner or administrator to control when and how translations are done, the quality assurance/review\nprocess, etc. The details of how this is implemented vary widely from system to system. Some systems pro‐\nvide the administrator with the ability to set broad controls on how things are done, while others allow the\nadministrator to control the translation process at a fine‐grained (per job or task) level.\nGenerally speaking, TPM tools allow the system administrator to control the following:\n• Decide which assets or asset classes are routed for translation\n• Decide which translation resource or service to use for an asset class and target language (e.g.\nmachine/human translation, select LSP, SLA, etc.)\n• Decide whether returned translations should be auto‐approved, or queued for review and post‐editing\n• Decide who is allowed to review/post‐edit returned translations or mark translations as complete/pub‐\nlished\n• Decide who is allowed to edit or translate assets, on a per site, project or asset level (e.g. invite profes‐\nsional or crowd translators to a project)\n",
  "speaker": "SYSTEM",
  "uuid": "fd9aad42-4353-4735-930f-8a7690cfe888"
}