{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 2\nprocesses related to the annotation of RESTful services (e.g., [2, 11]) still require a \nlarge amount of human intervention. First, humans have to understand the informal \ndescriptions provided in the RESTful service description pages, and then the semantic \nannotation of RESTful services has to be automated as much as possible.  \nIn this paper, we address these two main challenges by: (1) providing syntactic \ndescriptions of RESTful services that allow their automatic registration and \ninvocation, and (2) interpreting and enriching the RESTful services’ parameters, by \nmeans of their semantic annotation.  \nThe main contribution of our work is the proposal of an automatic approach for the \nsemantic annotation of RESTful services using diverse types of resources: a cross-\ndomain ontology, DBpedia (combined with GeoNames in the specific case of \ngeospatial services), and diverse external services, such as suggestion and synonym \nservices. \nThe remainder of this paper is structured as follows: Section 2 presents related \nwork in the context of semantic annotation of WS-* services and RESTful services. \nSection 3 introduces our approach for the automatic annotation of RESTful services, \nincluding explanations on how we derive their syntactic description and semantic \nannotation. Section 4 presents the evaluation of our system in the geospatial domain. \nFinally, Section 5 presents some conclusions of this paper and identifies our future \nwork. \n2   Related work \nMost research in the semantic annotation of RESTful services has focused on the \ndefinition of formal description languages for creating semantic annotations. The \nmain proposed formalisms for describing these services are: the Web Application \nDescription Language1 (WADL) which describes RESTful services syntactically, \nMicroWSMO [3] which uses hREST (HTML for RESTful services) [3, 5], and SA-\nREST [2, 8] which uses SAWSDL [1] and RDFa2 to describe service properties. \nThe work done in the state of the art on Semantic Web Services (SWS) addresses \nmainly SOAP/WSDL services, which are only focused on the syntax required for \ndescribing the exposed functionality (operations, input and output types). Considering \nthis, in [19] the authors introduced an approach to annotate WADL documents linking \nthem to ontologies. Among these approaches, some authors propose rather \nheavyweight approaches for semantic description, which are normally derived from \nWeb Service (WS-*) semantic description frameworks like WSMO or OWL-S. An \nexample is proposed in [10], which makes use of a specific selection of existing \nlanguages and protocols, reinforcing its feasibility. First, OWL-S is used as the base \nontology for services, whereas WADL is used for syntactically describing them. \nSecond, the HTTP protocol is used for transferring messages, defining the action to be \nexecuted, and also defining the execution scope. Finally, URI identifiers are \nresponsible for specifying the service interface. Nevertheless, these languages are \nstrongly influenced by existing traditional WS-* services. \n                                                           \n1 http://www.w3.org/Submission/wadl/ \n2 http://www.w3.org/TR/xhtml-rdfa-primer/ \n",
  "speaker": "SYSTEM",
  "uuid": "ffb8bf34-5d0a-466c-953b-b68d957ff060"
}