{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 60\n58\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nautomate the process.\nThe features highlighted in this section can be found throughout the translation technology tool chain. These\nare best thought of, not as products, but as technologies or features that are embedded within larger sys‐\ntems. These features are generally utilized to increase translator productivity, improve efficiency/cost,\nreduce errors, and encourage the use of consistent style and terminology, all of which are important to deliv‐\nering high quality output.\nTranslation Memory\nTranslation memory is a common feature in most computer aided translation (CAT) tools. It comes in two\ndistinct forms, one of which is used to eliminate redundant work, and one which is used to assist translators\nin recalling similar translations from previous jobs.\nExact match translation memory simply looks for translations whose source text exactly matches a previous‐\nly completed translation. This type of search/lookup is easy to do, and is not computationally intensive, so\nan exact match translation memory can search a corpora of billions of texts nearly instantly. This is typically\nused to auto‐fill translations for source texts that have already been translated. For applications where there\nare a lot of repeating texts, this can yield significant cost savings.\nFuzzy match translation memory looks up not just exact matches, but also looks for similar source texts, and\nscores them by their degree of similarity to the index text. While this is conceptually simple, calculating the\n“distance” between texts is not trivial. At best these systems can generate an approximate “distance”\nbetween candidate texts. Because of this, fuzzy match translation memory is best used as a style and mem‐\nory aid for human translators, who can pull up a list of similar texts and their translations, and then use the\nFigure 19: Translation Process\nTranslation Processes & Features\n",
  "speaker": "SYSTEM",
  "uuid": "fff52eed-98b5-40f9-816b-01d157dfddbf"
}