{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 6\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 6 \n \n- \nFederated Query Processing for the Semantic Web. Carlos Buil Aranda. Febrero 2012. \nUniversidad Politécnica de Madrid. \nY otros tres estudiantes están cerca de defender sus tesis doctorales, en las áreas de e-Ciencia \nSemántica y Web Semántica.  \n- \nFolksonomy to Ontology Evolution. Héctor Andrés García. Diciembre 2012. \n- \nOntology-based Data Stream Access. Jean Paul Calbimonte. Febrero 2013. \n- \nSemantic annotation of geospatial resources. Víctor Saquicela. Marzo 2013. \nOtros méritos y actividades \n- \nAsesor externo y evaluador de varios comités nacionales e internacionales, organizaciones y \nproyectos: Organización Mundial de la Salud, OTAN y Comisión Europea.  \n- \nRevisor frecuente de varias revistas indexadas JCR: Journal of Web Semantics, International \nJournal of Human-Computer Studies, IEEE Internet Computing, IEEE Intelligent Systems, \nInternational Journal on Data & Knowledge Engineering (DKE), IEEE Transactions on Knowledge \nand Data Engineering, Future Generation Computer Systems, etc. \n- \nPresentación de varios seminaries y tutorials en conferencias y escuelas internacionales: \no \nPrinciples & Foundations of Ontologies & Semantic Grids. 4th, 5th, 6th y7th International \nSummer Schools on Grid Computing (ISSGC series).  \no \nRobust Management of Web and Grid Ontologies and Metadata. Tutorial en WWW2007, \nBanff, Canada. Mayo 2007 \no \nOntological Engineering. Tutorial en ECAI2004. Agosto 2004. \nCharlas invitadas en instituciones, conferencias y workshops \nEn los últimos años, he dado más de 20 charlas invitadas en instituciones, conferencias y workshops \ninternacionales, incluyendo, entre otros: Stanford University, University of Southern California, \nUniversity of Texas, UK National e-Science Centre, OTAN, etc. Algunas de las más relevantes son: \n- \nData-intensive Research with the DISPEL Language. 6th International Workshop on Semantic \nBusiness Process Management (SBPM2011). Hersonissos, Grecia. 29/05/2011 \n- \nSemantic Web Applications: Past, Present and Future. 3º Seminario OntoBras. Florianópolis, \nBrasil. 31/08/2010 \n- \nSemantics in Sensor Networks. Future Internet Symposium Workshop on Semantics and Future \nInternet. Berlin. 01/09/2009 \n- \nVision of future developments in semantic interoperability. NATO IST-075 Workshop on Semantic \nInteroperability. The Hague. 24/9/2008 \n- \nMetadata Management in Next Generation Knowledge-based Applications. ESWC2008 \nInternational Workshop on Semantic Metadata Management and Applications (SEMMA2008). \n2/6/2008 \n- \nSemantic Web and Semantic Grid. University of Texas. Austin, Texas. 21/9/2007. \n- \nOntologies and Semantic Interoperability for Humanities Data. National e-Science Centre. eSI \nThematic Programme: e-Science in the Arts and Humanities. Edinburgh. 19/06/2007. \n- \nMetadata management for the Semantic Grid. University of Liverpool, Liverpool, 28/11/2006. \n- \n(Ontology-based) Metadata: What is it, Where and How can we use it, and How can we share it? \nNational e-Science Centre Workshop: Re-use or Re-invention - a Roadmap for Data Integration \n(Schizophrenia as a Test Case). Edinburgh, Reino Unido. 27/11/2006. \n- \nS-OGSA as a Reference Architecture for the Semantic Grid. Information Science Institute, \nUniversity of Southern California. Marina del Rey, California. 12/7/2006. \n- \nSemantic Grid Requirements for Ontology Technology. SMI, Stanford University, California. \n11/7/2006. \n- \nOntoGrid and S-OGSA: Semantic Grid Requirements for Triple Stores. National e-Science Centre \nWorkshop: RDF, Ontologies and Meta-data. Edinburgh. 7/6/2006. \nPremios \n- \nPremio extraordinario de tesis doctoral.Universidad Politécnica de Madrid. Curso 2003-2004 \n- \nTercer premio nacional de Informática. Ministerio de Educación y Ciencia. 2000 \n- \nPremio al rendimiento académico. Universidad Politécnica de Madrid. Curso 2007-2008 \n- \nMejor artículo científico de la conferencia ESWC2011. Junio 2011. \n",
  "speaker": "SYSTEM",
  "uuid": "fff6e03c-abf1-4ec6-8c96-b5333dfa49e6"
}