{
  "message": "SYSTEM: Wiki: TWO PH.D. POSITIONS IN NATURAL LANGUAGE PROCESSING -- SAPIENZA  UNIVERSITY OF ROME (ITALY)\nThe Department of Computer Science of the Sapienza University of Rome  invites applications for TWO PH.D. POSITIONS IN NATURAL LANGUAGE PROCESSING.\nThe positions are part of a 5-year ERC Starting Grant on MULTILINGUAL SEMANTIC PROCESSING funded by the European Research Council (ERC) and headed by Prof. Roberto Navigli. The successful candidates will join a young and dynamic research team (including 2 faculty members,3 research fellows and 2 research associates) with solid experience and  proven excellence in NLP research. Please visit the group's website:\nhttp://lcl.uniroma1.it\nThe candidates are expected to perform cutting-edge research in one of the following areas:\nMULTILINGUAL & DOMAIN-ORIENTED WORD SENSE DISAMBIGUATION & INDUCTION\nSTATISTICAL MACHINE TRANSLATION FOR RESOURCE-RICH VS.RESOURCE-POOR LANGUAGES\nSEMANTIC INFORMATION RETRIEVAL AND EXTRACTION\nWe are seeking for qualified candidates with an excellent university  degree who are willing to research and develop state-of-the-art  algorithms and approaches.\nApplications are invited from suitably qualified candidates who have:\nA Master's degree in Computer Science, Computational Linguistics, Mathematics, or a related discipline.\nGood communication skills in English. NOTE: knowledge of Italian is NOT a requirement.\nStrong programming skills: Java and practical expertise with standard NLP tools are required, knowledge of Perl and C++ are a plus. Publication record in any of the above areas is a plus.\nINFORMATION\nApplication deadline: February 20, 2011\nStarting date: as soon as possible (successful candidates can start  on a paid internship before the official academic year -- i.e., before  October 2011)\nDuration: 3 years\nSalary: approx. 16800 euros per annum after taxes (around 1400 euros per month)\nInformal inquiries can be sent by email to Roberto Navigli  (navigli@di.uniroma1.it).\nHOW TO APPLY\nPlease send a detailed CV (possibly including a short research statement) and official transcripts of academic records to Roberto  Navigli (navigli@di.uniroma1.it). Please include the position reference LCL-PHD-2011 in the subject line.\nABOUT LA SAPIENZA\nThe Sapienza University of Rome is a seven-century-old university in the heart of Rome. It is one of the largest universities in Europe, with around 150,000 students. Its Faculty of Science (that includes the Department of Computer Science) has been ranked as the best school of science in Italy, 7th in Europe, and 25th in the world according to the Times Higher World University Ranking 2009 for Science. Sapienza University is an equal opportunity employer.\nABOUT THE COMPUTER SCIENCE DEPARTMENT\nThe Department of Computer Science is a modern and well-equipped research institution with a top-class faculty and a strong Ph.D. program. The Department comprises 42 faculty members, 15 postdocs and around 20 Ph.D.students. The successful candidate will be based in Rome, one of the most beautiful cities in the world. The Department is situated in a nice lively area with lots of cafes, bars, restaurants, and at walking distance from the city centre. Prominent candidates must not be afraid  of the language barrier, as Italians are in general very friendly.",
  "speaker": "SYSTEM",
  "uuid": "013e9f76-8dc0-48d1-bef6-f44060a2c6f1"
}