{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 10\n10\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\nTheorem 1.1. Consider a CQ q/n over a schema R, a database D for R, a set Σ of\nTGDs and KDs over R, and an n-tuple t ∈Γ n. It holds that t ∈ans(q,D,Σ) if and\nonly if t ∈q(chase(D,Σ)) or chase(D,Σ) fails.\n1.3 The Conceptual Model ER+\nIn this section we present the conceptual model we shall deal with in this pa-\nper, and we give its semantics in terms of relational schemata with dependencies.\nThis model, which is called ER+, incorporates the basic features of the Entity-\nRelationship model [3] and OO models, including subset (or is-a) constraints on\nboth entities and relationships. It is an extension of the one presented in [20], and\nwe use a notation analogous to that of [20].\n1.3.1 Syntax of ER+\nThe schemata expressed in the ER+ model are called ER+ schemata. An\nER+ schema consists of a collection of entity, relationship, and attribute deﬁni-\ntions over an alphabet of symbols partitioned into a set of entity symbols Ent, a set\nof relationship symbols Rel, and a set of attribute symbols Att.\nAn entity deﬁnition has the form\nentity E\nisa: E1,...,Ek\nparticipates(⩾1): R1 : c1,...,Rℓ: cℓ\nparticipates(⩽1): R′\n1 : c′\n1,...,R′\nm : c′\nm,\nwhere (i) E ∈Ent is the entity to be deﬁned, (ii) the isa clause speciﬁes the set\nof entities to which E is related via is-a, i.e., the set of entities that are supersets\nof E, (iii) the participates(⩾1) clause speciﬁes that an instance of the entity E\nmust necessarily participate in relationship Ri ∈Rel as the ci-th component, and\n(iv) the participates(⩽1) clause speciﬁes that an instance of the entity E cannot\nparticipate in relationship R′\ni ∈Rel as the c′\ni-th component more than once. The isa,\nparticipates(⩾1) and participates(⩽1) clauses are optional.\nA relationship deﬁnition has the form\nrelationship R among E1,...,En\nisa: R1[j11,..., j1n],...,Rℓ[jℓ1,..., jℓn],\nwhere (i) R ∈Rel is the relationship to be deﬁned, (ii) the entities of Ent listed in the\namong clause are those among which the relationship R is deﬁned (n is the arity\nof R), i.e., the i-th component of R is an instance of the entity Ei, and (iii) the isa\nclause speciﬁes the set of relationships to which R is related via is-a, i.e., the set of\nrelationships that are supersets of R; for each relationship Ri, we specify in square\n",
  "speaker": "SYSTEM",
  "uuid": "01770f38-1d4c-4732-9b29-4c4e39717027"
}