{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 34\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 34 de 42 \n5. Garijo D, Corcho O, Belhajjame K, Verdes-Montenegro L, Garrido J, Palma R and \nMazurek C. Is preserving data enough? Towards the preservation of scientific methods. \nOpen Research Data: Implications for Science and Society. Warsaw, Polonia. Mayo \n2015. \n6. Garijo D, Mihindukulasooriya N, Corcho O. LDP4ROs: Managing Research Objects with \nthe W3C Linked Data Platform. WWW2015 Workshop on Semantics, Analytics, \nVisualisation: Enhancing Scholarly Data (SAVE-SD 2015). Florencia, Italia. Mayo 2015. \n7. Giraldo O, García-Castro A, Corcho O. Using Semantics and NLP in the SMART \nProtocols Repository. Poster (Best Poster Award). 6th International Conference on \nBiomedical Ontology (ICBO 2015). Lisboa, Portugal. Julio 2015 \n8. Lozano E, Gracia J, Corcho O, Noble R., Gómez-Pérez A. Problem-based learning \nsupported by semantic techniques. Interactive Learning Environments. Volumen: 23 (1). \nPp: 37-54. Enero 2015 \n9. Lozano Hontecillas E, Jorge Gracia Del Rio, Jochem Liem, Asuncion de Maria Gomez \nPerez, Bert Bredeweg. Semantic feedback for the enrichment of conceptual models. \nInteractive Learning Environments. Springer Science+Business Media B.V. DOI \n10.1007/s10579-012-9182-3. Volumen: 23. Pp 37-54. Enero  2015 \n10. Luciano Frontino De Medeiros, Priyatna F, Corcho O. Automatic R2RML Mapping \nGeneration from Relational Databases. 15th International Conference on Web \nEngineering (ICWE 2015). Rotterdam, Holanda. Junio 2015. \n11. Memishi B, M.S. Pérez and G. Antoniu. Diarchy: An Optimized Management Approach \nfor MapReduce Masters. International Conference on Computational Science (ICCS) \n2015, Computational Science at the Gates of Nature. Procedia Computer Science, \nVolume 51. Pp: 9-18. Reykjavik, Iceland, June 2015. \n12. Mihindukulasooriya N., García-Castro R. Describing Linked Data Platform Applications \nwith the Hydra Core Vocabulary. Proceedings of the 3rd Workshop on Services and \nApplications over Linked APIs and Data Workshop 2015 (SALAD 2015). Pp: 33-36. \nCEUR, Vol. 1359. ISSN: 1613-0073. Portorož, Slovenia. 1 junio 2015. \n13. Mihindukulasooriya, N.; García-Castro, R.; Gómez-Pérez, A. A Distributed Transaction \nModel for Read-Write Linked Data Applications. Proceedings of the 15th International \nConference on Web Engineering (ICWE 2015). Springer. ISBN: 978-3-319-19889-7. \nRotterdam, The Netherlands. 23-26 junio 2015. \n14. Mihindukulasooriya N.; Rico M.; García-Castro R. An Analysis of Quality Issues of the \nProperties Available in the Spanish DBpedia. LNAI 9422. 16th Conference of the \nSpanish Association for Artificial Intelligence (CAEPIA 2015). Pp: 198-209. Springer. \nISBN: 978-3-319-24597-3. Albacete, España. 9-12 noviembre 2015. \n15. Molina M, Sanchez-Soriano J, Corcho O. A Using Open Geographic Data to Generate \nNatural Language Descriptions for Sensor Networks (DOI: 10.3390/s150716009). \nSensors. ISSN: 1424-8220. MDPI AG, Suiza. Volumen: 15. Pp: 16009-16026. Julio \n2015. \n16. Radulovic F., García-Castro R., Gómez-Pérez A. SemQuaRE - An extension of the \nSQuaRE quality model for the evaluation of semantic technologies. Computer \nStandards & Interfaces. ISSN: 0920-5489. El sevier. Dragan S. Domazet (ed.). \nVolumen: 38 pp: 101-112. Febrero 2015 \n17. Radulovic F, García-Castro R, Gómez-Pérez A. Towards the Anonymisation of RDF \nData. 27th Int. Conf. on Software Engineering and Knowledge Engineering \n(SEKE2015). Proceedings of SEKE2015, ISBN 1-891706-35-7. Pittsburg, Philadelphia, \nEEUU. Julio 2015 \n18. Radulovic F., Poveda-Villalón M, Vila-Suero D, Rodríguez-Doncel V, García-Castro R., \nGómez-Pérez A. Guidelines for Linked Data generation and publication: An example in \nbuilding energy consumption. Automation in Construction. ISSN: 0926-5805. Elsevier \nScience BV. Volumen: 57. Pp 178-187. Septiembre 2015 \n19. Santana-Pérez I, Pérez-Hernández MS. Towards Reproducibility in Scientific \nWorkflows: An infrastructure-based approach. Scientific Programming. February 2015. \nHindawi Publishing Corporation. \n20. Suárez-Figueroa MC, Gómez-Pérez A, Fernández-López M. The NeOn Methodology \nframework: A scenario-based methodology for ontology development. Applied \nOntology. IOS Press. Volumen: 10 (2) PP: 107-145. Septiembre 2015 \n2016: \n",
  "speaker": "SYSTEM",
  "uuid": "01a1794f-7d5c-45b8-ad23-de7ee29c5408"
}