{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 6\n6\nMariano Rico, Óscar Corcho et al.\nWhen a user logins to our Control Point (which will be described in section\n5), the system provides a personalized view of its contacts, and of its UPnP\ndevices and multimedia content, regardless they are local or remote. This view is\ngenerated once the authorization policies stored by the centralized Access Policy\nServer are applied. Actions allowed for each user, such as adding new contacts\nand remote homes, or authorizing other users to view their local content, can\nbe also personalized. Finally, a Facebook plugin integrated in the Control Point\neases the management of users.\nAfter user login, a set of UPnP remote sessions can be established with\neach of the remote homes that this user is authorized to access and that are\ncurrently available. UPnP remote sessions are established on top of IMS sessions,\nwhich provide the necessary levels of security and quality of service. To start\nan UPnP session that includes a remote home, the IMS UA installed in the\nHome Gateway starts an IMS session. The IMS UA of the destination home is\nconstantly listening for incoming IMS sessions. When an incoming IMS session\nis received by the destination IMS UA, an authorization request to the Access\nPolicy Agent is made.\nThe Access Policy Agent located in the Home Gateway is the element in\ncharge of verifying connection grants of the incoming calls. When receiving an\nauthorization request, it proxies it to the centralized Access Policy Server. Any\nincoming IMS session that is not explicitly allowed by the destination home\nwill be rejected or referred to the user for explicit authorization. Once a remote\nconnection is established, the UPnP Remote Extension installed in the Home\nGateway extends the UPnP visibility beyond the home network, acting as if\nthe authorized devices were part of the same local home. The interaction \u001dow\nbetween the local Control Point and UPnP-enabled Media Servers is shown in\nFig. 2.\nFig. 2: UPnP remote access \u001dow interaction\n",
  "speaker": "SYSTEM",
  "uuid": "023947c6-89d7-4b42-a653-f720bb1c7ade"
}