{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTrámites administrativos\n1.1\nObtención del Certificado de Docencia\n1.2\nSuficiencia Investigadora (Diploma de Estudios Avanzados)\n1.3\nAnteproyecto de Tesis\n1.4\nCodirección de Tesis\n1.5\nTutela Académica\n1.6\nPrelectura de tesis\n1.7\nDefensa de tesis\n2\nEnlaces a normativas\n2.1\nNormativa departamento\n2.2\nNormativa UPM\n2.3\nNormativa doctorado internacional\n3\nTrámites\nTrámites administrativos\n\nLa elaboración y defensa de la Tesis doctoral lleva asociados unos trámites administrativos. Algunos de estos trámites sólo son necesarios para obtener algún tipo de documento acreditativo necesario para asuntos oficiales (como por ejemplo solicitar una beca). Sin embargo, la mayoría de los trámites son obligatorios.\nObtención del Certificado de Docencia\n\nUna vez acabado el periodo de docencia, habiendo superado todos los cursos, se podrá solicitar un Certificado del periodo de docencia.\nEsto no es obligatorio para la obtención del título dedoctorado.\nSuficiencia Investigadora (Diploma de Estudios Avanzados)\n\nUna vez superado el periodo de trabajos de investigación, el doctorando deberá defender su aptitud para la investigación ante un tribunal para obtener la\nSuficiencia Investigadora\n. La matriculación (pago de tasas) se hace a través de la Secretaría de Alumnos. La solicitud del examen se hace a través de la Secretaría del Departamento, debiendo adjuntar:\n1. Solicitud de Suficiencia Investigadora (formulario disponible en la Web del Departamento)\n 2. Currículum vitae\n 3. Expediente notas de doctorado (se solicita en Secretaría de Alumnos)\n 4. Resumen de méritos de investigación (publicaciones, proyectos, etc.)\n 5. Documentación acreditativa de los méritos de investigación presentados\n 6. (OPCIONAL) Informe de profesores con los que ha realizados los trabajos de investigación\n 7. Memoria resumen del trabajo realizado en las asignaturas y trabajos de investigación de doctorado (unas 10 páginas)\n 8. (OPCIONAL) Descripción del trabajo de tesis doctoral en curso, firmado por el/los Director/es del trabajo (si éste no fuese \n    profesor del D.I.A., deberá ser firmado también por el tutor del alumno)\nLa superación de dicho examen da derecho a la obtención del Certificado-Diploma de Estudios Avanzados. El pago de las tasas se hará a través de la Secretaría de Alumnos.\nAnteproyecto de Tesis\n\nYa no es necesario entregar ningun documento como anteproyecto\nComo paso previo a la elaboración de la Tesis doctoral, se tiene que aprobar un proyecto de Tesis (o anteproyecto). La\nSolicitud del Proyecto de Tesis Doctoral\nse debe realizar a través de Secretaría de Alumnos. Hay que rellenar un formulario (disponible en la Web del Departamento), así como adjuntar un breve resumen que incluya:\n1. Introducción a la tesis doctoral\n 2. Estado de la cuestión\n 3. Objetivos de la tesis\n 4. Plan de trabajo\n 5. Bibliografía asociada\nLa extensión del resumen no es fija, variando entre las 5 y 30 páginas.\nCodirección de Tesis\n\nEn los casos en los que una Tesis sea dirigida por más de un director, hay que solicitar la codirección de la Tesis. Una vez aprobado el proyecto de Tesis, hay que entregar en la Secretaría del Departamento la\nSolicitud de Codirección de Tesis\n(\nModelo solicitud codirecciópn\n), la\nJustificación de la Codirección de Tesis\n(\nJustificación codirección\n) y el informe de\nAceptacion de la Codireccion de Tesis\n(\nAceptación codirección\n).\nTutela Académica\n\nLos alumnos que hayan terminado los dos períodos de docencia e investigación y hayan solicitado la aprobación del proyecto de Tesis deberán abonar en ese momento y todos los años a partir del mismo una Tasa por Tutela de Tesis Doctoral. Esta tasa da derecho a la utilización de las instalaciones y servicios de la Facultad, al mantenimiento del expediente y, en consecuencia, al mantenimiento, también, de la condición de alumno del interesado. El impago de la tutela puede acarrear la expulsión del programa de doctorado.\nPara abonar las tasas basta ir a Secretaría de Alumnos, donde tras solicitarlo expiden la carta de pago correspondiente.\nPrelectura de tesis\n\n(Esto es un borrador, falta escribir detalles y poner enlace a la normativa donde aparezca este proceso descrito.)\nHay dos opciones para hacer la prelectura, a y b.\nEn caso de tener x artículos, también hay que solicitar la prelectura en el departamento. Hay que escribir un formulario de solicitud de prelectura y adjuntar un documento hablando de las publicaciones relevantes.\nEn caso de no tener x articulos o de querer realizar la presentación de la prelectura, se han de entregar los siguientes documentos:\nSolicitud de la prelectura de la tesis\n(\nModelo petición prelectura\n) y la\nAutorización para la presentación pública de la tesis\n(\nModelo autorización prelectura\n)\nUna vez solicitada la prelectura, en la siguiente junta de departamento se acepta o no. En caso de ser aceptada, se dispone de 3 meses \"habiles\" (agosto no cuenta) hasta la presentación de la misma.\nDefensa de tesis\n\nDocumento con los límites de defensa de tesis doctorales de planes antiguos (regidos por RD 778/98, RD 56/2005 y RD 1393/2007):\nDocumento plazos\nResumen:\n- Iniciadas antes de febrero de 2011: 11 de febrero de 2016\n- Iniciadas después de febrero de 2011: 20 de septiembre de 2017\nCuidado, no afecta a los planes regidos por RD 99/2011, cuyo doctorado ha comenzado a partir de 2011. Éstos están sujetos a tablas según tipos y tienen máximo número de años.\nEnlaces a normativas\n\nAquí está el Real Decreto:\nRD99/2011\nNormativa departamento\n\nNormativa UPM\n\nNormativa UPM\nEn este enlace está toda la normativa muy bien contada y escueta sobre las tesis doctorales.\nAdemás, se pueden encontrar los Word y OpenOffice de los informes anuales que hay que entregar y otra documentación, los requisitos para doctorado europeo, formación de tribunal, etc.\nNormativa doctorado internacional\n\n[1]\nTrámites\n\nNota.- De acuerdo a la normativa actual (Abril 2011)\nOpciones generales\n1. Si se hace doctorado europeo no se hace prelectura.\n2. Si tienes un artículo JCR no se hace prelectura.\nDocumentos para el depósito\ndocumentos boricles\nTrámites después del depósito y aceptación del tribunal\n1. Una vez fijada la fecha y hora de lectura por el Presidente(a),\néste(a) se lo comunicará al Secretario(a) y al secretario(a)\nadministrativo(a) del Programa de Doctorado.\n2. El secretario(a) administrativo(a) del Programa de Doctorado\nrealizará la reserva de la sala donde se llevará a cabo la defensa por\nel procedimiento habitual (correo electrónico a Jefatura de estudios) y\nuna vez obtenida dicha reserva se lo comunicará al Secretario(a).\n3. El Secretario comunicará, por indicación del Presidente, a los\nVocales, al Vicedecanato de Posgrado (v.investigacion@fi.upm.es) y a\nSecretaría de Alumnos del Centro (bego@fi.upm.es), la fecha, lugar y\nhora de la defensa de la Tesis, con al menos 15 días de antelación. Se\nsugiere como cuerpo del mensaje:\nEstimados compañeros,\nComo Secretario del Tribunal nombrado por la Comisión de Doctorado de la\nUniversidad Politécnica de Madrid que ha de juzgar la tesis doctoral\npresentada por D. XXXXXXXX titulada XXXXXXXXXX, le comunico por orden\ndel Presidente de dicho tribunal que el acto de defensa de la tendrá\nlugar el próximo día xxxxxxx,a las XXXXXXX, en la XXX de la Facultad de\nInformática de la Universidad Politécnica de Madrid.\nEl Secretario del Tribunal,\n4. El secretario(a) administrativo(a) del Programa de Doctorado enviará\na los Vocales del tribunal los impresos de liquidación de dietas y\ngastos de locomoción.\n(\nhttp://www.fi.upm.es/intranet_p/docs/tramites/2_gastos_tesis_doctorales.pdf\n).\n5. El día de la lectura, el Secretario deberá recoger las actas de la\nlectura de la Tesis en la Secretaría de Alumnos del Centro. Y el\nsecretario(a) administrativo(a) del Programa de Doctorado deberá\nolicitar a los Vocales los impresos de liquidación de dietas y gastos\nde locomoción, así como los correspondientes justificantes y tramitarlos\na Gestión Económica.\n6. El procedimiento que se debe seguir para la defensa de la tesis, está\nrecogido en el punto 11 del reglamento de elaboración y defensa de Tesis\nDoctoral de la Universidad Politécnica de Madrid\n(\nhttp://www.upm.es/normativa/academica/Reglamento_Elaboracion_Defensa_Tesi\n>s).\n7. Durante el acto de defensa y cuando se lo indique el Presidente, el\nSecretario deberá proceder a la lectura de la correspondiente normativa\nde defensa (RD 1393/2007).\n8. Al finalizar el acto de defensa, el Secretario se encargará de\nellenar las actas por cuadruplicado, en las que deben figurar la\ncalificación, fecha de lectura, nombre y firma de cada uno de los\nmiembros del tribunal.\n9. El Secretario deberá entregar las tres actas originales en la\nSecretaría de Alumnos y la copia al secretario administrativo del\nPrograma de Doctorado para su archivo.",
  "speaker": "SYSTEM",
  "uuid": "024e84cd-8e19-49a3-89f6-447a62c30cff"
}