{
  "message": "SYSTEM: Ejercicios.pdf: Página 14\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n14 \nEjercicio 6    Ejemplo del Aparato Digestivo. \n \nSe desea construir un sistema basado en marcos que se utilizará en la enseñanza del aparato \ndigestivo a niños de 10 años. Se sabe que forma el aparato digestivo los siguientes órganos: \nboca, esófago, estómago, intestino delgado e intestino grueso. La boca precede al esófago, y \néste al estómago. A continuación, y en el siguiente orden, se encuentra el intestino delgado y el \nintestino grueso. \n \nLas funciones de dichos órganos son: la boca para masticar y deglutir, el esófago para transferir \nalimentos; el estómago para mezclar y comenzar la digestión; el intestino delgado para \nabsorverlos; y el intestino grueso para absorver y desecharlos. \n \nLos órganos del aparato digestivo están unidos entre sí, pero al mismo tiempo están \nindependizados por medios esfínteres. Así, el cardias une el esófago con el estómago e impide \nque el alimento pase del estómago al esófago. El píloro une el estómago y el duodeno. La \nválvula ileocecal une el intestino delgado con el grueso. El experto posee más conocimiento \nsobre estos esfínteres. Dichas propiedades se describen en otros documentos, y deberá tenerse \nen cuenta para incluirlas posteriormente en el sistema final. \n \nEl esófago es un tubo muscular de 30-40 cm. de longitud, cuyas contracciones empujan el bolo \nalimenticio desde la boca al estómago. Su mucosa no está preparada para soportar la presencia \nde ácido. El estómago es un saco muscular dividido en zonas: el fundus (que está unido al \nesófago por el piloro) y el cuerpo (parte intermedia) para almacenar alimentos de gran tamaño; \ny el antro (unido al intestino delgado por el cardias) para mezclar y triturar los alimentos. \n \nEl intestino delgado está compuesto por el duodeno, yeyuno e ileón. El duodeno es un tubo de \n25 cm. de longitud que conecta el estómago al resto del intestino delgado. El yeyuno sigue al \nduodeno, tiene dos metros de longitud, y comunica el duodeno con el ileón el cual mide 4 \nmetros. \n \nEl intestino grueso comienza con el colon ascendente. Este precede al colon transverso, el cual \nva seguido del colon descendente, del colon sigmoideo, y del recto. El colon ascendente \ncomunica el intestino delgado con el resto del intestino grueso. \n \nEn la digestión intervienen numerosos jugos, ácidos y enzimas. Además, se sabe que los jugos \nestán compuestos por ácidos y enzimas. La enzima Amilasa está en la boca; el jugo gástrico, \nformado por ácido clorhídrico y la enzima pepsina en el estómago; y, los jugos pancreáticos y \nbiliar en el duodeno. El experto posee más conocimientos sobre ellos, y deberá tenerse en \ncuenta para incluir dicho conocimiento posteriormente en el sistema final. \nSe pide: \na) Construir el diagrama de la jerarquía de macros y explicar la semántica de las relaciones \nempleadas. Indicar en dicho diagrama cuales son las propiedades de cada marco clase. \nb) Explicar detalladamente los marcos: intestino delgado, duodeno, yeyno e ileón. \nc) Si a este sistema se le preguntaran las siguientes cuestiones, ¿cuál sería la sintaxis de las \nconsultas, cómo razonaría el sistema y qué respondería?: \nc.1. \n¿Cuáles son los componentes del estómago? \nc.2. \n¿Cuál es el esfinter superior del colon ascendente? \nc.3 \n¿Precede el estómago al esófago? \nC.4. \n¿Cuál es el órgano que está en la parte superior del Cardias? \nC.5. \n¿Cuál es el órgano que está en la parte inferior del Piloro? \nC.6. \n¿De qué órgano forma parte el colon transverso? \nC.7. \n¿Qué enzima produce la boca? \nC.8. \n¿Qué elementos forman el jugo pancreático? \nC.9. \n¿Es el ácido clorhídrico una enzima? \nC.10. ¿Cuánto mide el intestino delgado? \n",
  "speaker": "SYSTEM",
  "uuid": "027b0054-72c9-46b7-864f-4bf082bc2998"
}