{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 86\n84\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nThe foundations of NLP lie in a number of disciplines, viz. computer and information sciences, linguistics,\nmathematics, electrical and electronic engineering, artificial intelligence and robotics, psychology, etc.\nIn the field of Natural Language Processing, there exist two distinct focuses: language processing and lan‐\nguage generation. The first refers to the analysis of language for the purpose of producing a meaningful rep‐\nresentation, while the latter refers to the production of language from a representation.\nApplications of NLP include a number of fields of studies, such as machine translation, natural language text\nprocessing and summarization, user interfaces, multilingual and cross language information retrieval (CLIR),\nspeech recognition, artificial intelligence and expert systems, SEO and so on.\nSemantic Search Engines\nSemantic Search Engines are systems to provide rapid access to text or unstructured data inside databases\non desktops or across the entire Internet that formally encoding meaning (i.e. semantics) separately from\ndata, content or applications, generally ontologies and the tools to build them.\nTimely access to critical information in companies and institutions is vital in today’s information economy.\nThe knowledge worker’s productivity relies on his capability to access to the right information in the proper\ntime. In fact, information is useless if it can’t be found and retrieved within its digital data life span.\nSo, as digital information is more and more abundant within the organizations, the search engines become\nmore and more important to work effectively. However, unstructured data and language barriers have lim‐\nited the success of search engines.\nFor that reason, search itself has evolved into a larger collection of technologies than just a basic search\nengine. The move from technology to product requires not only additional technologies, like text analytics\nand categorization, but also tools to adjust relevance, create filtering rules, protect information security,\ndeliver appropriate results to different devices, and analyse usage.\nThe application of semantics to search engines seeks to boost accuracy search by aiming ambiguity via an\nunderstanding of context. Indeed, search and semantics have similar goals and rely on similar technologies:\nto make information more findable and usable.\nSemantic search companies used several methodologies to integrate semantics into their engines: RDF Path\nTraversal, meaning‐text functions, keyword to Concept Mapping, graph Patterns, Logics, fuzzy concepts,\nrelations and logics.\nNatural Language Query Engines\nNatural Language Query Engines are systems to analyse and classify a question, and use NLP techniques to\nunderstand an answer, usually from a text source.\nUnder overload information, the key considerations for improving access include accessibility, high precision,\nease of use, transparent retrieval across heterogeneous data sources and accommodation of rapid language\nchange in the domain.\nAnother approach to provide innovative search solutions is to consider natural language query engines. The\nidea behind is that people can use human language to ask for information rather than Boolean operators,\nkeywords or complex query structures. However, people’s keywords usage habits undermine the value of\nthis type of engines that needs a complete sentence to understand what has been asked.\n",
  "speaker": "SYSTEM",
  "uuid": "027c3263-baf7-422f-94fd-25ec6d9ef083"
}