{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 141\nMINISTERIO DE CULTURA\n147\n178.- Base de datos de editoriales. Agencia del ISBN\nDirección Web:\nhttp://www.mcu.es/webISBN/editorialAvanzadaFilter.do?cache=init&layout=\nbusquedaeditoriales&language=es\nOrganismo editor: Subdirección General de Promoción del Libro, la Lectura y las Letras\nEspañolas. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple \nMateria: Bibliotecas. Bibliografía. Edición.\nDescripción y comentarios: Base de datos sobre editoriales. Contiene datos de todas las\neditoriales españolas que han estado en activo en algún momento entre 1972 y la actuali-\ndad, así como autores-editores y entes o empresas que publican esporádicamente. Su\nnúmero se cifra en casi 50.000: más de 18.000 actualmente en activo y otras 30.000 ya des-\naparecidas. Permite buscar por nombre de editor, comunidad autónoma, provincia, prefijo\nISBN, año de alta y tipo de editor, así como enlazar con su producción editorial. \n179.- Base de datos de premiados del libro, lectura y letras\nDirección Web: http://www.mcu.es/premiado/cargarFiltroBusquedaAction.do?layout=\npremiado&cache=init&language=es\nOrganismo editor: Subdirección General de Promoción del Libro, la Lectura y las Letras\nEspañolas. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCatálogos\nImagen/Texto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Bibliotecas. Bibliografía. Edición.\nDescripción y comentarios: La base de datos de premiados ofrece información bibliográ-\nfica sobre todos aquellos escritores, traductores e ilustradores que a lo largo de sus carre-\nras han obtenido alguno de los premios que otorga el actual Ministerio de Cultura a través\nde la Subdirección General de Promoción del Libro, la Lectura y las Letras Españolas.\nEstos premios que convoca y concede cada año el Ministerio de Cultura tienen como obje-\ntivo estimular la creación literaria mediante el reconocimiento público de la labor de los\nautores cuyas obras han destacado especialmente a juicio de un jurado de expertos en cada\nmodalidad. Igualmente se reconoce la labor en pro de la difusión de la cultura de determi-\nnadas entidades y profesionales. \nBASES DE DATOS  1/1/04  03:39  Página 147\n",
  "speaker": "SYSTEM",
  "uuid": "029cc47b-322d-4b0c-85dd-fe1ac2627052"
}