{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 17\n \n \nPág. 19 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nHacer uso de las herramientas proporcionadas por el Plan de Internacionalización \nde la Agenda Digital para España, que contiene un programa de financiación \ndirecta a las empresas para actividades de internacionalización (ICEX, AECID, ...). \n \nApoyar el papel tractor de las grandes empresas españolas asentadas en el \nmercado iberoamericano y otros mercados emergentes. \n \nEstrechar la cooperación con la comunidad iberoamericana para liderar la \nimplantación de las tecnologías de procesamiento de lenguaje natural y \ntraducción automática en español. Apoyo y participación institucional de los \ndistintos países iberoamericanos en el proyecto. \n3. La Administración Pública como impulsora de la industria del lenguaje: \n3.1. Creación de las Plataformas comunes de procesamiento de lenguaje natural y de \ntraducción automática de las Administraciones Públicas: \n \nMejorar la calidad y capacidad del servicio público incorporando las tecnologías de \nprocesamiento de lenguaje natural y traducción automática. \n \nDotar de herramientas comunes para el procesamiento del lenguaje natural y la  \ntraducción automática a las Administraciones Públicas. \n \nEn concordancia con las recomendaciones CORA, simplificar, lograr sinergias y \naplicar la economía de escala en la puesta en marcha de nuevos servicios basados \nen tecnologías de procesamiento de lenguaje natural y traducción automática. Se \nbusca el ahorro de costes mediante la compartición de recursos entre las \nAdministraciones Públicas, y la eliminación de duplicidades y redundancias; \nademás de mediante la mejora de la eficiencia de los procedimientos y la mejora \ndel conocimiento. La plataforma se basará en el empleo de componentes \nreutilizables e interoperables, y, preferentemente, con licencias no restrictivas de \ncódigo abierto. \n \nDisponer de herramientas comunes para la generación, evaluación y explotación \nde los recursos lingüísticos. \n \nCompartir infraestructuras y sistemas entre los proyectos innovadores que sean \napoyados desde las instituciones públicas. También podrán ser usados tras la \nfinalización de los proyectos como centros demostradores online. \n \nEmplear infraestructuras y sistemas comunes para su aplicación en el sector \ninvestigador facilitando el desarrollo de nuevos componentes y el análisis de \ngrandes corpus documentales. \n \nCompartir servicios con otras instituciones del sector: Real Academia Española, \nInstituto de España, organismos iberoamericanos, etc. \n3.2. Recursos lingüísticos de las Administraciones Públicas y Política de Reutilización de la \nInformación del Sector Público: \n",
  "speaker": "SYSTEM",
  "uuid": "0308b104-afbe-40e6-a4b5-16b3b7aa9ef5"
}