{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 12\n5.1 Building local ontologies from the Reference Ontology \nThe building process is structured/guided by the architecture of the Reference \nOntology and scoped with applications needs. In this sense, we will need to extend \nsome already defined elements, to remove unnecessary elements, or to add new \napplication dependent elements that appear in each ES schema source. The result of \nthis should be a RO friendly \"local\" ontology. Thanks to this similarity, mappings \nbetween local ontologies and RO will not be complex. But on the other hand, \nmappings between local ontologies and ES schema sources will be complex. \nRegarding the evolution and change propagation dimension we have: \n• \nChanges in the RO imply a change in the mappings between local and RO as well \nas probably changes in the mappings between the local ontologies and the ES \nschema sources. \n• \nChanges in the RO imply a change in the local ontology; in this case, the \nmappings RO – local ontology would remain as they were. The mappings \nbetween the local ontologies and the ES schema sources should be updated. \n• \nChanges in the ES schema sources imply changes in its local ontology (probably \nthe part that is not a mirror of the RO) and the mappings between local ontologies \nand ES schema sources, and probably minor changes in the mappings between \nlocal ontology and the RO. This last consequence is especially interesting \nbecause the changes in the ES schema sources will be the most frequent in the \nscenario posed by SEEMP. \n5.2 Building local ontologies as a reverse engineering process from the ES \nschema sources \nIn this case, mappings between local ontologies and schema resources should not be \ncomplex. On the other hand, complex mappings will appear between the Local and \nRO. The building process requires more sophistication of knowledge engineering and \ngood acquaintance of all the data and their structures of the application: not easily \nfound skill set in ES or any other operational/research organizations. Regarding the \nevolution and change propagation dimension we have: \n• \nChanges in the ES schema sources imply a change in the local ontologies and, \nconsequently, in mappings between sources and local ontologies, but not \nnecessarily in mappings between local and the RO. \n• \nChanges in the RO imply changes in the mappings between local ontologies and \nthe RO, but it is not necessary to modify anything at the ES level. \n",
  "speaker": "SYSTEM",
  "uuid": "032db6ba-76c3-472d-9007-3c081a7afc21"
}