{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 61\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 61 of 124\nTable 4.2: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nadjacency list data model(continued)\nSlot\nValue\nExample\n1. Create the Water area class.\n2. Create the Fishing Statistical area class, and set up the subClassOf re-\nlation between the Fishing Statistical area class and the Water area\nclass.\n3. Create the Environmental area class, and set up the subClassOf relation be-\ntween the Environmental area class and the Water area class.\n3.1. Create the Inland/marine class, and set up the subClassOf relation be-\ntween the Inland/marine class and the Environmental area class.\n3.2. Create the Ocean class, and set up the subClassOf relation between the\nOcean class and the Environmental area class.\n3.3. Create the North/South/Equatorial class, and set up the subClas-\nsOf relation between the North a South a Equatorial class and the\nEnvironmental area class.\n3.4. Create the Sub Ocean class, and set up the subClassOf relation between\nthe Sub Ocean class and the Environmental area class.\n3.5. Create the Large Marine ecosystem class, and set up the subClas-\nsOf relation between the Large Marine ecosystem class and the\nEnvironmental area class.\n4. Create the Jurisdiction area class, and set up the subClassOf relation be-\ntween the Jurisdiction area class and the Water area class.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: TX-AP-01 [SFBG+07]\nPR-NOR-CLTX-03. Pattern for re-engineering a classiﬁcation scheme which follows the snowﬂake\ndata model\nThe pattern for re-engineering non-ontological resource shown in Table 4.3 suggests a guide to transform a\nclassiﬁcation scheme into an ontology. The classiﬁcation scheme is modeled/represented with a snowﬂake\ndata model. This pattern aims at creating a taxonomy from the classiﬁcation scheme, being the semantics\nof the relations between classiﬁcation scheme items the subClassOf relationship.\nTable 4.3: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nsnowﬂake data model.\nSlot\nValue\nGeneral Information\nName\nClassiﬁcation scheme to Taxonomy (snowﬂake model)\nIdentiﬁer\nPR-NOR-CLTX-03\nType of Component\nPattern for Re-engineering Non-Ontological Resource (PR-NOR)\nUse Case\nGeneral\nRe-engineering a classiﬁcation scheme which follows the snowﬂake model to design a tax-\nonomy.\nExample\nSuppose that someone wants to build an ontology based on an occupation hierarchical clas-\nsiﬁcation, which follows the snowﬂake data model.\nPattern for Re-engineering Non-Ontological Resource\nINPUT: Resource to be Re-engineered\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "033a4f09-2b10-441d-94f4-f7bc20f512c6"
}