{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 13\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13921\n2.  En todo caso, quienes a la entrada en vigor de este real decreto se encuentren \ncursando estudios de doctorado disponen de 5 años para la presentación y defensa de la \ntesis doctoral. Transcurrido dicho plazo sin que se haya producido ésta, el doctorando \ncausará baja definitiva en el programa.\nDisposición transitoria segunda.  Programas de doctorado verificados con anterioridad o \nen tramitación.\nLos programas de doctorado ya verificados conforme a lo establecido en el Real \nDecreto 1393/2007, de 29 de octubre, deberán adaptarse a lo dispuesto en el presente \nreal decreto con anterioridad al inicio del curso académico 2013-2014. En todo caso tales \nprogramas deberán quedar completamente extinguidos con anterioridad al 30 de \nseptiembre de 2017.\nLas universidades responsables de los programas de doctorado que en la fecha de \nentrada en vigor del presente real decreto hubieran iniciado el procedimiento de verificación \ny no hubieran obtenido todavía la correspondiente resolución, podrán optar entre continuar \nla tramitación ya iniciada o acogerse a lo dispuesto en el presente real decreto.\nDisposición derogatoria única.  Derogación normativa.\nQueda derogado el Capítulo V del Real Decreto 1393/2007, de 29 de octubre, por el \nque se establece la ordenación de las enseñanzas universitarias y cuantas disposiciones \nde igual o inferior rango se opongan a lo establecido en este real decreto, sin perjuicio de \nlo establecido en la disposición transitoria segunda del presente real decreto.\nDisposición final primera.  Modificación del Real Decreto 1393/2007, de 29 de octubre, \npor el que se establece la ordenación de las enseñanzas universitarias.\n1.  Se modifica el artículo 11 del Real Decreto 1393/2007, de 29 de octubre, que \nqueda redactado en los siguientes términos:\n«Artículo 11.  Enseñanzas de Doctorado.\n1.  Se entiende por doctorado el tercer ciclo de estudios universitarios oficiales, \nconducente a la adquisición de las competencias y habilidades relacionadas con la \ninvestigación científica de calidad.\n2.  La superación de las enseñanzas de doctorado dará derecho a la obtención \ndel título de Doctor o Doctora, con la denominación que figure en el RUCT.\n3.  La denominación de los títulos de Doctor será: Doctor o Doctora por la \nUniversidad U, siendo U la denominación de la Universidad que expide el título. \nAsimismo, la expedición material del título incluirá información sobre el programa de \ndoctorado cursado, de acuerdo con lo establecido al respecto en el Real Decreto \n1002/2010, de 5 de agosto, sobre expedición de títulos universitarios oficiales.\n4.  Sin perjuicio de la vigencia para estas enseñanzas de lo dispuesto en las \ndisposiciones adicionales, cuarta, quinta, sexta y disposición transitoria tercera de \neste real decreto, las enseñanzas de doctorado se regirán por su normativa \nespecífica.»\n2.  Queda sin contenido el apartado 3.4 de la Memoria para la solicitud de verificación \nde títulos oficiales contenida en el Anexo del citado real decreto.\nDisposición final segunda.  Modificación del Real Decreto 1002/2010, de 5 de agosto, \nsobre expedición de títulos universitarios oficiales.\nSe modifica el apartado 5 del artículo 11 del Real Decreto 1002/2010, de 5 de agosto, \nsobre expedición de títulos universitarios oficiales, que queda redactado en los siguientes \ntérminos:\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "03cd5eb0-e911-4169-a1de-86c3dbbd06cc"
}