{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 21\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11170\nCAPÍTULO IV\nDisposiciones específicas de las ayudas para estancias breves en otros Centros de \nI+D del Subprograma FPI-MICINN\nArtículo 39.  Objeto.\n1.  Estas ayudas complementarias tienen como objeto la financiación de la realización \nde estancias, por parte del personal investigador en formación, en Centros de I+D diferentes \na los que estén adscritos con el fin de que dicho personal pueda realizar actividades \nbeneficiosas para mejorar su formación y/o la investigación del proyecto para el que se \nconcede la ayuda, así como impulsar el desarrollo de su tesis.\n2.  Las ayudas se podrán solicitar para estancias en otros Centros de I+D y empresas \nextranjeros o españoles, siempre que éstos estén ubicados en una localidad distinta a la \ndel Centro en que se desarrolla la actividad.\nArtículo 40.  Beneficiarios.\nPodrán ser beneficiarios de estas ayudas los Centros de I+D de adscripción del \npersonal investigador en formación de la presente y anteriores convocatorias del \nsubprograma de ayudas para la formación de personal investigador, independientemente \nde la situación jurídica (beca o contrato) en la que se encuentre el personal investigador \nen formación.\nArtículo 41.  Características de las ayudas.\n1.  Las estancias que se soliciten tendrán una duración mínima de dos meses y \nmáxima de seis, pudiendo desarrollarse en diferentes periodos.\nEn caso de desarrollarse en diferentes periodos, solo se abonará una única ayuda para \nel viaje asignándose la de mayor cuantía, de acuerdo con lo establecido en el apartado 4.\n2.  Las estancias se realizarán dentro del año 2011, y podrán disfrutarse durante la \nfase de beca o la fase de contrato, excluyéndose los periodos no recuperables establecidos \nen el artículo 20.\n3.  El importe de la ayuda para la estancia será:\na)  En España: 25 euros por día de estancia en el centro.\nb)  En el extranjero: 50 euros por día de estancia en el centro.\n4.  El importe de la ayuda para el viaje, que podrá realizarse en vehículo propio, será:\na)  Desplazamientos en España:\nDentro de la Península: Hasta 90 euros.\nA o desde las Islas Baleares: Hasta 120 euros.\nA o desde las Islas Canarias: Hasta 150 euros.\nb)  Desplazamientos al extranjero:\nHasta 600 euros cuando el lugar de destino sea un país de Europa.\nHasta 1.500 euros cuando el lugar de destino sea un país del resto del mundo.\n5.  Sin perjuicio de lo anterior, el personal investigador en formación disfrutará de un \nseguro de accidentes y de asistencia médica en los desplazamientos al extranjeros \nautorizados por el Ministerio de Ciencia e Innovación cuando se trate de países sin \nconcierto con la Seguridad Social española o cuando las coberturas de este concierto \nfueran insuficientes.\n6.  Una vez concedidas las ayudas y en casos debidamente justificados, el órgano \nconcedente podrá autorizar cambios en el objeto de la estancia, sin que ello suponga \nincremento del gasto aprobado.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "03ed81ca-f023-4d56-9367-e19696e39380"
}