{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 16\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 16 de 42 \nCoordinador del proyecto: Óscar Corcho García \n \nTítulo del proyecto: Social Media: Métodos y Tecnologías para Medios Sociales (CEN-20101037) \nEntidad financiadora: CDTI \nEntidades participantes: Yahoo! España (coord.), Acceso, Activa, Bestiario, Indra, Media Planning \nGroup, Neo Metrics, Fundación Barcelona Media, UPC, UPM, CSIC, UIB, laSalle-Univ. Ramon Llul, \nFundación Barcelona Digital, Univ. Oviedo \nDuración, desde: 01-09-2012  \nhasta: 31-12-2013 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: Ciudad 2020. Hacia un modelo de ciudad inteligente sostenible (IPT-20111006) \nEntidad financiadora: CDTI \nEntidades participantes: Indra Sistemas, Ferrovial Servicios, Atos Origin, Fagor Eléctrica, Grupo \nCorporativo GFI Informática, Iriscene Software Corporation, Intelligent Software Components, Tekia \nIngenieros, Daedalus Data, Decisions and Language \nDuración, desde: 01-10-2011  \nhasta: 31-12-2014 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: BabeLData. Multilingüismo en ontologías y Linked Data (TIN2010-17550) \nEntidad financiadora: Ministerio de Ciencia e Innovación \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 01-01-2011  \nhasta: 31-12-2013 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: myBigData: métodos, técnicas y herramientas para dar soporte a la e-Ciencia \nbasada en datos (TIN2010-17060) \nEntidad financiadora: Ministerio de Ciencia e Innovación. Convocatoria de Proyectos de Investigación \nFundamental (TIN) \nEntidades participantes: Universidad Politécnica de Madrid  \nDuración, desde: 01/01/2011 hasta: 31/12/2013 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Red temática española de Linked Data (TIN2010-10811-E)  \nEntidad financiadora: Ministerio de Ciencia e Innovación \nEntidades participantes: Universidad Politécnica de Madrid, Euskal Herriko Unibertsitatea, Universidad \nRey Juan Carlos, Universidad de Deusto, Universidad Complutense de Madrid, Universidad Nacional de \nEducación a Distancia, Universitat de Lleida, Universidad Europea de Madrid, Universidad San Pablo \nCEU, Universidad de Zaragoza, Universidad de Santiago de Compostela, Universidad de Murcia, \nUniversidad de Málaga, Universidad Carlos III de Madrid, Universidad de Extremadura, Universidad de \nSevilla, Fundación CTIC, Universidad de Oviedo. \nDuración, desde: 01/01/2011 hasta: 31/12/2012 \n \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Wf4Ever (FP7-270192)  \nEntidad financiadora: Unión Europea \nEntidades participantes: Intelligent Software Components, S.A., University of Manchester, Universidad \nPolitécnica de Madrid, University of Oxford, Poznan Supercomputing Centre, Instituto de Astrofísica de \nAndalucía (CSIC-IAA), Leids Universitair Medisch Centrum \nDuración, desde: 01/12/2010 hasta: 30/11/2013 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: PlanetData (FP7-257641)  \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Innsbruck, Stichting Centrum voor Wiskunde en Informatica, \nEcole Polytechnique Federale de Lausanne, Foundation for Research and Technology-Hellas, Freie \nUniversitat Berlin, Jozef Stefan Institute, Karlsruhe Institute of Technology, Semantic Technology Institute \nInternational, Universidad Politecnica de Madrid \nDuración, desde: 01/10/2010 hasta: 30/09/2013 \nInvestigador responsable por la UPM: Óscar Corcho García \n",
  "speaker": "SYSTEM",
  "uuid": "04680a93-c0b6-4239-a0de-203e20d2ac1d"
}