{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 174\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n180\n241.- SIAS. Sistema de información del agua subterránea. Instituto Geológico\ny Minero de España (IGME)\nDirección Web: http://www.igme.es/internet/default.asp\nOrganismo editor: Instituto Geológico y Minero de España (IGME).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nTexto completo\nAvanzada\nMateria: Geociencias.\nDescripción y comentarios: Sistema de Información del Agua Subterránea en Espa-\nña. Proyecto piloto: Andalucía (Sevilla y Huelva). El equipo SIG de la Dirección de\nHidrogeología y Aguas Subterráneas ha definido y diseñado una herramienta de trabajo\ndirigida a usuario final (técnico hidrogeólogo, fundamentalmente), como apoyo a los pro-\nyectos de investigación e ingeniería hidrogeológica. Esta herramienta permite la visualiza-\nción, consulta, generación de gráficos, etc., de la información de la base de datos SIAS. La\nbase topográfica 1 : 400.000 es del ICA y su uso es restringido al SIAS.\n242.- SIGEOF. Sistema de información geofísico. Instituto Geológico\ny Minero de España (IGME)\nDirección Web: http://www.igme.es/internet/sigeof/i_inicio_spa.asp\nOrganismo editor: Instituto Geológico y Minero de España (IGME).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nTexto completo\nCompleja\nMateria: Geociencias.\nDescripción y comentarios: Sistema de Información Geofísico. Gestor de datos geofísi-\ncos del territorio nacional español, permite la consulta y descarga de información de múl-\ntiples disciplinas geofísicas: gravimetría, radiometría y magnetometría aeroportadas, eléc-\ntrica, testificación, petrofísica y sísmica. Su interfaz WEB permite ejecutar consultas en\nbase a criterios geográficos o sobre los atributos de los reconocimientos geofísicos. \nBASES DE DATOS  1/1/04  03:39  Página 180\n",
  "speaker": "SYSTEM",
  "uuid": "05ccbf04-4ce5-42d8-815d-4a17a137dbc3"
}