{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 6\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n1.6. Coste estimado del desarrollo de su solución propuesta\n€\n1.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n1.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n1.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n1.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 1.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­6­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n#\n#\nUn conjunto de ontologías  multilingües   proporcionan una base común para representar el \nconocimiento de diferentes dominios. Dichas ontologías facilitan la integración de fuentes \nde datos heterogéneas que pueden encontrarse en distintos formatos, esquemas e \nidiomas, permitiendo así su interoperabilidad. Esta capacidad de integración   e \ninteroperabilidad, además de ser un beneficio para el sector privado tecnológico, facilitará   el \ndesarrollo de aplicaciones que proporcionen soporte a diferentes servicios públicos. Las \nontologías facilitarán, asimismo, el intercambio de información   con los ciudadanos, con los \ndiferentes departamentos internos y con diversos organismos públicos. \n \nUn catálogo   de ontologías multilingües   que permite su organización, búsqueda   y \ncomparación según diferentes criterios sirve como punto de referencia para las actividades \nmencionadas en el párrafo   anterior. \n \nPor otro lado, la integración   e interoperabilidad entre información   de administraciones \npúblicas   y el sector privado podría suponer un aumento de la eficiencia de ciertos \nprocesos así como un decremento de las duplicidades tanto de datos como de tareas. \n \nPor otra parte, si las ontologías  se desarrollan y publican siguiendo las buenas prácticas \nrecomendadas por el Consorcio de la World Wide Web, se fomenta la disponibilidad de \nmodelos abiertos y accesibles en la Web. Estas ontologías pueden jugar el papel de \nmódulos   reutilizables en diferentes aplicaciones. Además   pueden servir como modelo \npara anotar distintas fuentes de datos que se pueden enlazar (entre ellas o con fuentes de \ndatos externas como por ejemplo DBpedia) y publicar de acuerdo con el paradigma de los \ndatos abiertos y enlazados en la Web, siguiendo así la política de RISP. \n \nEn general, los organismos públicos   disponen de un gran volumen de datos que \npretenden transformar en información útil   y fácil   de usar para los ciudadanos. Además, en la \nactualidad la administración   pública   está   preocupada por la transparencia tanto de los \ndatos como de la gestión. En este contexto, el uso de ontologías puede facilitar la limpieza \nde los grandes volúmenes de datos existentes en los servicios públicosasí como mejorar\nLa capacidad de integración   de fuentes de datos heterogéneas   proporcionada por las \nontologías multilingües, como se ha mencionado anteriormente, supone un beneficio para \nlas empresas tecnológicas, que pueden desarrollar aplicaciones complejas basándose en \nestas fuentes. El hecho de que las ontologías puedan ser explotadas por motores de \ninferencia facilita, asimismo, la comprobación   de la consistencia, la validez, la completitud \nasí como la precisión   de los datos obtenidos a través   de las diferentes fuentes. \n \nPor otra parte, el hecho de tener modelos y datos compartibles en las distintas lenguas \nhabladas en España,   facilitará   la cooperación   entre empresas tecnológicas   del país  y, por \ntanto, mejorará   su competitividad en el escenario internacional. \n \nUn caso paradigmático   en que las empresas pueden obtener un beneficio del uso de \nontologías públicas   de dominio es el de la vigilancia tecnológica.   Este dominio es, al \nmismo tiempo, tan complejo y tan amplio, que requiere la composición   de diferentes \ncomponentes especializados en cuyo desarrollo han de participar diferentes empresas e, \nincluso, grupos de investigación. Asimismo, requiere la integración   de datos con diferentes \nprocedencias y, por supuesto, provenientes de fuentes heterogéneas. \n \nSiguiendo la propuesta descrita en el presente documento, el plan de las tecnologías del \nleng aje ser irá como canali ación de la transferencia tecnológica de más de 20 añosde\nLa solución   propuesta proporciona los siguientes beneficios adicionales: \n- Aumenta la eficiencia de los procesos gracias a la compartición de datos representados \nsemánticamente. \n- Disminuye la dependencia de proveedores concretos que utilizan formatos privativos y \nconceptualizaciones no consensuadas. \n- Fomenta la creación de comunidades de desarrollo y soporte de recursos compartidos. \n",
  "speaker": "SYSTEM",
  "uuid": "06209e9e-e7e9-45d0-b835-b700aa731bc3"
}