{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nMultilingualidad\n2\nProjects\n3\nW3C Working Groups\n4\nPapers\n5\nTesis de Master\n6\nRevisiones\n7\nCursos\n8\nRegistro Software\n9\nOthers\n10\nPlanning - Reunion de Postdocs\nMultilingualidad\n\nPaper de DC con Dani y Elena\nEsbozo del plan de trabajo con Dani\nCargando el BTC dataset en la máquina de Victor (castor)\nLa máquina de Victor no dió la talla ... estuvo semana y media y nada\nGracias a la llegada de LinkedData2 y luego de esperar que termine el hackaton de DBPedia (Raúl Alcazar me comentó que Mariano tenía cosas instaladas) pude instalar BTC en linkeddata2\nhttp://linkeddata2.dia.fi.upm.es:8890/sparql\nProjects\n\nWebN+1\nNext plenary meeting - miércoles 19 de octubre\nCoordinación de las tareas de la UPM dentro del proyecto\nActualmente tengo que revisar 2 deliverables y escribir otros 4 (de lo siguiente uno para diseño y otro para implementacion)\nhttp://delicias.dia.fi.upm.es/wiki/index.php/People/BorisE3.2\nDescripción de algoritmos para la extracción inteligente del conocimiento - Contributors: Cesar, Andres, Boris\nE3.4 Metodología de integración automática de fuentes de datos - Contributors: Alex, JARG, Cristina (Vicomtech), Boris\nE3.5 Definición del sistema de monitorización de usuarios y trust - Contributors: Dani, Boris\nSólo me falta escribir el deliverable E3.2 Descripción de algoritmos para la extracción inteligente del conocimiento\nSoy el QA del deliverable de Tecnalia. Tengo que revisarlo.\nYa hice de QA de los deliverables. Falta que Pablo de TID me revise el E3.2\nTengo que escribir un plan de explotación\nAsistí, remotamente, a la reunion plenaria en Madrid en Julio ... more info aqui\nhttp://www.webenemasuno.es/wiki/index.php/20110705_Reunion_Plenaria\nIntercambiado correos\ncon Dani y Cristina (principalmente), para ver como integrar el componente de ingreso con el de provenance.\nunos pocos con Paulo de TID para ver como va a llamar al desambiguador de etiquetas\ncon Freddy y Cristina para ver el tema del uso de ODEMapster por Vicomtech\nSeguro que se me va una cosa ... pero eso es el core\nBabelData\nPreparar un kickoff meeting entre todos\nLD\nCoordinar todo lo de LD del grupo\nLo comenté hace tiempo en la reunión de PostDocs ... hacia falta una persona con skills de administración\nMe ha tocado instalar y documentar los virtuoso de linkeddata2 y linkeddata3\nhttp://ckan.linkeddata.es\n.... ;)\nhttp://thedatahub.org/group/spain\n.... ;)\nhttp://vocab-express.nodester.com/\n... ;)\nTengo que mirar que pasa con la instancia de webn+1 de map4rdf que comentan que está causando problemas en el server, espero llevarla a oegdev este finde.\nBioPortal\nCoordinación con JP para el tema de la máquina virtual\nGeoLinkedData\nmirar los 2 issues que asun ha encontrado hasta el momento\nTengo que pasarle a vsaquicela el modelo de datos del lookupservice para las uris de geolinkeddata.\nTEngo que implementar el servicio anterior (la mitad ya la hice en junio), pero como MA se pasó a Seals, me toca hacerlo a mi.\nTEngo pendiente hablar ocn Luis para resolver posible internal issues que tengamos\nRevisar el servicio que hizo Victor y hacer el deploy en oegdev\nLo voy a hacer en linkeddata2\nMiré la aplicación sameAs de OEGDEV para Luis\nEstoy con Filip para ver el tema de map4rdf\nHacer un call for jobs para geolinkeddata\nuna tarea para el nuevo, una tarea de prueba\nPosible organización de un GeoVocamp de Europa en Madrid - Confirmar a Krystof y Andreas\nAEMET LD\nMora tenia problemas con su usuario, le he creado otra cuenta para que pueda actualizar los datos.\nSoporte a Freddy para mostrar el trabajo que hicimos en AEMET para presentarlos en un set de slides -\nPlanetData\nSoporte a Oscar para identificar los enlaces a GeoLinkedData -\nPlanetData\nBNE LD\nDani Vila, gracias a Raul Alcazar, tiene una cuenta en el server, ahora él es independiente para subir sus cambios (es algo que se me pasó hacerlo).\nNueva instancia en linkeddata3 para hacer test de los datos que se generan para la biblioteca\nhttp://linkeddata3.dia.fi.upm.es:8890/sparql\nMe ha tocado ir un par de días a la BNE a instalar la insfraestructura y subir la primera version de los datos\nhttp://datos.bne.es/sparql\nUPM LD\nTenemos pendiente con MC el tema de los mappings r2o de la upm, para poder mostrar algo.\nFreddy ha identificado que al hacer import se han importado mal los campos de fecha\nTengo pendiente re-importar las tablas que contengan campos de fechas\nWebN+1\nCon Dani Garijo hemos puesto el metadata a los datos de prisa.\nDeploy de la aplicación de Dani para actualizar el endpoint en mccarthy\nW3C Working Groups\n\nRDB2RDF\nTest Cases document\nDesde que me fui a Bolivia he dejado el tema un poco aparacado, inicialmente estaba Alex para suplirme, pero creo que no estaba motivado en este tema. Hablé con él ayer y definitivamente no será parte del grupo.\nEl documento ahora se genera automáticamente (a partir de los ficheros .sql, .ttl, que estan en el repos del w3c), more info aqui\nhttp://www.w3.org/2001/sw/rdb2rdf/test-cases/\nA pesar de que he incluido más test cases, tengo que añadir todavia más Test cases y describir el proceso de ejecución por parte de los implementors.\nRevision de la especificacion, participación en las telcos, y revision de issues/actions\nSe ha creado un vocab inicial de R2RML, un html anotado con RDFa y el vocab en OWL, más info aqui:\nhttp://www.w3.org/ns/r2rml\nR2RML está en Last Call\nhttp://www.w3.org/TR/r2rml/\nGLD\nAsistí a una sesión del F2F meeting, presenté un overview de lo que hacemos, más info aqui\nhttp://www.w3.org/2011/gld/wiki/F2F1\nSolo han habido dos telcos, Asun participó en una.\nEstoy apuntado para colaborar en las best practices, y vocabularios geospatial\nAsun se ha apuntado a los vocabularios con OMV.\nOfrecido de voluntario para el tema de las best practices, más info aqui:\nhttps://dvcs.w3.org/hg/gld/raw-file/bcb72f87b5cc/bp/index.html\nHe comenzado a trabajar con Bernaddete en el tema del cookbook, más info aqui\nhttp://www.w3.org/2011/gld/wiki/Linked_Data_Cookbook\nHay un F2F meeting en Enero en DERI, todavia no he reservado los tickets. Pienso que sería bueno ir con Dani Vila\nHe propuesto a Elena para que hable en una telco del multilinguismo, estoy esperando la disponibilidad de Elena\nPapers\n\nWorkshop CAEPIA\nhe estado gestionando la revision de papers y respondiendo preguntas\nOscar puede comentar sobre los issues que hemos tenido, ahora que recuerdo, Asun estaba en un mail también\nme fallaron algunos revisores, lo de siempre, asi q me tocó revisarme un par de papers.\npreparar el programa para noviembre\nTriplification Challenge - El Viajer\nDani y yo preparamos el camera ready del paper, tengo pendiente book hotel/vuelo y registrarme\nDC conference - guidelines for the multingual web\nDAni/Elena y yo preparamos el camera ready del paper. Dani irá a presentarlo\nW3C Workshop A Local Focus for the Multilingual Web\nDani/Elena y yo preparamos un proposal para el workshop, pero fue rechazado :(\nBookchapter GLD - Methodological Guidelines\nReestructuré el paper, Oscar tiene conocimiento de esto.\nDavid Wood va a presentar un excerpt del chapter (junto con otros) en una conferencia de eGov. Le pasé un extended abstract para esto.\nBookchapter NeOn - Reuse and Re-engineering\nCorrecciones del revisor externo. Tengo que ponerme con esto este finde.\nOGK2011\nDavid Wood, Bernadette Hyland, Timothy Lebo, Boris Villazón-Terrazas, Percy Salas, Matias Frosterus and Pierre Desrochers\nInvited Panel Discussion: Linking Government Data\nOGK2011\nPaper AEMET\nRe-submit del paper y coordinación de los cambios. Gran Ayuda de OCorcho\nPaper IEEE\nLuis tiene que liderar la escritura, yo colaboraré como segundo autor en lo que haga falta\nPaper Dani BNE\nDani está liderando la escritura, yo colaboraré como segundo autor en lo que haga falta\nLibro de la Tesis\nTEngo pendiente mandarle al editor la info que me pidió ... a ver si en agosto saco un hueco.\nDocumento e info envidadas, esperando que salga.\npaper para un workshop con MC y Raúl García\nJournal Paper - Publishing Orthology and Diseases Information in the Linked Open Data Cloud\nPaper aceptado ... ;)\nCon Mikel y unos chicos de Murcia, hemos enviado este artículo a una revista Bio.\npaper para revista, del SoA de la tesis\nSeguro que se me olvida algun paper\nTesis de Master\n\nTEngo que leerme la parte de la tesis que me ha pasado Dani Vila\nSe me dijo que iba a ser el Cotutor de la Tesis de Dani Vila (varias veces). De la noche a la mañana aparecieron 3 personas en la cotutoria de Dani Vila (se sabe por experencia anterior que esto no puede ser posible en tesis de master). Decliné de ser co-tutor de esa tesis para no añadir ruido y desgaste de Dani en el tema. Hasta ahora no he recibido un comunicado oficial.\nRevisiones\n\n*\nCOLD\n*\nOCAS\nPC del ESWC12\nCursos\n\nCurso Tenerife\nCurso Athens\nCurso Biblioteca Nacional\nCurso GRan Canaria\nCurso Tenerife\nDocumentos Cursos Asun\nRegistro Software\n\nnor2o, falta el cd con las fuentes\nodemapster plugin falta el tema legal de Jan\nOthers\n\nEstuvimos con Dani Garijo llenando la info en CKAN de los datasets de la UPM. Si todo sale bien estarán elviajero, aemet (el de la BNE no pude añadirlo porque no hubo tiempo de poblarlo y enlazarlo).\nAprovechando el pánico también registré el OGOLOD (de Mikel).\nHe quedado con Elena para reunirnos en septiembre (presencialmente) y aunar esfuerzos para el tema del multilinguismo, asi estaríamos 3 personas (Dani, Elena y yo).\nEstoy con MC viendo como poblar las ontos que tiene en\nBuscamedia\na partir de unos XML que tiene.\nSeguimos con el tema\nHemos identificado que los XML son más complejos de lo que pensamos en su día\nTengo pendiente mirarme los mappings de la bd que me pasó Oscar y pasarla a instancias de GoodRelations\nTengo (y quiero) hacer un refactor de nor2o para que sea más user-friendly e incluir algunas mejoras y bug fixes\nseguro que se me está pasando alguna que otra cosa ... pero de momento esto es lo que he hecho/estado haciendo\nPlanning - Reunion de Postdocs\n\nEsto lo preparé para la reunión de postdocs, pero al final sólo se habló de proyectos\nSome statistics\nInput:\nhttp://ckan.net\nhttp://semantic.ckan.net/\nhttp://km.aifb.kit.edu/projects/btc-2011/\nhttp://sparql.sindice.com/\nOutput:\nlang stats\nlinks between resources in different languages\ninjection data for the lemonn tools?\nvocabularies most used? al estilo de los mondeca guys and LOV?\nmultilingual crosslinking\nextension of silk by including the access of translation services\nextension of silk by including Jorge metric similarity\neGov\ncreación y mantenimiento de\nhttp://es.ckan.net/\nopen data spain\nwe can suggest spanish vocabs, spanish methods, etc.\ncreación y de mantenimiento de\nhttp://data-gov.es/\ncreación y de mantenimiento de\nhttp://open.data.es\nfallo ya existe\nhttp://open-data.es\ndata shapes (graph, tree, table)\nservice for data shape transformations\nwe are always transforming from one shape to another\nfirst service that implements r2rml\nsecond service nor2o variation of r2rml for excel\nsecond service nor2o variation of r2rml for xml\nextensible to sensors data?\ngeolinkeddata\nvalidación de los links\nuri lookupservice\nchange scovo for RDF data cube\ninclusion of the opm for provenance description\nfixing current errors\ngeovocab comenzar colaboracion con Andreas y proponer gente del geospatial consortiium, John Goodwin, Luis Bermudez\ngeometry2rdf\nextension for shapefile support\nmarc21toLD\nalso available as service\nsameAs validator\nempaquetado del soft y mantenimiento\nnor2o y goodrelations\nrefactor of nor2o and inclusion of the creation of goodrelations compliant vocabs\nhacer lo de las empresas de oscar\nwebsite que incluira todos los vocabs desarrollados en el grupo\ndesde ahora todo deferenceable\nutilizar voaf para anotar los vocabs\nsoporte a schema.org\nestudio de schema.org\nposibles datasets a estudiar - tarea de ev\ncentros deportivos de madrid, spain\nseemp ld",
  "speaker": "SYSTEM",
  "uuid": "06e7dcc2-3157-4f6b-8ece-d4e18f528d0b"
}