{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 6\n6\nAndr´es Garc´ıa-Silva et al.\nof additional tags that the user used to annotate the resource. However, many\ntags refer to subjective impressions of users (e.g., my favourite, amazing) or\ntechnical details (e.g., Nikon, photo) which can be useless (or even harmful) for\ndisambiguation. Therefore, we need to select among all tags in the context those\nthat are most related to the analyzed tag.\nTo carry out this selection we use a technique described in [12]. After remov-\ning repeated words and stop words from the context, we compute the semantic\nrelatedness between each context word and the word to disambiguate. This re-\nlatedness computation is performed by using a web-based relatedness measure\ntaking into account the co-occurrence of words on web pages, according to fre-\nquency counts, and giving a value between 0 and 1, which indicates the degree\nof semantic relatedness that holds between the compared words. Finally, we\nconstruct the active context set with the context words whose relatedness score\nabove a certain threshold. We limit the cardinality of the active context to 4 (ac-\ncording to Kaplan’s experiments [14], this is the number of words above which\nthe context does not add more resolving power to the disambiguation).\n3.3\nSense Retrieval\nOur approach is inspired by the Tagora sense repository [19], which uses Wikipedia\ncontent articles as senses. We have extended this repository into MSR, a multi-\nlingual sense repository based on Wikipedia and DBpedia information (details\nof MSR are presented in section 3.5). Therefore, in this activity, we query MSR\nto ﬁnd the candidate senses for a tag. In addition, from MSR we obtain for each\nsense the set of most frequent keywords in the corresponding Wikipedia article,\nalong with their frequency value.\n3.4\nSense Disambiguation\nThe sense disambiguation activity is carried out when the sense retrieval activity\nreturns more than one sense. For instance, the NYC and Nueva York terms\naccording to English and Spanish Wikipedias11 have 16 and 24 possible meanings\nrespectively. The goal of this activity is to select a sense representing the tag\nmeaning in the context where it was used. The main idea is that the tag and its\ncontext can be compared against each one of the candidate senses, measuring\nthe overlap of the terms in the context with the terms in the Wikipedia pages\nrelated to the senses. We carry out this process by representing the senses and\nthe tag along with its context as vectors and then comparing those vectors using\na similarity formula to ﬁnd the most similar sense to the tag and its context [9].\nFirst we create the Vocabulary set as the union of the top N frequent terms\nin each of the candidate senses. Next for each sense we create a vector in\nℜ|V ocabulary| where each position corresponds to an element in an ordered ver-\nsion of the Vocabulary set. The value wi associated with the i-th position in the\n11 see http://en.wikipedia.org/wiki/NYC_(disambiguation) and\nhttp://es.wikipedia.org/wiki/Nueva_York_(desambiguacion)\n",
  "speaker": "SYSTEM",
  "uuid": "0720a793-1500-4e6d-aa17-7c4d67c6b1f9"
}