{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SEALS-EvaluatingClassifiers \n\nPreliminares\n\nLos casos de prueba deberían definirse teniendo en cuenta que cuando se quiera adicionar uno nuevo los cambios a los casos de prueba existentes sean mínimos o inexistentes. Sin embargo en muchos casos es prácticamente imposible porque un nuevo caso de prueba afecta a todos los casos existentes.\nSe debería incluir una figura donde se relacionen las clases de la ontología (PersitentTestData, TestDataVersion, Suite, SuiteItem, DataItem)con la terminología real para la definición de las evaluaciones evaluación (Evaluación, Versión de la evaluación, Conjunto de casos de prueba, Caso de prueba, Datos del caso de prueba).\nLo mismo debería hacerse para relacionar las clases de los datos de prueba en la ontología con las clases que describen los resultados y las interpretaciones.\nInstalación local de repositorios de datos de prueba y de resultados\n\nNota importante 1:\nVerificar la versión de los repositorios de datos de prueba y de resultados porque dependen de la versión del runtime evaluation service que se vaya a usar mas adelante en el proceso. En mi caso instale el repositorio 1.1b y era necesaria la versión 1.1 así que tuve que reinstalar el repositorio. Dependiendo de la versión se utilizan unas propiedades u otras de la ontología en los servicios web que dan accesos al repositorio de resultados (Ver\nConsultas al repositorio de pruebas\n).\nNota importante 2:\nEn el bpel al final del proceso me enteré que la propiedad hasComponentType de la ontología se utiliza para recuperar uno a uno los diferentes data items en el conjunto de datos de prueba (testSuite). Esta cuestion esta relacionada con el punto anterior porque dependiendo de la versión del repositorio se utilizan diferentes propiedades para acceder a los data items.  Verificar con Miguel esteban y Raul.\nLa instalación se realizó utilizando las guías proporcionadas en:\na PDF file\nSoftware\nJava SE Development Kit 6 update 18. En mi ordenador tengo instalada la versión 6_17 y voy a probar con ella para ver si no da problema.\n(No requerido para los repositorios) SVN client. Ya instalado en mi ordenador\n(No requerido para los repositorios) Maven 2.2.1 (Pendiente de instalar)\nMiddleware\n(No requerido para los repositorios)Fuse ESB 4.2.0-fuse-02-00. La versión requerida de fuse no se encuentra disponible en la pagina oficial. Encontré el instalador en el siguiente enlace (Pendiente de instalar):\nhttp://repo.fusesource.com/maven2/org/apache/servicemix/apache-servicemix/4.2.0-fuse-02-00/\nApache Tomcat 6.0.264\nOpenRDF SDK 2.2.4 que incluye a Sesame y Workbench.\nConfiguración de la variable de entorno ENV a D:\\SEALS\\environment, en este directorio va todo el middleware.\nEjecutar tomcat y desplegar sesame y workbench en el servidor web:\nTomcat requiere la variable de entorno BASEDIR que apunta al directorio principal de tomcat.\nmodificar fichero BASEDIR/conf/tomcat-users.xml y añadir la siguiente linea entre las etiquetas <tomcat-users> y </tomcat-users>:\n<user username=\"admin\" password=\"admin\" roles=\"manager-gui\"/>\nejecutar BASEDIR/bin/startup.bat\nir a\nhttp://localhost:8080/\ny seleccionar la opción tomcat manager. Usar como usuario y password a admin y admin\ndesplegar sesame y workbench usando los ficheros .war que se encuentra en ENV/openrdf-sesame-2.2.4/war\nDesplegar el repositorio de pruebas\n\nbajar y desplegar en tomcat:\nhttp://www.development.seals-project.eu/artifactory/global-repo/eu/sealsproject/platform/repos/tdrs-web/1.1-b/tdrs-web-1.1-b.war\n. El despliegue consiste en copiar este fichero war a la carpeta %TOMCAT%\\webapps\ncrear repositorio en OpenRDF Sesame. Ir a\nhttp://localhost:8080/openrdf-workbench/\ny seleccionar new repository. Datos del repositorio id testdata, Type: Native Java Store RDF Schema, y Triple indexes: spoc, posc, cpso\nconfigurar el repositorio de datos pruebas\nEditar fichero: %TOMCAT%\\webapps \\tdrs-web-1.1-b\\WEB-INF\\classes\\config.properties y modificar variables de acuerdo a la guía.\nCrear las siguientes carpetas:\nD:\\SEALS\\environment\\repositories\\testdata\nD:\\SEALS\\environment\\repositories\\testdata\\generators\nD:\\SEALS\\environment\\repositories\\testdata\\temp\nD:\\SEALS\\environment\\repositories\\testdata\\testdatasets\nDesplegar el repositorio de resultados\n\nbajar y desplegar en tomcat:\nhttp://www.development.seals-project.eu/artifactory/global-repo/eu/sealsproject/platform/repos/rrs-web/1.1-b/rrs-web-1.1-b.war\ncrear repositorio en OpenRDF Sesame. Ir a\nhttp://localhost:8080/openrdf-workbench/\ny seleccionar new repository. Datos del repositorio id results, Type: Native Java Store RDF Schema, y Triple indexes: spoc, posc, cpso\nconfigurar el repositorio de resultados\nEditar fichero: %TOMCAT%\\webapps \\tdrs-web-1.1-b\\WEB-INF\\classes\\config.properties y modificar variables de acuerdo a la guía\nCrear las siguientes carpetas:\nD:\\SEALS\\environment\\repositories\\results\nD:\\SEALS\\environment\\repositories\\results\\interpretations\nD:\\SEALS\\environment\\repositories\\results\\rawresults\nPruebas del repositorio de datos de prueba y de resultados\n\nPara probar el repositorio se usa el fichero de pruebas\na ZIP file\nque se encuentran en la página\nSEALSTestData#Usage\n. El proceso se divide en 2 etapas. Primero se registra la colección de datos de prueba y luego se adicionan los datos de prueba a esa colección.\nRegistrar colección de datos de prueba.\nModificar el fichero RegisterTestDataCollection.html cambiando la url en la etiqueta form, atributo action a:\nhttp://localhost:8080/tdrs-web-1.1-b/testdata/persistent/\nAbrir esa página y registrar el repositorio de ejemplo. Para esto se copia el contenido de OWLDLImportTestSuiteCollection.xml en el área de texto de la página y se hace el submit.\nNo hay ningún resultado, pero si se da nuevamente aceptar entonces dice que ya existe el repositorio.\nRegistrar datos de prueba\nModificar el fichero AddTestDataVersion.html cambiando la url en la etiqueta form, atributo action a:\nhttp://localhost:8080/tdrs-web-1.1-b/testdata/persistent/\nAbrir la pagina y copiar en el área de texto el contenido de OWLDLImportTestSuite1.0.xml, luego seleccionar el fichero de datos OWLDLImportTestSuite1.0.zip y hacer el submit.\nDefinición de datos de prueba",
  "speaker": "SYSTEM",
  "uuid": "07bc7cce-7641-4ea3-ab1c-75e0652a9bc2"
}