{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 81\nBÚSQUEDA \n \n81 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nSupóngase que se dispone de operaciones (defun crea-nodo (estado \npadre) ...), (defun estado-de-nodo (nodo) ...) y (defun padre-de-\nnodo (nodo) ...) para manipular los nodos. (Nótese que la función expandir-\nestado desvirtúa ligeramente la idea de la escalada simple, puesto que se generan \ntodos los hijos previamente a la selección; hemos preferido proponer de este modo \nel ejercicio para darle mayor genericidad.) \n2) Particularícense los ejercicios anteriores para el problema del tren. Prográmese \ny háganse comparaciones con las dos búsquedas irrevocables. \n3) Lo mismo que en el ejercicio anterior, pero para el problema del 8-puzzle. \nCompárense además los resultados con las distintas heurísticas presentadas en el \napartado 4.1. \n4) Como hemos indicado antes, se puede mantener para las escaladas \nirrevocables la misma estructura del programa busqueda que hemos utilizado hasta \nahora. Sin embargo, es más natural modificar la estructura del programa para que \nno se utilice la lista ABIERTOS (no es necesaria, puesto que a lo más contiene a un \nelemento). Diséñese el algoritmo correspondiente y prográmese en Common Lisp. \nObsérvese que sigue teniendo sentido la distinción \"búsqueda en árbol\" / \"búsqueda \nen grafo\". Prográmense pues las dos versiones. \nLas propiedades de los algoritmos en escalada irrevocables son las siguientes: \n• \nTienen una complejidad constante en espacio. \n• \nSu complejidad en tiempo, en el peor caso, continúa siendo exponencial. \n• \nNo garantizan que se encuentre el camino más corto (ni, en general, el de menor \ncoste). \n• \nNo son métodos completos: pueden no encontrar la solución aunque exista. \nLas dificultades principales que pueden aparecer y que conllevarán la \"pérdida\" de \nlas soluciones son las siguientes: \n• \nMáximo local (en nuestro contexto, sería preferible hablar de mínimo local, pero \nentonces se perdería el símil con el \"alpinismo\"): todos los hijos de un estado son \nmenos prometedores que él, pero no se trata de un estado objetivo. Por ejemplo, \nsupongamos que en el 8-puzzle elegimos la heurística que cuenta el número de \ndígitos mal situados. La experiencia (¡heurística!) nos muestra que en ocasiones \nes necesario descolocar algún dígito para alcanzar el objetivo; las escaladas \nirrevocables no recogerán dicho conocimiento. \n• \nMesetas: todos los estados hijos (y tal vez los descendientes) tienen el mismo \nvalor heurístico. Si tomamos la desigualdad estricta en la escalada, eso \n",
  "speaker": "SYSTEM",
  "uuid": "07dfd702-1a49-488c-8a4a-239f362a3dcf"
}