{
  "message": "SYSTEM: D5.3.2.pdf: Página 34\nPage 34 of 48 \nNeOn Integrated Project EU-IST-027595 \n \no If the answer is yes, then we can propose to select the iterative-incremental ontology \nnetwork life cycle model.    \n\u0003 Have the ontology network requirements assigned different priorities? \no If the answer is yes, then we can propose to select the iterative-incremental ontology \nnetwork life cycle model.    \nBased on the answers to these questions, the waterfall model or the iterative-incremental are \nselected. However, taking into account the different model versions presented in Section  3.2, we \npropose the following set of natural language questions to select a particular model version.  \nIf the iterative-incremental model is selected, it is necessary to decide among the different versions \nof waterfall model by means of answering these natural language questions in each iteration. \n\u0001 Have you planned or it is said in your ontology requirements to use any existing ontological \nresource in your ontology network development? \no If the answer is yes, then the five phase waterfall model should be selected. \n\u0001 Have you planned or it is said in your ontology requirements to use ontology design patterns \nin your ontology network development? \no If the answer is yes, then the five phase waterfall model should be selected. \n\u0001 Have you planned or it is said in your ontology requirements to use and merge a set of \nexisting ontological resources in your ontology network development? \no If the answer is yes, then the five phase + merging phase model should be selected. \n\u0001 Have you planned or it is said in your ontology requirements to use any non-ontological \nresource such as thesauri, data bases, etc. in your ontology network development?  \no If the answer is yes, then the six phase model should be selected. \n\u0001 Have you planned or it is said in your ontology requirements to use and modify any existing \nontological resource in your ontology network development?  \no If the answer is yes, then the six phase model should be selected. \n\u0001 Have you planned or it is said in your ontology requirements to use, merge, and modify a set \nof existing ontological resources in your ontology network development? \no If the answer is yes, then the six phase + merging phase model should be selected. \nIf software developers and ontology practitioners answer in the affirmative to several questions of \nthose proposed here, they would obtain several candidate models, and thus the final model version \nto be selected should be the most specific one based on the pyramid in Figure 14 and discussed in \nSection 3.3. \nIf software developers and ontology practitioners answer in the negative to all the aforementioned \nquestions, the final model version to be selected should be the four phase waterfall model. \nTask 2. Select processes and activities. \nThe goal of this task is to select the set of processes and activities to be performed during the \nontology network development. Users, domain experts and the ontology development team carry \nout this task taking as input the ontology requirement specification document (ORSD) and the set \nof potential knowledge-aware resources to be used during the development. The actors involved in \n",
  "speaker": "SYSTEM",
  "uuid": "080ba681-c33f-4a27-89b3-c3f44e54f189"
}