{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/IBM-Software \n\nContents\n[\nhide\n]\n1\nOntologies\n2\nNLP\n3\nVirtualización y arquitecturas\n4\nAlgo más\nOntologies\n\nIBM Rational Software Architect V9.1, gracias a su conexion con \"The Design Management V4.0 server\". Ademas, dicen que \"A Domain Toolkit is added to the Design Management server that enables server side extensibility. It allows teams and business partners to define custom design domains (throught an ontology editor.\" [informacion general del producto:\nhttp://www-01.ibm.com/common/ssi/printableversion.wss?docURL=/common/ssi/rep_sm/0/897/ENUS5725-A30/index.html\n][MariCarmen]\nIBM Rational Rhapsody V8.1. \"The domain toolkit enables you to create custom design domains in Rational Rhapsody Design Manager server. Define new domains through an ontology editor.\"  [informacion general del producto:\nhttp://www-01.ibm.com/common/ssi/ShowDoc.wss?docURL=/common/ssi/rep_sm/0/649/ENUS5724-X70/index.html&lang=en&request_locale=en\n] [MariCarmen].\nCRAFT (aunque es un poco antiguo: 2009) [Publicaciones relacionadas:\nhttp://researcher.watson.ibm.com/researcher/view_group_pubs.php?grp=1746\n] [MariCarmen]\nIODT: \"IBM Integrated Ontology Development Toolkit \"  que incluye (en principio, pero no lo encuentro, la web apunta al community group pero no encuentro el sw\nhttp://www.alphaworks.ibm.com/tech/semanticstk\n) [María Poveda]:\nEODM Workbench is an Eclipse-based editor for users to create, view and generate OWL ontologies\nMinerva is a high performance ontology repository built on relational databases. It completely follows W3C’s Web Ontology Language (OWL) and SPARQL Query Language for Resource Description Framework\nDocumentación\nhttp://goo.gl/bPBk8U\nNLP\n\nUIMA\n,  analysis of unstructured content. NOTA (Jorge): No lo he encontrado en Academic Initiative\nCognitive Computing\n. Lo de Watson. No tenemos nada parecido, aunque tiene relación con Semantic Web y Question Answering.\nVirtualización y arquitecturas\n\nBluemix\nAlgo más\n\nAunque no se trabaja con temas de\nseguridad\n, a lo mejor se pueden probar y aprovechar algunas de sus aplicaciones:\nAppScan Source Edition for Security V8.5\nIBM Security AppScan Source analyzes source code to identify security vulnerabilities while integrating application security testing with software ...\nIBM Security SiteProtector System\nIBM Security SiteProtector System provides central management of security devices to control policies, events, analysis and reporting for your ...\nAppScan Standard Edition V8.5\nAutomated Web application security testing for IT Security, auditors, and penetration testers",
  "speaker": "SYSTEM",
  "uuid": "0830797a-dc1a-4fc2-a76d-d2b559682968"
}