{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 80\n78\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nSocial Platforms\nSocial media has become an important marketing and distribution channel for web services and publica‐\ntions, and will continue to grow in importance. Social media translation services will enable content produc‐\ners and service providers to expand their reach in multiple languages, and to drive usage from these regions.\nThis is new territory, with only a few providers, such as Helsinki based Transfluent, specializing in this area.\nSocial translation is another interesting opportunity. Amara and Viki, for example, both operate crowd trans‐\nlation and captioning services for web video. Viki in particular has attracted several million users via word of\nmouth, and has built up an impressive catalo of translated videos from major content providers. We expect\nto see more services like this for translating other types of content. \nInteroperability and standards\nThe translation industry is notorious for its lack of standards. While there are standard file formats, like TMX\nand XLIFF, and a long list of secondary file formats, these standards tend to be over‐engineered, and because\nof this difficult and expensive to integrate into products. XLIFF and TMX in particular are file formats that are\nspecific to translations and aligned texts. This is the opposite of the situation with web services, where sim‐\nple REST APIs and data interchange formats like JSON are dominant. \nThe basic issue facing the translation industry today is not the lack of a standard file format in which to store\ntexts and their translations (both TMX and XLIFF work well for this), but the lack of standard procedures to\ninitiate common translation tasks (for example, when a content management system needs to call a third\nparty translation service to request a translation for a new document, there is no standard protocol).  The\nTAUS web services reference API standardizes the way common tasks are done in the context of a publicly\naccessible web service. This enables translation technology and service providers to provide a common\nimplementation that is the same for participating vendors. This, in turn, will enable developers to leverage\nre‐usable code, libraries, and extensions rather than build custom integrations for each translation service\nor technology they choose to work with. The API was made public in September 2012.\nMeasuring and benchmarking quality\nMeasuring and benchmarking translation quality in a consistent way is another challenge for the industry.\nFor many years now the industry has applied one size fits all approach to quality. It is an area with an inher‐\nent level of subjectivity. There has been no industry‐level consensus on the different expectations for quali‐\nty for different type’s content and purpose. The TAUS Dynamic Quality Framework is an industry initiative\nthat has begun to address this common issue. In 2012 a knowledgebase on quality assurance best practices,\ncontent profiling methodology and set of tools for quality evaluation was launched; these tools introduce\nindustry benchmarking using the business metrics have been is missing in the translation industry.\nA number of automated metrics have been developed to measure quality. These can provide an understand‐\ning of relative levels of quality, for example to indicate if one system has produced a better translation than\nanother. However, they do not provide absolute measure of quality. They don’t provide a measure of how\nquality is measured, nor do they measure factors such as style, grammar, etc. Unfortunately due to the vari‐\nance of human language, as well as the fact that there are often many ways to translate the same thing,\nthere may not be an algorithmic way to measure quality beyond counting obvious defects. \nThe likely solution will to combine automated and human mediated quality assurance processes to provide\na more precise measure of quality. For example, statistical methods can be used to measure the likelihood\n",
  "speaker": "SYSTEM",
  "uuid": "092a2e64-1f4f-4fbf-befd-f0148e253e4a"
}