{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 20\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11169\nperiodo de beca, el grado de cumplimiento del plan de trabajo propuesto y el plan de \ntrabajo previsto para la etapa de contrato. Se deberá hacer una referencia específica a la \nsituación y evolución de la tesis doctoral y a la realización de los cursos de doctorado.\nb)  En el plazo de un mes desde la fecha de finalización de la ayuda, un informe del \npersonal investigador en formación, con el visto bueno del investigador principal del \nproyecto de adscripción de la ayuda, que contemple la totalidad del trabajo realizado y sus \nresultados, haciendo especial referencia a los resultados de la tesis doctoral y a los \nobjetivos logrados con el programa de formación.\n3.  La evaluación del informe de seguimiento de los primeros 24 meses corresponderá a \nuna Comisión formada por expertos creada en el seno de la Subdirección General de Formación \ne Incorporación de Investigadores que podrá determinar la no continuidad en la ayuda.\n4.  Los beneficiarios de ayudas estarán sujetos a las actuaciones de control que lleven \na cabo las instituciones facultadas para ello por la Ley General de Subvenciones y, en su \ncaso, por la normativa comunitaria de los Fondos Estructurales.\nArtículo 38.  Renuncias e incorporación de reservas.\n1.  Las renuncias del personal investigador en formación a las ayudas objeto de este \nsubprograma deberán ser comunicadas al Centro de I+D al que están adscritos, y éste a \nsu vez dará traslado de este hecho a la Dirección General de Investigación y Gestión del \nPlan Nacional de I+D+i.\n2.  Las comunicaciones de renuncias de ayudas objeto de este subprograma, \npresentadas en registro válido dentro de los cuatro meses siguientes a partir de la fecha \nde publicación en la página web del MICINN de la resolución de concesión, podrán dar \nlugar a la sustitución por alguno de los candidatos de la lista de reserva, siempre que las \ndisponibilidades presupuestarias lo permitan y que dichos candidatos cumplan los \nrequisitos establecidos en el artículo 17 en la fecha especificada en el apartado 4 del \npresente artículo, de acuerdo al procedimiento siguiente:\na)  El Centro de I+D deberá solicitar por escrito a la Dirección General de Investigación \ny Gestión del Plan Nacional de I+D+i la sustitución del investigador que ha renunciado a la \nayuda por el candidato reserva situado en primer lugar para el proyecto de I+D en cuestión, \nadjuntando al escrito la aceptación del candidato reserva a la ayuda y la renuncia del \ntitular.\nb)  En el caso de que el primer reserva no acepte, se podrá solicitar la sustitución por \nel siguiente o siguientes reservas, en el caso de que existan y respetando el orden de \nprelación de los mismos.\nc)  Si la vacante no puede ser cubierta por el titular o un reserva, el Centro de I+D \nbeneficiario podrá solicitar a la Dirección General de Investigación y Gestión del Plan \nNacional de I+D+i, dentro del plazo indicado en este apartado, la incorporación de un \ncandidato reserva correspondiente a otro proyecto de I+D, adjuntado la aceptación de este \ncandidato reserva y, en su caso, la renuncia del titular.\n3.  En el caso de que a un proyecto de I+D no se hubiera presentado ningún candidato, \no bien que todos los candidatos presentados fueran considerados inadecuados, el Centro \nde I+D podrá solicitar, dentro de los tres meses siguientes a partir de la fecha de publicación \nen la página web del MICINN de la resolución de concesión, la incorporación de un \ncandidato reserva correspondiente a otro proyecto de I+D, adjuntado la aceptación de este \ncandidato reserva. La autorización estará condicionada a que las disponibilidades \npresupuestarias lo permitan y que dichos candidatos cumplan los requisitos establecidos \nen el artículo 17 en la fecha especificada en el apartado 4 del presente artículo.\n4.  Los candidatos que adquieran la condición de beneficiarios tras ser candidatos \nreserva, deberán acreditar el cumplimiento de los requisitos recogidos en el artículo 17 en \nla fecha de incorporación a su centro de adscripción, en caso de que esta sea anterior al \núltimo día hábil para la incorporación establecido en el párrafo primero del artículo 29.1. En \ncaso contrario, la fecha para el cumplimiento de dichos requisitos será el último día para la \nincorporación indicado anteriormente.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "097e1729-ae7d-4e33-8347-32690048b308"
}