{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 48\n46\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nreal costs to companies as they attempt to offer secure transactions. Enterprises are spending an exorbitant\namount of money resetting customer passwords that are forgotten or stolen. Customers have come to\nexpect convenient 24/7 access to their account information. In fact, companies that do not provide such\naccess are viewed as being difficult to do business with. It is simply not cost‐effective to attempt to meet this\nrequirement with more live agents. Today, billions of dollars are spent on call centre agents. These agents\nmust handle a wide range of functions – everything from taking orders, answering support questions, to set‐\nting up returns. It turns out that agents spend a huge percentage of their day answering simple account sta‐\ntus questions\nFinancial Services\nProvide effective risk management, compliance with critical industry regulations, and the ability to success‐\nfully combat increasing fraud and identity theft. Enable simple and secure remote authentication for a vari‐\nety of applications including:\n• Phone Banking Authentication\n• Password Reset\n• e‐Banking Transaction Security\n• Transparent Conversational Authentication\n• Private Banking\nTelecommunications\nSupport delivering services to mobile device customers and internet users securely and cost effectively.\nEnables simple and secure remote authentication for a variety of applications including:\n• Contact Centre Security\n• Secure Access to Value‐Added Services\n• m‐Commerce\n• Password Reset\nHealthcare\nProvides an accurate, non‐invasive, cost‐effective identity verification solution that seamlessly integrates\nwith existing contact centres and VoiceXML platforms. Enables simple and secure remote authentication for\na variety of applications including:\n• Contact Centre Security\n• Access to Patient Information\n• Password Reset\nGlobal Enterprise\nProtect private information, improve efficiency, and enhance the delivery of remote services via contact cen‐\ntres and the Internet. Voice biometrics enables secure remote authentication for a variety of applications\nincluding:\n",
  "speaker": "SYSTEM",
  "uuid": "0a28ebee-fa20-4ed1-acfe-5fa4ca9294c9"
}