{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PostdocLORIA \n\nThe INRIA Nancy-Grand Est has  a Post-doctoral position  in the  CyWiki project.\nINRIA (\nhttp://www.inria.fr/\n), the French national institute for research in computer science and control, is dedicated to fundamental and applied research in information and communication science and technology. Throughout its eight research centers, the Institute also plays a major role in technology transfer by fostering training through research, diffusion of scientific and technical information, development, as well as providing expert advice and participating in international programs.\nStarting date of the job: 1st January, 2010 Employment period: 1 years Gross salary: around 2400 euros per month Location loria:\nhttp://www.loria.fr/\nSubject description.\nThe CyWiki project has to be considered in the general framework of transforming multi-modal content units into formal knowledge units.\nThe aim of the project is to design a system supporting and managing the collaboration between humans and machines for guiding the transformation of textual document contents into formal knowledge.\nThe application domain is the Education domain. The inputs of the system  ressources are pedagogical textual\nresources: lectures (slides, manual, reports), exercises, projects, corrections, etc. The resulting knowledge units have to be accessible and manageable both by software and human agents.  These knowledge units make explicit the relations existing between pedagogical resources, favor the access and the reuse of contents, improve search and navigation through contents, and support and help the design of the design of new documents.\nThe candidate for this post-doc position  has to participate and to coordinate the design of the infrastructure of the project.\nYour research will focus on topics in the following areas:\n* knowledge representation,reasoning\n    * knowledge extraction (text mining)\n    * Social Semantic Web\n    * Semantic Wikis\nDocuments.\n- CV of the candidate (the thesis has to be defended within  the 12 months before the present date)\n- Recommendation letters.\nContacts:  Pascal.Molli@loria.fr and Amedeo.Napoli@loria.fr",
  "speaker": "SYSTEM",
  "uuid": "0a5fb82b-5c54-4302-9e0b-37368c2b0d3e"
}