{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master08-09 \n\nEsta página incluye información para alumnos de máster.\nContents\n[\nhide\n]\n1\nObjetivos de la asignatura\n2\nTransparencias\n3\nDocumentación de Metodologías\n4\nPrácticas\n5\nOfertas de trabajo relacionadas\n6\nComentarios sobre las prácticas\n6.1\nComentarios sobre la práctica 1\n6.1.1\nComentarios generales\n6.1.2\nComentarios particulares\n6.2\nComentarios sobre la práctica 2\n6.2.1\nComentarios generales\n6.2.2\nComentarios particulares\n6.3\nComentarios sobre la práctica 3\n6.3.1\nComentarios generales\n6.3.2\nComentarios particulares\n6.4\nComentarios sobre la práctica 4\n6.4.1\nComentarios generales\n6.4.2\nComentarios particulares\n6.5\nComentarios sobre la práctica 5\n6.5.1\nComentarios generales\n6.5.2\nComentarios particulares\nObjetivos de la asignatura\n\n[\nDescripción\n]\nTransparencias\n\n9/10/2008. Normas e Introducción\n16/10/2008. Ontologías\n23/10/2008. Lenguajes de Ontologías. RDF(S)\n[1]\n30/10/2008. Terminología en las ontologías y otros recursos\n[2]\n6/11/2008. Metodologías (I): Especificación\n[3]\n13/11/2008. Metodologías (II): Ciclo de Vida. Lenguajes de Ontologías: RDF(S) y SPARQL.\nMetodologías (II)\n.\nEjemplos RDF(S)\n.\nDBPedia SPARQL Endpoint\n20/11/2008. Metodologías (III): Reutilización de Recursos Existentes\n[4]\n27/11/2008. Lenguajes de Ontologías. OWL\n[5]\nEjemplo\n4/12/2008. Lenguajes de Ontologías. OWL\nEjemplo\n11/12/2008. Metodologías (IV): Conceptualización.\n[6]\n18/12/2008. Clase suspendida por escasa asistencia de alumnos\n8/1/2009. Ontologías y multilingualidad\n[7]\n15/1/2009. Anotación de recursos y acceso basado en ontologías a bases de datos de legado\n[8]\n22/1/2009. Aplicaciones\n[9]\n13/2/2009. Examen de la asignatura. Aula 6101. 9:00-13:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\nDocumentación de Metodologías\n\nD5.3.1 NeOn Development Process and Ontology Life Cycle\nNeOn Glossary of Activities\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[10]\nPrácticas\n\nTodas las prácticas se deben entregar por correo electrónico a Oscar Corcho.\nIntroducción a las prácticas\nPráctica 1\n(entrega 23/10/2008). Trabajo de recopilación de fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido.\nComentarios sobre la práctica 1\nDe momento también disponibles más abajo en esta misma página\nPráctica 2\n(entrega 20/11/2008). Desarrollo de taxonomías de conceptos y relaciones entre ellos en RDF Schema, con algunos individuos de ejemplo para poder mostrar cómo éstos se representan en RDF. Se puede hacer el desarrollo de manera manual (con un editor de texto, no recomendado) o con herramientas de edición de RDF(S). Asimismo, se deberán escribir 10 consultas en SPARQL teniendo en cuenta las taxonomías y relaciones implementadas, e intentando explotar las posibilidades expresivas de este lenguaje de consultas, junto con un análisis de cómo se abordarían estas consultas en una base de datos relacional.\nPráctica 3\n(\nentrega 4/12/2008\n). (entrega 8/1/2009)\nCada grupo de trabajo debe realizar la especificación de la ontología que va a desarrollar.\nGuías\nCada grupo puede decidir utilizar las herramientas propuestas en las guías, o utilizar la herramienta\nOntoKEM\npara realizar la especificación.\n(a) Realizar el documento de especificación de requisitos de la ontología.\nTemplate\n(b) Documentar en detalle cómo se han realizado todas y cada una de las tareas.\n(c) Rellenar el cuestionario sobre la utilidad y usabilidad de las guías.\nCuestionario\nCada grupo de trabajo debe revisar los recursos que se identificaron en la práctica 1 y buscar recursos nuevos, por ejemplo, en Watson, y así identificar la lista de recursos candidatos (ontológicos y no ontológicos) a reutilizar\nCada grupo de trabajo debe identificar el modelo de ciclo de vida y el ciclo de vida concreto de la ontología que va a desarrollar.\n(a) Seleccionar el conjunto de actividades necesarias para el desarrollo de la ontología usando la tabla de actividades.\n(b) Identificar el modelo de ciclo de vida a utilizar para el desarrollo de la ontología y justificar por qué se usa.\n(c) Identificar el conjunto de posibles escenarios en la construcción de la ontología.\n(d) Identificar el ciclo de vida concreto a seguir para desarrollar la ontología\n(e) Construir un diagrama Gantt para el desarrollo de la ontología.\n(f) Rellenar el cuestionario sobre la utilidad y usabilidad de las guías.\nCuestionario\nY finalmente debe realizar la conceptualización de la ontología que va a desarrollar indicando:\n(a) Comentar si es necesario la reutilización y reingeniería de otras ontologías. Justificar los criterios utilizados a la hora de seleccionar una ontología entre varias disponibles.\n(b) Clasificar en la \"pirámide de ontologías\" donde se incluyen cada una de las ontologías que se necesitan para la aplicación.\n(c) Modelo Conceptual de alto nivel de la ontología, indicando si las ontologías se obtienen de otros recursos ontológicos o de otras ontologías.\n(d) Construir el modelo Conceptual detallado de la ontología, identificando cuáles son los conceptos principales involucrados y las relaciones entre ellos.\n(e) Implementar una parte de la ontología con un editor, incluyendo propiedades en los conceptos e identificando algún axioma.\nPráctica 4\n(entrega 18/12/2008). Desarrollo de ontologías en OWL, basado en el desarrollo que se ha realizado con RDF Schema y los comentarios recibidos para la práctica anterior. Se debe hacer el desarrollo con herramientas de edición de OWL (herramientas recomendadas: Protégé 4\n[11]\ny SWOOP). Las ontologías deben contar al menos con 40 clases y 20 relaciones (ObjectProperties), y de las clases representadas al menos 10 deben ser definidas. Asimismo, la taxonomía escrita y la inferida deben ser distintas. También se deben incluir ejemplos de definiciones de clases que harían la ontología inconsistente y definiciones de instancias inconsistentes, y describir por qué. Las consultas SPARQL de la sesión previa se deben refinar teniendo en cuenta el nuevo modelo.\nPráctica 5\n(\nentrega 15/1/2009\n) (entrega 22/1/2009). Ontologías multilingües.\nEsta practica tiene dos partes principales:\n1. Realizar una evaluacion de las guias de localizacion (disponibles en las transparencias), evaluacion de la usabilidad del LabelTranslator plug-in (\nhttp://droz.dia.fi.upm.es/lt/evaluation.htm\n), y evaluacion de los resultados obtenidos por la herramienta.\n2. Traducir vuestras ontologias utilizando LabelTranslator.\nTrabajo Final Recopilatorio\n(entrega: día del examen: 13/2/09 a las 9:00).Cada grupo realizará un trabajo final en el que unificará y resumirá las prácticas realizadas a lo largo del curso. El objetivo del trabajo es mejorar los trabajos individuales y agruparlos en un único documento. Se pide:\npresentar con un enfoque metodológico la ontología construída, justificando aspectos como: la planificación de la ontología, la especificación de requisitos, los recursos no ontológicos reutilizados para su construcción, la conceptualización obtenida y la evaluación realizada a la ontología.\nImplementar la ontología en OWL con los métodos, técnicas y herramientas presentados a lo largo del curso.\nValorar  los contenidos de la asignatura, los contenidos aprendidos y los métodos docentes empleados\nLas prácticas se presentarán oralmente ese mismo día. Cada grupo hará una breve presentación de 10 minutos y se le harán preguntas durante otros cinco minutos.\nExamen de Febrero\n(día del examen: 13/2/09 a las 9:00)\nOfertas de trabajo relacionadas",
  "speaker": "SYSTEM",
  "uuid": "0a8ff040-a132-4324-9d2a-80254e9cf378"
}