{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nPropuestas\n2\nPresupuesto\n3\nCurriculum\n3.1\nDescripción UPM\n3.2\nDescripción OEG\n3.3\nShort CVs\n4\nDescripciones en Español\n4.1\nDescripcion del Grupo para los Avanza\n4.2\nCVs formato cicyt\n4.3\nShort CVs\n5\nDocumentación\nPropuestas\n\nPropuestas-Cenits-Avanzas\nIBM-Software\nTIN2014\nTIN2017\nPresupuesto\n\nPara hacer los presupuestos hay que tener en cuenta varias cosas:\nModelo de costes:\nActual Inderect Cost'\nEsto quiere decir que la EC Contribution es: (a confirmar por Ana)\n- Investigación: 75% sobre total\n- Gestión: 100% sobre total\n- Demostración: 50% sobre total\n- Coordinación: 100% costes directos + 7% de indirectos sobre (directos-subcontratación)\n- Otros: 100% sobre total\nPersonal:\nContrato\nCoste anual (12 PM)\nSuper A1\n52.442,35€\nA1\n44.624,17€\nA2\n41.118,30€\nFichero para calcular coste según personalización de sueldos A1 y A2\nOverheads:\n71,13%\n(sobre el presupuesto de Personal de la Fac. Informática)\nSubcontratación:\nAuditorías\n(en Gestión)\nConsumibles:\nTóner, papel, material de oficina, encuadernaciones, ratones, etc.\nOtros gastos:\nSeguros de viaje, organización local de reuniones, etc.\nCostes de personal para propuestas (Asun 2-1-2012):\nLos costes de rtd son de 5000 euros\nLos costes de gestion son de 4000 euros\nViajes:\n9K euros en el proyecto para meetings por 36PM:  minimo de 3000 euros por persona al año para meetings de research.\n3K euros en el proyecto para meetings para review por cada 36PM\n5K euros en el proyecto para asistir a conferencias, por cada 36PM\nEquipos\nIntentad sacar 6K euros para servidores\nAuditoria\n2K euros por cada multiplo de 370K euros si dura tres años\n2,5k euros por cada multiplo de 370K euros si dura 4 años\nPara proyectos superiores a 740K euros, poned 5k euros de auditoria\nCurriculum\n\nCurricula\nde los miembros del grupo.\nDatos útiles de\nPDI\n.\nDescripción UPM\n\nUPM: Universidad Politécnica de Madrid, Facultad de Informática, Madrid, Spain\nThe Universidad Politécnica de Madrid (UPM) is the oldest and largest of the Spanish Technical Universities and covers most Engineering disciplines. UPM has a strong commitment to R&D and Innovation, with more than 200 Research Groups and several Research Institutes and Technological Centres in different knowledge areas. The Ontology Engineering Group (OEG, www.oeg-upm.net), led by Prof. Asunción Gómez-Pérez, has been working on the provision of semantic infrastructure since 1995, and is currently composed of researchers from different fields: Ontological Engineering, Data Integration, Semantic Web, Semantic Grid and Computational Linguistic. Some of the most important results of the OEG group in the previous areas are: Methontology and the NeOn methodologies, WebODE and Oyster (in Ontological Engineering), Linguistic Information Repository model, LabelTranslator for localizing ontologies (in Computational Linguistic); R2O, ODEMapster and EgoIR (in semantic-based data integration); ODESeW and ODESWS (in Semantic Web); and WS-DAIOnt-RDF(S) and ODESGS (in Semantic Grid). Besides, it has participated or is participating in the following EU IST projects: MKBEEM, OntoWeb, Esperonto, OntoGrid as coordinator, NeOn, SEEMP, Knowledge Web, ADMIRE, DynaLearn, SemSorGrid4Env as coordinator, SEALS as coordinator, and MONNET.\nLogo UPM vectorial:\nfile\nDescripción OEG\n\nThe Ontology Engineering Group, established in 1995, carries out research in the areas of Ontological Engineering, Natural Language Processing, Semantic Web, Semantic e-Science and the Real World Internet. It is ranked third in the official UPM ranking of research groups, with an average of three Ph.D. theses and five M.Sc. theses read every year. The group maintains active contact with a large number of international institutions, including groups from top-ranked universities and research centres (e.g. Stanford University, University of Edinburgh, Oxford University, University of Manchester, UK National e-Science Centre, Open University, Universitat Karlsruhe, DERI). Furthermore, group members frequently visit these institutions for research stays.\nSome of the most important achievements obtained by the group are Methontology and  the  NeOn Methodology, methodologies for creating ontologies on ontology networks;  the latter is  based on a set of scenarios that include the collaborative development of the ontology, the reuse of ontological and non ontological resources, and the development and maintenance of the ontology network; it also contains WebODE and NeOn Toolkit (tools for ontology development), ODESeW ( an ontology-based application that automatically generates and manages knowledge-based portals), R2O, NOR2O and SPARQL-STR (mapping and query languages for transforming relational Databases, spreadsheets and sensor network data in RDF and Linked Data), and GeoLinkedData.es (the official Linked Data resource for the Spanish cartography). Finally, the group has developed applications in a wide range of areas, such as knowledge management, electronic commerce, finance job search, geo-location, project management, R&D and media library management.\nText‎\nShort CVs\n\nShort CV Asun\nProf. Asunción Gómez-Pérez, PhD. (Female, H index: 46) is Full Professor at UPM (2007), Director of the Artificial Intelligence department (2008), Director of the Ontology Engineering Group (1995, 8th group in the UPM ranking), Director of the Master (2010) and Ph.D Program (2013) on Artificial Intelligence, Director of the Co-founder of the COM joint institute between Santander Bank and UPM (2012).PhD in Computer Science (1993) and Master on Business Administration (1992). Before joining UPM, she was visiting (1994-1995) as a postdoc the Knowledge Systems Laboratory at Stanford University. She has supervised 18 Ph.D thesis, she has coordinated 4 EU projects  SEALS, SemSorGrid4Env and Ontogrid and now she is coordinating LIDER. She has participated 21 EU projects (FP5, FP6 and FP7) as main researchers, and in more than 40 national projects funded by Spanish research agencies and companies. Her main research interests are ontologies, semantic technologies, linked data and the semantic Web. She has published more than 150 papers and two books on Ontological Engineering.  Her works on Ontological Engineering about Methontology and the NeON methodology are world-wide known.  She has been co-director of the summer school on Ontological Engineering and the Semantic Web since 2003 up to 2011. She acts as reviewers in journals and conferences related with semantic technologies\nShort CV Oscar (\nhttp://www.oeg-upm.net/index.php/en/teachers/11-ocorcho\n)\nOpen Government Data: Prof Oscar Corcho (m) is a Full Professor at Departamento de Inteligencia Artificial (ETSI Informáticos, Universidad Politécnica de Madrid). His research activities are focused on the application of semantic technologies in Open Science, Linked Data and Ontological Engineering. Oscar worked as a Marie Curie research fellow at the University of Manchester, and was a research manager at iSOCO. He holds a degree in Computer Science, an MSc in Software Engineering and a PhD in Artificial Intelligence from UPM. He was awarded the Third National Award by the Spanish Ministry of Education in 2001 and the López de Peñalver award to the best researcher in Engineering in Spain in 2016. He has published several books, including “Ontological Engineering\" and “The DATA Bonanza”, and more than 100 papers in journals, conferences and workshops. He has also being involved in two series of summer schools (on Grid Computing – ISSGC – and on Ontology Engineering and Semantic Web – SSSW), being both lecturer and in the latest editions serving as Director for them. Oscar has participated in several EU projects related to the application of semantic technologies to Government and on the definition of roadmaps for Open Government (CLARITY, Mobile-AGE, TheyBuyForYou), leads the Spanish thematic network on Open Data for Smart Cities, where joint guidelines and vocabularies are being proposed for the harmonisation of datasets across open data portals in Spain, and is the scientific coordinator of the Open Cities (Ciudades Abiertas) project, with the municipalities of Zaragoza, Madrid, Santiago de Compostela and A Coruña. He has been also involved in the creation of the Spanish technical norm UNE178301:2015 on Open Data for Smart Cities, which proposes a maturity model to assess and improve the quality of open data implementations for cities, and on the development of a guide for the adoption of open data by municipalities in the context of the Spanish Federation of Municipalities (FEMP).\nOpen Science: Prof Oscar Corcho (m) is a Full Professor at Departamento de Inteligencia Artificial (Facultad de Informática, Universidad Politécnica de Madrid). His research activities are focused on the application of semantic technologies in Open Science, Linked Data and Ontological Engineering. In the area of Open Science, he has participated in a number of EU projects (ACTION, STARS4ALL, GO-INTER, DrInventor, Wf4Ever, PlanetData, ADMIRE, OntoGrid), as well as a good number of Spanish R&D projects and privately-funded ones. At UPM, he is responsible for the Open Science task force at the CESAER consortium of Science and Technology universities, and participates in the Big Science initiative, focusing on the role of data management inside the university. He is currently leading the task force on Interoperability from the EOSC FAIR Working Group and is a member of the advisory board of the CHIST-ERA Open Science Working Group\n.  Previously, Oscar worked as a Marie Curie research fellow at the University of Manchester, and was a research manager at iSOCO. He holds a degree in Computer Science, an MSc in Software Engineering and a PhD in Artificial Intelligence from UPM. He was awarded the Third National Award by the Spanish Ministry of Education in 2001 and the López de Peñalver award to the best researcher in Engineering in Spain in 2016. He has published several books, including “Ontological Engineering\" and “The DATA Bonanza”, and more than 100 papers in journals, conferences and workshops. He has also being involved in two series of summer schools (on Grid Computing – ISSGC – and on Ontology Engineering and Semantic Web – SSSW), being both lecturer and in the latest editions serving as Director for them.\nShort CV de Raul García\nShort CV Mariano Rico\nMariano Rico is a postdoc researcher at the OEG research group, belonging to the Artificial Intelligence Department at Univ. Politécnica de Madrid. Mariano holds a PhD in Computer Science from UAM (2009) and a MSc Physics (UAM‐1992). From 1992 to 2003 he was a R&D engineer and project manager at private companies. For 8 years he held a teaching assistant position at the Escuela Politécnica Superior (UAM). He is responsible for the Spanish chapter of DBpedia (\nhttp://es.dbpedia.org\n). His research interests include Linked Open Data, Natural Language Processing, Semantic Web technologies and Human-Computer Interaction. He had two stays in the world leading Digital Enterprise Research Institute (DERI), in Galway, Ireland, where he worked on Interaction with Semantic Web Services and Wiki Technologies. He has participated in european research projects (e.g. Wf4Ever, LIDER) and national projects (e.g. e-Madrid, Upgrid, S5T) at the university.\nFoto de 200x200 (cambia el parámetro\ns\npara obtener otros tamaños)\nHis most relevant 5 publications are these:\n\"A Semantically Enhanced UPnP Control Point to Enhance Multimedia Content\";M. Rico,Ó. Corcho, V. Méndez, JM Gómez-Pérez; IEEE Internet Computing 15(6); 2011; Impact (JCR 2011)= 2.000 (Q1).\n\"A Contribution-based Framework for the Creation of Semantically-enabled Web Applications\"; Mariano Rico, David Camacho, Óscar Corcho; Information Sciences180(10), pp. 1850-1854; 2010; Impact (JCR 2010): 2.833 (Q1).\n\"A Tool Suite to Enable Web Designers,Web Application Developers and End-users to Handle Semantic Data\"; M. Rico, J.A. Macías, D. Camacho, and O. Corcho; International Journal On Semantic Web and Information Systems (IJSWIS); 2010; Impact (JCR 2010):1.678 (Q2).\n\"Symplifying Semantic Web Application Development and Semantic Data Usage\"; Mariano Rico; AI Communications 23(1), pp. 65-66; 2010; Impact (JCR 2010): 0.824 (Q3).\n\"A Programming Experience of High School Students in a Virtual World Platform\"; Mariano Rico, Gonzalo Martínez-Muñoz, Xavier Alaman, David Camacho and Estrella Pulido; International Journal of Engineering Education; 2011; Impact (JCR 2011): 0.418 (Q3).\nShort CV Emilio Serrano\nEnglish (\nhttps://emilioserra.oeg-upm.net/\n)\nEspañol (\nhttps://emilioserra.oeg-upm.net/inicio/9\nShort CV Maria S. Perez\nMaría S. Pérez received the PhD degree in Computer Science in 2003 and the Extraordinary PhD Award at the Universidad Politécnica de Madrid. She is Full Professor at the same University. She is part of the Board of Directors of BDVA and member of the Research and Innovation Advisory Group of the EuroHPC Joint Undertaking. Her research interest includes high performance and large-scale computing, storage, big data and application of AI techniques. She is co-author of 4 books, 7 book chapters and she has published more than 100 articles in international journals and conferences. She has been involved in the organization of many workshops and conferences, and she has edited several proceedings books and special issues. She regularly serves as a PC member of major conferences in the area of HPC, Big Data and Cloud Computing (SC, CCGRID, Cluster, etc.). She has participated in several international projects funded by the European Commission and supervised the doctoral thesis of 9 PhD students.\nShort CV de Ana\nAna Ibarrola has extensive experience in managing FP6 and FP7 projects. She was the OntoGrid project administrator since September 2004 until September 2007. At this moment she is the SemSorGrid4Env project administrator since September 2008.\nShort CV de Mari Carmen\nMari Carmen Suárez-Figueroa, PhD. (Female, H Index: 18) is Teaching Assistant at UPM and Senior Researcher at the Ontology Engineering Group (OEG). She got the PhD in Artificial Intelligence in UPM in June 2010 and received an Outstanding Award.\nHer main research activities are focused on Ontology Engineering and Linked Data. Particularly, her PhD thesis is about the NeOn Methodology.\nShe has participated in several European research projects (NeOn, SEEMP, OntoGrid, Knowledge Web, PIKON, Esperonto, and OntoWeb), and Spanish research projects (mIO! and BuscaMedia).\nShe is one of the editors of the book entitled \"Ontology Engineering in a Networked World\" published by Springer in 2012.\nShe co-organized the Terminology and Knowledge Engineering Conference (TKE 2012) and several workshops at different international conferences (ISWC, EKAW, and ESWC).\nShe has been research visitor at Department of Computer Science (University of Liverpool) in 2004, at KMi (Knowledge Media Institute - Open University) in 2007, and at IRIT (Institut de Recherche en Informatique de Toulouse) in 2012.\nSome relevant publications:\nM.C. Suárez-Figueroa, G. Aguado de Cea, A. Gómez-Pérez. Ligths and shadows in creating a glossary about ontology engineering. International Journal of Theoretical and Applied Issues in Specialized Communication. Editorial John Benjamins Publishing Company. ISSN: 0929-9971. 2013\nM. Fernández-López, A. Gómez-Pérez, M.C. Suárez-Figueroa. Methodological guidelines for reusing general ontologies. Data & Knowledge Engineering. Editorial Elsevier. ISSN: 0169-023X. July 2013\nM. C. Suárez-Figueroa, G. A. Atemezing, O. Corcho. The Landscape of Multimedia Ontologies in the Last Decade. Multimedia Tools and Applications. Print ISSN: 1380-7501; Online ISSN: 1573-7721.. DOI 10.1007/s11042-011-0905-z. Editorial Springer US. January 2013\nA. JIMÉNEZ, M. C. SUÁREZ-FIGUEROA, A. MATEOS, A. GÓMEZ-PÉREZ, M. FERNÁNDEZ-LÓPEZ. A MAUT APPROACH FOR REUSING DOMAIN ONTOLOGIES ON THE BASIS OF THE NeOn METHODOLOGY.   International Journal of Information Technology & Decision Making. Volume 12, Issue 05 (September 2013). DOI: 10.1142/S021962201340004X\nOLD VERSION:\nBA Mari Carmen Suárez-Figueroa (mcsuarez@fi.upm.es) belongs to the Ontological Engineering Group (\nhttp://www.oeg-upm.net/\n) of the Artificial Intelligence Department of the Computer Science School (\nhttp://www.fi.upm.es\n) at Universidad Politécnica de Madrid (UPM). She graduated in Computer Science from UPM in 2001. She was Associate Professor (January-March 2002) and she is Teaching Assistant from 1st September 2008 at the Computer Science School at UPM. She will get the PhD in Artificial Intelligence in UPM in June 2010.\nHer research activities include methodologies for ontology (network) development, ontology (network) development, ontology development tools, ontology evaluation, and the Semantic Web. She has participated or is currently participating at different European and national projects: OntoWeb (IST-2000-29243), Esperonto (IST-2001-34373), PIKON (IST-2001-33487), Knowledge Web (FP6-507482), OntoGrid (FP6-511513), REIMDOC (FIT-340100-2004-22), SEEMP (IST-4-027347-STP), NeOn (FP6-027595), mIO! (CENIT 2008-1019), and BuscaMedia (CENIT 2009-1026). She has been research visitor at Department of Computer Science (University of Liverpool) in 2004 and at KMi at the Open University in 2007.\nShe co-organized the EON 2006 Workshop at WWW’06, the KRRSW 2008 Workshop at ESWC 2008, the tutorial called “NeOn Methodology: how to build ontology networks?” at EKAW 2008, and the tutorial called “Ontology Engineering: the NeOn Methodology through the NeOn Toolkit” at ISWC 2009.\nShort CV Elena\nElena Montiel-Ponsoda is Lecturer of the Applied Linguistics Department at the Universidad Politécnica de Madrid, UPM, (2012) and member of the Ontology Engineering Group (2006). She holds a M.A. in Conference Interpreting and Translation (2000) by Universidad de Alicante, a B.A. in Technical Interpreting (2003) by Hochschule Magdeburg-Stendal, Germany, and a PhD on Applied Linguistics (2011) by UPM. Her research interests are at the intersection between translation (and terminology) and knowledge representation (ontologies, linked data), including amongst others: ontology localization and lexicalization, and lexico-syntactic patterns for ontology development. She has participated in several international and national projects in these areas (NeOn, ICPS, Monnet, BabeLData, etc.). Currently, she is participating in the European project LIDER. You can find more about Elena Montiel-Ponsoda on the OEG webpage.\nRelevant publications:\nOn the role of senses in the ontology-lexicon. P. Buitelaar, P. Cimiano, J. McCrae, E. Montiel-Ponsoda. In New Research Trends of Research in Ontologies and Lexical Resources, A. Oltramari, L. Qin, P. Vossen, E. Hovy (Eds.), Springer, 2013, pp. 43-61.\nChallenges for the Multilingual Web of Data. J. Gracia, E. Montiel-Ponsoda, P. Cimiano, A. Gómez-Pérez, P. Buitelaar, J. McCrae. In Journal of Web Semantics, Elsevier, 2011, pp. 63-71.\nInterchanging Lexical Resources on the Semantic Web. J. McCrae, G. Aguado-de-Cea, P. Buitelaar, P. Cimiano, T. Declerck, A. Gómez-Pérez, J. Gracia, L. Hollink, E. Montiel-Ponsoda, D. Spohr, T. Wunner. In Journal of Language Resources and Evaluation, 46, Issue 4, 2012, pp. 701-719.\nEnriching Ontologies with Multilingual Information. E. Montiel-Ponsoda, G. Aguado de Cea, A. Gómez-Pérez, W. Peters. En Journal of Natural Language Engineering, Cambridge, 17: 283-309, 2010.\nA Note on Ontology Localization. P. Cimiano, E. Montiel-Ponsoda, P. Buitelaar, M. Espinoza, A. Gómez-Pérez. En Journal of Applied Ontology, 5: 127-137, IOS Press, 2010.\nShort CV María Poveda\nDr. María Poveda-Villalón is and assistant professor in the Artificial Intelligence Department  of the Universidad Politécnica de Madrid and is also part of the Ontology Engineering Group research lab. Her research activities focus on Ontological Engineering, Ontology Evaluation, Knowledge Representation and the Semantic Web. Previously she finished her studies in Computer Science (2009) by Universidad Politécnica de Madrid, and then she moved to study the Artificial Intelligence Research Master finished in 2010 in the same university. She has worked in the context of Spanish research projects as well as in European projects such as ETSI STF for SAREF extensions, VICINITY (H2020-688467), READY4SmartCities (FP7-608711), and NeOn (FP6-027595). She has contributed to the organization of the \"Linked Data in Architecture and Construction Workshop\" since 2015 edition, the \"13th OWL: Experiences and Directions Workshop and 5th OWL reasoner evaluation workshop\" in 2016, the \"Linked Energy Data Vocamp\" in 2015 and the \"Catching up with ontological engineering: To git-commit and beyond\" tutorial at EKAW2018. Finally, she is part of the W3C Web of Things Working Group.\nRelevant publications:\nM. Poveda-Villalón, M.C. Suárez-Figueroa, A. Gómez-Pérez. Validating ontologies with OOPS!. 18th International Conference on Knowledge Engineering and Knowledge Management. (EKAW2012) Galway, Irland, 8 - 12 October 2012.\nVandenbussche, P. Y., Atemezing, G. A., Poveda-Villalón, M., & Vatant, B. (2017). Linked Open Vocabularies (LOV): a gateway to reusable semantic vocabularies on the Web. Semantic Web, 8(3), 437-452.\nRadulovic, F., Poveda-Villalón, M., Vila-Suero, D., Rodríguez-Doncel, V., García-Castro, R., & Gómez-Pérez, A. (2015). Guidelines for Linked Data generation and publication: An example in building energy consumption. Automation in Construction, 57, 178-187.\nAlobaid, A., Garijo, D., Poveda-Villalón, M., Santana-Perez, I., Fernández-Izquierdo, A., & Corcho, O. (2019). Automating ontology engineering support activities with OnToology. Journal of Web Semantics, 57, 100472.\nShort CV Ahmad Alobaid\nAhmad is a PhD student in Universidad Politécnica de Madrid. His work focuses on semantic  labeling of tabular data and the generation of knowledge graphs from tabular data. He also  worked on [\nOnToology\n] to automatically generate documentation, virtualization, evaluation report,  JSON-LD, and validation of the ontology against set rules. He also developed an online mapping editor [\nOME\n] to annotate tabular data and generate mappings (e.g., RML and R2RML). It is integrated with the tada service to automatically suggests the classes and properties from ontologies.\nRelevant publications:\n“Exploiting Declarative Mapping Rules for Generating GraphQL Servers with Morph-GraphQL”, IJSEKE\nAlobaid, A., & Corcho, O. (2018, November). Fuzzy semantic labeling of semi-structured numerical datasets. In European Knowledge Acquisition Workshop (pp. 19-33). Springer, Cham.\nAlobaid, A., Kacprzak, E., & Corcho, O. (2020) . Typology-based Semantic Labeling of Numeric Tabular Data. Semantic Web Journal\nPriyatna, Freddy & Chaves-Fraga, David & Alobaid, Ahmad & Corcho, Oscar. (2019). morph-GraphQL: GraphQL Servers Generation from R2RML Mappings. 10.18293/SEKE2019-055.\nAlobaid, A., Garijo, D., Poveda-Villalón, M., Santana-Perez, I., Fernández-Izquierdo, A., & Corcho, O. (2019). Automating ontology engineering support activities with OnToology. Journal of Web Semantics, 57, 100472.\nDescripciones en Español\n\nDescripcion del Grupo para los Avanza\n\nCVs formato cicyt\n\nCicyt Asunción Gómez (2010)\nCicyt Óscar Corcho\nCicyt Raúl García\nCicyt Mariano Rico\nCicyt María Poveda (Septiembre 2014)\nCicyt Víctor Rodríguez\nCicyt Elena Montiel\n‎Cicyt Mariano Fernández\nCicyt Mari Carmen  Suárez de Figueroa\nCicyt María Pérez\nShort CVs\n\nShort CV Asun\nDña.  Asunción Gómez Pérez es catedrática de universidad en la Facultad de Informática de la Universidad Politécnica de Madrid y Directora del Grupo de Ingeniería Ontológica. Actualmente es Directora del Departamento de Inteligencia Artificial de la Facultad de Informática. Es Doctora en Ciencias de la Computación e Inteligencia Artificial (1993) y\nMáster en Dirección y Administración de Empresas (1994). Fue visitante en el Laboratorio de Sistemas de Conocimiento de la Universidad de Stanford (1994-1995). En la UPM ha dirigido numerosos proyectos europeos (MKBEEM, Ontoweb, Esperonto, Knowledge Web, NeOn, SEEMP, OntoGrid, Admire, SemsorGrid4Env, SEALS, DynaLearn, Monnet, LÍDER, etc) y del Plan Nacional (España Virtual, Plata, Geobuddies, BabeLData, etc.). Ha publicado más de 150 artículos y es autora de un libro sobre Ingeniería Ontológica y coautora de un libro sobre Ingeniería de conocimiento. Ha sido codirectora de la escuela de verano sobre Ingeniería Ontológica y Web Semántica desde 2003 hasta la fecha. Fue program chair de ASWC'09, ESWC’05 y EKAW’02 y coorganizadora de workshops y conferencias sobre ontologías.\nShort CV Oscar\nD. Óscar Corcho es Profesor Titular de Universidad en la Facultad de Informática de la Universidad Politécnica de Madrid, y forma parte del Grupo de Ingeniería Ontológica de esta facultad. Es Doctor en Ciencias de la Computación e Inteligencia Artificial (2004) por la UPM. Recibió el Tercer Premio Nacional Fin de Carrera por el Ministerio de Educación y Ciencia (2001) y el Premio Extraordinario de Doctorado por la UPM (2005). Sus actividades de investigación se centran en la e-Ciencia Semántica, la Web Semántica y la Ingeniería Ontológica. Ha participado en varios proyectos europeos en estas áreas: PlanetData, Wf4Ever, SemsorGrid4Env, ADMIRE, OntoGrid, Esperonto, DIP, HOPS, SWWS, Knowledge Web, OntoWeb y MKBEEM. También ha participado en el proyecto HALO, financiado por Vulcan Inc. Ha publicado los libros “Ontological Engineering\" y \"A layered declarative approach to ontology translation with knowledge preservation\", más de 50 artículos en revistas y conferencias, y realiza revisiones de artículos en diversas conferencias, workshops y revistas.\nShort CV de Raul García\nBreve CV de Mariano Rico\nMariano Rico Almodóvar es doctor en Ingeniería Informática y Telecomunicación por la Universidad Autónoma de Madrid (UAM, 2009) y\nlicenciado en CC. Físicas (UAM-1992, especialidad en Física Fundamental). De 1992 a 2003 fue ingeniero de\nI+D y jefe de proyectos en prestigiosos centros de investigación públicos y privados. Durante 8 años (en el periodo 2003-2013) fue\nprofesor ayudante en la Escuela Politécnica Superior (UAM). Sus intereses de investigación principales incluyen\nLinked Open Data, tecnologías de la Web Semántica y lenguaje natural. Ha realizado dos estancias en el centro de investigación Digital Enterprise\nResearch Institute (DERI), en Galway, Irlanda, referente mundial en Web Semántica, mundial donde ha trabajado en interacción con servicios, tecnologías de la Web Semántica, y wikis. En la universidad ha participado en varios proyectos de investigación europeos (e.g. Wf4Ever, LIDER) y nacionales (e.g. e-Madrid, Upgrid, S5T).\nFoto de 200x200 (cambia el parámetro\ns\npara obtener otros tamaños)\nSus cinco publicaciones más relevantes:\n\"A Semantically Enhanced UPnP Control Point to Enhance Multimedia Content\";M. Rico,Ó. Corcho, V. Méndez, JM Gómez-Pérez; IEEE Internet Computing 15(6); 2011; Impacto (JCR 2011)= 2.000 (Q1).\n\"A Contribution-based Framework for the Creation of Semantically-enabled Web Applications\"; Mariano Rico, David Camacho, Óscar Corcho; Information Sciences 180(10), pp. 1850-1854; 2010; Impacto (JCR 2010): 2.833 (Q1).\n\"A Tool Suite to Enable Web Designers,Web Application Developers and End-users to Handle Semantic Data\"; M. Rico, J.A. Macías, D. Camacho, and O. Corcho; International Journal On Semantic Web and Information Systems (IJSWIS); 2010; Impacto (JCR 2010):1.678 (Q2).\n\"Symplifying Semantic Web Application Development and Semantic Data Usage\"; Mariano Rico; AI Communications 23(1), pp. 65-66; 2010; Impacto (JCR 2010): 0.824 (Q3).\n\"A Programming Experience of High School Students in a Virtual World Platform\"; Mariano Rico, Gonzalo Martínez-Muñoz, Xavier Alaman, David Camacho and Estrella Pulido; International Journal of Engineering Education; 2011; Impact (JCR 2011): 0.418 (Q3).\nBreve CV de Maria S. Perez\nMaría S. Pérez es Catedrática de Universidad en la Universidad Politécnica de Madrid. Sus principales\náreas de investigación de interés incluyen Big Data, Machine Learning, Cloud, Edge Computing, HPC y\nSistemas de Almacenamiento. Es co-autora de 4 libros, 7 capítulos de libro y ha publicado más de 100\nartículos en revistas y conferencias internacionales. Ha organizado más de 30 ediciones de conferencias y\nworkshops internacionales, entre los que destaca la conferencia IEEE Cluster. Ha participado en 6 proyectos\neuropeos (coordinando uno de ellos) y en más de 15 proyectos nacionales. Es miembro del Board of\nDirectors de BDVA y miembro del Research and Innovation Advisory Group of EuroHPC.\nBreve CV Mari Carmen\nMª del Carmen Suárez de Figueroa Baonza es Profesora Ayudante en el Departamento de Inteligencia Artificial de la Facultad de Informática de la Universidad Politécnica de Madrid, y forma parte del Grupo de Ingeniería Ontológica de esta facultad. Anteriormente ha trabajado como Profesora Asociada (2002) en la Facultad de Informática.\nEs Licenciada en Informática por la Universidad Politécnica de Madrid (UPM) desde el año 2001, y obtendrá el grado de Doctora en Ciencias de la Computación e Inteligencia Artificial por la UPM en junio del año 2010.\nSus actividades de investigación se centran en la Ingeniería Ontológica y la Web Semántica. Concretamente, sus líneas de investigación incluyen metodologías para el desarrollo de redes de ontologías, desarrollo de ontologías en diferentes dominios, y evaluación de ontologías. Ha participado en los siguientes proyectos europeos y nacionales relacionados con su línea de investigación: BuscaMedia, mIO!, NeOn, SEEMP, REIMDOC, OntoGrid, Knowledge Web, PIKON, Esperonto y OntoWeb.\nHa sido investigadora visitante en el KMi en la Open University (Inglaterra) en el 2007 y en el Departamento de Informática de la Universidad de Liverpool (Inglaterra) en el 2004.\nHa co-organizado el EON 2006 Workshop en  WWW’06, el KRRSW 2008 Workshop en ESWC 2008, el tutorial titulado “NeOn Methodology: how to build ontology networks?” en EKAW 2008, y el tutorial titulado “Ontology Engineering: the NeOn Methodology through the NeOn Toolkit” en ISWC 2009.\nBreve CV Elena\nElena Montiel-Ponsoda es miembro del “Ontology Engineering Group” de la Facultad de Informática de la Universidad Politécnica de Madrid (UPM), y doctoranda del Dpto. de Lingüística Aplicada a la Ciencia y a la Tecnología de la misma universidad. Desde 2006 ha trabajado en diversos proyectos relacionados con ontologías, localización y procesamiento de lenguaje natural (PLN), entre otros: NeOn, Lifecycle support for networked ontologies (FP6-027595), ICPS – International Classification for Patient Safety, un proyecto de la Organización Mundial de la Salud, o el recién estrenado Monnet, Multilingual Ontologies for Networked Knowledge (FP7-248458). En el año 2000 se licenció en Traducción e Interpretación por la Universidad de Alicante, y en 2003 obtuvo el grado de Bachelor of Arts en Interpretación técnica por la Hochschule Magdeburg-Stendal, en Magdeburgo, Alemania. Ha realizado estancias de investigación en el centro de investigación DFKI, en Saarbrücken, Alemania (2008) y en el Grupo de Procesamiento de Lenguaje Natural de la Universidad de Sheffield (2009). Ha co-organizado el workshop “Multilingual Semantic Web” en la conferencia WWW2010. Los resultados de su investigación se han publicado en conferencias de Lingüística aplicada, Web Semántica y PLN, tales como OntoLex (2007), AELFE (2007 y 2008), Coling (2008), EKAW (2008), ESWC (2009), K-CAP (2009), o TIA (2009).\nBreve CV María Poveda\nMaría Poveda Villalón es profesora ayudante doctor del Departamento de Inteligenica Artificial de la Universidad Politécnica de Madrid y forma parte del laboratorio de investigación Ontology Engineering Group. Es doctora por la misma universidad en la que también cursó Ingeniería Superior Informática. Sus principales intereses de investigación se centran en la ingeniería ontológica, evaluación de ontologías, representación del conocmiento y web semántica. Ha participado en proyectos tanto nacionales como europeos y ha co-organizado eventos en el ámbito de la web semántica como el \"Linked Data in Architecture and Construction Workshop\" desde 2015, el \"13th OWL: Experiences and Directions Workshop and 5th OWL reasoner evaluation workshop\" en 2016, el \"Linked Energy Data Vocamp\" en 2015 y el tutorial \"Catching up with ontological engineering: To git-commit and beyond\" celebrado durante la conferencia EKAW2018.\nDocumentación\n\nEste documento hay que pedirlo cada vez que se haga una propuesta.\nFile:IMPRESO Solicitud investigadores dc.doc\nDocumento con la info administrativa de la UPM. Cuando piden el PIC, piden esto:\nAdmin data UPM",
  "speaker": "SYSTEM",
  "uuid": "0b0f269d-8835-44e9-adbc-b9d5b79fdeaa"
}