{
  "message": "SYSTEM: Wiki: Here we include information for the students of the \"Master de Investigación en Inteligencia Artificial\".\nStudent list\nFor privacy reasons, this is only accessible by the lecturers\nDeadline for final assignment: 26/06/2009\nObjectives\n\n[\nDescripción\n]\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation will be done on the basis of: participation in discussions (20%), periodical assignments (50%) and final assignment (30%)\nSchedule and Material\n\n3/3/2009. Introduction (Asun)\nRecomended reading: Tim Bernes Lee articles\nSlides: [\nIntro Sweb\n]\nAssignment: Choose between one of them.\nRead the article written by TBL in 1996 and 2002 and summarize his vision in three pages\nRead the \"Radar and Networks & Nova Spivack\" vision published in 2007. Summarize it in three pages\nWhat is the Future Internet and which one is the relationship with the semantic Web. Summarize it in three pages.\nDeadline: 10/3/2009 at 11:00am\n10/3/2009. Theoretical Foundations of Ontologies  (Asun)\nRecommended reading: Chapter 1 and 2 of the book \"Ontological Engineering\"\nSlides: [\nFoundations of ontologies\n]\nAssignment:Choose betwen one of them.\nRead and comment the following paper that includes several definitions of ontologies: Guarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nSearch papers on the topic of Ontological Commitments.  Read, comment and compare at least the following two papers:\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nChoose a domain and find  ontological and non ontological available resources consensuated by a community. Classify them in the continuous line identified by Lassila and McGuiness. Justify why they are important and how do you know that they represent consesuated knowledge.\nIdentify a set of criteria to be used to compare technologies used for searching ontologies. Classify existing technologies according to the criteria.\nDeadline: 16/3/2009 at 23:00\nPresentation: Students will be selected randomly to present their assigments on 21/4/2009\n17/3/2009. Ontologies and terminologies (Lupe)\nRecommended reading:\nSlides: [\nTerminology in ontologies\n]\nStudents should read the first two articles and one more selected from the others.\n[\n[1]\n]  [\n[2]\n]  [\n[3]\n[\n[4]\n][\n[5]\n] [\n[6]\n]\nDeadline: 26/3/2009 at 23:00\nPresentation: Students will be selected randomly to present their assigments on 31/3/2009\n24/3/2009. Ontology languages I (Oscar)\nRecommended reading: Chapter 4 of the book \"Ontological Engineering\"\nSlides: [\nOntology languages (RDF(S))\n]\nAdditional RDF(S) examples: [\n[7]\n]\nAssignment: see Ontology Languages (II).\n31/3/2009. Ontology languages II (Oscar)\nRecommended reading: Chapter 4 of the book \"Ontological Engineering\"\nSlides: [\nOntology languages (OWL)\n]\nAssignment: Create the same ontology in RDF(S) and OWL and compare the expressivity of both languages. If you have not selected a specific domain for this ontology development, you can use the following (written in Spanish):\nExample\n[\nData Center Ontology\n]\nDeadline: 13/4/2009 at 11:00am\n14/4/2009. Ontology languages III (Oscar)\nDiscussion about RDF(S) and OWL expressivity\n21/4/2009. Methodologies I (Asun)\nThe class of today is postponed.\n28/4/2009. Methodologies II (Asun)\nRecommended readings:\nNeOn Glossary of Activities\nD5.3.1 NeOn Development Process and Ontology Life Cycle\nChapter 3: ontology development process (required and if-applicable activities).\nChapter 4: scenarios for building ontology networks.\nChapter 5: life cycle and life cycle models.\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[8]\nChapter 5: guidelines for ontology requirements specificiation.\nChapter 6: guidelines for reusing and re-engineering non-ontological resources.\nChapter 7: guidelines for reusing ontological resources.\nChapter 8: guidelines for reusing ontology design patterns.\nD5.3.2. Revision and Extension of the NeOn Development Process and Ontology Life Cycle\n[9]\nSlides:\nNeOn Methodology: Specification and Scheduling\nAssignment: The International Olympic Committee decides to rely on semantic technologies to manage information related to the Olympic Games. For this purpose, such a committee needs an ontology network able to model information about the sports (summer and winter), about countries and teams involved, about venues and dates, and about medals and winners. Each group should focus on winter or summer sports; and should select one particular sport to define it in more detail.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nSchedule the ontology network development.\nDeadline:\nExtended to 24/5/2009 23:00 CET\n5/5/2009. Methodologies III (Asun)\nRecommended reading:\nD2.5.1. A Library of Ontology Design Patterns\nSlides:\nNeOn Methodology: Reuse of Knowledge Resources\nAssignment: Continuation of the Olympic Games assigment. In particular:\nQuick search for ontology design patterns that could be reused during the ontology development.\nTransformation of non ontological resources selected last week into ontologies\nSelection of ontologies to be reused\nDevelopment of the conceptual model that represents the proposed domain using the NeOn Toolkit. Particular decisions concerning the design of the ontology network and the reuse and integration of resources should also be documented.\nNote:\nNeOn Toolkit could be downloaded from\nhttp://neon-toolkit.org/\nDeadline:\nExtended to 24/5/2009 23:00 CET\n12/5/2009. Ontologies and Multilinguality (Mauricio)\nRecommended reading:\nMultilingual and Localization Support for Ontologies\nSection 8 Ontology Localization\nSlides:\nAssignment: Continuation of the Olympic Games assigment. In particular:\nLocalize the ontology network in at least one natural language different from that using during the ontology network development.\nDeadline:\nExtended to 24/5/2009 23:00 CET\nNote: The\nlast version of the LabelTranslator system\ncan be downloaded from:\nhttp://droz.dia.fi.upm.es/plugin/Labeltranslator.zip\n.  Please do not use the option software updates of NeOn Toolkit for install LabelTranslator.\n19/5/2009. Non-standard ontology reasoning features (Oscar)\nRecommended reading: [1] Cuenca Grau B, Horrocks I, Kazakov Y, Sattler U. Just the Right Amount: Extracting Modules from Ontologies. WWW2007, [2] Horridge M, Parsia B, Sattler U. Laconic and Precise Justifications in OWL. ISWC2008. [3] Schlobach S, Cornet R. “Non-standard reasoning services for the debugging of description logic terminologies”. In Proceedings of the 18th International Joint Conference on Artificial Intelligence (IJCAI), Acapulco, Mexico: 355-362. (2003)[4] Hai Wang, Alan Rector, Nick Drummond, Matthew Horridge, et al. OWL Pizzas: Practical Experience of Teaching OWL-DL: Common Errors & Common Patterns. EKAW 2004\nhttp://www.co-ode.org/resources/papers/ekaw2004.pdf\nSlides: [\nOWL Modularisation and Debugging\n] [\nSample OWL ontology with inconsistencies\n] [\nDebugging Experiment\n] [\nProtégé version to be used for both groups\n] [\nGuidelines (not to be downloaded nor looked at by Group 1)\n] [\nPaper Guidelines (not to be downloaded nor looked at by Group 1)\n]\nAssignment: We will provide a set of OWL ontology debugging guidelines that we have created in the last months and that we are writing down in a paper that we are preparing for the ISWC2009 conference, and will ask some students to apply these guidelines to debug a predefined set of OWL ontologies and some others to debug these ontologies without the help of the guidelines, in order to assess their adequacy.\nAssignment I. Fill in this survey before 18/5/2009:\nhttp://www.surveymonkey.com/s.aspx?sm=WYO9_2b_2f5jp5KgiCVAa3Bp4A_3d_3d\nAssignment II.\nOntology:\nMedia:HydrOntology2_root.zip\n(update the 22/05/09) if you were using the previous ontology send an email at catherine.roussey@liris.cnrs.fr few questions have to be removed from the first survey.\nBE CAREFUL. LOOK AT THE QUESTIONNAIRE FIRST TO CHECK WHAT YOU HAVE TO DO!!\nif you need some translation about hydrography name have a look at this thesaurus\nhttp://www.iho.shom.fr/Dhydro/Html/site_edition/consultation.html\nFill in this questionnaire before 1/6/2009: Group 1 without the guideline:\nhttp://www.surveymonkey.com/s.aspx?sm=SgEaEMJxkJJoSNVwA6b2wA_3d_3d\n. Group 2 with the guidelines:\nhttp://www.surveymonkey.com/s.aspx?sm=RvPMaSPPPW_2bVlq9H4G27_2fg_3d_3d\nAssignment III. Fill in this questionnaire before 16/6/2009: Group 1:\nhttp://www.surveymonkey.com/s.aspx?sm=_2f8BieN3Hv6FVcuxLxxkm1A_3d_3d\n; Group 2:\nhttp://www.surveymonkey.com/s.aspx?sm=0qbGr9zOX3yYPNpm4qYmfg_3d_3d\nDeadline: to be decided\n26/5/2009. Presentation of ontology development assignment (Asun)\nToday students will present in groups of two people the work done during the methodological topic. Each group will have 7 minutes maximum for presentation and 3 for questions.\nAssignment:\nA compilation of the methodological assignments covering all the methodological topics and a ppt presentation\nAnswers to questionnaires related to the assignment, to the methodological part of the course, and to the NeOn Toolkit.\nDeadline: A compilation of the methodological assignments, the questionnaires and a ppt presentation must be sent to Asun and Mari Carmen before 24/5/2009 23:00 CET\nQuestionnaires to be filled are:\nNeOn Methodology Questionnaire\n,\nNeOn Toolkit Questionnaire\n2/6/2009.\nThis class is cancelled, due to the following seminar that will be taught the day before, and that we consider that you should attend if possible:\nQuery Answering over Expressive DL Ontologies\n9/6/2009. Application of Natural Language Techniques to Ontology Development (Lupe)\n8/6/2009. NEW\nThe class scheduled for 9/6/2009 will be substituted by the lecture that Prof. Ruslan Mitkov will deliver on MONDAY, June 8t, 2009. Students are highly encouraged to attend this lecture, if possible. Prof. MITKOV's lecture will be at 11:00, H. 1005, Bloque 1. A summary of the lecture can be found in\nProf.MITKOV\nResearch topics\n\nOWL Debugging\nOntology Design Patterns\nOntology Reuse\nTransformation of Knowledge-aware Resources\nOntologies and Natural Language Processing, and Multilinguality",
  "speaker": "SYSTEM",
  "uuid": "0c175208-e63b-414c-9cb1-22a60cc0134d"
}