{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual25112010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n. \nSe ha intentado realizar la importación de los datos del repositorio de Sem4Tags a la base de datos postgres en el servidor de Deimos. Inicialmente tuve problemas para conectarme a la base de datos con un usuario diferente al usuario del sistema postgres debido a que no sabía cuál era el password del usuario postgres de base de datos. Una vez encontré los scripts pude realizar las modificaciones pertinentes.\nPor otra parte, las bases de datos de Sem4Tags están creadas para que soporten caracteres en español  por lo cual en los scripts de creación utilizo como opciones de localización (o Internacionalización) las localizaciones 'Spanish_Spain.1252' (para Windows) y 'es_PE.UTF-8' para Linux.\nLa creación de las bases de datos en Linux falla porque el nombre de la localización no es válido ( 'es_PE.UTF-8'). Esto se debe a que actualmente en dicha maquina no está instalada esta localización (esto lo pude comprobar con el comando locale –a).\nPara concluir, necesitamos solicitar a Deimos  la instalación del locale 'es_PE.UTF-8' en el servidor.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n-Paper para el ESWC\n- Preparación de las fuentes para el experimento (registro e invocación). Se ha agregado nuevas fuentes.\n   - Reescritura de varias secciones del paper.\n   - Lectura de publicaciones relacionadas con REST Semantic Annotation\nTarea 3. Modelo de anotación híbrido\n.\nSeguimos analizando el código facilitado por el grupo CSAIL del MIT para ver si se puede adaptar al castellano.\nTarea 2.3\n\n- Lectura de documentación y búsqueda de información sobre proveedores Cloud privados\n- Amazon: servicios EC2 y S3.\n      - GoGrid: proveedor de IaaS.\n- Documentación sobre infraestructuras cloud.\n- Beca AWS para uso de recursos Amazon.\nTarea 1.4\n\nTarea 7.1\n\n- Heurísticas\n· Implementación de técnica para detección de duplicados en un dataset\n- RDF\n· Generación de RDF con URIs de dataset correspondiente\n- Interlink\n· Generación de links entre datasets GeoLinked Data y DBpedia/Geonames mediante SILK",
  "speaker": "SYSTEM",
  "uuid": "0c4f6698-3b7b-466f-af5b-a9d3bbc12608"
}