{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 13\n1. Ontology and the Lexicon\n13\none’s view of the world, one’s culture, one’s thought, one’s language, and the struc-\nture of cognitive processes. The Sapir-Whorf hypothesis or principle of linguistic\nrelativity, in its strongest form, states that language determines thought:\nWe dissect nature along lines laid down by our native languages. The categories and\ntypes that we isolate from the world of phenomena we do not ﬁnd there because\nthey stare every observer in the face; on the contrary, the world is presented in\na kaleidoscopic ﬂux of impressions which has to be organized by our minds—and\nthis means largely by the linguistic systems in our minds. We cut nature up, organize\nit into concepts, and ascribe signiﬁcances as we do, largely because we are parties\nto an agreement to organize it in this way—an agreement that holds throughout our\nspeech community and is codiﬁed in the patterns of our language. The agreement\nis, of course, an implicit and unstated one, but its terms are absolutely obligatory;\nwe cannot talk at all except by subscribing to the organization and classiﬁcation of\ndata which the agreement decrees. (Whorf 1940/1972)\nNo two languages are ever sufﬁciently similar to be considered as representing the\nsame social reality. The worlds in which different societies live are distinct worlds,\nnot merely the same world with different labels attached. (Sapir 1929/1964)\nThese quotations imply a pessimistic outlook for the enterprise of practical,\nlanguage-independent ontology (or even of translation between two languages,\nwhich as a distinct position is often associated with Quine (1960)); but conversely,\nthey imply a bright future for ontologies that are strongly based on a language, al-\nthough such ontologies would have to be limited to use within that language commu-\nnity. But taken literally, linguistic relativity is certainly not tenable; clearly, we can\nhave thoughts for which we have no words. The position is more usually advocated\nin a weaker form, in which language strongly inﬂuences worldview but does not\nwholly determine it. Even this is not broadly accepted; a recent critic, for example,\nis Pinker (1994), who states bluntly, “There is no scientiﬁc evidence that languages\ndramatically shape their speakers’ ways of thinking” (p. 58). Nonetheless, we need\nto watch out for the un-dramatic shaping.\nFrom a practical standpoint in ontology creation, however, while an overly\nlanguage-dependent or lexicon-dependent ontology might be avoided for all the rea-\nsons discussed above, there is still much in the nature of natural languages that can\nhelp the creation of ontologies: it might be a good strategy to adopt or adapt the\nworldview of a language into one’s ontology, or to merge the views of two differ-\nent languages. For example, languages offer a rich analysis in their views of the\nstructure of events and of space that can serve as the basis for ontologies; see, for\nexample, the work of Talmy (2000b), in analyzing and cataloguing these different\nkinds of views.\n",
  "speaker": "SYSTEM",
  "uuid": "0c9758bd-b656-469d-9eb2-492e2f06d0ea"
}