{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Charlas_2012 \n\nEsta página describe el calendario de charlas de miembros del grupo. En ellas los miembros del grupo de investigación darán una charla sobre alguna parte del trabajo que estén realizando.\nA partir del 25 de octubre de 2012, las charlas, salvo notificación contraria, se realizarán los\njueves de 10:30 a 12:00\n. En la primera media hora se realizará un\nstatus update\nde un minuto de cada uno de los miembros del grupo, y a continuación la persona que se haya comprometido a dar una charla realizará su presentación.\nDeberán asistir\nobligatoriamente\ntodos los doctorandos y las personas implicadas con dicha charla. La asistencia es voluntaria para el resto de miembros aunque recomendable, ya que saldrán de ellas habiendo adquirido nuevos conocimientos.\nUnas pequeñas reglas a tener en cuenta:\nEl ponente se encargará de enviar el lunes un correo a Ana para recordarla que tiene que reservar una sala para la reunión. Finalmente, en caso de que Ana no pueda reservar la sala a tiempo, la persona con quien hay que contactar es Mara (mara@fi.upm.es o extensión 7403) (Para este caso, es mejor también recurrir a un docente del Grupo, que ya sabemos cómo va al administración en la FI).\nEl ponente ha de estar unos minutos antes en la sala para ir abriéndola, preparando el ordenador, etc. Deberá ir con alguien al que le abran la sala, claro (cualquier docente o JARG valen).\nLas presentaciones se dividen en 30 minutos de presentación y 30 minutos de discusión. Una presentación no debería contener más de unas 30 transparencias.\nLas transparencias han de estar escritas en inglés y siguiendo el patrón del grupo. La charla se impartirá en inglés salvo causas de fuerza mayor.\nCharlas 2007\nCharlas 2008\nCharlas 2009\nCharlas 2010\nCharlas 2011\nCharlas 2012\nCalendar 2012\n\nDate\nPlace\nSpeaker\nTopic\nJanuary 12\nIrene Eleta (University of Maryland)\nShe'll speak about social tagging in online museums.[\nFurther information\n]\n[Presentation]\nJanuary 19\nH-1005\nJose Mora\nBrief summary of the work done during the visit at Oxford.\n[Presentation]\n.\nJanuary 26\nFebruary 2\nH-1003\nFreddy\nSPARQL to SQL Query Translation for R2RML (Note: would be perfect if we have a dedicated presentation of R2RML before, otherwise I will just give a brief overview of it)\nFebruary 9\nH-1002\nJean-Paul\nVisit at EPFL stuff (sensors as usual)\nFebruary 16\nH-1005\nSamuel Vieyra\nGenerating domain semantic annotation schemes using machine learning and  statistical techniques\nFebruary 23\nMarch 1\nMarch 8\nMarch 15\nRiccardo Albertoni\nResearch project and liaison with other OEG members and projects\nMarch 22\nMarch 29\nApril 5\nApril 12\nJorge Gracia\nArtificial Neural Networks applied to Ontology Matching\nApril 19\nH-1002\nMari Carmen Suárez de Figueroa\nReusing Domain Ontologies on the Basis of Decision Analysis (\nPresentation\n)\nApril 26\nMay 3\nMay 10\nH-1002\nKartik Asooja\nExploring semantic measures and their applications (MT, Plagiarism, Sentence Similarity)\nMay 17\nMay 24\nH-1005\nOlga/Andrés\nOlga:Short presentation on master thesis plans / Andrés:Characterising Emergent Semantics in Twitter Lists (Paper accepted at ESWC 2012)\nMay 31\nJune 7\nJune 14\nH-1005\nOscar Corcho\nWf4Ever\nJune 21\nH-1005\nVictor Rodríguez Doncel\nIntroduction in the OEG\n[Presentation]\nJune 28\nDavid Carral (Wright State University) - Master student of Pascal Hitzler\nPresentation of his MSc work and ESWC2012 paper\nJuly 5\nTo be announced\nMariano Rico\n[\nes.dbpedia.org\n] status and DBpedia SPARQL queries analysis\nJuly 12\nCoincide con summer school\nJuly 19\nSala de Grados (11:00)\nRafa (tesis)\nTesis doctoral\nJuly 24 (Tuesday)\nH-1003 - 11:00\nJosé Luis Ambite\nInformation Integration at ISI/USC\nSeptember 6\ncafetería (invito a café)\nOscar Corcho\nGeneral welcome to the new semester\nSeptember 13\nH-1002\nNitish Aggarwal\nDERI\nSeptember 27\nNandana Mihindukulasooriya\nApache Software Foundation\nOctober 4\nRiccardo Albertoni\nShort introduction/demo to SSONDE [\nPresentation\n]\nOctober 11\nOctober 18\n[Meeting Cercedilla]\nOctober 25\nH-1002\nJorge Gracia\nChallenges for the Multilingual Web of Data.\nI will motivate the problem of multilingualism on the Web of Data and identify several research questions around this problem. I will mention also the different research topics that are currently active in the group related to the multilingual Semantic Web.\nPresentation\nNovember 2\nH-1002 (10:30)\nJ.A.R.G.\nNuevas hojas de firmas y reporte de horas en UPM (\nPresentación\n)\nRecordatorio gestión (\nPresentación\n)\nNovember 8\nJean-Paul\nSPARQL RDF Streaming Query Benchmark [\npaper\n]\nNovember 15\nRafael González-Cabero\nWf4Ever Recommender Service\nNovember 22\nAftab Iqbal\nWork on Linked Data and Software Engineering\n[1]\nNovember 29\nDaniel Garijo\nScientific workflows abstraction (work done at ISI)\n[2]\nDecember 7\nDecember 13\nDecember 20\nIdafen Santana-Pérez\nThesis Proposal\nDecember 27",
  "speaker": "SYSTEM",
  "uuid": "0cb20e7d-4137-4bcd-ad1a-1759d9d07627"
}