{
  "message": "SYSTEM: D5.3.2.pdf: Página 13\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 13 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \nmany very similar activities exist that should be marked as synonyms of each other\") to \nwhich again solution proposals and arguments can be submitted.  \nAfter setting up the discussion project in Cicero, a call for participation in providing feedback about \nthe NeOn Glossary was sent to several mailing lists (including public-owl-dev, protege-owl, web-\nsemantica-ayuda, semweb-spain, sti, super, and soa4all). Furthermore, a story about this initiative \nwas published on the NeOn website5 and flyers with the call for participation were distributed at \nISWC 2008. For the future, it is planned to collect the feedback from the discussion project and use \nit for publishing an updated version of the glossary. \nHowever, this initiative has had no very success. It seems that the call for participation has been \nnot very productive. Reviewing the Cicero page, we realized that just a few people registered in the \npage and few people provided feedback on the current issues.  \n2.2. NeOn Glossary Version 2 \nIn this deliverable we introduce the NeOn Glossary that includes, as Figure 1 shows, the NeOn \nGlossary of Processes and Activities Version 2, as an important and independent subset that \nmakes use of the terminology defined in the NeOn Resource Glossary.  \n \nFigure 1. NeOn Glossary Composition \nThe NeOn Glossary of Process and Activities Version 2 includes all the definitions from the \nNeOn Glossary of Activities Version 1 [ 10] and a set of new or modified definitions. In summary, \nthe NeOn Glossary of Process and Activities Version 2 include 63 definitions.  \nThe following new or modified definitions were originated from the methodological work carried out \nin WP5, concretely from the top-down work done in D5.4.1 [ 11]. \n\u0001 Ontological Resource Reuse is defined as the process of using available ontological resources \n(ontologies, modules, statements, or ontology design patterns) in the solution of different \nproblems (e.g., the development of different ontology-based applications, the activity of \nontology aligning (as background knowledge), etc.).  \nWe can distinguish the following types of ontological resource reuse: ontology reuse, ontology \nmodule reuse, ontology statement reuse, and ontology design pattern reuse, as Figure 2 \nshows. \no Ontology Reuse is redefined as the process of using available ontologies in the solution \nof different problems.  \no Ontology Module Reuse is defined as the process of using available ontology modules \nin the solution of different problems.  \no Ontology Statement Reuse is defined as the process of using available ontology \nstatements in the solution of different problems. \n                                                \n5 http://www.neon-project.org/web-content/index.php?option=com_content&task=view&id=121&Itemid=1 \n",
  "speaker": "SYSTEM",
  "uuid": "0ce84649-11b2-4f15-a455-a67e96ca6242"
}