{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 36\nPage 36 of 124\nNeOn Integrated Project EU-IST-027595\nTopBraid Composer can also convert ﬂat ﬁles into ontologies. It transforms the ﬂat ﬁle columns into\nan ontology schema and the ﬂat ﬁle rows into instances of the ontology. It can also convert\nspreadsheets into ontologies.\nIts input resources are Excel spreadsheets.\nThis tool follows the\napproach to transforming resource schema into an ontology schema and the resource content\ninto instances of the ontology.\nThis tool produces one single ontology.\nThe ontology components generated are classes, at-\ntributes, relations, and instances. The resultant ontology is expressed in RDF/OWL (Full, DL or\nLite).\nTools for Transforming XML Files into Ontologies\nThe main tools are XSD2OWL and XML2RDF, and TopBraid Composer, described above. In the following\nsection we describe XSD2OWL and XML2RDF.\n• XSD2OWL and XML2RDF43 are tools that support the method for transforming XML ﬁles into ontolo-\ngies [GC05]. The input ﬁles are (1) an xml schema deﬁnition (XSD) ﬁle, which describes the xml\nschema; and (2) an xml ﬁle, which contains the xml instances.\nTools for Transforming Flat Files into Ontologies\nThe four main tools for transforming ﬂat ﬁles are TopBraid Composer, described above, ConvertToRdf, ﬂat2rdf\nand Java BibTeX-To-RDF converter. Next we describe the remaining three.\n• ConvertToRdf44 is a tool for automatically converting delimited text data into RDF via a simple\nmapping mechanism.\nThe input resources are delimited text ﬁles. This tool supports the approach to transforming resource\ncontent into instances of an existing ontology, performs a semi-automatic conversion and em-\nploys a formal speciﬁcation of the conversions between entities of the resource and the ontology.\nConvertToRdf contemplates syntactic transformation aspects, and how symbols are structured\nin the ﬁle and ontology formats. It also contemplates semantic transformation aspects, and the\nsemantic interpretation of the resource elements when deﬁning transformations to ontology elements.\nThe tool produces one single ontology. The resultant ontology instances are expressed in RDF\n• ﬂat2rdf45 is a simple Perl script that converts classic unix text database ﬁles into RDF.\nIts input resources are classic unix text ﬁles (e.g. /etc/passwd). This tool transforms the ﬂat ﬁle\ncontent into ontology instances. ﬂat2rdf performs a semi-automatic conversion and employs a\nformal speciﬁcation of the conversions between entities of the resource and the ontology. ﬂat2rdf\ncontemplates syntactic transformation aspects, and how symbols are structured in the ﬁle and\nontology formats.\nThe tool generates one single ontology. The resultant ontology instances are expressed in RDF.\n• Java BibTeX-To-RDF Converter46 allows converting BibTeX ﬁles to an RDF format according the\nSWRC ontology47.\nThe input resources are plain BiBTex ﬁles (i.e. text ﬁles). This tool transforms the text ﬁle content\ninto ontology instances and performs an automatic conversion. It employs an ad-hoc wrapper.\n43http://rhizomik.net/redefer/\n44http://www.mindswap.org/~mhgrove/convert/\n45http://simile.mit.edu/repository/RDFizers/flat2rdf/\n46http://www.aifb.uni-karlsruhe.de/WBS/pha/bib/index.html\n47http://ontoware.org/projects/swrc/\n",
  "speaker": "SYSTEM",
  "uuid": "0e2d80f9-f3fb-416e-87b5-9c5a3894a3c7"
}