{
  "message": "SYSTEM: D5.3.2.pdf: Página 11\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 11 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n2. NeOn Glossary of Process and Activities \nThe ontology network development process was defined in deliverable D5.3.1 [ 10] as the \nprocess by which user needs are translated into an ontology network. The main goal of the \nontology network development process is to identify and define which activities are carried out \nwhen ontology networks are collaboratively built. \nWithin the NeOn consortium, it was decided to build the NeOn Glossary of Activities for unifying \nthe terminology used by the NeOn partners. The idea was to achieve consensus on the \nidentification and definition of the activities involved in developing ontology networks.  \nThe consensus reaching process followed within the NeOn consortium for the identification and \ndefinition of the activities involved in the ontology network development process was presented in \n[ 10]. Such a work was conceived due to the lack of standardization in the Ontology Engineering \nterminology, which clearly contrasts with the Software Engineering field that boasts the IEEE \nStandard Glossary of Software Engineering Terminology. \nThus, the first step towards the standardization of the terminology used in the Ontology \nEngineering field was presented in [ 10,  12,  13]. Such a step lies in achieving consensus on the \ndefinitions for the activities involved in the development process for ontology networks, within the \nNeOn consortium, and building the NeOn Glossary of Activities. From our understanding, any \nstandardization agency such as ISO or W3C does not deal with the unification of Ontology \nEngineering terms. Only some ISO technical committees such as ISO/TC37/SC4 are working on \nthe contribution of the ontologies for unifying linguistic resources.  \nThe NeOn Glossary of Activities Version 1 presented in deliverable D5.3.1 [ 10] is exclusively \nfocused on the processes and activities involved in the ontology network development process, \nand it is published in the NeOn website1.  \nThus, our future aim is to standardize the NeOn Glossary of Activities, since the identification and \ndefinition of the activities involved in the development of ontology networks should be a result \nagreed within the Ontology Engineering field. The idea is to propose to standardization \ncommittees, such as the technical committee ISO/TC37, the standardization of the NeOn Glossary. \nTerminology standards help to avoid confusion by harmonizing terms, in our case activities \ninvolved in the development of ontology networks. The future standard NeOn Glossary of Activities \nis intended to serve as useful reference for those in the Ontology Engineering field and for those \nwho come into contact with ontologies. \nISO TC 37 (Terminology and other language resources) has set up a task force on ontologies to \nclarify the terminology of this area and to propose a strategy for TC 37 in this area. It is worth \nmentioning that we are being invited to participate in such task force. \nFor this reason, we decided to promote an initiative to obtain feedback from people outside NeOn \nproject in order to have richer definitions and a more complete glossary. Additionally, we decided \nto include other kinds of definitions and not only definitions for activities and processes. Thus, in \nSection  2.1, we explain the procedure for getting feedback about the NeOn Glossary Version 1 \nfrom the ontology engineering community, using the argumentation tool “Cicero” [ 3].  And in \nSection  2.2, we enhance the existing glossary with more activity/process definitions and with other \nkinds of definitions (data, metadata, etc.), which will be included in the NeOn Resource Glossary. \nThe NeOn Glossary will include the NeOn Glossary of Activities and the NeOn Resource Glossary.   \nAnother important issue with respect to the methodology for building ontology networks is to know \nthe technological support we have for the different activities and processes identified in the NeOn \n                                                \n1 http://www.neon-project.org/web-content/images/Publications/neonglossaryofactivities.pdf \n",
  "speaker": "SYSTEM",
  "uuid": "0e43c350-39a3-46ae-8955-59d754750d47"
}