{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Propuestas \n\n)\nEspañol (\nhttps://emilioserra.oeg-upm.net/inicio/9\nShort CV Maria S. Perez\nMaría S. Pérez received the PhD degree in Computer Science in 2003 and the Extraordinary PhD Award at the Universidad Politécnica de Madrid. She is Full Professor at the same University. She is part of the Board of Directors of BDVA and member of the Research and Innovation Advisory Group of the EuroHPC Joint Undertaking. Her research interest includes high performance and large-scale computing, storage, big data and application of AI techniques. She is co-author of 4 books, 7 book chapters and she has published more than 100 articles in international journals and conferences. She has been involved in the organization of many workshops and conferences, and she has edited several proceedings books and special issues. She regularly serves as a PC member of major conferences in the area of HPC, Big Data and Cloud Computing (SC, CCGRID, Cluster, etc.). She has participated in several international projects funded by the European Commission and supervised the doctoral thesis of 9 PhD students.\nShort CV de Ana\nAna Ibarrola has extensive experience in managing FP6 and FP7 projects. She was the OntoGrid project administrator since September 2004 until September 2007. At this moment she is the SemSorGrid4Env project administrator since September 2008.\nShort CV de Mari Carmen\nMari Carmen Suárez-Figueroa, PhD. (Female, H Index: 18) is Teaching Assistant at UPM and Senior Researcher at the Ontology Engineering Group (OEG). She got the PhD in Artificial Intelligence in UPM in June 2010 and received an Outstanding Award.\nHer main research activities are focused on Ontology Engineering and Linked Data. Particularly, her PhD thesis is about the NeOn Methodology.\nShe has participated in several European research projects (NeOn, SEEMP, OntoGrid, Knowledge Web, PIKON, Esperonto, and OntoWeb), and Spanish research projects (mIO! and BuscaMedia).\nShe is one of the editors of the book entitled \"Ontology Engineering in a Networked World\" published by Springer in 2012.\nShe co-organized the Terminology and Knowledge Engineering Conference (TKE 2012) and several workshops at different international conferences (ISWC, EKAW, and ESWC).\nShe has been research visitor at Department of Computer Science (University of Liverpool) in 2004, at KMi (Knowledge Media Institute - Open University) in 2007, and at IRIT (Institut de Recherche en Informatique de Toulouse) in 2012.\nSome relevant publications:\nM.C. Suárez-Figueroa, G. Aguado de Cea, A. Gómez-Pérez. Ligths and shadows in creating a glossary about ontology engineering. International Journal of Theoretical and Applied Issues in Specialized Communication. Editorial John Benjamins Publishing Company. ISSN: 0929-9971. 2013\nM. Fernández-López, A. Gómez-Pérez, M.C. Suárez-Figueroa. Methodological guidelines for reusing general ontologies. Data & Knowledge Engineering. Editorial Elsevier. ISSN: 0169-023X. July 2013\nM. C. Suárez-Figueroa, G. A. Atemezing, O. Corcho. The Landscape of Multimedia Ontologies in the Last Decade. Multimedia Tools and Applications. Print ISSN: 1380-7501; Online ISSN: 1573-7721.. DOI 10.1007/s11042-011-0905-z. Editorial Springer US. January 2013\nA. JIMÉNEZ, M. C. SUÁREZ-FIGUEROA, A. MATEOS, A. GÓMEZ-PÉREZ, M. FERNÁNDEZ-LÓPEZ. A MAUT APPROACH FOR REUSING DOMAIN ONTOLOGIES ON THE BASIS OF THE NeOn METHODOLOGY.   International Journal of Information Technology & Decision Making. Volume 12, Issue 05 (September 2013). DOI: 10.1142/S021962201340004X\nOLD VERSION:\nBA Mari Carmen Suárez-Figueroa (mcsuarez@fi.upm.es) belongs to the Ontological Engineering Group (\nhttp://www.oeg-upm.net/\n) of the Artificial Intelligence Department of the Computer Science School (\nhttp://www.fi.upm.es\n) at Universidad Politécnica de Madrid (UPM). She graduated in Computer Science from UPM in 2001. She was Associate Professor (January-March 2002) and she is Teaching Assistant from 1st September 2008 at the Computer Science School at UPM. She will get the PhD in Artificial Intelligence in UPM in June 2010.\nHer research activities include methodologies for ontology (network) development, ontology (network) development, ontology development tools, ontology evaluation, and the Semantic Web. She has participated or is currently participating at different European and national projects: OntoWeb (IST-2000-29243), Esperonto (IST-2001-34373), PIKON (IST-2001-33487), Knowledge Web (FP6-507482), OntoGrid (FP6-511513), REIMDOC (FIT-340100-2004-22), SEEMP (IST-4-027347-STP), NeOn (FP6-027595), mIO! (CENIT 2008-1019), and BuscaMedia (CENIT 2009-1026). She has been research visitor at Department of Computer Science (University of Liverpool) in 2004 and at KMi at the Open University in 2007.\nShe co-organized the EON 2006 Workshop at WWW’06, the KRRSW 2008 Workshop at ESWC 2008, the tutorial called “NeOn Methodology: how to build ontology networks?” at EKAW 2008, and the tutorial called “Ontology Engineering: the NeOn Methodology through the NeOn Toolkit” at ISWC 2009.\nShort CV Elena\nElena Montiel-Ponsoda is Lecturer of the Applied Linguistics Department at the Universidad Politécnica de Madrid, UPM, (2012) and member of the Ontology Engineering Group (2006). She holds a M.A. in Conference Interpreting and Translation (2000) by Universidad de Alicante, a B.A. in Technical Interpreting (2003) by Hochschule Magdeburg-Stendal, Germany, and a PhD on Applied Linguistics (2011) by UPM. Her research interests are at the intersection between translation (and terminology) and knowledge representation (ontologies, linked data), including amongst others: ontology localization and lexicalization, and lexico-syntactic patterns for ontology development. She has participated in several international and national projects in these areas (NeOn, ICPS, Monnet, BabeLData, etc.). Currently, she is participating in the European project LIDER. You can find more about Elena Montiel-Ponsoda on the OEG webpage.\nRelevant publications:\nOn the role of senses in the ontology-lexicon. P. Buitelaar, P. Cimiano, J. McCrae, E. Montiel-Ponsoda. In New Research Trends of Research in Ontologies and Lexical Resources, A. Oltramari, L. Qin, P. Vossen, E. Hovy (Eds.), Springer, 2013, pp. 43-61.\nChallenges for the Multilingual Web of Data. J. Gracia, E. Montiel-Ponsoda, P. Cimiano, A. Gómez-Pérez, P. Buitelaar, J. McCrae. In Journal of Web Semantics, Elsevier, 2011, pp. 63-71.\nInterchanging Lexical Resources on the Semantic Web. J. McCrae, G. Aguado-de-Cea, P. Buitelaar, P. Cimiano, T. Declerck, A. Gómez-Pérez, J. Gracia, L. Hollink, E. Montiel-Ponsoda, D. Spohr, T. Wunner. In Journal of Language Resources and Evaluation, 46, Issue 4, 2012, pp. 701-719.\nEnriching Ontologies with Multilingual Information. E. Montiel-Ponsoda, G. Aguado de Cea, A. Gómez-Pérez, W. Peters. En Journal of Natural Language Engineering, Cambridge, 17: 283-309, 2010.\nA Note on Ontology Localization. P. Cimiano, E. Montiel-Ponsoda, P. Buitelaar, M. Espinoza, A. Gómez-Pérez. En Journal of Applied Ontology, 5: 127-137, IOS Press, 2010.\nShort CV María Poveda",
  "speaker": "SYSTEM",
  "uuid": "0e5a7bd4-8329-4017-a183-2f835bcb2e57"
}