{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 99\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 99 of 124\nFigure 6.4: Enriched FlorTag moon\nwhite, sky, blue, clouds, water},\n• {moraine, alberta, banff, canada, lake, lac, rockies, scan},\n• {rising, sunlight, lake, quality, bravo}, {lake, nature, landscape, sunset,\nwater, organisms}\n• {lake, finland, suomi, beach, bubbles, blue, sunlight, kids, natural}\nNote that these tagsets contain the tags that remain after the lexical processing performed in the ﬁrst phase.\nFig. 6.5 shows the information contained in the automatically obtained FlorTag.\nFor the second phase of FLOR, Sense Deﬁnition and Semantic Expansion using WordNet, the available\nWordNet senses for Lake are considered. These are the following:\nWordNet 1: Lake→Body of water, Water→Thing→Entity\n(a body of (usually fresh) water surrounded by land)\nWordNet 2: Lake→Pigment→Coloring material→Material\n→Substance→Entity\n(a purplish red pigment prepared from lac or cochineal)\nWordNet 3: Lake→Pigment→Coloring material→Material\n→Substance→Entity\n(any of numerous bright translucent organic pigments)\nApplying the Wu and Palmer formula for the senses of lake and the senses of the rest of the tags in these\ntagsets we obtained variable similarities from 0 to 0.86. The zero similarities were obtained for location\nnames such as banf, pakistan, suomi and for generally unrelated tags such as quality, scan,\nsunlight, sunset. Interestingly, lake returned zero similarity for the tags glacier and mountain\nwhile they should be related. This is due to the fact that, in WordNet, Glacier and Mountain are hyponyms\nof Geological formation which is a hyponym of Natural object while Lake is a hyponym of Body of water\nwhich is a direct hyponym of Thing. Furthermore Glacier is a hyponym of Ice mass but there is no sub-\nsumption relation between Ice mass and Ice or Water that would allow for a connecting path between Lake\nand Glacier. This fact motivates further research on how to identify similarities between tags of a tagset\nbeyond the subsumption relations provided by WordNet.\nThe highest similarity, 0.86, for lake was obtained with the tag water, because Sense 1 of Lake is related\nto Body of water (Sense 2 of Water) with a direct hyponymy relation. Note that, in most of tagsets the ﬁrst\nsense of Water, Liquid, is selected as this is the most common sense in which the tag is used. Therefore,\nthis is a nice example of phase 2 identifying a non-trivial correlation.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "0ecc8375-7c0a-4885-b6d5-ec7c9c05e0f8"
}