{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Large-scale_data_integration \n\n- Beauty and the beast: The theory and practice of information integration. Laura Hass\n[3]\n- Data integration: The teenage years. Alon Y. Halevy\n[4]\n- Information Integration: Conceptual Modeling and Reasoning Support. Diego Calvanese, Giuseppe De Giacomo, Maurizio Lenzerini, Daniele Nardi, Riccardo Rosati.\n[5]\n- Three Decades of Data Integration: All Problems Solved? Patrick Ziegler and Klaus R. Dittrich\n[6]\n- Ontology-Based Integration of Information - A survey of Existing Approaches. H.Wache, T. Vogole\n[7]\nReview\nGaV and LaV approaches\n\n- Information integration using logical views. Jeffrey D. Ullman\n[8]\n- Data integration: A theorical Perspective. Maurizio Lenzerini\n[9]\n- Logic-based techniques in data integration. Alon Levy\n[10]\nQuery rewriting\n\n- Answering queries using views. Alon Y. Levy, Alberto O. Meldenzon.\n- Complexity of Answering Queries Using Materialized Views. Sergi Abiteboul, Oliver M. Dushka\n- Tractable query answering and rewriting under description logic constraints. Héctor Pérez-Urbina, Boris Motik, Ian Horrocks\n[11]\n- The Return of the Entity-Relationship Model: Ontological Query Answering. Andrea Cali, Georg Gottlob and Andreas Pieris.\n[12]\n- A general Datalog-based framework for tractable query answering over ontologies. A. Calì, G. Gottlob, and T. Lukasiewicz. Journal of Web Semantics, 2012.\n[13]\n- Logic Program Optimization. Tekle, K. Tuncay. State University of New York, 2007.\n[14]\nTechnologies (EII, EAI, ETL, CTF)\n\n- Semantic Data Integration for the Enterprise. An Oracle White Paper.\n[15]\n- Kossmann D. The state of the art in distributed query processing. ACM Computing Surveys 32(1) (2000) 422-469\n[16]\n- Quilitz B, Leser U. Querying distributed RDF data sources with SPARQL. ESWC2008:521-538\n[17]\n- Langegger A, WoB W, Blochl M. A semantic web middleware for virtual data integration on the Web. ESWC2008:493-507\nData Integration - Web 2.0 (Mashups) - Ontology\n\n- Dynamic Fusion of Web Data. Erhard Rahm, Andreas Thor...\n- Mashing Up Search Services. Daniele Braga, Stefano Ceri, David Martinenghi\n- Damia - A Data Mashup Fabric for Intranet Applications. Mehmet Altinel, Susan Cline.\n- An online Plataform for Web APIs and Service Mashups. Michael Maximilien, Ajith Ranabahu,...\n- Composing RESTful Services and Collaborative Workflows. Florian Rosenberg, Francisco Curbera, .....\n- Data Integration  Support for Mashups. Andreas Thor, David Aumueller\n- The RDF Book Mashups: From Web APIs to a Web of Data. Christian Bizer, Richard Cyganiak.\n- An Architecture for Dynamic Data Source Integration. Ian Gorton, Justin Almquist....\n- Dynamic Data Integration Using Web Services. Fujun Zhu, Mark Turner.\n- A flexible Integration Framework for Semantic Web 2.0 Applications. Eyal Oren, Armin Haller,...\n- Ontology-Based Integration of Information - A survey of Existing Approaches. H.Wache, T. Vogole\n[18]\nReview\n- SEWSIP: Semantica based Web services Integration in P2P. LI Juanzi XU Bin.\n- Undersatanding Mashup Development. Jin Yu, Boualem Benatallah...\n- SA-REST: Semantically Interoperable and Easier-to-Use and Mashups. Amit P. Sheth, Karthik Gomadam.\n- How Will We Interact with the Web of Data?. Tom Heath.\nSensor Networks Data Management\n\n- Data Management in the Worldwide Sensor Web - M. Balazinska, Amol Deshpande, Michael J. Franklin, Phillip B. Gibbons, Jim Gray, Suman Nath, Mark Hansen, Michael Liebhold, Alexander Szalay, Vincent Tao\n[19]\n- Data Management in the Worldwide Sensor Web Presentation -\n[20]\nSemantic Sensor Web\n\nSheth, A, C Henson, and S S Sahoo. “Semantic sensor web.” IEEE Internet Computing (2008): 78-83.\nPatni, H, C Henson, and A Sheth. “Linked sensor data.” In CTS, 362-370, 2010.\nCorcho, O, and R Garc’ia-Castro. “Five challenges for the Semantic Sensor Web.” Semantic Web 1, no. 1 (2010): 121-125.\nCalbimonte, Jean-Paul, Óscar Corcho, and Alasdair J. G. Gray. “Enabling Ontology-based Data Access to Streaming Data Sources.” In ISWC’10: Proceedings of the 9th International Semantic Web Conference, 2010.\nContinuous queries\n\nArasu, Arvind, Shivnath Babu, and Jennifer Widom. “The {CQL} continuous query language: semantic foundations and query execution.” The VLDB Journal 15, no. 2 (2006): 121-142.\nhttp://dx.doi.org/10.1007/s00778-004-0147-z\n.\nBarbieri, Davide Francesco, Daniele Braga, Stefano Ceri, Emanuele Della Valle, and Michael Grossniklaus. “{C-SPARQL}: A Continuous Query Language for {RDF} Data Streams.” In (IJSC), 3-25, 2010.\nReading list",
  "speaker": "SYSTEM",
  "uuid": "0f0696f8-6075-4247-9a1b-9a5741ba9122"
}