{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 52\n50\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nsmartphone integration in the longer‐term and encourage the use of embedded telematics.\nIncreased Use of Biometrics \nInitially, biometrics was a terminology that was familiar only in the medical field. However, the growing con‐\ncern for security has increased the adoption of biometric technologies among enterprises and governments.\nThis is one of the key drivers in the Global ASR Applications market because ASR applications are used along\nwith voice authentication applications. These applications are used to verify the authenticity of users using\ntheir voice patterns. A combination of these two applications helps to identify the authenticity of the voice\nsource along with interpreting and replying to the person. This ensures a high amount of accuracy and secu‐\nrity. In addition, the low cost of biometric devices has increased the demand in small and medium business‐\nes (SMBs). The use of ASR applications for attendance purposes is another major criterion which is increas‐\ning the demand for ASR applications across various enterprises. \nImproved Accuracy Levels \nCurrently, vendors have the capability to provide ASR applications with more than 90% accuracy. In addition\nto this, these applications have the ability to recognize various languages and generate speech‐based auto‐\nmated replies. Because of these features, enterprises are increasingly adopting ASR applications to improve\ntheir productivity and turnaround time. In addition, high accuracy levels of the ASR applications have sub‐\nstantially reduced the cost and time that is spent on customer care. Thus, the accuracy of the ASR applica‐\ntions in recognizing various languages and vocabularies has increased demand among small and large enter‐\nprises that are seeking such applications to optimize their processes. \nCustomer Care in many languages\nIn a competitive environment, it has become imperative for enterprises to differentiate their marketing\nactivities with better customer care services. Thus, to achieve product differentiation, vendors have\nincreased the capability of the ASR applications to support various languages. This language‐specific cus‐\ntomization has helped enterprises improve customer satisfaction levels.\nConsumer‐focused applications can support Speech awareness: Speech interfaces on products such as\nmobile phones (e.g. Siri) and within vehicles will lead end users to the potential capabilities of Speech. Due\nto Consumerisation of the workplace, we will also see employees expecting enterprises to offer similar capa‐\nbilities to help them undertake their work tasks  \nGrowing markets in speech recognition can anchor growth for LT and benefit from LT enhancement: Speech\nleads to IC (recognizing contexts and concepts), applications such as call routing also include analytics, nat‐\nural language processing and semantics.\nSpeech Technology Challenges\nInability to Suppress Ambient Noise \nOne of the main challenges is the inability of speech recognition applications to suppress ambient noise.\nSpeech recognition applications are highly sound sensitive and hence any ambient noise reduces their accu‐\nracy levels. Although the Speech Recognition industry has witnessed several technological advancements,\nthe issue of high sensitivity to noise still remains a barrier to the adoption of automatic speech recognition\napplications. \nDespite the technological advancements in the Speech Recognition industry, ASR applications are highly sen‐\n",
  "speaker": "SYSTEM",
  "uuid": "0fb43dd8-e671-4ddd-a533-7d6dc282b463"
}