{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 7\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n7\nThe \u001crst step is the Simple Service Discovery Protocol (SSDP)-based discov-\nery stage. When a new device is added to the network, it announces itself using\na SSDP multicast message. The UPnP Remote Extension component proxies\nthese SSDP messages to all the remote homes connected, together with all the\nreply messages sent to a particular UPnP device. Therefore the UPnP Remote\nExtension component hides all the complexity of remote device discovery, al-\nlowing any Media Server or Renderer to be discovered as if it were in the same\nhome.\nOnce a device has been discovered, action methods like browsing or searching\n(for Media Servers) can be invoked, and events can be received. The UPnP\nRemote Extension also proxies these methods using the standard UPnP control\nprotocol (SOAP over HTTP), and includes a component that keeps track of the\ndevices connected from a remote home to be able to send them noti\u001ccations\nwhen a remote home is disconnected.\nTherefore, in summary, the UPnP Remote Extension implementation makes\nit completely transparent for devices whether they are in the local or remote\nhome.\n4\nGlobal Identi\u001ccation and Location for UPnP-enabled\nMultimedia Resources\nIn this section we propose a uni\u001ced framework for the identi\u001ccation, location\nand retrieval of the multimedia resources that will be shared across homes, which\ngoes beyond the local identi\u001ccation that is proposed in the context of the original\nUPnP protocol.\nThe standard UPnP protocol proposes the use of URIs for the identi\u001ccation of\nresources available in UPnP-enabled devices, and for the identi\u001ccation of actions\nthat can be invoked on those resources. However, these URIs are addressed from\na local network, and are not directly accessible from outside. In fact, when an\nUPnP server is asked for a URI, it returns the physical address of the resource\nwith a local IP address.\nOur resource identi\u001ccation proposal is based on the virtualization of resources\navailable across homes by means of the use of global Uniform Resource Identi\u001cers\n(URIs). We propose to modify the existing URI scheme so that resources\ncan be identi\u001ced globally and located from outside the local network, providing\nglobal unique identi\u001cers that are independent of UPnP sessions and homes. This\nwill facilitate the delivery and management of these resources, together with\nthe linking and publication of their corresponding metadata according to the\nLinked Data principles, when describing them with ontology-based annotations\nand tags.\nThe local URIs assigned to resources inside a home network are modi\u001ced by\nthe Home Gateways for every resource request or response that gets out of the\nlocal network. This modi\u001ccation consists in the inclusion of a prologue to the\noriginal URI with the Home Gateway public IP address and the port where it\nis listening, and a string that indicates the type of message that is being sent\n",
  "speaker": "SYSTEM",
  "uuid": "0fb611f2-fb17-436c-832f-02c7430e32ab"
}