{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD09-10 \n\nHere we include information for the students of the \"Master de Investigación en Inteligencia Artificial\" and of the European Master on Computational Logic.\nContents\n[\nhide\n]\n1\nExam\n2\nGroups\n3\nObjectives\n4\nOntology assignment\n5\nSchedule and Material\n6\nResearch topics\n7\nJob offers\nExam\n\nJune 30th\n, 23:59 CET, is the deadline to send the ontology and its documentation (explaining in detail the process followed) for those students that did not pass the february exam.\nStudent list\nOnly accessible by lecturers\nGroups\n\nArturo Bajuelos Castillo, Victor Marrero Baute\nVishal Dilip Gangwani Meerwani, Miguel García-Serrano González\nMiguel Lou Moreno, Pablo Gómez Esteban\nDiego Gonzalez Rodriguez, Raziel Valle Miranda\nSantiago Márquez Solís\nFarid Fleifel\nRaúl Domínguez García-Escudero, Silvio Tschapke\nAlvaro Fernández Díaz, Ghislain Atemezing\nDavid Moreno Navas, Gonzalo Gutiérrez Martín\nAlexander de León, Sinan Egilmez\nDaniel Garijo Verdejo, Esther Núñez Vidal\nPaula Cordero Moreno, Héctor José Pichardo Ortiz\nObjectives\n\nDescription\nand\nIntroduction\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation will be done on the basis of: weekly work and participation in discussion (15%), Build an ontology  (55%) and research work (30%)\nSend your hands-on to the following email\nmasterr09@delicias.dia.fi.upm.es\nOntology assignment\n\nSome people have requested additional information about the ontology assignment that will be used to obtain the 55% of the final qualification. These are the details of this assignment: Each group will have to select a domain on which they can build a network of domain ontologies. They have to show how they can apply a methodological approach to build this network of ontologies, justifying adequately aspects like planning, requirement specifications, non-ontological resources reused, conceptualisation and evaluation. The network of ontologies should be of approximately 40-50 concepts and 10 properties. They have to implement them in OWL, using a mix of atomic, primitive and defined classes, and showing how they can exploit inferences. This will have to presented by the end of the semester.\nSchedule and Material",
  "speaker": "SYSTEM",
  "uuid": "108779ed-925a-4cc1-a7d6-3afd120acc9e"
}