{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 109\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 109 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n17. E.J. Byrne. A conceptual foundation for software re-engineering. In Proceedings of the \nInternational Conference on Software Maintenance and Reengineering, pages 226–235. IEEE \nComputer Society, 1992. \n18. A. Cockburn, L. Williams. The Costs and Benefits of Pair Programming (2000). Proceedings of \nthe First International Conference on Extreme Programming and Flexible Processes in \nSoftware Engineering (XP 2000). \n19. A. M. Davis, E. H. Bersoff, E. R. Comer. A Strategy for Comparing Alternative Software \nDevelopment Life Cycle Models. IEEE Transactions on Software Engineering 14-10. 1453-\n1461. 1988. \n20. Y. Ding, D. Fensel. Ontology library systems: The key to successful ontology reuse. In \nProceedings of SWWS'01, The first Semantic Web Working Symposium, pages 93-112, \nStanford University, California, USA, July 30 - August 1. 2001. \n21. M. Engler, D. Vrandecic, Y. Sure. A Tool for DILIGENT Argumentation: Experiences, \nRequirements and Design. In Robert Tolksdorf and Elena Paslaru Bontas and Klaus Schild, 1st \nInternational Workshop on Semantic Technologies in Collaborative Applications STICA 06. \nIEEE, IEEE, Manchester, UK, June 2006. \n22. S. Farrar, W. Lewis, T. Langendoen. A Common Ontology for Linguistic Concepts. In \nProceedings of the Knowledge Technologies Conference, Seattle, Washington, March 10-13, \n2002. \n23. M. Fernández-López, A. Gómez-Pérez. Overview and Analysis of Methodologies for Building \nOntologies. Knowledge Engineering Review (KER). Vol. 17, Nº 2, pp 129-156. 2002. \n24. M. Fernández-López, A. Gómez-Pérez. Searching for a Time Ontology for Semantic Web \nApplications. International Conference on Formal Ontology in Information Systems, Turín, \n2004. \n25. M. Fernández-López, A. Gómez-Pérez, M. D. Rojas-Amaya. Ontologies' crossed life cycles. In: \nDieng R, Corby O (eds) 12th International Conference in Knowledge Engineering and \nKnowledge Management (EKAW 2000). Juan-Les-Pins, France. (Lecture Notes in Artificial \nIntelligence LNAI 1937) Springer-Verlag, Berlin, Germany, pp 65–79. \n26. M. Fernández-López, A. Gómez-Pérez, N. Juristo. METHONTOLOGY: From Ontological Art \nTowards Ontological Engineering. 1997. Spring Symposium on Ontological Engineering of \nAAAI. Stanford University, California, pp 33–40. \n27. A. Gangemi, N. Guarino, C. Masolo, A. Oltramari, L. Schneider. Sweetening Ontologies with \nDOLCE. In Proceedings of Knowledge Engineering and Knowledge Management. Ontologies \nand the Semantic Web, 13th International Conference, EKAW 2002, Siguenza, Spain, October \n1-4, 2002. Lecture Notes in Computer Science 2473 Springer 2002, ISBN 3-540-44268-5. \n28. R. García-Castro, M. C. Suárez-Figueroa, A. Gómez-Pérez, D. Maynard, S. Costache, R. \nPalma, J. Euzenat, F. Lécué, A. Léger, T. Vitvar, M. Zaremba, D. Zyskowski, M. Kaczmarek, \nM. Dzbor, J. Hartmann, S. Dasiopoulou. Knowledge Web. Deliverable 1.2.4. Architecture of the \nSemantic Web Framework. February 2007. Available at: http://knowledgeweb.semanticweb.org/. \n29. N. Gessa, M. Busanelli, P. De Sabbata, F. Vitali. Extracting a semantic view from an ebusiness \nvocabulary. 8th IEEE International Conference on E-Commerce Technology (CEC 2006) and \n3rd IEEE International Conference on Enterprise Computing, E-Commerce, and E-Services \n(EEE 2006). 26-29 June 2006, Palo Alto, California. \n",
  "speaker": "SYSTEM",
  "uuid": "10bcd20e-1f64-40df-b1ea-7a8e69ea0c6c"
}