{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 4\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13912\nDISPONGO:\nArtículo 1.  Objeto.\nEl presente Real Decreto tiene por objeto regular la organización de los estudios de \ndoctorado correspondientes al tercer ciclo de las enseñanzas universitarias oficiales \nconducentes a la obtención del Título de Doctor o Doctora, que tendrá carácter oficial y \nvalidez en todo el territorio nacional.\nArtículo 2.  Definiciones.\n1.  Se entiende por doctorado el tercer ciclo de estudios universitarios oficiales, \nconducente a la adquisición de las competencias y habilidades relacionadas con la \ninvestigación científica de calidad.\n2.  Se denomina programa de doctorado a un conjunto de actividades conducentes a \nla adquisición de las competencias y habilidades necesarias para la obtención del título de \nDoctor. Dicho programa tendrá por objeto el desarrollo de los distintos aspectos formativos \ndel doctorando y establecerá los procedimientos y líneas de investigación para el desarrollo \nde tesis doctorales.\n3.  Tiene la consideración de doctorando quien, previa acreditación de los requisitos \nestablecidos en el presente real decreto, ha sido admitido a un programa de doctorado y \nse ha matriculado en el mismo.\n4.  Se entiende por Escuela de Doctorado la unidad creada por una o varias \nuniversidades y en posible colaboración con otros organismos, centros, instituciones y \nentidades con actividades de I+D+i, nacionales o extranjeras, que tiene por objeto \nfundamental la organización dentro de su ámbito de gestión del doctorado, en una o varias \nramas de conocimiento o con carácter interdisciplinar.\n5.  Se entiende por documento de actividades del doctorando el registro individualizado \nde control de dichas actividades, materializado en el correspondiente soporte, que será \nregularmente revisado por el tutor y el director de tesis y evaluado por la comisión \nacadémica responsable del programa de doctorado a que se refiere el artículo 8.3.\n6.  El Director de tesis es el máximo responsable en la conducción del conjunto de las \ntareas de investigación del doctorando, en los términos previstos en el artículo 12 de esta \nnorma.\n7.  El tutor es el responsable de la adecuación de la formación y de la actividad \ninvestigadora a los principios de los programas y, en su caso, de las Escuelas de \ndoctorado.\n8.  La comisión académica de cada programa es la responsable de su definición, \nactualización, calidad y coordinación, así como del progreso de la investigación y de la \nformación y de la autorización de la presentación de tesis de cada doctorando del \nprograma.\nArtículo 3.  Estructura.\n1.  Los estudios de doctorado se organizarán a través de programas, en la forma que \ndeterminen los estatutos de las universidades y de acuerdo con los criterios establecidos \nen el presente real decreto. Dichos estudios finalizarán en todo caso con la elaboración y \ndefensa de una tesis doctoral que incorpore resultados originales de investigación.\n2.  La duración de los estudios de doctorado será de un máximo de tres años, a \ntiempo completo, a contar desde la admisión del doctorando al programa hasta la \npresentación de la tesis doctoral.\nNo obstante lo anterior, y previa autorización de la comisión académica responsable \ndel programa, podrán realizarse estudios de doctorado a tiempo parcial. En este caso tales \nestudios podrán tener una duración máxima de cinco años desde la admisión al programa \nhasta la presentación de la tesis doctoral.\nSi transcurrido el citado plazo de tres años no se hubiera presentado la solicitud de \ndepósito de la tesis, la comisión responsable del programa podrá autorizar la prórroga de \ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "10df7aca-0f8e-44fd-8366-390cbe961a52"
}