{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 24\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97749\nArtículo 36.  Evaluación e informe de las memorias de seguimiento de las ayudas.\n1.  Las memorias de seguimiento de las ayudas, serán examinadas por una Comisión \nde Evaluación constituida conforme a lo dispuesto en el artículo 31 de la presente \nconvocatoria. El informe de evaluación se efectuará teniendo en cuenta el aprovechamiento \nen los estudios, el proceso de desarrollo de la tesis y las actividades de formación \ninvestigadora y del informe del director.\n2.  La Comisión de evaluación podrá recabar información adicional, que podrá ser \nrequerida a la universidad, al organismo, al departamento, al director de tesis y al propio \ndoctorando, si considerara que la aportada con la documentación no contiene las \ncondiciones necesarias para formular el informe favorable.\n3.  A la vista de la evaluación, la Comisión de selección, constituida conforme a lo \ndispuesto en el artículo 32.5, elaborará la correspondiente propuesta favorable o \ndesfavorable. En el caso de informes desfavorables, se iniciará expediente informativo por si \nse derivaran incumplimientos, en cuyo caso sería de aplicación lo indicado en el artículo 19 \nde esta convocatoria.\nArtículo 37.  Resolución.\nLa Secretaría General de Universidades delega en la Dirección General de Política \nUniversitaria la resolución que proceda en cada caso, sobre la aplicación de los \nincumplimientos previstos en el artículo 19 como consecuencia de los informes de \nevaluación desfavorables.\nCAPÍTULO V\nEstancias breves en España y en el extranjero\nLos beneficiarios de ayudas en régimen de beca o de contrato en prácticas, podrán \noptar a recibir ayudas complementarias para estancias breves en España y en el extranjero \ndurante el ejercicio 2010, que se concederán y abonarán de acuerdo con los requisitos \nque se establecen en este apartado.\nArtículo 38.  Objeto de las estancias breves.\n1.  Las ayudas para estancias breves tendrán por objeto reforzar directamente al \nprograma formativo e impulsar el desarrollo de su tesis. Las actividades a realizar durante \nla estancia ya sean en laboratorios de investigación, para consulta de fondos bibliográficos \no documentales de índole diversa, el aprendizaje de nuevas técnicas instrumentales y \notros trabajos de campo, deben considerarse significativas y beneficiosas para el \ncumplimiento de los fines de las ayudas concedidas. Quedan expresamente excluidas las \nactividades ordinarias que exija el programa de formación de posgrado y el normal \ndesarrollo de la tesis.\n2.  Las ayudas se aplicarán a estancias en España y en el extranjero, en centros de \ndestino que estén ubicados en una localidad distinta a la del centro de adscripción de la \nbeca y que implique cambio de residencia respecto del domicilio habitual y sea diferente a \nla residencia familiar.\nArtículo 39.  Características de las estancias y fechas de inicio.\n1.  Las estancias susceptibles de recibir esta ayuda tendrán una duración mínima de \ndos meses y máxima de cuatro, debiendo coincidir, salvo excepciones justificadas, con los \nperíodos académicos y/o los de actividad ordinaria de los centros de destino. \nExcepcionalmente se podrán conceder estancias de un mes cuando el destino sea en \nEspaña y la finalidad de la misma quede suficientemente justificada.\n2.  El importe de la ayuda, como complemento de la dotación mensual como becario \nserá de 25 € por día de estancia en España y de hasta 50 € por día de estancia en el \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "1102e801-c9e2-4c38-ac74-f4d9486dec38"
}