{
  "message": "SYSTEM: Curriculum_abreviado_CVA_Proyectos_2016.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nde la web de datos enlazados (linked data) de acuerdo al modelo de datos de lemon-\nontolex, estándar de facto en la representación de recursos lingüísticos en la web de datos, \ndel que es coautora.   \n \nHa participado en proyectos europeos y nacionales clave en estas áreas (como, por \nejemplo, NeOn-Lifecycle Support for Networked Ontologies, Monnet-Multilingual Ontologies \nfor Networked Knowledge, BabeLData-Multilingüismo en Ontologías y Linked Data, o \nLIDER- Linked Data as an enabler of cross-media and multilingual content analytics for \nenterprises across Europe), así como privados (el proyecto International Classification of \nPatient Safety, financiado por la Organización Mundial de la Salud ; Generación de datos \nenlazados a partir del catálogo bibliográfico y de autoridades, de la Biblioteca Nacional de \nEspaña, o Propuesta de asesoramiento para el desarrollo de un prototipo de datos \nenlazados lingüísticos para K Dictionaries y Semantic Web Company).  \n \nHa publicado el libro “Multilingualism in Ontologies. Building Patterns and Representation \nModels”, y artículos en revistas, conferencias y workshops internacionales y nacionales en \nlas áreas de investigación de Web Semántica, Procesamiento de Lenguaje Natural, \nTerminología y Traducción. También ha coeditado actas de workshops y conferencias, y \nrecientemente ha participado en la coedición de un número especial de la revista JAIR-\nJournal of Artificial Intelligence Research sobre algoritmos y aplicaciones multilingües.   \n \nHa realizado estancias de investigación pre-doctoral en Inglaterra (Natural Language \nProcessing \nGroup \nde \nla \nUniversity \nof \nSheffield) \ny \nAlemania \n(DFKI-Deutsches \nForschungszentrum für Künstliche Intelligenz GmbH) y post-doctorales también en Alemania \n(Semantic Computing Group de la Universität Bielefeld).  \n \nHa organizado workshops y paneles en conferencias de Web Semántica y Procesamiento \nde Lenguaje Natural, tales como la 1ª y 2ª edición del \"Workshop on the Multilingual \nSemantic Web\", organizados en el marco de las conferencias WWW2010 e ISWC2011; la \nconferencia TKE2012 – \"Terminology and Knowledge Engineering\"; el \"Multilingual Web \nWorkshop 2014\"; el panel \"Natural Language Processing\" en la ESWC2014, el workshop \n\"Use of Multilingual Language Resources in Knowledge Representation Systems\" en el \nmarco del \"XX European Symposium on Languages for Specific Purposes\"; y la 3ª y 5ª \nedición del \"Workshop in Linguistic Linked Data\", organizado en el marco de la conferencia \nLREC2014 y LREC2016. También ha impartido tutoriales en las mismas áreas, como \n\"Enriching the Semantic Web with Linguistic Information\" en ESWC2014 o \"Representación, \ndescubrimiento y explotación de datos lingüísticos enlazados\" en CAEPIA 2015.  \n \nParticipa activamente en las actividades de estandarización de los grupos Ontolex \n(Ontology-Lexica Community Group) y BMLOD (Best Practices for Multilingual Linked Open \nData) del W3C. También cabe destacar que ha sido invitada al seminario de perspectivas \nDagstuhl sobre la Web Semántica Multilingüe en septiembre de 2012, y a dar charlas \ninvitadas en conferencias (Vocabulary Day -DCMI 2013) e instituciones académicas (en \nSeminario de Traducción e Interpretación organizado por la Hochschule Magdeburg-Stendal \ny en las I Jornadas Científicas CES Felipe II, por la Universidad Complutense de Madrid). \n \nFinalmente, mencionar que participa asiduamente en los comités de programas de \nconferencias y workshops tanto internacionales como nacionales (ESWC, ISWC, COLING, \nEKAW, AESLA, TIA, Workshop on Linked Data in Linguistics), y como revisora en relevantes \nrevistas del área (JWS-Journal of Web Semantics, LREV-Lexical Resources and Evaluation, \nIBÉRICA, Journal on Data Semantics, IJAIT-International Journal on Artificial Intelligence \nTools, JAIR-Journal of Artificial Intelligence Research).   \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \nBosque-Gil, J., Gracia, J., Aguado-de-Cea, G., Montiel-Ponsoda, E. (2015). Applying the \nOntoLex Model to a Multilingual Terminological Resource. En Gandon, F., Guéret, Ch., \n",
  "speaker": "SYSTEM",
  "uuid": "11591de3-99cb-40eb-aa90-7a6a5a18725b"
}