{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 14\nPage 14 of 111 \nNeOn Integrated Project EU-IST-027595 \nactivities from those included in the NeOn Glossary of Activities are mandatory and which \nare optional.  \n A proposal that includes different ontology network life cycle models.  \n Guidelines for obtaining the ontology network life cycle for a concrete ontology network; the \nontology network life cycle is the specific sequence of activities needed for developing a \nconcrete ontology network following a concrete ontology network life cycle model.  \n Preliminary evaluation results of the notions presented in this document within the three \nNeOn use cases. \n1.4. Deliverable Structure \nThe deliverable is structured as follows: \n Chapter 2 deals with the state of the art of the development process and life cycle models in \ndifferent fields (Software Engineering, Knowledge Engineering and Ontology Engineering). \n Chapter 3 presents the definition of the ontology network development process in NeOn. This \nchapter also includes the following results: \n¾ The NeOn Glossary of Activities, which identifies and defines the activities involved in \nontology network construction. Definitions in the glossary have been collaboratively built \nand consensuated by all NeOn partners; the process followed to reach consensus for \nbuilding the NeOn Glossary of Activities is also included.  \n¾ A classification of the activities into those that are required for the development of \nontology networks and those that are applicable (depending on the cases), but not \nrequired, and, therefore, they are non-essential or dispensable. \n Chapter 4 deals with the identification and definition of 8 scenarios for building ontology \nnetworks collaboratively with special emphasis in reuse, reengineering and merging. \n Chapter 5 provides the definition of several ontology network life cycle models according to \nthose defined in the Software Engineering field; it also provides guidelines for obtaining the \nconcrete life cycle for an ontology network. \n Chapter 6 describes the ontology network life cycle for the three NeOn use cases (fisheries, \ninvoicing and nomenclator). \n Chapter 7 presents the conclusions and future work. \nDefining the NeOn methodology (which includes methods, techniques and tools for the activities \nidentified and defined in the NeOn Glossary of Activities) is out of the scope of this document, it will \nbe presented in deliverable D5.4.1 (NeOn methodology for building contextualized networked \nontologies) at M24. \nThorough evaluations of the different ontology network life cycle models proposed in this \ndeliverable will be carried out within task T5.6 (Evaluation of the NeOn methodologies) and \nincluded in deliverable D5.6.1 (Experimentation with NeOn methodologies). \n \n",
  "speaker": "SYSTEM",
  "uuid": "11a7cfcd-21e6-4ec0-b865-9f9a1663221d"
}