{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 10\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n10 \nEjercicio 8: Cesáreas \n \nSe desea modelizar el conocimiento de un experto ginecólogo en cesáreas. Se sabe que existen dos tipos \nde cesáreas: las previstas de antemano y las improvisadas durante el parto. \n \nLas cesáreas previstas de antemano se producen cuando se dan alguna de las siguientes circunstancias: \n \n• \nEl bebé  está en posición podálica \n• \nLa futura madre padece durante el embarazo alguna de las dos enfermedades siguientes: gestosisi o \ndiabetes gravídica. \n• \nLa placenta está en posición previa-central. \n• \nLa madre tiene problemas de corazón, renales o graves infecciones en vías genitales. \n \nEn otros casos, la cesárea se improvisa durante el parto. Se produce cuando: \n \n• \nLa cabeza del niño es demasiado grande y no cabe por el canal del parto. \n• \nLa cabeza del niño no está encajada correctamente en el canal del parto \n• \nExiste sufrimiento fetal. Lo cual significa que el ritmo cardiaco del bebé ya no es regular o que \nempieza a expulsar mecónio. \n• \nLa placenta se despendre. \n \nExisten tres tipos de incisión. Si la cesárea no está programada y la placenta se ha desprendido, se realiza \nuna incisión Umbílico púbica. En el resto de los casos se realiza una cesárea del tipo transversal baja o de \nJoel Coell. Se posee la siguiente información sobre cada tipo de incisión: \n \n• \nUmbílico púbica. Es vertical, empieza debajo del ombligo y termina en el pubis. La cicatriz es visible \ny grande. \n• \nTransversal baja. Es horizontal, la cicatriz no es visible. \n• \nDe Joel Coell. Es horizontal, pero se practica un centímetro debajo de la transversal baja. \n \nCon independencia del tipo de incisión que se realice, las fases de la intervención siempre suceden de la \nmisma forma y en el siguiente orden: Cortar, extraer al niño, extraer la placenta, y suturar la herida. \n \nEl objetivo de este ejercicio es representar tanto conocimiento como sea posible en cada uno de los \nsiguientes formalismos, para emitir un juicio de qué formalismos son los más adecuados: \n \na) Realizar un Sistema de Producción \na.1) \nRepresentar el conjunto de reglas que permita determinar el tipo de cesárea y el tipo de incisión \nque se realizar \na.2) \nUsando encadenamiento hacía delante, probar el sistema con un ejemplo. \n",
  "speaker": "SYSTEM",
  "uuid": "11e654c5-029b-4ff2-ad54-8181c39168eb"
}