{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 82\n80\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nMarket Force\nAssumption\nImpact\nTime\nFrame\nAccelerator/\nInhibitor/\nNeutral\nCertainty of\nAssumption\nMacroeconomics\nEconomic situation\nThere is a strong correlation between the economy\nand IT expenditures. The global economy situation is\nimpacting IT budgets, business and consumer confi-\ndence, the availability of credit and private invest-\nment, and internal funding.\nHigh\nShort-term\nInhibitor\n\n \nGlobal megatrends\nMobile\nSpending on mobile devices will grow 23%, driving\n43% of IT growth; a mobile strategy is priority num-\nber one for all industry players in 2012. Consumers\nare interested in personalised services which could\nbe enabled through LT technologies.\nHigh\nMedium-\nterm\nAccelerator\n\n\nCloud Computing\nCloud as a new paradigm of computing that is\nreshaping IT will help to evolve translation technolo-\ngies. The key advantage to cloud services should be\nthe ability of IT organizations to shift IT resources\nfrom maintenance to new initiatives. IDC estimates\nthat cloud services (public cloud) increased 34% in\n2010 to nearly $22 billion, or about 1.6% of IT spend-\ning, and that percentage should increase to 3% by\n2014.\nHigh\nMedium-\nterm\nAccelerator\n\n\nE-commerce\nAccording to Eurobarometer surveys, the cross-bor-\nder potential of EU retail e-commerce is not being\nrealised; 51% of EU27 retailers sell via the internet,\nbut only 10% support cross-border transactions.\nTranslation technologies are the key enable technol-\nogy to enable cross-border transactions.\nHigh\nShort-term\nAccelerator\n\n\nSocial Media\nSocial media networks (such as Facebook or Twitter)\nand social business initiatives yields social data,\nwhere customer, partners and employees conversa-\ntions create an insight-rich goldmine for businesses.\nNew unstructured data (in the form of text, audio and\nvideo) analysis are required to generate profound\ninsights.\nHigh\nMedium-\nterm\nAccelerator\n\n\nBig Data\nThe data growth is pushing the need for storage,\nanalysis and big data technologies. The latter has\nintersection with LT technologies and its growth will\npush new developments and  revenues for Lt ven-\ndors.\nHigh\nMedium-\nterm\nAccelerator\n\n\nOpen Source\nOpen source has already had a major impact on\nmachine translation. There are mature and actively\nused open source platforms for all types of machine\ntranslation such as Apertium or Moses.\nHigh\nMedium-\nterm\nAccelerator\n\n\nInternationalization\nand globalization \nHigh\nShort-term\nAccelerator\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "11f7fa98-865f-4d6b-9b82-6ddc253328e7"
}