{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 2\n2\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\n1.1 Introduction\n1.1.1 Motivation\nThe Entity-Relationship (ER) model is a fundamental formalism for conceptual\nmodeling in database design; it was introduced by Chen in his milestone paper [3],\nand it is now widely used, being ﬂexible and easily understood by practitioners. With\nthe rise of the Semantic Web, conceptual modeling formalisms have gained impor-\ntance again as ontology formalisms, in the Semantic Web parlance. Ontologies and\nconceptual models are aimed at representing, rather than the structure of data, the\ndomain of interest, that is, the fragment of the real world that is being represented\nby the data and the schema. A prominent formalism for modeling ontologies are de-\nscription logics (DLs) [4], which are decidable fragments of ﬁrst-order logic, partic-\nularly suitable for ontological modeling and querying. In particular, DL ontologies\nare sets of assertions describing sets of objects and (usually binary) relations among\nsuch sets, exactly in the same fashion as the ER model.\nRecently, research on DLs has been focusing on the problem of answering\nqueries under ontologies, that is, given a query q, an instance B, and an ontology\nK , answering q under B and K amounts to compute the answers that are logically\nentailed from B by using the assertions of K . In this context, where data size is\nusually large, a central issue the data complexity of query answering, i.e., the com-\nputational complexity with respect to the data set B only, while the ontology K and\nthe query q are ﬁxed.\nFor this reason the tractable DL-Lite family [5, 6], for instance, has become a\nprominent family of DL languages. More precisely, DL-Lite languages are ﬁrst-\norder rewritable, i.e., for every conjunctive query q, for every initial instance B,\nand for every DL-Lite knowledge base K , it is possible to construct a ﬁrst-order\nquery qK (which, in particular, is a union of conjunctive queries), such that directly\nevaluating qK over B (without resorting to the knowledge base K any more) re-\nturns the correct answers to q under B and K . The ﬁrst-order rewritability implies\ntwo desirable properties: (i) the data complexity of conjunctive query answering is\nvery low, namely, in the highly tractable class AC0 (which is the complexity class\nof recognizing words in languages deﬁned by constant-depth Boolean circuits with\n(unlimited fan-in) AND and OR gates), and (ii) query answering can be performed\nefﬁciently by translating the rewritten query qK into SQL, thus taking advantage of\nthe optimization capabilities of the underlying relational DBMS.\nIn this chapter we consider the problem of conjunctive query answering under an\nextended version of the ER model, which we call ER+. Our model is obtained from\nthe original ER model by adding is-a relations among entities and relationships,\nfunctional and mandatory participation constraints on the participation of entities to\nrelationships, and functional and mandatory constraints on attributes of entities and\nrelationships. Figure 1.1 shows an ER+ schema, where the reader will recognize the\nfamiliar graphical notation of Chen’s ER model. The schema describes members of\na university department working in research groups. Ph.D. students and professors\n",
  "speaker": "SYSTEM",
  "uuid": "12048c51-c312-45e5-957c-0112ff4266d7"
}