{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 108\nPage 108 of 124\nNeOn Integrated Project EU-IST-027595\n1. Add a new subclass: (Adj|N) NP<class> →NP<subclass>.\nThis matches a class name aready in the ontology preceded by an adjective or noun, such as adjective\npreceding a known type of ﬁsh, which we assume is a more speciﬁc type. For example, when we\nencounter the phrase . . . Japanese ﬂounder. . . in a text and ﬂounder is already in the ontology, we\nadd Japanese ﬂounder as a subclass of ﬂounder.\n2. Add a new class (a more generic version of the Hearst patterns). Here we postulate that an unknown\nentity amidst a list of known entities is likely to be also an entity of the same type. For example, if we\nhave a list of classes of ﬁsh, and there is an unknown noun phrase in amongst the list, we can presume\nthat this is also a class of ﬁsh. To decide where to add this new class in the ontology, we can look for\nthe Most Speciﬁc Common Abstraction (MSCA) of all the other items in the list (i.e. the lowest common\nsuperclass of all the classes in the list) and add the new entity as a subclass of this class. However,\nthis has not currently been implemented due to the complexities of implementation in NEBOnE, but is\nplanned for the future. Currently therefore, we just add it as a new subclass of Thing (top level) and\nleave it to the user to move it to a more appropriate place.\nExample: Hornsharks, leopard sharks and catsharks can survive in aquarium conditions for up to a\nyear or more.\nwhere hornshark and leopard shark are classes in the ontology and catshark is unknown, so we can\nrecognise catshark as a subclass with the same parent as that of hornshark and leopard shark, in this\ncase shark.\n3. Add an alternative name as a synonym: a name followed by an alternative name in brackets is a\nvery common pattern in some kinds of text. For example in texts about ﬂora and fauna we often get\nthe common name followed by the Latin name in brackets, as in the following sentence:\nExample: Mummichogs (Fundulus heteroclitus) were the most common single prey item.\nIf we know that one of the two NPs is a class or instance in the ontology, we can predict fairly accurately\nthat the other NP is a synonym.\n7.3\nSPRAT application\nSPRAT (Semantic Pattern Recognition and Annotation Tool) is composed of a number of GATE components:\nsome linguistic pre-processing followed by a set of gazetteer lists and the JAPE grammars described above.\nThe components are as follows:\n• Tokeniser: divides the text into tokens\n• Sentence Splitter: divides the text into sentences\n• POS-Tagger: adds part-of-speech information to tokens\n• Morphological Analyser: adds morphological information (root, lemma etc.) to tokens\n• NP chunker: divides the text into noun phrase chunks\n• Gazetteers: looks up various items in lists\n• OntoRootGazetteer (optional): looks up items from the ontology and matches them with the text, based\non root forms\n• JAPE transducers: annotates text and adds new items to the ontology\n",
  "speaker": "SYSTEM",
  "uuid": "1225f2e7-4391-4156-9a8a-e003abcb753c"
}