{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual18032010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Desambiguacion usando Dbpedia local en Español e Ingles\nInstalación del servicio de asociación semántica de etiquetas en la maquina definitiva.\nSelección básica de entidad semántica asociada a una etiqueta. El resultado de esta selección básica servirá como línea base para comparar y evaluar los resultados del proceso de asociación de semántica presupuestado. Dicha selección básica toma la etiqueta y forma una URL DBpedia para ver si existe un recurso semántico. Si no existe, se busca un recurso DBpedia asociado a una página Wikipedia cuyo título sea la etiqueta.\nSe han identificado semánticamente “stopwords”. Stopwords son aquellas palabras que no aportan nada en el proceso de recuperación de información por ejemplo en español se tiene “el, la, los, por, y” entre otros.\nSe ha incluido la traducción automática en el proceso de asociación de semántica de etiquetas utilizando el LabelTranslator. LabelTranslator es una herramienta desarrollada en el OEG que utiliza varios recursos lingüísticos entre ellos EuroWordnet. La traducción se utiliza en dos aspectos:\n1)\tCuando una página Wikipedia en español no tiene asociada una traducción directa a una página Wikipedia en ingles. En este caso se realiza la traducción del título de la página en español a inglés usando como contexto las palabras mas frecuentes en la página Wikipedia. Con la traducción se busca un recurso DBpedia para realizar la asociación semántica a la etiqueta en español. \nPor ejemplo la página Wikipedia Parque_nacional_Sierra_Nevada_(Venezuela) no tiene asociada una página en ingles, por tanto al realizar la traducción usando el LabelTranslator obtenemos National_Park y por tanto se puede asociar dicha etiqueta con la entidad semántica\nhttp://dbpedia.org/resource/National_Park\n2)\tCuando una etiqueta en español no tiene asociada una página Wikipedia en español.  En este caso se realiza la traducción del título de la página en español a inglés usando como contexto las etiquetas utilizadas en la acción de etiquetado que se está procesando.  Con la traducción se realiza la búsqueda de una entidada semántica en ingles para la etiqueta en español.  \nPor ejemplo para la etiqueta “anotación” no existe una página Wikipedia en español, si la traducimos al inglés usando el LabelTranslator obtenemos anotation para la cual si existe una página Wikipedia en Ingles y por tanto se puede obtener la entidad semántica.\nActividad: Artículo del Knowledge engineer review.\nSe ha enviado la versión camera-ready para su publicación en la revista.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nMigración de servicios de Glassfish 2.0 a Glassfish V3.\nCorreción de errores en el registro de servicios REST, que generan errores al ejecutar el algorimto de ILP.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nRecopilación del trabajo realizado por Yufei, aplicación de sus manuales en la herramienta de TreeTagger y análisis de las implimentaciones obtenidas.\nFuncionamiento del TreeTagger en español por línea de comandos: ejecución y compilación.\nAnálisis de soluciones para incorporar el pluging TreeTagger en el servicio web.\nExplorar soluciones para el problema del consumo de memoria.\nRevisar las ontologías creadas a partir de la metodología propuesta por Boris y realizar el informe correspondiente.\nInterfaz Anotación Híbrida\n\nMejora en Interfaz.\n- Se ha continuado con la mejora de interfaz, pero falta re ordenar elementos.\n- Se ha mejorado la nube de etiquetas para que genere palabras en español.\n- Se trabaja en el drag and drop y llamada al web Service de Sigma.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con la implementación de la API del adaptador, desarrollando las interfaces encargadas de notificar los cambios en un recurso o tarea.\n- Para dar soporte a las labores de notificación se ha comenzado con el desarrollo del repositorio de metadatos, eligiendo Jena como herramienta para su gestión. Se hará uso de OWL para las ontologías, y RDF's usa para los datos.\nTarea 1.4\n\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nRevisión manual junto con experto del dominio de conjuntos de referencia para la medición del valor de exhaustividad en la evaluación del descubrimiento de mappings.\nLos cunjuntos abordados son:\nPhenomenOntology 3.6 - Nomenclátor Conciso\nPhenomenOntology 3.6 - Nomenclátor Geográfico Nacional\nPhenomenOntology 3.6 - Lexicón de BCN200\nPhenomenOntology 3.6 - Lexicón de BCN25\nTarea 7.1\n\n- RDF.\n· Generación de mappings con mayor cobertura de fenómenos (revisión exhaustiva de fuentes)\n      · Identificación de problemas para la conversión de las fuentes a RDF consecuencia de la   ausencia de normalización en las instancias de diversas fuentes.\n      · Generación de conjuntos de datos con URI armonizadas\n- Linked Data.\n· Inicio de página web\n      · Servidor\n- Entregables Hito 5. Supervisión final de documentos",
  "speaker": "SYSTEM",
  "uuid": "13b57969-60ea-43d1-8902-cd8dda103d8f"
}