{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 26\n26\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\n4. If t ∈ans(q,D,Σ), then accept; otherwise, reject.\nSoundness and completeness of the above algorithm follows immediately from\nLemma 1.2. Step 1 can be carried out in PTIME in general, and in AC0 in case both\nR and Σ are ﬁxed (see Lemma 1.2). Since Σ is a set of non-conﬂicting CDs (resp.,\nIPCDs, BACDs), the claim follows immediately from Corollary 1.2.\n1.7 Discussion\nIn this chapter we have introduced an extension of Chen’s Entity Relationship\nmodel, that is, the ER+ family. ER+ is a very natural formalism for modeling data,\nas it builds upon the ER model, which has been used for decades in database design.\nWe argue that the ER model is a powerful tool for ontological query answering,\nwhich at the same time is not awkward to understand and use; in particular, prac-\ntitioners and even persons without any technical knowledge can proﬁtably use ER\n(and its extensions) to express ontologies.\nWe have presented three ER+ languages which, by means of mild restrictions\nspeciﬁed by efﬁciently-testable syntactic conditions, enjoy the separability property\nand ﬁrst-order rewritability. The latter ensures not only that query answering under\nour languages is in the low complexity class AC0, but that answering can be done by\nevaluating a suitable SQL query over the initial data. This opens the possibility of\nefﬁcient implementation of query answering under non-conﬂicting ER+ schemata\non large data sets. Our study also pinpoints the complexity of query answering under\nour three non-conﬂicting ER+ languages with respect to both data and combined\ncomplexity.\nIt is worth noticing that the problem we deal with in this chapter has several\nother applications. It is tightly related to the analogous problem of query answering\non incomplete data under constraints [11, 12] and to semantic data integration [13].\nMoreover, our problem of query answering is mutually reducible to the query con-\ntainment problem (see, e.g., [14]), therefore all our results carry on to the latter.\nFinally, we remind the reader that the complexity results for most DL-Lite lan-\nguages come, in fact, as special cases of our results on ER+. For instance, non-\nconﬂicting ER+\nB with negative constraints is strictly more expressive than the lan-\nguages DL-LiteF and DL-LiteR [5, 6]. This shows that, if DL-Lite languages are\nuseful and important for modeling database schemata and ontologies, then a fortiori\nalso ER+ is.\nReferences\n1. A. Cal`ı, G. Gottlob, A. Pieris (2009) Tractable query answering over conceptual schemata.\nIn: Proc. of ER 175–190.\n",
  "speaker": "SYSTEM",
  "uuid": "13c5b878-2da9-4536-b4f7-3db2301aaafa"
}