{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 92\nPage 92 of 124\nNeOn Integrated Project EU-IST-027595\nTable 5.4: Pattern for Re-engineering a Thesaurus(continued)\nSlot\nValue\nGeneral\n1. Identify the records which contain thesaurus concepts without a broader concept,\nwithin the concept-concept relationship entity.\n2. For each one of the above identiﬁed thesaurus concepts ti:\n2.1. Obtain the thesaurus concept ti within the concept entity.\n2.2. Create the corresponding ontology class, Ci class, if it is not created yet.\n2.3. Identify the thesaurus concept, tj, which are narrower concepts of ti, within\nthe concept-concept relationship entity.\n2.4. For each one of the above identiﬁed thesaurus concept tj:\n2.4.1. Obtain the thesaurus concept tj within the concept entity.\n2.4.2. Create the corresponding ontology class, Cj class, if it is not created yet.\n2.4.3. Set up the subClassOf relation between Cj and Ci\n2.4.4. Repeat from step 2.2 for cj as a new ci\n2.5. Identify the thesaurus concept, tr, which are related concepts of ti, within the\nconcept-concept relationship entity.\n2.6. For each one of the above identiﬁed thesaurus concept tr:\n2.6.1. Obtain the thesaurus concept tr within the concept entity.\n2.6.2. Create the corresponding ontology class, Cr class, if it is not created yet.\n2.6.3. Set up the relatedClass relation between Cr and Ci\n2.6.4. Repeat from step 2.4 for cr as a new ci\n2.7. Identify the non-preferred terms for the concept ti. They are referenced in the\nsame records which contain ti, within the concept entity.\n2.8. For each one of the above identiﬁed thesaurus term tq:\n2.8.1. Create the corresponding label lq for the concept ti.\nExample\n1. Create the European class.\n2. Create the Dada class and assert that Dada is subClassOf European.\n2.1. Create the Merz class and assert that Dada is relatedClass of Dada.\n2.2. Create the Dadaism label and assert that Dadaism is label of Dada.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\n5.6\nNeOn Method for Re-engineering Thesauri\nThe goal of the thesaurus re-engineering process is to transform a thesaurus into an ontology. The activities\nof this process are based on the ones presented in 3.1.4: (1) non-ontological resource reverse engineering,\nwhich includes tasks 1 to 3, (2) non-ontological resource transformation, which includes tasks 4 and 5, and\n(3) ontology forward engineering, which includes tasks 6 and 7.\n5.6.1\nThesaurus Transformation\nIn the following, we outline the specialization of the non-ontological resource transformation activity for the-\nsauri, and consequently how to carry out tasks 4 and 5 included in Figure 3.2. The thesaurus transformation\nconsists of the following tasks:\n• Task 4. Search for a suitable pattern for re-engineering thesaurus. The goal of this task is to ﬁnd\nout if there is any applicable re-engineering pattern for re-engineering thesaurus useful to transform\nthe thesaurus into a conceptual model. The search for a suitable pattern for re-engineering thesaurus\n",
  "speaker": "SYSTEM",
  "uuid": "13f6e52c-a866-47cb-8025-352ad7c7610e"
}