{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 23\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 23 de 42 \n26. Saquicela V, Vilches-Blázquez LM, Corcho O. Semantic Annotation of RESTful \nServices Using External Resources. 1st Workshop on Service Web Engineering \n(SWEng), in conjunction with 10th International Conference on Web Engineering \n(ICWE). ICWE 2010 Workshops, Springer-Verlag LNCS 6385, pp. 266-276 (ISBN: 978-\n3-642-16985-4). Viena (Austria). Julio 2010 \n27. Suárez-Figueroa MC, Gómez-Pérez A, Muñoz O, Vigo M. gOntt, a Tool for Scheduling \nand Executing Ontology Development Projects. 22nd International Conference on \nSoftware Engineering and Knowledge Engineering (SEKE 2010). Knowledge Systems \nInstitute Graduate School. ISBN: 1-891706-26-8. Redwood City, San Francisco Bay, \nUSA. 1-3 Julio 2010 \n28. Umbrich J, Villazón-Terrazas B, Hausenblas M. Dataset Dynamics Compendium: A \nComparative Study. First International Workshop on Consuming Linked Data \n(COLD2010) en ISWC2010. ISSN: 1613-0073. CEUR Workshops. Pekin, China. \n08/11/2010. \n29. Vilches-Blázquez LM, Villazón-Terrazas B, De Leon A, Priyatna F, Corcho O. An \nApproach to Publish Spatial Data on the Web: The GeoLinked Data Use Case. \nWorkshop on Linked SpatioTemporal Data 2010 in conjunction with the 6th International \nConference on Geographic Information Science (GIScience 2010). Zurich (Suiza). \nSeptiembre 2010 \n30. Vilches-Blázquez LM, Villazón-Terrazas B, Saquicela V, de León A, Corcho O, Gómez-\nPérez A. GeoLinked Data and INSPIRE Through an Application Case. Poster en la \nInternational Conference on Advances in Geographic Information Systems (GIS 2010). \nSan José, California. 2 de Noviembre 2010 \n31. Villazón-Terrazas B, Suárez-Figueroa MC, Gómez-Pérez A. A Pattern-Based Method \nfor Re-Engineering Non-Ontological Resources into Ontologies. International Jounal \non Semantic Web and Information Systems (ISSN: 1552-6283). IGI-Publisching. \nVolumen: 6(4). Páginas: 27 - 63. Diciembre 2010 \n32. Xing W, Corcho O, Goble CA, Dikaiakos M. An ActOn-based Semantic Information \nService for Grids. Future Generation of Computer Systems. Elsevier. Volumen: 26. \nPáginas: 324 - 336. Marzo 2010 \n2011: \n1. Buil-Aranda C, Arenas M, Corcho O. Semantics and Optimization of the SPARQL 1.1 \nFederation Extension. The Semantic Web: research and application. ESWC2011. ISBN: \n978-3-642-21033-4. \n2. Buitelaar P, Cimiano P, McCrae J, Montiel-Ponsoda E, Declerck T. Ontology \nLexicalisation: \nThe \nlemon \nPerspective. \nhttp://tia2011.crim.fr/Workshop-\nProceedings/TIAW-2011.pdf. 9th International Conference on Terminology and Artificial \nIntelligence - Workshop. Paris, Francia. 10 November 2011. \n3. Calbimonte JP, Jeung H, Corcho O, Aberer K. Semantic Sensor Data Search in a \nLarge-Scale Federated Sensor Network. ISWC 2011 - Workshop Semantic Sensor \nNetwork Workshop. Bohn, Alemania. 23 de octubre 2011. \n4. García-Castro R. Perspectives in Semantic Interoperability. The Semantic Web: \nresearch and application. ESWC2012. ISBN: 978-3-642-21033-4. \n5. García-Castro R. SET-MM - A Software Evaluation Technology Maturity Model. \nPROCEEDINGS SEKE 2011 The 23rd International Conference on Software \nEngineering & Knowledge Engineering. SEKE 2011. ISBN: 978-1-891706-29-5. \n6. Garijo D, Villazón-Terrazas B, Corcho O. A Provenance-Aware Linked Data Application \nfor Trip Management and Organization. Proceedings of the 7th International \nConference on Semantic Systems (I-Semantics). I-Semantics. Graz, Austria. 7–9 \nSeptember 2011. \n7. Gluhak A, Hauswirth M, Krco S, Stojanovic N, Bauer M, Nielsen R, Haller S, Prasad N, \nReynolds V, Corcho O. An Architectural Blueprint for a Real-World Internet. The Future \nInternet: Future Internet Assembly 2011: Achievements and Technological Promises. \nSpringer-Verlag. Volumen 6656. ISBN: 978-3-642-20897-3. \n8. Gracia J, Bernad J, Mena E. Ontology Matching with CIDER evaluation report for OAEI \n2011. ISWC 2011. Bohn, Alemania. 23-27 octubre 2011. \n",
  "speaker": "SYSTEM",
  "uuid": "1404ab5b-b56b-4956-8157-dfc8c74e1297"
}