{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 3\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 3 \n \nResumen del CV1 \n \nOscar Corcho, PhD, es Profesor Titular de Universidad en el Departamento de Inteligencia Artificial de \nla Facultad de Informática de la Universidad Politécnica de Madrid, y codirige el Grupo de Ingeniería \nOntológica de esta facultad. Anteriormente trabajó como investigador Marie Curie en la Universidad \nde Manchester y como gestor de investigación en la empresa iSOCO. Es licenciado en informática \n(2000), Máster en Ingeniería del Software (2001) y Doctor en Ciencias de la Computación e \nInteligencia Artificial (2004) por la UPM. Recibió el Tercer Premio Nacional Fin de Carrera por el \nMinisterio de Educación y Ciencia (2001) y el Premio Extraordinario de Doctorado por la UPM (2005). \nSus actividades de investigación se centran en la e-Ciencia Semántica, la Web Semántica y Web \nde Linked Data y la Ingeniería Ontológica. Está dirigiendo algunos proyectos europeos y nacionales \nen estas áreas (Wf4Ever, PlanetData, Ciudad2020, BuscaMedia y mIO!), y ha participado en varios \notros públicos (SemsorGrid4Env, ADMIRE, OntoGrid, Esperonto, DIP, HOPS, SWWS, Knowledge \nWeb, OntoWeb y MKBEEM) y privados, como el proyecto HALO, financiado por Vulcan Inc., o el de la \nInternational Classification of Patient Safety, financiado por la Organización Mundial de la Salud. Ha \npublicado los libros “Ontological Engineering\" y \"A layered declarative approach to ontology translation \nwith knowledge preservation\", y más de 80 artículos en revistas, conferencias y workshops \ninternacionales. \nLiderazgo científico: resumen de contribuciones científicas y académicas \nSe han seleccionado las siguientes contribuciones principales, dada su importancia para determiner \nel liderazgo científico (una lista más detallada de estas contribuciones en forma de publicaciones, \nproyectos, charlas invitadas, premios, etc., se proporciona en la siguiente sección): \nÁrea \nContribuciones principales \nBreve descripción de un \nindicador de \nreconocimiento \nIngeniería \nde \nontologías \nPublicación de uno de los principales libros de \nreferencia del área [Gómez-Pérez et al., 2004] \n \nPropuesta de creación y supervision del desarrollo de la \nplataforma de ingeniería de ontologías WebODE \n[Arpírez et al., 2003]. \nMás de 500 citas, usado \ninternacionalmente como \nlibro de texto de referencia.  \n10.000 usuarios hasta su \ncierre en 2008. \nWeb \nSemántica \nPropuesta de creación y supervision del desarrollo de \ndos tecnologías de gran repercusión en el ámbito de la \nWeb Semántica: la infraestrucura de generación de \nportales semánticos ODESeW [López-Cima et al., 2003] \ny el lenguaje de mappings entre bases de datos y \nontologías R2O y su motor de ejecución ODEMapster \n[Barrasa et al., 2004]. \nODESeW: 10 websites de \nproyectos creadas con esta \ntecnología \nR2O/ODEMapster: usados \npor organizaciones como la \nFAO o el Instituto \nGeográfico Nacional \ne-Ciencia \nsemántica \nContribuciones a la estandarización de una \nespecificación para el acceso robusto basado en \nservicios a datos RDF (WS-DAI-RDF) [Esteban-\nGutiérrez et al., 2009]. \n \nPropuesta de una arquitectura de referencia para el \ndesarrollo de aplicaciones Grid mejoradas con \nsemántica (S-OGSA) [Corcho et al., 2006]. \n \n \nContribución a la definición del modelo de provenance \ndel proyecto myExperiment [Belhajjame et al., 2008]. \nEn proceo de \nestandarización por el \nOpen Grid Forum, y una de \nsus implementaciones es \nparte de OGSA-DAI  \nGran influencia sobre la \nvision SOKU (Service-\nOriented Knowledge \nUtilities) de la Unión \nEuropea \nModelo tenido en cuenta en \nel grupo del W3C sobre \nprovenance \n                                                 \n1 Se utiliza el formato de CV del investigador principal de propuestas de proyectos del Consejo de Investigación \nEuropeo (European Research Council – ERC) en su modalidad “Starting Grants”, dentro del programa IDEAS. \n",
  "speaker": "SYSTEM",
  "uuid": "146b143f-8389-445b-b45c-a318a43283bf"
}