{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/GeoBuddies \n\n-\tVilches Blázquez, L. M.; Ramos Gargantilla, J. Á.; Corcho, O.; Capdevila Subirana, J. Hacia una armonización semántica de la Información Geográfica. II Congreso Catalán de Geografía. En Treballs de la Societat Catalana de Geografia, number 65. ISSN: 1133-2190. Special number dedicated to Segon Congrés Català de Geografia., 29-31 May, 2008 Barcelona, Spain.\n-       Vilches-Blázquez, L. M., Ramos, J. A., López-Pellicer, F. J., Corcho, O., Nogueras-Iso, J. An approach to comparing different ontologies in the context of hydrographical information. Fourth International Workshop “Information Fusion and Geographic Information Systems” (IF&GIS’09) Popovich et al., (eds.) Lecture Notes in Geoinformation and Cartography (LNG&C) Springer-Verlag. \nPages: 193-207. ISBN: 978-3-642-00303-5 May 17th - 20th, 2009 St. Petersburg, Russia.\n-       Vilches-Blázquez, L.M., Corcho, O. (2009) A heuristic approach to generate good-quality linked data about hydrography. In 8th International Workshop on Web Semantics (WebS’09) in conjunction with 20th edition of DEXA. 31 August - 4 September. Linz, Austria (To appear)\n-\tAguado de Cea G, Puche Alosete J, Ramos JA Tagging Spanish Texts: the Problem of ‘se’ Language Resources and Evaluation Conference (LREC 2008) Marrakech, Marruecos 28-30 de mayo de 2008 Pages: 5\n-\tEkaterina Buyko, Christian Chiarcos, Antonio Pareja-Lora. Ontology-Based Interface Specifications for an NLP Pipeline Architecture. Proc. 6th International Language Resources and Evaluation (LREC'08), pp: 847-854. Mayo, 2008. Marrakech, Marruecos.\n-       Aguado de Cea, G., Gómez-Pérez, A., Montiel-Ponsoda, E., and Suárez-Figueroa, M.C. Using Linguistic Patterns to Enhance Ontology Development. In Proceedings of the International Conference on Knowledge Engineering and Ontology Development (KEOD 2009). (To appear).\n-\tMontiel-Ponsoda, E. Aguado de Cea, G.  Using natural language patterns for the development of ontologies. En las actas del VII Congreso Internacional de la Asociación Europea de Lenguas para Fines Específicos (AELFE 2008), páginas 332-345 (ISBN 978-84-691-5718-3).\n-       Aguado de Cea, G. y Montiel Ponsoda, E. When Phraseology and Ontologies Meet. XI Simposio Internacional de Comunicación Social. Santiago de Cuba (Cuba), enero 2009, páginas 80-84. (ISBN 978-959-7174-14-1).\n-       Aguado de Cea, G., Montiel-Ponsoda, E., and Suárez-Figueroa, M.C. Approaches to ontology development by non ontology experts, Proc. of the International Symposium on Data and Sense Mining, Machine Translation and Controlled Languages (ISMTCL 2009).(ISSN 0758 6787; ISBN 978-2-84867-261-8)\n-       Aguado de Cea, G., Gómez-Pérez, A., and Montiel-Ponsoda, E. Enriching Ontologies with Multilingual Information, en las actas de las III Jornadas Red Temática en Tratamiento de la Información Multilingüe y Multimodal (PLN-TIMM), páginas 107-110.\n-\tRamos JA, Fernández-López M, Gómez-Pérez A (2009) Algoritmo de agregación de mappings basado en reglas de selección. XIII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA 2009). 9-13 Noviembre 2009. Sevilla (España).\n-\tPoveda, M; Suárez-Figueroa, M.C.; Gómez-Pérez, A. \"Patrones, antipatrones y malas prácticas en ontologías\". XIII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA 2009). 9-13 Noviembre 2009. Sevilla (España).\n-       Roussey, C., Corcho, O., Vilches-Blázquez, L.M. A Catalogue of OWL Ontology AntiPatterns. In The Fifth International Conference on Knowledge Capture (K-CAP’09) 1 – 4 September 2009. Redondo Beach, California, USA.\n-        García-Ramos S, Otero-Quintana A, Fernández-López M. OntologyTest: a tool to evaluate ontologies through tests defined by the user. En International Symposium on Distributed Computing and Artificial Intelligence\n(DCAI'09) Salamanca, España. (Lecture Notes in Computer Science LNCS 5518) Springer-Verlag, parte II, Berlín, Alemania, pp 91–98 (2009)\n-        Herrero P., Bosque J.L., Pérez M.S. A Business-Rule Based Model to manage Virtual Organizations in Collaborative Grid Environments. En Market-Oriented Grid and Utility Computing, John Wiley & Sons, Ltd, (2008)\n-        Sánchez A., Montes J., Dubitzky W., Valdes J.J., Perez M.S, de Miguel P. Data Mining meets Grid Computing: Time to Dance. En Data Mining Techniques in Grid Computing Environments, John Wiley & Sons, Ltd, (2008)\n-        Sánchez A., Perez M.S, Gueant P., Peña J.M., Herrero P. DMGA: A generic brokering-based data mining grid Architecture. En Data Mining Techniques in Grid Computing Environments, John Wiley & Sons, Ltd, (2008)\n-        Herrero P., Bosque J.L., Salvadores M., Pérez M.S. WE-AMBLE: A workflow engine to manage awareness in collaborative grid environments, en International Journal of High Performance Computing Applications 22(2), pp. 250-267 (2008)\n-        Pérez M.S., Sanchez A., Abawajy, J. Robles V., Peña J.M. An agent architecture for managing data resources in a grid environment, en Future Gener. Comput. Syst. 25(7), pp. 747-755 (2009)\n-        Montes  J., Sánchez A., Valdes J.J., Perez M.S, Herrero P. The Grid as a Single Entity: Towards a Behavior Model of the Whole Grid, en Proceedings of the OTM 2008 Confederated International Conferences, CoopIS, DOA, GADA, IS, and ODBASE 2008. LNCS 5331, pp. 886-897, Springer Verlag (2008)\n-        Pérez M.S. \"A High Performance Suite of Data Services for Grids\" In Future Generation Computer Systems, Elsevier (To appear)\n'\nBold text'",
  "speaker": "SYSTEM",
  "uuid": "152d435e-1932-4d5d-b61d-10ed08c3b88c"
}