{
  "message": "SYSTEM: Wiki: Ir a LinkedData\nContents\n[\nhide\n]\n1\nURI Naming Convention\n2\nNamespaces\n3\nGeometry model\n4\nDecisiones de diseño\n5\nCodificación\n6\nGrafos\n7\nPubby settings\n8\nTérminos adicionales\n8.1\nConcepto de Viaje\n8.2\nModelado del Viaje\n8.3\nPropuesta a implementar\n8.4\nEjemplo\n9\nTO DO List\nURI Naming Convention\n\nURL base del directorio de ontologías:\nhttp://webenemasuno.linkeddata.es/ontology/\nURI de la ontología extendida del OPM:\nhttp://webenemasuno.linkeddata.es/ontology/OPMO/\nURI de la ontología extendida del MPEG-7:\nhttp://webenemasuno.linkeddata.es/ontology/MPEG7/\nURI que siguen los recursos:\nhttp://webenemasuno.linkeddata.es/resource/elviajero/\n<Type>/<ResourceName>\nNamespaces\n\nrdfs:\nhttp://www.w3.org/2000/01/rdf-schema#\nopmo:\nhttp://openprovenance.org/model/opmo#\nopmv:\nhttp://purl.org/net/opmv/ns#\nsioc:\nhttp://rdfs.org/sioc/ns#\nmpeg7:\nhttp://metadata.net/mpeg7/mpeg7.owl#\nmpeg7Ext:\nhttp://webenemasuno.linkeddata.es/ontology/MPEG7/\nopmopviajero:\nhttp://webenemasuno.linkeddata.es/ontology/OPMO/\ngeo:\nhttp://www.w3.org/2003/01/geo/wgs84_pos#\ndcterms:\nhttp://purl.org/dc/terms/\nfoaf:\nhttp://xmlns.com/foaf/0.1/\nGeometry model\n\nSe incluye un \"Punto\" por recurso, y al punto se le añaden la latitud y longnitud:\nhttp://webenemasuno.linkeddata.es/resource/elviajero/\n<Type>/<ResourceName>\nhttp://www.w3.org/2003/01/geo/wgs84_pos#location\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#long\nxsd:double\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#lat\nxsd:double\nPara designar localizaciones, hemos distinguido dos tipos de relaciones distintas: las que denotan que  una acción ocurre en un sitio (place) y las que son de guías que hablan de un sitio (refersTo). Así podemos tener que una guía \"refersTo\" Barcelona (de manera un poco más abstracta), pero que su edición 'took \"place\" in' Madrid.\nSe utilizan xsd:doubles como rango de latitud y longitud, para que sea compatible con linked data y porque es lo que vamos a enlazar.\nPara enlazar localidades (con sameAs) para esta iteración hemos decidido quedarnos con el primer resultado.\nDecisiones de diseño\n\n1.- Razón por la que no se importan las clases de las ontologías mapeadas con el OPM (que lo especializan sependiendo del dominio), en lugar de crear una clase en la ontología extendida, y hacer el mapping.\nSe hace debido a los namespaces: si añadimos la clase de la ontología que queremos mapear directamente, cuando creemos una instancia de esa clase se referirá a la ontología original, por lo que no se conserva la jerarquía que capturamos con OPM.\nPor ejemplo, si queremos decir que un post es una subclase de Artifact, y que el post es un sioc:post, si añadimos directamente sioc:post como subclase de nuestra ontología, al crear una instancia se creará como una instancia de sioc:post y se referirá a su ontología. Sin embargo, en dicha ontología no encontramos la relación de post como subclase de artifact, por lo que sería incorrecto.\nLa solución aceptada es crear una clase post como subclase de artifact y establecer una relación de equivalencia con sioc:post.\nCodificación\n\nEn un principio se ha almacenado todo en UTF-8 en el repositorio de Jena-TDB.\nComo se utiliza Virtuoso en los servidores de la facultad, se ha pasado el modelo a un archivo y de ahí se ha cargado en Virtuoso.\nPara pasar de Jena a Virtuoso se ha decidido utilizar la codificación Turtle (.ttl). RDF/XML no es la más adecuada, dado que si hay fallos en la codificación con caracteres raros (algo más que normal teniendo en cuenta el orígen de los datos) no se puede generar el fichero. N3 no produce problemas, pero automáticamente cambia la codificación y se pierden los acentos y \"ñ\" de los literales. TURTLE no produce problemas y mantiene los literales en UTF-8, por lo que ha sido el elegido.\nGrafos\n\nActualmente se han creado 3 grafos. De esta manera se puede cambiar cualquiera de ellos según haya necesidad y añadir nuevos datos en posteriores grafos.\nhttp://webenemasuno.linkeddata.es/dataset/viajero/IPTCS\n- Grafo donde se guardan las guías (noticias)\nhttp://webenemasuno.linkeddata.es/dataset/viajero/POSTS\n- Grafo donde se guardan los posts\nhttp://webenemasuno.linkeddata.es/dataset/viajero/UPOS\n- Grafo donde guardamos las localizaciones\nhttp://webenemasuno.linkeddata.es/dataset/viajero/GENERAL\n- Por problemas de accesibilidad en pubby, se ha creado un nuevo grafo, union de los 3 anteriores.\nEstos datos están en la siguiente instancia\nInstance name\nSPARQL Endpoint\nInstallation Path\niSQL Port\nHTTP Port\nCredentials\nDescription\nwebenemasuno\nhttp://webenemasuno.linkeddata.es/sparql\n/opt/virtuoso-6.1.1/webenemasuno\n1122\n8902\ndba/geo8\nProduction instance for webenemasuno.linkeddata.es\nPubby settings\n\nTérminos adicionales\n\nConcepto de Viaje\n\nEn la última reunión del proyecto se ha introducido el concepto de \"Viaje\".\nUn viaje es un tipo de recurso que se va a poder compartir, modificar y reproducir por parte de los usuarios. Se crea en 3 partes: Antes del viaje (consultas de contenidos para usar como referencia), durante el viaje (subida de contenidos dinámica y consulta) y después del viaje (sobre todo subir vivencias y conclusiones del viaje).\nAntes del viaje, se decide el lugar (o lugares) que se va a visitar, por lo que se puede tener un itinerario. Se pueden añadir y guardar fotos y videos de referencia que vayamos a utilizar, otros viajes, guías del país, etc.\nSuponemos que cuando le damos al botón \"Crear Viaje\" ya tenemos alguna referencia seleccionada (en caso de que se haya escogido alguna, claro).\nUn viaje será el contenedor de los contenidos que generemos durante el propio viaje (fotos, vídeos, posts, etc).\nCada uno de estos recursos tiene un proceso independiente de creación (ya sea usando otras referencias o mediante un conjunto de procesos que haya llevado a cabo el usuario).\nTambién pueden tener metadatos descriptivos propios de los recursos (título, subtítulo, creador, derechos, fecha, etc.).\nUn viaje se puede modificar añadiendo nuevos contenidos como referencias del viaje, (Ejemplo: He creado el viaje, pero he olvidado añadir esta guía que tanto me gusta! O: Voy a modificar el itinerario añadiendo un nuevo destino). Incluir modificaciones del viaje en el prototipo? ¿Cómo denominamos a las distintas \"Versiones\"? Por ejemplo, si un viaje se guarda como un id y lo modificamos,¿ la nueva versión tiene un id nuevo o conservaría el antiguo como ocurre en los posts?.\nPor tanto, un viaje debe soportar eliminar contenidos asociados al mismo (propongo que para el prototipo esto no se implemente aún, ya que es un poco complicado a primera vista)\nYa que un viaje está geolocalizado y un usuario sube recursos desde lugares, se podría mostrar la visualización con multilíneas, y cuando se pinchase en cada punto, ver qué ha subido ahí el usuario (en una caja), y guías relevantes del sitio del País en otra caja.\nModelado del Viaje\n\nNuevo artefacto del perfil opmopviajero: Trip (Viaje). Subclase de \"Container\" de SIOC (puesto que un viaje es un contenedor de posts , fotos, videos y anotaciones). Un viaje posee los siguientes metadatos descriptivos: Nombre (id, obligatorio, automático), título (opcional), creador (opcional), fecha de creación (opcional).\nNombre: identificador de la instancia \"Viaje\". Ej: VIAJ17_03_11_1223\nTítulo: Título ideado por el usuario. Es un literal. Ejemplo: Viaje Brasil 2011. Se relaciona mediante la propiedad sioc:hasTitle con el contenedor del viaje, (como si de un blog se tratase).\nCreador: se trata de la cuenta del usuario creador. La nomenclatura que se ha seguido hasta ahora es la de poner ACC+el nombre del agente. Se relaciona con la propiedad has_creator de sioc, aunque quedará registrado con el rol adecuado con el opm también.\nFecha (de creación): análogo a los anteriores. Convendría que fuera un xsd:Date, pero como no se qué formatos se van a utilizar, en el prototipo se manejarán literales.\nRelaciones con otros artefactos:\nItinerario y contenidos agregados posteriormente (fotos, videos, posts).\nItinerario: Nueva clase que se ha de añadir a la ontología, bien como parte de la ontología opmopviajero o bien extendiendo/reutilizando otras de geoes. Se relaciona con un viaje con una de las 2 relaciones (a discutir el nombre):Trip123  <has_itinerary/ has_route> Itinerary1123.\nNota:\nquizá no para el prototipo, pero si los itinerarios se pueden cambiar, convendría ponerlos como artefactos y registrar parte de su provenance.\nFotos videos y posts. No son los mismos los que se agregan que los que se utilizan como referencia para el viaje, lo ideal es distinguirlos para poder hacer un \"time line\" del propio viaje. Cada vez que se añaden se puede considerar que el viaje ha sufrisdo una modificación, y por lo tanto ha sufrido un nuevo proceso que desemboca en una nueva versión. Discutir el problema de la identificación y el versionado: ¿Cómo sabemos la versión actual si el componente de ingreso siempre se refiere al mismo identificador?\nPropuesta Dani:\nCada vez que se realiza una nueva  modificación, se busca cuál es la última versión del viaje/recurso, se crea el id de la nueva versión y se genera. Requiere una consulta al repositorio por inserción, pero a cambio se mantiene todo el provenance y reproducibilidad.\nItinerario: (Por ahora) No es un nuevo artefacto, sino un contenedor de puntos en orden para ser dibujados. ¿Cómo se establece el orden? Un itinerario puede contener varios puntos (\nnueva relación has_point\n), y para saber por cuál empezar a dibujar, contiene la relación (\nfirst point\n). Entre los puntos tienen una relación\nnext_point\npara saber el orden.\nNota:\nEsto es mejorable y discutible.\nUn viaje surge de un proceso de creación por parte de un usuario. Para ello utiliza una serie de referencias a guías, posts, videos, fotos y otros viajes que forman parte de su provenance. Este proceso finaliza con la primera versión del viaje.\nCuando un usuario modifica un viaje añadiendo contenidos, hay que especificar el proceso de creación de cada contenido y luego especificar que se usa para una nueva versión del viaje. Por ejemplo: si un usuario sube una foto, a la que ha puesto un título, hora, etc. Hay que especificar su creación, añadir sus metadatos asociados y por último crear la nueva versión del viaje en el que se añade como referencia.\nCuando otros usuarios se refieran al viaje para usarlo como referencia, se refieren al identificador único sin pensar en versiones. Suponemos que siempre se refieren a la última versión del viaje, ya que suponemos que el componente de ingreso no soporta versiones.\nPropuesta a implementar\n\nBasado en el modelo de geometrías de geolinked data. Un viaje tiene itinerarios (por ahora no guardamos los cambios a itinerarios).\nLos itinerarios tienen pathElements. Cada path Element tiene un orden y un punto asociado.\nEjemplo\n\nEjemplo de modelado de un viaje creado a partir de otro como referencia y que sufre una modificación añadiendo una foto (creando una nueva versión del viaje).\nNo he representado itinerario, nombre, etc. para no complicar más la figura.\nLeyenda\nRojo: Artefactos\nAzul: Agentes\nVerde: Procesos\nGris: Aristas (opm)\nErrata: la arista \"Later Generation Than\" no debería ir al Process, sino al artefacto resultante. La arista de later gen than de la foto es Used, y la de was controlled de la guía es Used también\nTO DO List\n\nVisualizador\nQue la fecha se meta como un long y no como un literal (en caso de que se pueda).\n(No se hará debido a los formatos en que están los datos)\nQuitar los espacios de los upos (meterlos en mayúsculas y con urlencode)\nMeter los autores sin acentos ni espacios (hacer urlencode)\nEn general, hacer urlencode de todas las instancias para evitar errores. UTF-8\nActualizar los upos, repitiendo el parser de upos en el nuevo formato (que espero NO VUELVAN A CAMBIAR)\nCorregir los links de las guías que terminan en #despiece, ya que se refieren a zonas de otras guías. Para ello hay que quitar lo que haya después del /Tes, referenciando adecuadamente el rol (que es que utiliza parte de otro fichero).\nEn los comentarios, añadir también al creador en mayúsculas y sin espacios (con urlencode).\nEliminar los espacios, \\n y \\\\n (como en \\\\nMadrid)\nEn el modelo, he puesto que dc:creator es equivalente a mpeg7:creator, cuando es una superprpopiedad\nCorregir los namespaces del modelo, cambiando por los nuevos que tendrá la ontología para ser publicada\nCrear una nueva ontología inportando el core del opmo y expandiendo las clases adecuadas en un profile, en vez de extender la que ya existe (por el problema de los namespaces)\nLos links se debería de poner como xsd:anyuri (y meterlos como dataproperty). Añadir la función.\nSugerencia de Victor: consultar DBpedia o geolinkeddata para extraer información concreta de geolocalización acerca de la localidad extraída de la noticia. Enlazar con una relación owl:sameAs con el recurso apropiadamente.\nEn vez de proceso de creación, meter las guías como proceso de publicación. (O no?)\nEn los enlaces, cambiar los \"/\" por \"_\" para que no haya problemas con las rutas.\nFallo al introducir los roles de uso: algunos de los individuos se llaman igual que la clase\nAgentes en mayúsculas.\nPor petición de Luis, incluir también el body de los posts y noticias. Por si terceros quieren parsearlo en busca de más extracción de información.\nGuardar un log con los ficheros que fallan o los posts que no tienen nicetitle para informar a prisacom.\nValorar si incluir los .PES (pdfs)\n. DESECHADO POR AHORA\nPosible mapping entre sioc:content y opmo:content\nAñadir a la ontología los labels en español con cada una de las clases\nUtilizar SILK para completar los enlaces con la dbpedia. Para ello, añadir etiquetas a cada localización con su significado en español.\nHe descubierto que los creadores de las guías son Agents (opmAgents) cuando deberían ser accounts. Es decir, que la tripla: <\nhttp://webenemasuno.linkeddata.es/resource/elviajero/Guide/20100410ELPVIAVJE_1.TES\n>                 | <\nhttp://rdfs.org/sioc/ns#has_creator\n> <\nhttp://webenemasuno.linkeddata.es/resource/elviajero/ContentProvider/ISIDORO_MERINO\n> estaría mal. Debería ser /Account/ACCISIDORO_MERINO\nFallo al hacer los sameAs (YA LO HE CORREGIDO EN EL PROGRAMA, PERO HAY QUE REPARSEAR. SE METE EN LA SIGUIENTE ITERACIÓN). Ejemplo:\nidNoticia | <\nhttp://www.w3.org/2002/07/owl#sameAs\n>            | <\nhttp://webenemasuno.linkeddata.es/resource/elviajero/geo.linkeddata.es/RESOURCE_MUNICIPIO_SEVILLA\n>, en lugar de ser <\nhttp://geo.linkeddata.es/resource/Municipio/Sevilla\n>\nCreo que he añadido mal los labels en la ontología (las etiquetas de idiomas). Consultar Boris. Efectivamente lo he hecho mal. Reparsear y cargar el nuevo repositorio.\nTodo aquello que pueda llevar label ha de llevarlo (autores, etc).\n(Creo que está todo)\nCorregir lo que ha dicho Alex del Pubby. No utilizar urlEncode, sino uriEncode. Sino Pubby no podrá utilizar las urls bien\nHe descubierto porqué no carga en Virtuoso. Algunas URIs son demasiado largas (4000 caracteres!)\nERROR de algunos videos: Error: Cannot convert node\nhttp://metadata.net/mpeg7/mpeg7.owl#mediaDuration\nto OntProperty. Fácil corregir, pero necesita otro parseo----> Resulta que es MediaDuration\n(bad practise!!!)\nParte de geolinkeddata no se ha cargado debido a fallo en el server. Volver a enriquecer los datos\nSILK no soporta acentos (Ejemplo ComunidadAutónoma = ComunidadAut%C3%B3noma y da un fallo de SPARQL Syntax).\n¿Por qué no está presente el contenido de muchas noticias? Investigar.\nURIs de links y videos no resolubles (tienen \"=\"). Sustituirlos.\nError al ver algunas URIs con el Pubby (no soporta los \"=\", por ejemplo)\nMejorar y automatizar el proceso de: comparación SILK, cargar al repositorio, buscar en DBPedia los que no estén en geolinkeddata y subir otra vez.\nAutomatizado en la medida de lo posible. Hay que ejecutar 4 scripts.\nBastante importante, aunque no se incluye en la versión inicial. HAY CICLOS EN EL GRAFO, cuando en OPM se dice que no debería. Esto hace que el grafo actual sea un grafo de provenance ilegal. Los ciclos que encontramos es porque se han modificado los datos y no tenemos acceso a dichas modificaciones. Por ejemplo: una noticia utiliza un enlace como \"más información\", y la otra noticia hace lo mismo con la primera. Para solucionarlo, habría que: comparar ambas noticias, ver cuál de ellas es anterior y decir que una usa a la otra de acuerdo con ello. La segunda lo que usaría sería una versión de la otra noticia, de manera que se rompería el ciclo y se haría secuencial. Pero el proceso de anotación sería más lento.\nValorar si incluir todas las accounts como pertenecientes a un solo OPM Graph, y decir que ese OPM graph soporta el perfil que hemos definido (así es como pone que ha de hacerse en la especificación).\nHablar con Prisacom sobre los fallos del parser en torno al 8% de los ficheros procesados... se pierde muchísima infomración (Unos 1500 archivos de noticias, fotos y videos)! --> Hemos hablado y \"verán lo que pueden hacer\"\nEn esta primera iteración no se ha mejorado la geolocalización de aristas, solo se ha hecho con las noticias (UPOS). A pesar de que la mayoría han sido publicadas y editadas en Madrid, hay que añadir las coordenadas de geolocalización. Conveniente hacer una query al repositorio y asignársela 1 a 1.\nCuando se parseen los posts, si tienen enlaces a wikipedia, extraer el concepto y enlazar con dbpedia.\nERROR Parser prisa : Problema al leer el fichero Exception: Exception: -error-if-this-is-used- is a required field. Ejemplo: E:\\Trabajo\\WEBN+1\\ARCHIVOS PRISACOM\\DatosXMLprisaCompleto\\200701\\23\\destinos\\20070123elpviadst_1.Tes.\nEjemplo error parsing : Se procesa E:\\Trabajo\\WEBN+1\\ARCHIVOS PRISACOM\\DatosXMLprisaCompleto\\200706\\15\\destinos\\20070615elpviadst_5.Ies\nProblema al leer el fichero Exception: Exception: Parsing Error : The content of element type \"hedline\" is incomplete, it must match \"(hl1,hl2*)\".\nDecir a Prisa que hay algunos errores de codificación en sus comentarios.\nUn post se puede referenciar por comentarios con el #comments detrás del título del post\nDetectar otros tipos de artefactos como presentaciones (ahora metidos como videos)\nRecargar los excels y las carpetas del nuevo mes\nLos de Prisa han vuelto a liarla con las URLS (en concreto todas las de Paco Nadal). Hablar con ellos y con Boris a ver cómo se puede hacer bien. También han cambiado algunos nice-titles.\nDoble label en algunos (muchos) content providers (Ej: Paco Nadal)\nHay que volver a procesar lo de la DBPedia: algunas etiquetas tienen acentos (Ámsterdam, Moscú, Sudán), mientras que las nuestras no. Explorar las etiquetas que tengan inglés.\nMeter la mejora del query framework. Es decir, rehacer las consultas por defecto como se habían hecho para el caso de uso desechado.\nAdecuar el API REST para manejar las queries anteriores.\nResulta que la copia de DBpedia que tenemos no tiene bien algunas coordenadas (por ejemplo, Sydney, República de Irlanda, etc.). Corregir en la medida de lo posible esto. (Cambiar a la copia que tiene Angelito)\nProcesar los nuevos UPOs (se han ampliado) cuando Luis solucione lo de los municipios. Esto conlleva a corregir también lo de las etiquetas de Silk y, ya de paso, las coordenadas (cambiar al endpoint nuevo).\nIncluir los Viajes como nuevo objeto de la ontología. Esto conlleva a que el parsing de IPTCs y comments ha de repetirse, pq llevan integrada la ontología. Ya de paso, corregir la falta de contenido (si es culpa del parser, claro), los fallos en los links y las excepciones de codificación en los videos de los posts (que tienen mil maneras de exponerse).\nVa cobrando mayor urgencia el completar que se pueda insertar datos a través del API REST. Robustez si se dan datos incompletos. Una vez erminado-> Cristina\nContemplar poner las fechas y tratarlas como xsd:Date para que se puede filtrar por las mismas.\nSacar la url de jpg de las imágenes a ser posible para poder previsualizar\nA hacer por Boris:\nCambiar  la configuración de Pubby para que los xsd:anyUri sean clickables.\nMeter estadísticas (parsing .Est)\ngrave:\nOscar ha apuntado que no hay guías de alguns sitios. (Cambiar la query del título a optional).\ngrave:\nMe he dado cuenta de que algunos videos se han metido como guías en las localizaciones. Verificar el tipo del artefacto con la extensión.\nMe he dado cuenta de que en algunos recursos he olvidado poner el recurso. En concreto:\n<\nhttp://webenemasuno.linkeddata.es/elviajero/resource/ACCPACO-NADAL\n>\nrepositorio actualizad\nMirar los recientes archivos .Zes (parece como una sucesión de fotos) ¿Tenemos acceso?",
  "speaker": "SYSTEM",
  "uuid": "15a61183-3794-43dc-8c34-469b7172ffeb"
}