{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 17\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97742\npublicaciones, ponencias y otras actividades de difusión de resultados que se financien \ncon las ayudas concedidas al amparo de la presente Orden.\nArtículo 26.  Recursos.\n1.  Contra esta Orden, que pone fin a la vía administrativa, cabe interponer recurso \npotestativo de reposición en el plazo de un mes. Asimismo, cabe interponer recurso \ncontencioso-administrativo ante la Sala de lo Contencioso-Administrativo de la Audiencia \nNacional, en el plazo de dos meses a contar desde el día siguiente a la fecha de su \npublicación.\n2.  Contra las resoluciones de concesión de las ayudas de la presente convocatoria, \ncabe interponer recurso potestativo de reposición en el plazo de un mes. Asimismo, podrá \ninterponerse recurso contencioso-administrativo ante la Audiencia Nacional, en el plazo de \ndos meses a contar desde el día siguiente a la fecha de su publicación. Dicho recurso no \npodrá ser interpuesto hasta que el anterior recurso potestativo de reposición sea resuelto \nexpresamente o se haya producido la desestimación presunta.\nCAPÍTULO III\nProcedimiento de solicitud y concesión de las nuevas becas\nArticulo 27.  Requisitos de los solicitantes.\n1.  Los candidatos deberán acreditar estar en posesión del título o superado los \nrequisitos para acceder a las enseñanzas de tercer ciclo o a los estudios de Oficiales de \nPosgrado, conforme a alguna de las siguientes ordenaciones universitarias:\na)  Estudios de tercer ciclo regulados por el RD 778/1998, de 30 de abril:\na.1)  Haber finalizado los estudios conducentes al Título oficial español de Licenciado, \nIngeniero o Arquitecto o en su caso, conforme a sistemas educativos extranjeros no \nadaptados y/o no pertenecientes al Espacio Europeo de Educación Superior que den \nacceso al doctorado.\na.2)  En el caso de los solicitantes que hayan obtenido el título o realizado los estudios \nconforme a sistemas educativos extranjeros adaptados al Espacio Europeo de Educación \nSuperior, deberán haber superado al menos 300 créditos ECTS.\nb)  Estudios Oficiales de Posgrado regulados por el RD 56/2005 o RD 1393/2007:\nb.1) Haber finalizado los estudios conducentes al título oficial español de Licenciado, \nIngeniero o Arquitecto o conforme a sistemas educativos extranjeros no adaptados y/o no \npertenecientes al Espacio Europeo de Educación Superior que den acceso al doctorado.\nb.2)  Haber finalizado los estudios conducentes al título oficial español de Diplomado, \nIngeniero Técnico y Arquitecto Técnico, y tener superados al menos 60 créditos de máster \ny 300 créditos comprendidos los correspondientes al título de primer ciclo y los de máster \ny estar admitido en la fase investigadora del doctorado.\nb.3)  Haber finalizado los estudios de Grado del EEES y tener superados al menos 60 \ncréditos de máster y 300 créditos comprendidos los correspondientes al título de primer \nciclo y los de máster y estar admitido en la fase investigadora del doctorado.\n2.  La fecha de finalización de los estudios a los que se refiere el punto 1 anterior \ndeberá ser:\na)  En el caso de licenciados, ingenieros y arquitectos o equivalente en sistemas \nuniversitarios extranjeros no adaptados al EEES debe ser posterior al 1 de enero de 2007.\nb)  En el caso de diplomados, ingenieros técnicos y arquitectos técnicos o equivalente \nen sistemas universitarios extranjeros no adaptados al EEES, debe ser posterior al 1 de \nenero de 2005.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "15c692ff-3479-45fb-9276-044a9e55dcdd"
}