{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 7\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11156\nOrden PRE/3662/2003, de 29 de diciembre (publicada en el Boletín Oficial del Estado \nnúmero 313, de 31 de diciembre de 2003), por la que se regula un nuevo procedimiento de \nrecaudación de los ingresos no tributarios recaudados por las Delegaciones de Economía \ny Hacienda y de los ingresos en efectivo en las sucursales de la Caja General de Depósitos \nencuadradas en las mismas, y modificada por la Orden EHA/3967/2007, de 26 de diciembre \n(publicada en el Boletín Oficial del Estado número 7, de 8 de enero de 2008).\nArtículo 15.  Régimen jurídico.\nLas subvenciones objeto de esta convocatoria están sometidas a las bases reguladoras \ncontenidas en la Orden ECI/266/2008, de 6 de febrero, por la que se establecen las bases \nreguladoras de la concesión de subvenciones públicas en el marco de la Línea Instrumental \nde Actuación de Recursos Humanos, del Plan Nacional e I+D+I 2008-2011, y a las normas \nque le sean aplicables, entre ellas:\na)  La Ley 38/2003, de 17 de noviembre, General de Subvenciones.\nb)  El Real Decreto 63/2006, de 27 de enero, por el que se aprueba el Estatuto del \npersonal investigador en formación.\nc)  El Reglamento de la Ley 38/2003, de 17 de noviembre, General de \nSubvenciones.\nd)  En particular, las que se deriven de la posible cofinanciación por el Fondo Social \nEuropeo. Las subvenciones financiadas con cargo a fondos de la Unión Europea se regirán \npor las normas comunitarias y por las normas nacionales de desarrollo o transposición de \naquéllas que se citan a continuación. Los procedimientos de concesión y de control de las \nsubvenciones establecidas por la Ley 38/2003, de 17 de noviembre, tendrán carácter \nsupletorio respecto de las normas de aplicación directa a las subvenciones financiadas \ncon cargo a fondos de la Unión Europea.\n1.º  Reglamento (CE) n.º 1083/2006 del Consejo de 11 de julio de 2006 por el que se \nestablecen las disposiciones generales relativas al Fondo Europeo de Desarrollo Regional, \nal Fondo Social Europeo y al Fondo de Cohesión y se deroga el Reglamento (CE) no \n1260/1999 (publicado en el Diario Oficial de la Unión Europea L 210, de 31 de julio \nde 2006).\n2.º  Reglamento (CE) n.º 1081/2006 del Parlamento Europeo y del Consejo de 5 de julio \nde 2006 relativo al Fondo Social Europeo y por el que se deroga el Reglamento (CE) n.º \n1784/1999 (publicado en el Diario Oficial de la Unión Europea L 210, de 31 de julio de 2006).\n3.º  Reglamento (CE) n.º 1828/2006 de la Comisión de 8 de diciembre de 2006 por el que \nse fijan normas de desarrollo para el Reglamento (CE) n.º 1083/2006 del Consejo, por el que \nse establecen las disposiciones generales relativas al Fondo Europeo de Desarrollo Regional, \nal Fondo Social Europeo y al Fondo de Cohesión, y el Reglamento (CE) n.º 1080/2006 del \nParlamento Europeo y del Consejo, relativo al Fondo Europeo de Desarrollo Regional (publicado \nen el Diario Oficial de la Unión Europea L 271, de 27 de diciembre de 2006).\n4.º  Orden TIN/2965/2008, de 14 de octubre, por la que se determinan los gastos \nsubvencionables por el Fondo Social Europeo durante el periodo de programación de \n2007-2013 (publicada en el Boletín Oficial del Estado número 252, de 18 de octubre de \n2008) modificada por la Orden TIN/788/2009, de 25 de marzo (publicada en el Boletín \nOficial del Estado número 79, de 1 de abril de 2009).\nArtículo 16.  Notificación a la Comisión Europea.\nLos subprogramas recogidos en la presente Resolución cumplen con las condiciones \ny disposiciones pertinentes del Reglamento (CE) n.º 800/2008 de la Comisión Europea, de \n6 de agosto de 2008 (publicada en el Diario Oficial de la Unión Europea L214, de 9 de \nagosto de 2008), por el que se declaran determinadas categorías de ayuda compatibles \ncon el mercado común en aplicación de los artículos 87 y 88 del Tratado (Reglamento \ngeneral de exención por categorías), quedando estos subprogramas exentos de la \nobligación de notificación contemplada en el artículo 88, apartado 3, del Tratado.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "16669cd5-283a-4e57-adab-e649160b0dc9"
}