{
  "message": "SYSTEM: Ontoterminology_a_new_paradigm_for_terminology.pdf: Página 4\nKEOD-International Conference on Knowledge Engineering and Ontology Development. Madeira October 5-8 2009 \n \n \ncan be viewed as a conceptual map [Tricot et al. \n2005] in which the experts navigate along the “is-a” \nand “part-of” relationships in order to access \ninformation connected to concepts (figures 3, 4 and \n5). \n \nSchemas play a key role in technical domains. \nFrom the conceptual point of view, they represent \none of the most important references. Experts agree \non this kind of independent natural language \nknowledge, \neasier \nto \nunderstand \nand \nmore \nconsensual than texts. They refer to schemas every \ntime a communication problem occurs or when an \nexplanation is required. A schema describes a \nphysical entity and the parts which make up it. Each \nof these parts is also described by its own schema. \nEntities and components are modelled by concepts \nlinked by the part-of relationship. These concepts \ncreate a network of part-of linked concepts which \nallows users to browse from a schema describing the \ncurrent concept to a more detailed or global schema \nassociated to one of its part-of concepts. Just as \nhypertext has defined a new method of corpus \nnavigation using textual links, hyper schema defines \na new method of knowledge base navigation \nattached to the domain ontology using conceptual \nlinks (see figures 4 and 5). \n \n \n \nFigure 3. The ontoterminology of hydraulic turbines \n \n3 METHODOLOGY \nUnlike textual terminology’s semasiological \napproach which relies essentially on texts for \nspecialised vocabulary extraction [Buitelaar et al. \n2005], [Daille et al. 2004], ontoterminology is based \non an onomasiological approach. It consists in first \ndefining the domain ontology and then identifying \nthe most suitable terms to denote the concepts (if \nnecessary, new normalised terms are proposed). Our \nintention is not to compare the two approaches, their \ngoals remain different: the former focuses on \nspecialised vocabulary whereas the latter focuses on \nconceptualisation. We should just bear in mind that \nthe lexical structure extracted from a corpus does not \nmatch the conceptual structure directly defined by \n",
  "speaker": "SYSTEM",
  "uuid": "179bee1c-6d4f-4b15-ab93-443fb43d950c"
}