{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Carlos%27_Tasks \n\nContents\n[\nhide\n]\n1\nBibliography\n2\nADMIRE Tasks\n3\nPhD thesis Tasks\n4\nDatasets\n5\nOther SPARQL Federation tools\n6\nEvaluation\n7\nOther systems\n8\nDAIS Group\n9\nConferences\n10\nW3C SPARQL-WG\nBibliography\n\nDatabase Bibliography Tasks\nAnswering Queries Using Views: A Survey. Alon Y. Levy. Department of Computer Science and Engineering. University of Washington. Seattle, WA, 98195\nMiniCon: A scalable algorithm for answering queries using views, R. Pottinger, A. Havely, The VLDB Journal The International Journal on Very Large Data Bases, 2001\nData Integration A Theoretical Perspective, Maurizio Lenzerini, Procs of 21 ACM SIGMOD-SIGACT-SIGART symposium on Principles of database systems, 2002\nEfficiently Ordering Query Plans for Data Integration, AnHai Doan and Alon Havely, Procs of the international conference on data engineering, 2002\nQuery Containment for Data Integration Systems, Millstein T. and Halevy A. and Friedman M., Journal of Computer and System sciences, 2003\nReasoning in Data Integration Systems: why LAV and GAV are Siblings, Andrea Cali, ISMIS 2003, Maebashi City, Japan.\nBootstraping Pay-As-You-Go Data Integration Systems Anish Das Sarma, Xin Dong, Alon Halevy, SIGMOD 2008\nReconcilable Differences, Todd J. Green, Zachary G. Ives, Val Tannen, ICDT 2009.\nOptimizing queries across diverse data sources, L. M. Haas, D. Kossmann, E. L. Wimmers, and J. Yang In Proc. VLDB, pages 276–285, Athens, Greece, Aug. 1997.\nQuery Planning in InfoMaster, O.M. Duschka, M.R. Genesereth, 12th ACM Symposium on Applied Computing, San Jose, CA, 1997.\nFlexible and scalable query planning in distributed and heterogeneous environments, Jos? Luis Ambite and Craig A. Knoblock, In The Fourth International Conference on Artificial Intelligence Planning Systems (AIPS-98), Pittsburgh, June, 1998.\nQuery Processing and Optimization on the Web, Mourad Ouzzani, Athman Bouguettaya, Dept of Computer Science, Virginia Tech, Distributed and Parallel Databases, 15, 187-218, 2004.\nAdaptive Query Processing: Technology in Evolution, Joseph M. Hellerstein, Michael J. Franklin, Sirish Chandrasekaran, Amol Deshpande, Kris Hildrum, Sam Madden, Vijayshankar Raman and Mehul A. Shah, Special issue on Adaptive Query Processing, 23(2), December 1993\nXJoin: A Reactively-Scheduled Pipelined Join Operator, Tolga Urhan and Michael J. Franklin,\nGrid Bibliography Tasks\nHadoop in action book\nhttp://www.manning.com/lam/\nhttp://www.enakting.org/enakting/pubs\nRead Andreas Langegger PhD Thesis:\nhttp://www.langegger.at/papers/Langegger-phd-thesis.pdf\nThis week's (25/01/2010) readings :\n[1]\n,\n[2]\n,\n[3]\nMeandre project\nGo through and analyse:\nThe anatomy of the Grid\n[4]\nThe physiology of the Grid\n[5]\nBook: Grid 2 (Chapters mainly Data access and integration and OGSA)\n[6]\nWSRF\n[7]\nOGSA-DAI\n[8]\nOGSA-DQP\n[9]\nGlobus Data Replication Service (DRS)\n[10]\nDistributed Computing Bibliography Tasks\nGo through and analyse:\nLAM/MPI Parallel Computing ???\nAsignatura Sistemas Operativos Distribuidos\nAsignatura Bases de Datos Distribuidas\nDescription Logics Bibliography Tasks\nGo through and analyse:\nThe Description Logic Handbook\n[11]\nDistributed DL bibliography\nLectures of European Master in Computational Logic\nFind the lectures' TOC\nADMIRE Tasks\n\nModify ontologies according what it is described in the deliverables (plus make them av\nFinish deliverables D1.9, D4.6 and D5.6\nModify Platform ontology according to Oscar's changes and comments last meeting\nemails to PE writers to get a description of them\nActivity for Ally, return candidate PEs with all their information, not just the name\nPresent the RDF data existing in the registry as Linked Data\nCorrect D1.6\nUse Ivy in the SemanticRegistry project in the SVN\nPaper with Liangxiu about the ADMIRE ontology\nthe plan\nADMIRE - Check Liangxiu's ontology\nADMIRE - Check mistake detected by Liangxiu at the\nPE creation tutorial\nADMIRE - Check Maciek's ontology\nADMIRE - Apply changes suggested by Chee Sun to the PE creation tutorial\nADMIRE - Solve memory problems\nADMIRE - Deliverables (WP1, WP4 and WP5) In WP4 deliverable, D4.3 talk about querying different and distributed registries (i.e. using SparqlDQP), talk about SPARQL Update, it might be interesting\nADMIRE - Implement Amy's interface for updating and querying (improve performance of queries) --> found a bug in USMT, being checked\nADMIRE - Query performance (among others, check the web server in which the RDF file is)\nADMIRE - test robustness & scalability. Use\nOGSA-DAI test framework\n?\nADMIRE - Video about how to create PEs in the ontology\nPhD thesis Tasks\n\nPrepare system for ESWC 2011: make the system public for accessing bio2rdf endpoints. Fail proof. It is important to get similar results to the ones in the paper. Fail proof: clean code, default graph problem, remove patterns {}, etc.\nCheck out\nhttp://www.almaden.ibm.com/cs/garlic/\nrecommendation by Andy Seaborne\nGoogle summer of code, propose project SPARTQL-DQP and go to the school. Get paid 5000$, email Mario Antonioletti\nGSoC application\nmeasure the response times of each SPARQL endpoint, because they may interfere with my global response times. Maybe at 01:00 am will be faster one bio2rdf endpoint\nemail a Oscar about Dev8D, general summary compiling the previous emails\nRead NeOn deliverable D1.4.5\nAnalyse Linked data Web API (the one from Dev8D)\nPrepare paper for\nDEXA 2010\n.\nEvaluation\nPrepare paper for\nJournal of Web Semantics\n: The\nPlanning\nRDF Resource - refactor it to meet\nOGSA-DAI coding rules\nOGSA-DAI test framework\nHow to contribute to the OGSA-DAI project\nCheck RDF Resource memory problem\nAdd loggers to those classes that have it missing\nSemantic OGSA-DAI, combine R2O with OGSA-DAI. Create resources and activities for it.\nCreate test suite for SparqlDQP. Based on\n[12]\n?\nWeb page for OGSA-DAI RDF resource and try to upload it to the OGSA-DAI SVN\nKeep working in SparqlDQP\nLook at the idea for querying endpoints in\nSADI\nSADI ppt\nCheck BOLBS, CLOBs in the RDF Resource, convert tfrom one datatype to another\nCollaborate with Juan F. Sequeda about his paper\nLook at optimising algorithms\nCollaborate with Ibrahim Elsayed about distributed SPARQL\nImprove the ESWC2010 paper:\nThe review\nNetworked Graphs evaluation\nhere\nARQ Service statistics\nby Andy Seaborne, not a SPARQL standard\nleave data in the server, indirect access. using sparql protocol you can't iterate over the data retrieved, use properties from rsources (a new resource created from indirect access) tosotre statisticsabout them and optimise its access.\nDatasets\n\nbio2rdf\nbio2rdf\nbio2rdf blog\ncontains useful examples onhow to use bio2rdf\nbio2rdf slides\nbio2rdf demo queries\nEsto (\nhttp://www.myexperiment.org/search?query=bio2rdf&type=all\n) te puede interesar; es lo actualmente se hace para poder agregar data de distintos endpoints.\nbio2rdf datasets\n-> Aqui busca los ficheros con extension .ns\nbio2rdf visualization\nLinked Life Data\nLinked Life Data\nDataset from the LaRK project. Contains an integration of 20+ datasets about biomedical data\nblog post\nLinked Life Data\nmain datasets\nDBpedia\nDBPedia EPR\nOther SPARQL Federation tools\n\nJena and DARQ\n[13]\nSenWIQ\nhttp://sourceforge.net/projects/semwiq/\nNetworked Graphs\nNetworked Graphs\nNetworked Graphs paper\nEvaluation\n\nQueries\nqueries\nOther systems\n\nApache Mahout\nhttp://lucene.apache.org/mahout/\nMahout's goal is to build scalable machine learning libraries.\nDAIS Group\n\nNotes from the WS-DAI group meetin at OGF 28 in Munich\nThe notes\n.\nConferences\n\nDEXA\nWISE\nhttp://conference.cs.cityu.edu.hk/wise2010/\n15 de junio\nESWC\nISWC\ne-Science 10 de junio\nhttp://www.escience2010.org/\nCIKM 2010\nhttp://www.yorku.ca/cikm10/call_for_papers.php\nW3C SPARQL-WG\n\nCertainly Bound Variables\nCertainly Bound Variables",
  "speaker": "SYSTEM",
  "uuid": "17f7517f-d1f1-442c-9210-d7fe91355191"
}