{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n1. Migración a la ultima versión de Netbeans (6.9.1) y de glassfish (3.0.1) de todos los proyectos de desarrollo, incluyendo el API de desambiguación de etiquetas, los servicios web SOAP y RESTful, y la aplicación web.\n2. Desambiguación simultanea de etiquetas. Se modificó el API de desambiguación de etiquetas para que permita procesar etiquetas simultáneamente. La entrada al API es una cadena de etiquetas separadas por coma. El xml que retorna el API se modifico añadiendo un elemento <Tag name =\"tagName\"> para encapsular los resultados obtenidos para cada etiqueta. Dentro de esta etiqueta <Tag> se presentan los mismos resultados que se presentaban anteriormente para una etiqueta. La funcionalidad de desambiguar etiquetas simultaneas se implemento tambien en los servicios Web y en la aplicación web.\nDesde el punto de vista técnico, por cada a etiqueta a desambiguar se lanza un hilo de ejecución, con un máximo de 10 hilos simultáneos. Además, se implementó el manejo de transacciones en la base de datos para evitar que por excepciones no controladas la base de datos tuviera datos inexactos.\nNueva Aplicación web:\nhttp://grafias.dia.fi.upm.es:8080/SemanticWebApp/DisambiguationTool.xhtml\nNuevo Servicio web RESTful:\nhttp://grafias.dia.fi.upm.es:8080/SemanticTagWebServiceRestFul/resources/tag/disambiguate\nParámetros (en negrita los valores por defecto):\nString tag (es el único obligatorio, puede ser una única etiqueta o una lista de etiquetas separadas por coma)\nString contextstr (tags separados por coma, valor por defecto la cadena vacía)\nString lang (es, en, both)\nboolean activeContext (true o false)\nboolean  naiveSenseSelection (true o false)\nEjemplo de uso:\nhttp://grafias.dia.fi.upm.es:8080/SemanticTagWebServiceRestFul/resources/tag/disambiguate?tag=Casa&lang=es\nAdicionalmente, se ha creado un servicio que permite precargar etiquetas al repositorio. Este servicio es útil en caso de necesitar datos precargados para una demo o un prototipo y así evitar que en el proceso de desambiguación se tenga que realizar el proceso de carga del repositorio.\nEl servicio se encuentra en:\nhttp://grafias.dia.fi.upm.es:8080/SemanticTagWebServiceRestFul/resources/tag/load\n.\nParámetros (ambos obligatorios):\nString tag (puede ser un único tag o una lista de tags separados por coma)\nString lang (es, en, both)\nEjemplo de uso:\nhttp://grafias.dia.fi.upm.es:8080/SemanticTagWebServiceRestFul/resources/tag/load?tag=Madrid&lang=es\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Analis de nuevas fuentes semanticas para intentar asignar significados a los attributos no encontrados en la DBpedia.\nTarea 3. Modelo de anotación híbrido\n.\nExplorado método de \"scrapping Google Search page\" para detectar la ortografía correcta de una palabra en una frase.\nTarea 2.3\n\n- Instalación de librerías para video del AEI.\n- Lectura de documentación para reorientación de la línea de investigación.\nTarea 1.4\n\n(A completar por Luis)\nTarea 7.1\n\n- Heurísticas\n· Mejora heurísticas desarrolladas\n      · Revisión de resultados obtenidos\n      · Generación de gold standard\n-RDF\n· Desarrollo librería para generación de RDF a partir de shapefiles\n- Web/Difusión\n. Envío de resumen para las JIDEE2010",
  "speaker": "SYSTEM",
  "uuid": "182ec636-0462-4950-a1a4-d5ac909d537c"
}