{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Gentmar2011 \n\nMultimedia Lab searches \nMOTIVATED RESEARCHERS (m/f)\nJob description\n•        You will participate in application-driven research projects (funded by the European Union, national funding agencies, and/or industrial partners).\n•        You will develop new concepts and applications in the field of expertise of theresearch group Multimedia Lab.\nProfile\n•        You are a dynamic person.\n•        You have a Master degree, preferably in Computer Science, Informatics, Electronics, or Mathematics.\n•        You are interested in multimedia applications and you are willing to participate inapplication-driven research projects in this field.\n•        You have a focused research interest and expertise in at least one of the following areas: knowledge representation, ontology engineering, semantic technologies, reasoning, linked data, adaptive media streaming, media adaptation decision taking, media formats and protocols.\n•        You have in-depth knowledge of at least one of the following computer or Web technologies: C++, C#, Java, PHP, Web services, Javascript, HTML5, RDF, OWL, SPARQL, RIF.\n•        You are able to work independently and accurately.\n•        You have good communication skills, written as well as oral.\n•        You have a very good knowledge of the English language (written and oral).\n•        Occasionally,you are willing to work during weekends of evenings.\nOffer\n•        A young, dynamic and stimulating work environment.\n•        A contract as full time scientific employee at Ghent University.\n•        Start date: as soon as possible.\n•        End date: 31/12/2011, the contract being yearly renewable.\n•        The salary depends on your (scientific) working experience; the initial salary is min. € 35,400.00 and max. € 72,000.00 \nper year.\n•        Contacts and collaboration with leading national and international research groups and companies.\n•        Possibility to present research results at important international conferences.\n•        Extralegal advantages: free public transport; biking fee for work traffic, use of sport facilities and entrance in \nstudent restaurants of Ghent University.\nContact person MMLab\nRik Van de Walle, PhD\n(Senior Full Professor)\nt: +32 9 331 49 14\ne: rik.vandewalle@ugent.be\nApplication and evaluation\nPlease send your application file before February 28, 2011 to\nRik Van de Walle, PhD\nGhent University - IBBT\nFaculty of Engineering and Architecture\nDepartment of Electronics and InformationSystems\nMultimedia Lab\nGaston Crommenlaan 8 bus 201, B-9050 Ledeberg-Ghent, Belgium\nThe application file must contain:\n•        an application letter;\n•        your curriculum vitae;\n•        a short motivation (max. one page in which you state why you are applying for the job position.\n---\nMultimedia Lab (MMLab, multimedialab.elis.ugent.be) is a research group within Ghent University, Faculty of Engineering and Architecture, Department of Electronics and Information Systems (ELIS, www.elis.ugent.be). \nMMLab was founded in 2001. This lab has a wide range of activities, including fundamental/basic research, applied research, and contract-based research with industrial partners. Besides, MMLab is doing scientific consultancy for both industrial and governmental partners and is one of the founding research groups of IBBT.\nThe main research topics that are dealt with by MMLab can be summarized as follows:\n•       Video coding and compression\n•       Image/video processing and analysis\n•       Multimedia content adaptation\n•       Metadata and Semantic Web technology\n•       Gaming technology\n•       Standardization in the domain of Web-based multimedia applications and systems\nThe activities of MMLab in basic/fundamental research (e.g., development of newalgorithms for multimedia coding/adaptation) are at the basis of other, rather application-driven, research activities (e.g., exploitation of metadata within video on the Web scenarios).\nMore detailed information about the activities of MMLab can be found via\nhttp://multimedialab.elis.ugent.be\n.\nMMLab currently counts 8 staff members and about 25 researchers.",
  "speaker": "SYSTEM",
  "uuid": "18a6d469-949f-448b-9b3d-00ab00d88929"
}