{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Contratos,_becas_y_el_paro \n\nDesde hace un par de años los becarios oficiales (UPM, CAM, FPI, FPU) tenemos la\noportunidad de disfrutar de al menos los dos últimos años de beca en forma de contrato\nen prácticas.\nDebido a ellos tenemos derecho a prestación por desempleo al finalizar tal contrato.\nEn función de la duración del contrato, y de la base de cotización del mismo, se\ntendrá derecho a un determinado número de meses de paro (más o menos unos 7-8 para\nun contrato de 2 años) y con una cuantía dada.\nEs importante señalar que en caso de querer solicitar el paro, hay que solicitarlo en el\nplazo de los quince días hábiles posteriores a la finalización del contrato. \nDurante esos quince días hábiles se tiene derecho a recibir la cuantía íntegra que \ncorrespondiera en función de lo que se haya estado cotizando. Después de ese periodo\nla cuantía a percibir decrece de forma gradual.\nSin embargo,\neste periodo se puede prorrogar en el caso de haber tenido otros ingresos\nde tipo no contributivo\n, como por ejemplo las\nbecas OTT\n.  En este caso, estos quince días\nhábiles se posponen hasta que esos ingresos no contributivos finalicen.\nPara solicitar el paro hay que pasarse por el INEM, inscribirse en el paro, y pedir los \nformularios para realizar la solicitud. Además de los datos personales, nos pedirán dos \ncosas:\nUn informe de empresa (UPM) en el que figuren lo que nos han pagado durante\nlos últimos 6 meses de contrato.\nEn el caso de no haber solicitado el paro los quince días hábiles posteriores a la\nterminación del contrato, será necesario presentar las credenciales de becario\n(OTT o de otro tipo) que justifiquen no haber realizado la solicitud en ese periodo.\nEspero que esta entrada sea de utilidad para todos, tanto profesores como becarios,\nque se puedan ver en la misma situación.\nMas información.\nSi se ha cotizado (haber tenido un contrato) de forma no continua, hay que presentar los contratos anteriores si el utlimo contrato no es superior a 180 dias.\nAdjunto el documento oficial sobre paro (2009).\nFile:Prestacion contributiva.pdf",
  "speaker": "SYSTEM",
  "uuid": "190c82d9-5926-4db0-a28b-6732d8e367fa"
}