{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 7\n \n \n7\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \nSÉPTIMO.-  CONDICIONES DE RENOVACIÓN, RENUNCIA Y REVOCACIÓN \n \n7.1. Las ayudas para becas objeto de la presente convocatoria tendrán una duración de \ndoce meses, que comprenderá desde el día 1 de enero hasta el 31 de diciembre de \n2010. \n7.2. Las becas podrán ser renovadas por otro período anual hasta completar un máximo de \ndos años de disfrute.  \n7.3. El mantenimiento y la renovación de la beca quedarán a expensas de que no existan \ninformes desfavorables sobre el adjudicatario por parte del Director, refrendado por  el \nresponsable de la Escuela, Facultad, Centro I+D o Instituto Universitario, en los \ntérminos que resuelva el Vicerrectorado de Investigación de la UPM y siempre que se \nacredite la continuación en un programa de doctorado. \n7.4. Los beneficiarios de las ayudas deberán presentar informes anuales que expongan los \nresultados y objetivos de la actividad realizada y un informe del Director de la Tesis, \nsegún se detalla en el art. 8.1. \nLa duración, extinción y prórrogas del contrato en prácticas se regirá por lo que \nestablece el Art. 11.1 del Texto Refundido del Estatuto de los Trabajadores, aprobado \npor el R. D. Legislativo 1/1995 de 24 de marzo y su normativa de desarrollo. \n7.5. Las renuncias deberán ser inmediatamente notificadas al Vicerrectorado de \nInvestigación por el beneficiario, y se acompañará de un informe final de actividades \nrealizadas hasta la fecha, con el visto bueno del Director. \n7.6. Las renuncias o bajas que se produzcan entre los beneficiarios de nueva concesión \ndentro de los seis primeros meses de la primera anualidad, podrán ser cubiertas por \nlos candidatos de la lista de reservas, que se establece en el artículo 14.4 de esta \nconvocatoria. \n7.7. El incumplimiento total o parcial de los requisitos y obligaciones establecidos en esta \nresolución dará lugar a la revocación de la beca o rescisión total o parcial del contrato \ny a la obligación de reintegrar la ayuda y los intereses de demora correspondientes.  \n7.8. Las ayudas para becas o contratos podrán ser revocadas o rescindidas por el \nVicerrector de Investigación, previo informe desfavorable del Director y con el VºBº del \nresponsable de la Escuela, Facultad, Centro de I+D, o Instituto Universitario según la \nunidad de adscripción del Director, pudiéndose tramitar, si fuera posible, un cambio del \nmismo. \n7.9. El Vicerrectorado de Investigación informará a los responsables de la Escuelas, \nFacultades, Centros de I+D e Institutos Universitarios de las de las altas y bajas que se \nproduzcan en esta convocatoria. \n \n",
  "speaker": "SYSTEM",
  "uuid": "194f46d0-06d2-41cb-ba27-473ae14fbf59"
}