{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 14\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \nmedio ambientes que es atribuido a la Agencia de Protección Ambiental de los \nEEUU. \n- \nNúmero total de términos: 10.000 \n- \nTipos de Relación: jerárquica. \n- \nDisponible en la página web para consulta online. En inglés. \n5. Glosario de términos técnicos del arte del teatro \n- \nhttp://www.theatrecrafts.com/glossary/glossary.shtml \n- \nDefinición: Este glosario ofrece una amplia lista de términos teatrales así como su \ndefinición.  \n- \nDisponible para consulta a través de la página web. \n2.5.2 Tesauros \n1. Getty: El Instituto de Investigación Getty ha creado el ULAN (The Union List of Artist \nNames browser), vocabulario estructurado que cuenta con unos 220.000 nombres e \ninformación biográfica sobre artistas y arquitectos. Este Instituto cuenta con la \ncolaboración de otras instituciones y proyectos que colaboran en la elaboración y puesta \nal día de este tesauro. Junto con AAT (The Art y Architecture Thesaurus vbrowser) y \nTGN (The Getty Thesaurus of Geographic Names browser), forman un completo \nvocabulario sobre arte y todo lo relacionado con él.  \n- \nhttp://www.getty.edu/ \n9 The Union List of Artist Names (ULAN) ®: base de datos con alrededor de \n262.000 nombres e información biográfica de cerca de 118.000 artistas y \narquitectos. \n- \nhttp://www.getty.edu/research/conducting_research/vocabularies/ulan/  \n- \nPublicado por: J. Paul Getty Trust \n- \nDescripción: ULAN es un vocabulario estructurado que contiene nombres, \npseudónimos, nacionalidades, datos biográficos y otro tipo de información \nsobre artistas. Diseñado para proporcionar terminología por indexación y \nrecuperación. Estandarizado a nivel mundial. ULAN incluye cualquier \nidentificador individual o corporativo (por ejemplo, un grupo de gente que \ncolabore en un mismo proyecto) en el diseño o creación de arte o \narquitectura. En el caso de identificadores corporativos se incluye posibles \nrelaciones jerárquicas. El crecimiento de ULAN se debe a la contribución \nde distintos museos, librerías y otros instituciones culturales. Cada registro \nen ULAN contiene un artista (no un nombre o término). Actualmente \npodemos encontrar alrededor de 118.000 registros. Aunque cada registro no \nestá traducido a todos los idiomas, el tesauro es multilingüe en el sentido de \nque cada registro puede conceptos en múltiples lenguas. \n- \nNúmero total de Términos: 262.000 \n- \nTipos de relación: asociativa, equivalencia, jerárquica. \n \n14\n",
  "speaker": "SYSTEM",
  "uuid": "195778a1-f3d1-434a-9783-dd18c2c9eba7"
}