{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Charlas2007 \n\nEsta página describe el calendario de charlas de miembros del grupo en 2007.\nCalendario 2007\n\nFecha\nLugar\nPonente\nTópico\n28 de mayo\n6002\nMari Carmen\nMetodologia para construir ontologias dentro del WP5 del proyecto NeOn\n1 de junio\n6002\nAndrés\nÁngel y Boris\nTrabajo realizado por Andrés en los cursos de doctorado\nAnálisis del posible trabajo conjunto (sobre incorporación de instancias en distintos formatos)\n8 de junio\n6002\nRaúl García Castro\nResumen de su tesis sobre benchmarking de la tecnología de la Web Semántica (45 min)\n15 de junio\n6002\nLiliana\nAnalysis of how to introduce semantics in IT systems.\n22 de junio\nSala de Reuniones (Piso de abajo del DIA. Enfrente del despacho de Asun)\nAngel Lopez\nIntegracion de informacion en ODESeW. Relacion entre ODESeW y SEEMP\n29 de junio\n6002\nLiliana\nAnalysis of how to introduce semantics in IT systems.\n6 de julio\n6002\n13 de julio\n6002\nNadie\nSummer School 2007\n20 de julio\n6002\nRosario Bautista (Universidad de Málaga)\nOntologías y terminología\n27 de julio\n6002\n7 de septiembre\n6002\nMauricio Espinoza Mejía\nLabelTranslator plugin: una herramienta para traducción de etiquetas ontológicas\n14 de septiembre\n6002\nSilvia Platas\nÓscar Muñoz García\nPresentación de su proyecto fin de carrera. IRIBA: Herramienta para el análisis automático de resultados de interoperabilidad (30 min).\nPresentación de su proyecto fin de carrera. RDF(S) Connector. Acceso uniforme a ontologías y meta-datos expresados en RDF(S).\n21 de septiembre\n6002\nRafael González-Cabero\nFirenze Framework\n28 de septiembre\n6002\nAdrián Siles Rodríguez\nODEWiki (30 min)\n5 de octubre\n(9.30 - 11.00)\n6002\nElena, Oscar Muñoz, Mari Carmen\nPresentacion sobre el trabajo que se esta realizando en el WP5 de NeOn (Lexico-Syntactic Patterns; Ideas para la Metodologia de Construccion de Aplicaciones Semanticas; Metodologia para la construccion de redes de ontologias)\nDespues de estas presentaciones se hablara de como organizar los viajes a CAEPIA 2007\n19 de octubre\n6002\nRaul Palma\nPresentacion de trabajo realizado en la estancia en Karlsruhe relacionado con el proyecto Neon.\n25 de octubre (10.00 - 11.00)\n6002\nMari Carmen\nMetodologia para la construccion de redes de ontologias: ideas preliminares sobre especificacion, reuse, etc.\n29 de octubre\n6002\nRaul Palma\nPresentacion de mi trabajo en curso sobre mi tesis doctoral: Ontology Metadata Evolution\n8 de noviembre\n6002\nRafa (cancelada por enfermedad)\n15 de noviembre\n6002\nno hay reunión\n22 de noviembre\n6002\nBoris + Andres - Debido a la asistencia a la Conf que sugirió Asun (Rails), tenemos que cambiar esta presentación, algun voluntario?\nDiscusión sobre demos y papers para ESWC2008, e ISWC challenge (Deimos use case?)\n29 de noviembre\n6002\nElena, Mora, Yufei\nThe goal of this meeting is to find out which part of Jose's work on linguistic matching (specially the grammars, algorithms, architecture) can be used by Elena and Yufei. Their work is about matching lexico syntactic patterns included in design patterns and natural languages queries introduced by a user. The presentation will include: Elena will make a short presentation with the general idea and Yufei will present the study done up to now about the taggers. Jose will present his work (\n.ppt file\n).\n13 de diciembre (10:30)\n6002\nJosé Ángel Ramos\nDescubrimiento automático de mappings (Spanish)\n20 de diciembre\n6002\nBoris + Andrés\nReuse of non ontological resources.\n27 de diciembre\n6002\n¿Voluntarios?",
  "speaker": "SYSTEM",
  "uuid": "19fb7343-2b2e-4b69-9e8e-59243ec53755"
}