{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 92\n90\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nAlthough most survey respondents, similar to the results for print, expect no change in their personal\nor their company’s scanning behaviour, for those respondents indicating a change, a strong percentage\nexpect an increase. Hardcopy vendors would be wise to heed this expected transition and think about\nofferings (in the form of products or services) that address this need.\n• Digital data growth: As IT continues to modify its annual spending away from technology toward infor‐\nmation (i.e., content), the demand by employees, business partners, and clients to access information\nin digital format will be a major driver for scanner growth during the following years. \n• Vertical industry applications: Environments such as warehousing and retail continue to represent the\nkey verticals for scanning and text input applications. There exists a progressive expansion onto the\nretail shopping floor for both workers and shoppers alike. For workers, these new form factors are being\nused for inventory tracking and messaging. For shoppers, these devices are used to scan barcodes while\nshopping, ultimately expediting the checkout process. \n• Marketing: As augmented reality is becoming mainstream, more and more applications for digital imag‐\ning will appear. \n• Combination / Convergence with NUI: as Natural User Interfaces like touchscreens are becoming the\nstandard the facto, new text input methods and techniques are required and should be integrated with\nthese technologies.\nChallenges\n• Capture more revenue in the mobile chain. Text input has become a commodity and standard in the\nmobile industry. \n• Innovation: due to the maturity of the technologies, innovation has to come from the natural user\ninterface side rather than from the intelligent content technologies.\n• Competition: With the rise of app markets for mobiles, pcs and companies, scanning and text input\napplications are rising. However, this competition is eroding price and margins.\n• Mobile scanners. Mobile scanners are personal workgroup scanners that are small enough to fit in a\npersonal bag for travel. Mobile scanners tend to require human interaction in feeding multiple pages\n(no ADF), but if an ADF is included, the document feeder is limited to fewer than 10 pages. \n• Scan behaviour should rise in the cloud. The need to take paper content to the cloud is evident.\nAlthough most survey respondents, similar to the results for print, expect no change in their personal\nor their company’s scanning behaviour, for those respondents indicating a change, a strong percentage\nexpect an increase. Hardcopy vendors would be wise to heed this expected transition and think about\nofferings (in the form of products or services) that address this need. \nAuthoring/Creation\n",
  "speaker": "SYSTEM",
  "uuid": "1b64a437-e1df-4ef0-ad7f-fa97eaa998d7"
}