{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 69\n67\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nice that enables customers to select from many translation agencies, and to centrally manage their projects.\nWhile the Cloudwords service is not free, it is quite inexpensive. Cloudwords, in turn, charges a commission\nfor the projects brokered through its platform.\nMany localisation service providers follow a similar model, and offer their hosted platform for an inexpen‐\nsive monthly fee, then make the bulk of their money by selling professional translations on a per word basis.\nTranslation agencies, in turn, make most or all of their money by selling translation. \nChannels and platforms\nThese translation services are offered through both direct and channel partner systems, depending on the\namount of automation and system integration required. For example, a translation agency that offers a self‐\nservice web translation tool for ordering translations for Word documents will typically sell direct to end\nusers. On the other hand, systems that require a lot of automation will often have translation built in. \nExamples of integrated solutions include:\n• Content management systems that have translation management built in (e.g. Drupal)\n• Captioning and subtitling services that support translations as part of the captioning process (e.g.\n3PlayMedia, Amara)\n• Multilingual e‐commerce systems that automatically translate source language content as new prod‐\nucts are added\n• Custom applications built around a language service provider’s system or API\nThe advantage of integrated solutions is that they greatly reduce the amount of work the customer needs to\ndo to utilize translation (in some cases, they automatically request translations from LSPs behind the scenes\nso no administrative work is required of the users). Their main disadvantage is that these integrations are\ndifficult and expensive to do, so LSPs and third party solution providers are slow to create integrated tools\nfor new markets and applications.\nDemand for Professional Translation Technology\nThe demand for translation technology comes from several sources: individual translators, language service\nproviders (translation agencies), and publishers/content producers. Individual translators and agencies are\ntypically looking for computer aided translation tools, so they can work more efficiently. Larger agencies will\nalso invest in translation management tools (or use their customer’s translation management tools, depend‐\ning on the situation). Publishers and content producers, on the other hand, are generally looking for process\nautomation, and are less concerned about the details of how translators do their work (this is often done by\nan outsourced agency).\nIndividual translators\nIndividual translators participate in the supply chain in three main ways: via translation agencies, translation\nmarketplaces and direct‐to‐customer relationships. \nTraditionally individual translators would interact with customers via language service providers (translation\nagencies). LSPs provide several services to translators: customer acquisition (sales), project management,\nand administrative support (billing, collections, etc.). They are still a dominant channel translators go\nthrough, but new technologies are enabling customers to automate more of the process, and in some cases\nbuild direct relationships with translators. Google’s G‐Community is an example of such disintermediation.\nTranslation marketplaces, such as Cloudwords, enable translation buyers to request competitive quotes,\n",
  "speaker": "SYSTEM",
  "uuid": "1cc82bee-643e-42da-88df-cc3320045dd1"
}