{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual13052010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n. \nModificaciones al proceso de asociación de semántica a etiquetas: 1) vamos a probar el algoritmo utilizando solo descripciones breves de cada página wikipedia en lugar de todo el contenido. Estas descripciones breves las vamos a recuperar de la DBpedia por medio de la relación\nhttp://dbpedia.org/ontology/abstract\n.\nPreparación de los datos y de la apliación para la evaluación que se va a realizar del algoritmo.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nModelado e implementación de un proceso para almacenar los resultados de la invocacion de fuentes. Con este proceso se evita ejcutar llamadas a fuentes que previamente fueron invocadas.\nTarea 3. Modelo de anotación híbrido\n.\nOntologías creadas:\nLa primera ontología corresponde con una ontología de contexto, donde se representa las posiciones de una palabra dentro de un documento. La segunda ontología modeliza el sistema de anotaciones que se está manejando hasta el momento. Para poder reconstruir una página Web se debe saber las posiciones que ocupa las cabeceras HTML. En GATE se pueden incluir dichas cabeceras o en general cualquier texto con sus metadatos mediante un parámetro que se puede configurar al cargar el documento. El problema reside en uno de los pasos del proceso de anotación, concretamente en el TreeTagger ya que no es capaz de entender dicho parámetro y, por tanto, no carga el documento y salta una excepción.\nInterfaz Anotación Híbrida\n\n- Se viene integrando todos los módulos creados en el nuevo sistema de anotación. Con algo de retraso.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el desarrollo de la funcionalidad de transferencia de ficheros mediante GridFTP.\n- Se ha continuado con el testeo del funcionamiento de las interfaces ya implementadas.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nImplementación del evaluador automático de conjunto de mappings respecto a los conjuntos de referencia.\nImplementación del cargador automático de conjunto de mappings en XML.\nImplementación del conversor a formato OEGMappings de los conjuntos de referencia en formato desarrollado.\nImplementación del evaluador automático de conjunto de mappings.\nTarea 7.1\n\n- Redacción del paper para Workshop on Linked Spatiotemporal Data 2010\n- Linked Data.\n· Difusión\n      · Actualización web\n- RDF.\n· Iniciación del pintado RDF en mapa\n      · Desarrollo de ontologías para nuevos dominios\n      · Generación de RDF para otros dominios",
  "speaker": "SYSTEM",
  "uuid": "1d0f1ff8-efe3-4309-9aac-fd0dd6fea014"
}