{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 4\n4\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\nLanguage\nArity\nPerm.\nCombined\nData\nnon-conﬂicting ER+\nany\nyes\nPSPACE-complete AC0\nUB: [8]\nUB: [9]\nnon-conﬂicting ER+\ni\nany\nno\nNP-complete\nAC0\nLB: [10]\nUB: [9]\nnon-conﬂicting ER+\nB bounded\nyes\nNP-complete\nAC0\nUB: [8] LB: [10]\nUB: [9]\nTable 1.1 Summary of complexity results.\n1.1.2 Summary of the Chapter\nWe ﬁrst introduce, in Section 1.3, the ER+ model, and provide a formal semantics\nfor it in terms of a relational representation; that is, each ER+ schema is encoded in a\nrelational schema, plus a set of relational constraints – belonging to the well-known\nclasses of inclusion dependencies and key dependencies. A set of inclusion and key\ndependencies in such a form that it can represent an ER+ schema is called a set of\nconceptual dependencies (CDs). We study different variants of the ER+ model in\nterms of the corresponding (sub)classes of CDs. Our central algorithmic tool is the\nchase [7, 8], widely adopted in the literature in the context of query containment\nand answering under relational constraints.\nIt turns out that ER+ is not ﬁrst-order rewritable. The chief reason for this is the\ninteraction between inclusion dependencies and key dependencies in a set of CDs,\nwhich mirrors the interaction between functional participation constraints and the\nother kinds of constraints in the corresponding ER+ schema. The central (semantic)\nnotion here is then separability, which guarantees a decoupling between inclusion\nand key dependencies in a set of CDs: under a set Σ of separable CDs, answering\na query q on an instance D is equivalent to answering q on D under the inclusion\ndependencies of Σ only. We provide a syntactic condition, in Section 1.4, which\nimplies separability of CDs; we do this by deﬁning non-conﬂicting CDs (and, con-\nsequently, non-conﬂicting ER+ schemata). We show that the aforementioned condi-\ntion is not only sufﬁcient, but also necessary; this way, we do precisely characterize\nthe class of separable ER+ schemata.\nWe provide, in Section 1.5, a complexity analysis of the query answering problem\nfor the following three cases: (i) non-conﬂicting ER+schemata, (ii) non-conﬂicting\nER+schemata with identity permutations, i.e., schemata where every is-a among re-\nlationships has the identity permutation associated to it (non-conﬂicting ER+\ni ), and\n(iii) non-conﬂicting ER+schemata with the arity of relationships bounded by a con-\nstant (non-conﬂicting ER+\nB). Observe that ER+ properly generalizes both ER+\ni and\nER+\nB. The complexity results shown in this chapter are summarized in Table 1.1.\nWhen results in the table are already known from the literature, this is indicated\n(UB and LB stand for upper and lower bound, respectively). Notice that all non-\nconﬂicting variants of ER+ enjoy ﬁrst-order rewritability, which in turn guarantees\nAC0 data complexity.\n",
  "speaker": "SYSTEM",
  "uuid": "1da434a5-ff14-4241-9429-0ebd7636b557"
}