{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 12\nTask 8. Extract terminology and its frequency. The goal is to extract from the \nlist of CQs and their answers a pre-glossary of terms. This pre-glossary of terms is \ndivided in three different parts: terms from the CQs, terms from the CQs’ answers, \nand terms identified as named entities, which are objects. From the requirements in \nthe form of CQs, we extract terminology (names, adjectives and verbs) that will be \nformally represented in the ontology by means of concepts, attributes, relations or \ninstances (in the case of named entities). From the answers to the CQs, we extract \nterminology that could be represented in the ontology as concepts or as instances. \nFrom both CQs and corresponding answers, we extract named entities such as \ncountries or currencies. The output is included in the slots 7a, 7b and 7c of the \ntemplate, respectively. The set of terms with higher appearance frequencies will be \nused later on for searching knowledge-aware resources that could be potentially \nreused in the ontology development. \nThe ontology development team should carry out this task taking as input the list \nof identified CQs and their answers by using terminology extraction techniques and \ntools supporting such techniques. The task output is included in slot 7 of the template. \nThe output in the SEEMP ORSD is shown in Table 5. \nTable 5. SEEMP ORSD Slot 7. \n7 \nPre-Glossary of Terms  \na. Terms from Competency Questions  +  Frequency \nJob Seeker \n \n \n27 \nCV \n \n \n \n 2 \nPersonal Information \n \n 3 \nName \n \n \n \n 4 \nGender  \n \n \n 1 \nBirth date \n \n \n 1 \nAddress  \n \n \n 1 \nNationality \n \n \n 1 \nContact (phone, fax, mail) \n \n 3 \nObjective  \n \n \n 3 \nJob Category \n \n \n 3 \n... \nb. Terms from Answers  +  Frequency \nSW engineer, programmer \n \n 5 \nBritish, Spanish, Italian, French \n 1 \nAutonomous, Seasonal Job,  \n 2 \nBasic education, Higher education \n 1 \nResearch, Financial, Education \n 4 \n1 year, 2 years, 3 years \n \n 1 \n3000 Euros per month \n \n 1 \nCEFRIEL Research Company \n 1 \nc. Objects \nAndorra, Angola, Argentina, Australia, Bolivia, France, Italy, Malta, Spain, etc. \nEuro, Zloty, Great British Pound, US Dollar, Peso, etc. \nCEFRIEL, ATOS, etc. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "1de187c5-45b6-4d13-9a0a-0dc18ecbb53d"
}