{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 18\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11167\nArtículo 35.  Pago de las ayudas.\n1.  Durante el periodo de beca, el pago de la misma a los investigadores beneficiarios \nse realizará mensualmente, en función del número de días que el personal investigador en \nformación esté de alta, considerándose en todos los casos meses de 30 días, y de acuerdo \ncon el cumplimiento de las instrucciones que establezca en su caso la Subdirección \nGeneral de Formación e Incorporación de Investigadores.\nLa dotación de la beca será abonada a mes vencido directamente por el Ministerio de \nCiencia e Innovación a los beneficiarios, realizándose el primer pago a partir del primer día \ndel mes siguiente a la fecha de recepción en la Subdirección General de Formación e \nIncorporación de Investigadores del certificado de incorporación, independientemente de \nlos atrasos que le corresponda recibir al becario.\n2.  El importe de las ayudas correspondiente a la fase de contrato se librará por \nanticipado a los Centros de I+D, a los que se exime de la constitución de garantías. Los \nrendimientos financieros que se pudieran generar por los fondos librados por anticipado a \nlos beneficiarios no incrementarán el importe de la ayuda concedida.\nEl Ministerio de Ciencia e Innovación transferirá anualmente a los Centros de I+D la \ncuantía que corresponda, en función del número de investigadores en formación \nincorporados a los mismos.\nEl pago de la ayuda correspondiente a la primera anualidad del contrato, se efectuará \nal finalizar la fase de beca, condicionado a la recepción y valoración positiva del informe \nde seguimiento de los primeros 24 meses regulado en el artículo 37.2.a) y previa \npresentación del contrato cuya celebración se incentiva. El pago de la anualidad siguiente \nse efectuará al finalizar la anualidad anterior, condicionado a la recepción de la memoria \nde actuación económica referida en el artículo 36 y su valoración positiva.\nPara el caso de inicio de la fase de contrato en día distinto al primero de mes, se \ncalcularán los importes de los meses incompletos sobre la base de meses de 30 días.\nLos Centros de I+D beneficiarios realizarán en su caso las correspondientes retenciones \na cuenta e ingresos por los pagos que realicen al personal investigador en formación.\nCon anterioridad al pago de cada anualidad, los Centros de I+D beneficiarios deberán \npresentar declaraciones responsables de encontrarse al corriente en sus obligaciones \ntributarias y frente a la Seguridad Social, así como en el pago de obligaciones por \nreintegro.\nEn caso de interrupciones del cómputo de la ayuda en la fase de contrato, conforme a \nlo dispuesto en el artículo 21.2, en ningún caso conllevará un aumento de la ayuda \nconcedida inicialmente, resultando el importe de la cuota patronal de la seguridad social \ncorrespondiente al periodo prolongado por cuenta del centro de adscripción.\n3.  En el caso de cambio de Centro de I+D durante la fase de contrato, el centro \ninicialmente beneficiario deberá transferir al nuevo centro receptor la cantidad destinada a \nla financiación del coste de contratación del investigador que no hubiera gastado, de forma \nproporcional en el tiempo, en la fecha de rescisión del contrato del investigador. La ayuda \ncorrespondiente a la siguiente anualidad, si procediera, sería abonada al nuevo centro \nreceptor.\nArtículo 36.  Justificación de las ayudas en la fase de contrato.\n1.  La justificación de las ayudas se realizará por los Centros de I+D de adscripción \nde las ayudas de acuerdo con lo establecido en el artículo 30 de la Ley 38/2003, General \nde Subvenciones, según las disposiciones que sobre seguimiento y justificación económica \nse establecen en esta resolución y en la resolución de concesión así como a las instrucciones \nque establezca la Subdirección General de Formación e Incorporación de Investigadores \ny, en su caso, según lo establecido en la normativa aplicable a la cofinanciación de los \nfondos estructurales de la Unión Europea.\nLa justificación de las ayudas se realizará mediante cuenta justificativa que, haciendo \nuso de la facultad otorgada por el artículo 72.3 del Real Decreto 887/2006, de 21 de julio, \npor el que se aprueba el Reglamento de la Ley 38/2003, de 17 de noviembre, General de \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "1de8107a-2248-4167-8cba-8f1d0440ee3c"
}