{
  "message": "SYSTEM: Resoluci%C3%B3n_de_3_de_junio_de_1991%2C_de_la_UPM_por_la_que_se_acuerda_la_publicaci%C3%B3n_del_Reglamento_de_Becarios_de_dicha_Universidad.pdf: Página 3\n22522\nViernes 5 julio 1991\nBOE núm. 160\nconcretos Que complementen los conocimientos a que se contraen las\nmaterias objeto de las bolsas y ayudas de carácter general y tiendan a la\naproximación de los estudiantes a la práctIca profesional y al inicio en\nla metodologia práctica de la investigación.\nTambién podrán tener por objeto el auxilio a situaciones excepciona-\nles de carácter individualizado. pudiendo consistir en la exención del\nabono de tasas académicas.\nArt. 15.\nl.\nDichas bolsas y ayudas podran ser dotadas por Entida-\ndes públicas o privadas, por la Universidad Politccnica de r....ladnd. a\nPetlción de las Escuelas, Facultades. Departamentos o Institutos de la\nmisma, y por personas t1sicas o juridicas. Las becas. bolsas y ayudas\npodrán llevar el nombre de quien las haya dotado. o de una persona\nfisica o jurídica relevante histórica. cientifica, tecnológlCa o socialmente.\n1.\nLas condiciones de ajduciación de las bolsas y ayudas serán las\nque consten en el correspondiente convenio, en tanto no resulten\ncontrarias al orden público, o, en su defecto, las que acuerde el\nRectorado de la Universidad, debiendo atenderse, en todo caso, a las\nsiguientes prevenciones:\na)\nNo podrá hacerse efectiva cantidad alguna en tanto no exista\ndot4:lción presupuestaria. en los créditos correspondientes al Rectorado.\nb)\nEn ningún caso podrá hacerse reconocimiento de derechos en\nfavor de los becarios sin que esté autorizado y suscrito el correspon-\ndiente convenio. aunque, en su caso, podrán retrotraerse los efectos\neconómicos y administrativos de la beca a la fecha de su firma.\nc) .La cuantía individualizada de la bolsa o ayuda se señalará por\nel Rectorado siguiendo los criterios señalados por la Junta de Gobierno\nde la Universidad Politécnica de Madrid, o por los concedentes, en el\ncaso de no ser órganos de ésta.\n, En la adjudicación de las bolsas y ayudas se ~rantizaráel respeto a\nlos principios constitucionales de igualdad, ménto y capacidad.\nCAPITULO V\nBolsas y Ayudas al estudio para Programas de Cooperación Educativa\nArt. 16.\nEl Rectorado de la Universidad Politécnica de Madrid, los\nDirectores y Decano de las Escuelas y Facultades, y los Directores de\nCursos de Especialización, podrán suscribir, por delegación del Rector,\nconvenios con Empresas para la realización de Programas de Coopera-\nción Educativa en los Que se concierte la participación con la Universi-\ndad en la preparación espccialiUlda y práctIca reqü-::idas para la\nformación de los alumnos, a fin de reforzarla en las áreas operativas de\nlas Empresas. para conseguir profesionales con una visión real de los\nproblemas y sus interrelaciones, preparando su incorporación ful1ura al\ntrabajo.\nDichos convenios deberán ser notificados, tras su firma. al Recto-\nrado, y, si en el plazo de un mes no se realiza ninguna modificación,\nentrarán en vigor y se procederá a su inscripción en el Registro de\nPrograma de Cooperación Educativa que se creará al efecto.\nArt. 17.\nLos programas habrán de ser elaborados de forma que\nasegure una dedicación a los estudios y actividades de las Empresas, con\nuna duración que no exceda del 50 por 100 del tlempo íntegro que\nconstituye el curso académico. o como complemento práctICO del\nmismo.\nArt. 18.\nEn el correspondiente convenio podrá preverse. en su caso,\nla aportación por las Empresas de una cantidad en concepto de bolsa o\nayuda al estudio, al igual que su periodicidad y cuantias temporales, Que\nserjn satisfechas en la forma que se determine.\nArt. 19.\nLos Programas de Cooperación Educativa podran reali-\nz::¡rse cn los locales de las Empresas correspondientes o en los de la\nUniversidad Politécnica de l\\Iadrid. segun se determine en el correspon~\ndiente convenio.\nArt. 20.\nCuando, en aplicación de los correspondientes Programas\nde Cooperación Educativa. no se reserve el derecho a sdeccionar los\nbecarlOS la Entidad que suscnba el coO\\:enio con la Universidad\nPolitécnica de Madrid, los beneficiarios de los mismos deberán estar\ninscritos en el Registro de candidatos a la concesión de bel'as. y seran\npropuL'stos por la Dirección de la Escuela o facultad, o la del Curso de\nEspecialización, qUl' asumen las competencias cstablendas para las\nRt'laciones Universidad-Empresa a que hace referencia el artículo 4 del\nReal Decreto 1497/1981. de 19 de junio.\nArL 21.\nLa participación de un Empresa en un programa no\nsupondrán la adquisición de más compromisos que los estipulados en el\nconvenio. y en ningtin caso. se dcnvarán obligaciones propias de un\ncontrato labor;;¡l.\nSin perjuicio de ellos, las correspondientes Empresas deberán exten-\nder. al ¡inalizar el programa. independientemente del titulo académiCO\nque obtenga el alumno. una certificación con mención expresa del nivel\nalcanzado en su evaluacion total dentro de la Empresa. con indicación\ndc la especialidad a la que ha estado orientada su torma(Íón.\nArt. 22.\nEs incompatible la participación en más de un Programa\ndc Cooperación Educativa, simultáneamente.\nSe tenderá a fomentar la mayor participación del alumnado que así\nlo quiera en los Programas de Cooperacion Educativa.\nCAPITULO VI\nHomologación del titulo de becarios con carJto a Progamas financiados\npor Organismos supranacionales\nArt. n.\nEl Rectorado de la Universidad Politécnica de Madrid\nexpedirá sus propias credenciales para los becarios de Programas\nfinanciados por organismos supranacionales, mediante las que homolo-\ngara su condición de becano, con los mIsmos derechos y deberes que los\npropios de la UniverSidad.\nCAPITULO VII\nNormas procedimentales\nArt. 24.\nlos firmantes de convenías, contratos o Programas, los\nDirectores de Cursos de Especialización o los investigadores principales.\na los que se ha hecho referencia en los artículos que preceden,\npropondrán los correspondientes becarios en el documento que se\nadiciona como anexo 1a este Reglamento. contando, en su caso, con su\naceptación, adjuntándose al ·mismo un breve informe sobre las situacio-\nnes a que se refiere el artículo 14 de este Reglamento o la adecuación del\ncandidato o becario a la actividad objeto de la beca (anexos II y IJI), así\ncomo el tipo de dedicación y la cuantia y periodicidad de la ayuda a la\nque éste tendrá derecho, sin perjuicio de lo establecido en el artículo 4.°\ndel presente Reglamento.\nIgualmente se hará constar su matriculación, el estar cursando\nestudios, o se aportará fotocopia compulsada del título acedémico\ncorrespondiente, o del documento acreditativo del abono de los dere-\nchos para la expedición del título.\nPara los estudiantes de la Universidad Politécnica de Madrid bastara\nla comprobación de tales circunstancias en sus propios archivos.\nTambién se adjuntará, en su caso, currículum vitae resumido del\ninteresado, igual que fotocopia de su documento nacional de identidad\no pasaporte, declaración jurada de no realizar actividad sujeta a\nincompatibilidad o de la actividad compatibilizable con la precepción de\nla beca o ayuda, con declaración de los datos personales y bancarios, y\ndeclaración individualizada de aceptación de la beca, caso de que ésta\nse concediere (anexo IV), todo ello con nrreglo a los formularios que se\nadicionan al presente Reglamento.\nEl Rector de la Universidad Politécnica de Madrid, a propuesta del\nórgano correspondiente, nombrará al becario de entre los alumnos\ninscritos en el Registro de candidntos a becas que mejor se adecuen a las\ncondiciones determinadas en el informe o en la propuesta correspon-\ndiente. En ella se hará constar que el candidato está inscrito en el\nRegistro, garantizando el proponente el cumplimiento de los prinicios\nconstitucionales de igualdad, mérito y capacidad. en la selección del\ncandidato.\n.\nArt. 25.\nA los candidatos designados se les extenderá una credencial\nde becario. en los términos Que constan en el anexo V al presente\nReglamcnto, inscribiéndose esta en los correspondientes Registros de\nbecarios de la Universidad Politécnica de Madrid.\nEl becario sólo tendra derecho a las percepciones expresamente\nrecogidas en su credencial, yen tanto no excedan de las correspondientes\ndisponibilidades presupuestarias.\nArt.\n~6.\nLos becarios de la Universidad Polikcnica de Madrid\ngozarán del seguro escolar. en los términos establecidos por la legislación\nvigente. y. ('n cu caso, al seguro de accidentes que corresponda. en\ncalidad de bcncJiciarios por la póliza suscrita por la Universidad\nPolitécnica de Madrid, en las cuantías en que cada caso correspondan.\nque scrjn las proporcionales en el tiempo de dedicación a la actividad.\nlos costes de aseguramiento correrán con cargo a c<.lda convenio o\ncontrato concrdo.\nArt.27.\nJ.\nEn cada Escuela o Facultad de la Universidad\nPolitec~\n!liea de Madrid habrá un Rcgistro dc candidatos a bolsas y ayudas al\nestudio para Programas de Cooperación Educativa. en los que podrán\ninscribirse los alumnos de la misma que lo deseen. que adjuntarán su\ncurrículum vitae. En dicho Registro se anotarán las credenciales de las\nbolsns\n~ ayudas conccdidas, y el sujeto que las pefCIba.\n.\n1.\nEn la oficina de tranlcrencias dc tecnologia habra un Registro de\nbecarios de convenios. conlratos y proyectos de investigaCión cienlifica.\nt':cnica y artístiCJ. en el que constarán las credenciales de las becas\nconcedidas.\n3.\nEn el Vicerrectorado responsable de la investigación habrá un\nRegistro de becarios para la formación de personal docente: en el que\nconstaran las occns ('oncedldas, v las correspondientes mcidencHls\nindividuales de sus bencliciarios,\n.\nArt. 28.\nl.\nLas adjudicaciones de todo tipo de b('cas podrán ser\nrevisadas por el Rectorado de la Universidad Politécnica de Madrid,\nmcdiGnte expediente contmdictorio. cuya resolución podrú dar lugar J\nla p0rdida del derecho a la misma. a la devolución de las cantidades\nindebidamente percibidas y a la suspensión temporal de los derechos de\nregistro. antes Citados. cualquit'ra qlle s('a la éptKa en .que hubiere SIdo\ndisfrutada. y dentro del periodo legal de preSCripCiÓn, en los supuestos\nl.'n que hubiere concurrido ocultación. falseamiento de datos. o cualquier\notra infracción del ordenamIento juridico.\n",
  "speaker": "SYSTEM",
  "uuid": "1f238249-d3db-43a5-b006-6d59350ca912"
}