{
  "message": "SYSTEM: Wiki: The Unit for Natural Language Processing (\nhttp://nlp.deri.ie\n) and the eBusiness Unit (\nhttp://deb.deri.ie\n) at the Digital Enterprise Research Institute (\nhttp://www.deri.ie\n) of the National University of Ireland, Galway invite applications for a PhD position in Cross-Lingual Ontology-based Information Extraction.\nDERI is a leading research institute in semantic technologies that offers a stimulating, dynamic and multi-cultural research environment, excellent ties to research-groups worldwide, close collaboration with industrial partners and up-to-date infrastructure and resources. The Unit for Natural Language Processing  has a focus on applied research in ontology-based information extraction, semantic-level text mining and the use of linguistic and semantic methods in information retrieval. The eBusiness Unit develops methods that support the application of semantics to business information systems in the areas of content analytics, uncovering and extracting meaning from business information and the development of provenance based trust for business information integration.\nThe PhD position will be in the context of the EU funded project Monnet on 'Multilingual Ontologies for Networked Knowledge':\nhttp://www.monnet-project.eu\nCandidates should have an excellent university degree in a relevant field of study, e.g. computer science, computational linguistics, information science, with an emphasis on natural language processing and preferably with a specific interest in information extraction, ontologies, semantics, and multilingual applications. Familiarity with machine learning methods would be an advantage.\nPlease send your application (CV, cover letter) in PDF format to 'paul dot buitelaar at deri dot org' - by July 5th 2010\nFurther details can be obtained from:\nDr. Paul Buitelaar -\nhttp://www.paulbuitelaar.net/\nUnit for Natural Language Processing DERI - National University of Ireland, Galway\nand/or\nSean O'Riain -\nhttp://www.deri.ie/about/team/member/sean_o'riain/\neBusiness Unit\nDERI - National University of Ireland, Galway",
  "speaker": "SYSTEM",
  "uuid": "1f417d56-7cac-49dc-bf53-1cdaa56f53bf"
}