{
  "message": "SYSTEM: OEG_submission_SSN2014.pdf: Página 6\n4.4\nTransforming a static dataset into a RDF data stream\nMorph-streams allows deﬁning R2RML mappings to convert event objects into\nRDF observations. In this case, we created a R2RML mapping based on the ob-\nservation model described above.13 To test the RDF streaming we forked morph-\nweb, a demonstrator of morph-streams, and added a new CSV data source.14\nAs a result, earthquake observations are emitted periodically and can be queried\nusing SPARQLStream. The dataset in Turtle format is also available online.15\nTo have a more accurate simulation, we will implement a CSV pusher that\nadapts the emission time for each row according to the earthquake timestamp\nand the total demo time. For instance, for a demo of 12 minutes using the 2013\nearthquakes dataset, we will have during the ninth and tenth minutes (corre-\nsponding to September and October) a higher rate of earthquakes in Castell´on.\n5\nOpen Questions and Next Steps\nRDF stream processing is a relevant and emerging area of interest that calls for\na solution to i) serve continuous queries in near real-time and ii) deal with the\ncomplexities of Big Data, i.e. heterogeneity of sources, domains, and ﬂow rates.\nWe are active participants of the W3Cs RDF Stream Processing group, where\nadvances in the ﬁeld are discussed.16 In this work, we show preliminary steps on\nthe treatment of a static sensor dataset to be tested in a RDF stream processing\nengine.\nNext steps will address the design of an adaptive approach to process RDF\nstreams. These are some of the questions that we are working on to continue\nthis research line:\n– What is the best method to detect spatio-temporal clusters in a stream\nprocessing scenario? This information may be useful to design more eﬃcient\nAQP algorithms.\n– Are there implicit features of Linked Sensor Data that make its processing\nmore parallelizable? Can this be used to implement optimized query opera-\ntors for stream processing?\n– Is RDF compression [9,10] a proper solution to alleviate data transmission\nrates in a Sensor Web scenario?\nFor future work, we will also apply the results of this research to other do-\nmains, such as public transport monitoring or credit card transactions. In these\nscenarios, the volume of data is higher and the data generation is more frequent.\n13 https://github.com/allaves/morph-web/blob/master/sparqlstream-\nweb/conf/mappings/earthquakes.ttl\n14 Source code available at https://github.com/allaves/morph-web.\n15 https://www.dropbox.com/s/cypbyj6hynf0d62/Earthquakes-Spain-2013.ttl\n16 http://www.w3.org/community/rsp/\n",
  "speaker": "SYSTEM",
  "uuid": "20236440-a684-43cb-8d7f-778f946a7f5d"
}