{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Ljubljanafeb2011 \n\nLooking for a junior data integration engineer\nBackground knowledge is essential when trying to understand text, especially in the chaotic world of on-line publishing, blogs, tweets and social networks. Zemanta uses a large knowledge database to collect data on people and things the web writes about and from which our natural language processing routines can learn and suggest content to bloggers.\nKeeping this repository up to date with numerous sources from around the world is an exciting and challenging task and we want to expand our team with a junior engineer to work in this field.\nExpect to be:\n* integrating databases from our partners using Google Refine and Freebase,\n   * working on automatic reconciliation of entities, fusion of datasets, schema alignment,\n   * linking Open Data,\n   * crawling web APIs and an occasional screen-scrape,\n   * learning about existing cutting-edge tools, open source or proprietary, enhancing them and creating new ones,\n   * being ambushed by data, from Excel sheets to multi-million-row SQL databases,\n   * making best-effort compromises in an imperfect world\nYou should have experience in software development and knowing Python, Django, SQL, Unix shell programming or Java is a plus. Enjoy working with other people to solve complex challenges and are self-reliant the rest of the time\nWhat we offer is an ability to work on an exciting global project, growing your knowledge and experience by competing with other global tech companies, some stress and adrenalin, flexible schedule, competitive pay, team of bright peers and cutting edge tech.\nLocation is Ljubljana, Slovenia. We’re accepting candidates from outside Slovenia also – in this case you’d need to come here for a longer immersion period or drive to Ljubljana once to twice a week. Start date is March or April.\nWe’re expecting applications in English language. You should send a short CV and explain persuasively why we should hire you. We’re especially interested in your hobby, student or open source side projects. E-mail us at jobs@zemanta.com.\nLink:\nhttp://www.zemanta.com/blog/looking-for-a-junior-data-integration-engineer/",
  "speaker": "SYSTEM",
  "uuid": "203e2c22-e227-4c39-9a34-95cc9c371183"
}