{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle DC1: \"Physical design of Knowledge Graphs\".\n- Description DC1: A día de hoy existen infinidad de datasets almacenados en bases de datos relaciones. En el contexto de la creación de Knowledge Graphs se ha propuesto la transformación de los datos de esas RDB a RDF pero también la traducción de las consultas de SPARQL a SQL. Se ha demostrado que en un contexto de federación de consultas,  dependiendo del tipo de subquery generado, la ejecución sobre RDB es más eficiente que sobre el RDF generado y viceversa. El objetivo de este proyecto es la aplicación de técnicas de Machine Learning en un contexto de consultas federadas para, en base a las descripciones de las fuentes de un Knowledge Graph (RDF-MT), decidir que partes deben ser transformadas a RDF y que partes deben mantenerse en la base de datos para la ejecución eficiente de consultas SPARQL.\n- Funding schema: perhaps SPRINT\nTitle DC2: \"SPARQL 1.1 in SPARQL-to-SQL translations\".\n- Description DC2: El objetivo de este proyecto es la mejora en la traducción de consultas SPARQL-to-SQL de la herramienta morph-RDB. Este software, capaz de crear un Knowledge Graph Virtual sobre una base de datos relacional utilizando el lenguaje de mapping R2RML, no tiene en cuenta todos los operadores existentes de SPARQL en su última versión. El fin es formalizar e implementar la traducción de estos operadores de SPARQL a SQL e integrarlo en el desarrollo actual de la herramienta.\n- Funding schema: not funded\nTitle DC3: \"Virtual Knowledge Graph Access over Open Data\"\n- Description DC2: El objetivo de este proyecto la creación de una capa virtual de consultas con SPARQL sobre los datos abiertos en bruto (CSV, JSON, XML) de diversas fuentes (e.g. ayuntamientos, transporte, biología). Para ello, se deberá extender y formalizar la traducción de consultas en SPARQL haciendo uso de reglas de mappeo a comandos en bash, para generar unos resultados de forma eficiente.\n- Funding schema: not funded\nAhmad Alobaid\n\nTitle AA1: \"Online R2RML Mapping Editor\".\n- Description AA1: Writing Mappings to represent heterogenous tabular data is cumbersome, it is time consuming and subject to human errors. Some efforts in the semantic web community to generate such mapping in a (semi-)automatic way are still on early stages (experimental). Even though they can be used to generate mappings, they are not designed to include editing functionalities. This is the technological problem to be addressed in this work. The OEG group developed a simple prototype of a mapping editor without this editing functionality\nOME\n. It is also important to support autocomplete of concepts and properties from general ontologies (currently schema.org is supported) and user defined ontologies. It would be a very good advantage to have it online without any required plugins. Also including a way to use automatic semantic labeling systems (via APIs) like TADA, Karma, .. etc. would be very beneficial.\nTitle AA2: \"Semantic Reality\".\n- Description AA2: The idea is to represent the world semantically. To have a video camera that record everything. This feed will go into a system which identify objects. The objects are represented using semantic concepts. Then, the positioning of these objects will also be represented using ontologies.\nPablo Calleja - Patricia Martín\n\nTitle PP1: \"Improving Spanish and English terminology extraction processes over massive documents using distributed computation\".\n- Description PP1: El objetivo del proyecto es mejorar una herramienta de extracción terminológica desarrollada sobre Solr, implementar nuevas técnicas de extracción de terminología y mejorar su interfaz. Actualmente, la herramienta no explota las propiedades de Solr para realizar computación distribuida para trabajar con grandes volúmenes de documentos de forma ágil. De la misma forma, la extracción de términos sobre documentos en español ha de ser mejorada con nuevos modelos actuales: mejorar la precisión de las herramientas  mediante la creación de una aplicación de refinamiento con ténicas de procesamiento natural.\n- Funding schema: not funding available so far (but will be necessary in current european projects or others that will come)",
  "speaker": "SYSTEM",
  "uuid": "2105e31d-c45b-4a45-8d0b-f591af49d25a"
}