{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 74\nPage 74 of 124\nNeOn Integrated Project EU-IST-027595\nChapter 5\nMethods for Re-engineering Thesauri\n5.1\nIntroduction\nA thesaurus represents the knowledge of a domain with a collection of terms and a limited set of relations\nbetween them. Thesauri are the most valuable input for creating, at reasonable cost, ontologies in many\ndomains. They contain, readily available, a wealth of category deﬁnitions plus a hierarchy, and they reﬂect\nsome degree of community consensus [HdB07]. In this chapter we present a deﬁnition of thesauri, the\nexisting standards for thesauri, the data models for representing thesauri and the method for re-engineering\nthesauri into ontologies. Although we recognize that multilinguality is an important and complicating factor in\nthesaurus conversion, it is no treated in this deliverable.\n5.2\nThesaurus Standards\nIn the ﬁeld of thesaurus development there are several standards. These standards also provide some\nguidelines about how the thesaurus should be structured. Figure 5.1, taken from [Lab07], depicts the the-\nsaurus standards evolution. The ISO 2788:1986 standard is the seed of the rest of the standards. The ISO\n5964:1985 extends the scope of the ISO 2788:1986 adding a multilingual context. The ANSI/NISO Z39.19-\n2003 adds management guidelines to principles of monolingual thesauri. The ANSI/NISO Z39.19-2003 was\nsuperseded by ANSI/NISO Z39.19-2005. The BS 8723-1:2005 and BS 8723-2:2005 are the british version\nof the ISO 2788.\nIn the following we brieﬂy describe the most important thesaurus standards.\n• ISO 2788:1986, guidelines for the establishment and development of monolingual thesauri [ISO86].\nThis standard covers some aspects of the selection of indexing terms, the procedures for the control of\nthe vocabulary, and speciﬁcally, the way of establishing relationships among these terms (particularly\nthose relations that are used, a priori, in the thesauri), as well as the inclusion and suppression of\nterms, the methods of compilation, the form and the content of the thesauri, the use of automatic\ndata processing, etc. The indications established in this standard ensure the uniformity of each of the\nindexing areas or entities. The techniques described by the standard are based on general principles\nthat can be applicable to any kind of subject.\n• ISO 5964:1985, guidelines for the establishment and development of multilingual thesauri [ISO85].\nThe guidelines given in this International Standard should be used in conjunction with ISO 2788, and\nregarded as an extension of the scope of the monolingual guidelines. The majority of procedures and\nrecommendations contained in ISO 2788 are equally valid for a multilingual thesaurus. This applies\nparticularly to general procedures, for example, the forms of terms, the basic thesauri relationships, and\nmanagement operations such a evaluation and maintenance. Distinction is made between preferred\nterms and non-preferred terms.\n",
  "speaker": "SYSTEM",
  "uuid": "2106b23a-0557-4f3c-87fe-0e24884ae382"
}