{
  "message": "SYSTEM: Cicyt_Vilches.pdf: Página 5\n \n \nTítulo del proyecto: Investigación y aplicación de resultados sobre el descubrimiento y explotación de correspondencias \n(mappings) entre fuentes de información heterogéneas, desarrollo de heurísticas de detección de instancias y \nasesoramiento en ISO/TC 211 (P071015357) \n \nEntidad financiadora: Dirección General del Instituto Geográfico Nacional. \nEntidades participantes: Instituto Geográfico Nacional, Universidad Politécnica de Madrid (Ontology Engineering Group) \nDuración,  desde: 2008 \n \nhasta: 2008 \n \nCuantía de la subvención: 73.000 € \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:     \n \n \nTítulo del proyecto: GeoBuddies: Anotación semántica colaborativa con dispositivos móviles en el Camino de Santiago \n(TSI2007-65677-C02-01) \n \nEntidad financiadora: Ministerio de Educación y Ciencia \nEntidades participantes: Universidad Politécnica de Madrid, Universidad de Santiago de Compostela \nDuración,  desde: 01-10-2007 \n \nhasta: 03-08-2010  \nCuantía de la subvención: 151.250 € (UPM) \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: +10 \n \n \nTítulo del proyecto: Investigación y desarrollo de una ontología global que permita aunar la clasificación de fenómenos \ngeográficos recogidos en diferentes catálogos (P071015357) \n \nEntidad financiadora: Dirección General del Instituto Geográfico Nacional \nEntidades participantes: Instituto Geográfico Nacional, Universidad Politécnica de Madrid (Ontology Engineering Group) \nDuración,  desde: 01/01/2007 \n \nhasta: 31/12/2007        \nCuantía de la subvención: 55.000 € \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:     \n \n \nTítulo del proyecto: Discovering our Past World with Digitised Maps (DIGMAP) (P07-6005-691A) \n \nEntidad financiadora: eContentPlus-2005-CULT-038042 \nEntidades participantes: Universidad Politécnica de Madrid, IST – Instituto Superior Técnico (Portugal), BNP - National \nLibrary of Portugal (Portugal), KBR – Royal Library of Belgium (Belgium), BNCF – Biblioteca Nazionale Centrale di Firenze \n(Italy), NLE – National Library of Estonia (Estonia), IMI - Institute of Mathematics and Informatics of the Bulgarian Academy \nof Sciences (Bulgaria). \nDuración,  desde: 01/10/2006 \n \nhasta: 31/12/2008                   \nCuantía de la subvención: 949.009 € (Total)  162.104 € (UPM) \nInvestigador responsable: José Borbinha (IST. Portugal)     Responsable UPM: Miguel Ángel Bernabé Poveda \nNúmero de investigadores participantes: 100 \n \n \nTítulo del proyecto: IDEDES. Evaluación y potenciación del papel de las Infraestructuras de Datos Espaciales en el \ndesarrollo sostenible en América Latina y el Caribe (606PI0294) \n \nEntidad financiadora: CYTED (Programa Iberoamericano de Ciencia y Tecnología para el Desarrollo) \nEntidades participantes: IGEOPAT, UNPA, IGAC, IDERC-ONI, CETDIR, IGM-GITB, UPM, IGN, CIC-IPN, CENTIA, DNT-\nMTOP, TDM, BGE, SIG-Forestal, Mat. Aplicada CUJAE, IGP. \nDuración,  desde: 01/01/2006 \nhasta: 31/12/2009  \nCuantía de la subvención: 200.000  € \nInvestigador responsable: Tatiana Delgado \nNúmero de investigadores participantes: +50 \n \n",
  "speaker": "SYSTEM",
  "uuid": "22dc0406-3d82-4e42-982d-8a1a84b5e589"
}