{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 96\nPage 96 of 124\nNeOn Integrated Project EU-IST-027595\nincluded in the semantic enrichment process. This is done in two sub-steps.\nSUB-STEP 1.1: The Lexical Isolation\nThis sub-step identiﬁes sets of tags that should be excluded as well as those that can be further processed.\nCurrently we isolate and exclude all tags with numbers, special characters and non English tags. The reason\nfor excluding non-English tags is that our method explores various external knowledge sources (WordNet,\nSemantic Web ontologies) that are primarily in English. As future work, we will extend FLOR to isolate\nadditional types of tags as well and deal with non-English tags.\nSUB-STEP 1.2: The Lexical Normalisation\nThis sub-step aims to solve the incompatibility between different naming conventions used in folksonomies,\nontologies and other lexical databases, such as WordNet. This phase produces a list of possible Lexical\nRepresentations for each tag aiming to maximise the coverage of this tag by different resources. For ex-\nample, the compound tag santabarbara in folksonomies appears as Santa-Barbara or Santa+Barbara in\nvarious ontologies and as Santa Barbara in WordNet. However, as the lexical anchoring to these resources\nis a quite complex problem, we try to address it by producing all the possible lexical representations for each\ntag such as: {santaBarbara, santa.barbara, santa_barbara, santa barbara, santa-barbara, santa+barbara,\n...}.\n6.1.2\nSTEP 2: Sense Deﬁnition and Semantic Expansion\nDue to polysemy, the same tag can have different meanings in different contexts. For example, the tag\njaguar can describe either a car or an animal depending on the context in which it appears.\nBefore\nconnecting a tag with a relevant SWE, it is important to determine its intended sense in the given context.\nThis task is performed in the ﬁrst sub-step, which is the Sense Deﬁnition and Disambiguation sub-step.\nAnother issue to take into account is that, despite its signiﬁcant growth, the Semantic Web is still sparse. A\ndirect implication is that while online ontologies might not contain concepts that are syntactically equivalent\nto a given tag, they might contain concepts that are labeled with one of its synonyms. To overcome this\nlimitation, we perform a semantic expansion for each tag, based on its previously identiﬁed sense, in the\nsecond sub-step.\nSUB-STEP 2.1: The Sense Deﬁnition and Disambiguation\nThis sub-step discovers the intended sense of a tag in the context it appears. As context we consider the\nset of tags with which the given tag co-occurs when describing a resource. For example, in the tagset:\n{panther, jaguar, jungle, wild} the context of jaguar is {panther, jungle, wild}. We use\nWordNet as a sense repository and rely on its hierarchy of senses to compute the similarities between the\nsenses of all tags in the tagset and thus achieve their disambiguation. WordNet also provides rich sense\ndeﬁnitions which facilitate the semantic expansion in the next sub-step.\nTo deﬁne the senses of the tags in a tagset, we identify all the lexical representations for each tag in WordNet.\nIn the cases that a tag has more than one senses in WordNet (synsets) we exploit the contextual information\nof the tagset to identify the most relevant sense. For this, we calculate the similarity between all the com-\nbinations of tags in the tagset using the Wu and Palmer similarity formula ([WP94]) on the WordNet graph.\nThe similarity degree between two senses is calculated based on the number of common ancestors between\nthem in the WordNet hierarchy and the length of their connecting path. The result for each calculation is a\ncouple of senses and a similarity degree for these senses. We select the two senses of the tags that return\nthe highest similarity degree provided that this is higher than a speciﬁed threshold. If a tag has low similarities\nwhen compared to all the other tags in its cluster, then it is assigned to the most popular WordNet sense.\n",
  "speaker": "SYSTEM",
  "uuid": "22e65327-93a2-4a6f-ad78-596a87403c98"
}