{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 14\n14\nMariano Rico, Óscar Corcho et al.\nWe o\u001ber distributed RDF query support to facilitate search across homes\nfor multimedia resources according to simple or complex query patterns, what\nadvances the type of searches that can be performed in current systems.\nConcerning our Control Point, the experimental measures with end users\nshow reasonable values for usability and user satisfaction, although aspects such\nas online help, documentation, or response time must be improved in a produc-\ntion environment.\nFuture work will deal with some of the extensions that we have provided and\nthe addition of new functionalities. One of them is related to the evaluation of\nthe quality of metadata provided by users. It is well known that annotations\nprovided by users are usually of low quality, and we have tried to minimize this\nby providing linking facilities to the Web of Data so that users can easily add\nannotations based on existing data. However, using data from the Web of Data\ndoes not ensure high quality either. We consider that an interesting extension,\nfollowing the trends of [9], where the addition of data about where metadata\ncomes from or who provided them, would improve the quality.\nAnother important extension to work on in the future is the provision of\nnatural language search interfaces that can be more easily used by a larger\nnumber of users, taking into account that this tool will be used by people who\nare not aware of semantic technologies or query languages, and may want to go\nbeyond simple keyword searches.\nFinally, further work will be carried out in the management of the lifecy-\ncle of metadata in the distributed system that results from the connection of a\nnetwork of homes. Users can generate and store locally annotations about mul-\ntimedia resources, which are available either at their home devices or in remote\nhome devices. Therefore, policies have to be devised for those situations where a\nmultimedia resource is deleted from a local or remote home device. Should these\nannotations be removed, left available in the system to indicate that at some\npoint in time there was a resource that was annotated like that, or archived?\nCon\u001dicting annotations, provided by di\u001berent persons, or new domain ontologies\nfound and incorporated in the system should also update the existing metadata\naccording to these policies.\n8\nAcknowledgements\nThis work has been funded by the Spanish Government under the AVANZA\nprogram (TSI-020100-2008-202, TSI-020100-2009-0196). The project has been\ndeveloped thanks to the joint e\u001borts of Universidad Politécnica de Madrid, Tele-\nfónica R&D and iSOCO.\nReferences\n1. 3rd Generation Partnership: Group Services and System Aspects. IP Multimedia\nSubsystem, Stage 2, Release 6. Technical speci\u001ccation, Project 3GPP TS23.228\n(July 2005), http://www.3gpp.org/\n",
  "speaker": "SYSTEM",
  "uuid": "2401ee18-4def-4837-b176-1bbde93e3672"
}