{
  "message": "SYSTEM: Wiki: Catalyzing the development of an Open Software Community around corporate greenhouse gas emissions reporting\nProject Sponsor:  Carbon Disclosure Project\nAcademic Contact: Dr. Chris Preist  Computer science, Engineering faculty, University of Bristol\nProject to start: Flexible\nClosing date: Position open until filled\nThe Company\nThe Carbon Disclosure Project (CDP) is an independent not-for-profit organisation that holds the largest database of corporate climate change information in the world, gathered on behalf of institutional investors, purchasing organisations and government bodies.\nThe Project\nThis project will address two linked research challenges:\n1. Computer Systems Engineering:\n* What data-models, semantic web ontologies, middleware tools, analysis techniques and visualisation front-ends can be provided to support the open publication and exchange of corporate climate emissions data, and the developing of an open software community on top of this?\n   * The project will aim to map out the space of options here, and develop prototypes including proto-standards where appropriate. This will support the ‘official’ process of reporting by corporations into various legal jurisdictions around the world and the exchange of data between different official data repositories.\n   * It will also aim to catalyze the ‘unofficial’ use of this data by other stakeholders to build services on top of these. These could include analyst companies interested in risk assessment, NGOs interested in measuring the relative performance of companies against each other, and press organisations researching data for news stories.\n2. Sociotechnical Systems Thinking:\n* How can this infrastructure be developed in such a way as to meet the objectives of the Carbon Disclosure Project: to encourage active reduction in GHG emissions by the corporate world?\n   * What will maximise transparency and active engagement by corporations? This will need balancing the objectives of NGOs, press and individual activists with the sensitivities of the corporate world, and require developing an understanding of the views of both leading and laggard corporate players.\n   * What is the role of proprietary ‘value added’ services versus freely available open services?\n   * To what extent can a profit-oriented market-driven approach bring the software community into being, versus an open press/activist approach?\n   * How can the two interact in a constructive way?\nRequirements on candidates:\nEssential:\nCandidates should have a minimum of an upper second (2.1) class honours degree (or equivalent) in computer science or related discipline;\nAbility to work with different stakeholders to understand their motivations and requirements.\nAbility to express ideas clearly, both in writing and presentation.\nDesirable:\nExperience of programming in XML\nExperience with semantic web technologies such as RDF and OWL\nAn interest in, and knowledge of, corporate climate emissions\nAn interest in systems thinking\nThe project will be based in London and the successful candidate will work with CDP staff to ensure sufficient funds are raised throughout the project period to cover its financial contributions to the project.\nFunding:\nA tax-free EPSRC stipend (£15.090 for 2010/2011) is available for the successful candidate, enhanced by a minimum of £3500 from the Company -sponsor. Tuition fees will also be covered. Standard EPSRC studentship eligibility applies. Please check your eligibility before applying. Non-eligible individuals are welcome to apply, but must be able to find alternative funding.\nApplication process\nPlease contact the IDC in Systems directly with informal enquiries.\nFormal applications have to be made through the University of Bristol Post Graduate admissions on-line system.\nInformation about PG programmes at the University of Bristol and how to apply  is available in the online postgraduate prospectus\nhttp://www.bristol.ac.uk/eng-systems-centre/idc/vacancies/cdp.html",
  "speaker": "SYSTEM",
  "uuid": "2420900e-5c54-450b-be4c-81b73255ff5a"
}