{
  "message": "SYSTEM: HGARCIA_CVA_Proyectos_2016.pdf: Página 1\n \n1 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \n \n \nParte A. DATOS PERSONALES \nNombre y apellidos \nHéctor Andrés García Silva \nDNI/NIE/pasaporte \nX8306512Q \nEdad \n38 \nNúm. identificación del investigador \nResearcher ID \n  \nCódigo Orcid \n  \n \nA.1. Situación profesional actual  \nOrganismo \nUniversidad Politécnica de Madrid  \nDpto./Centro \nGrupo de Ingeniería Ontológica  \nDirección \nDespacho 3204, Escuela Técnica Superior de Ingenieros \nInformáticos (ETSIINF)  \nTeléfono \n 913363670 \ncorreo electrónico Andresgs77@gmail.com \nCategoría profesional \nInvestigador contratado  \nFecha inicio \n01/01/2016 \nEspec. cód. UNESCO \n120304 \nPalabras clave \nWeb Semántica, Natural Language processing, Machine Learning \n \nA.2. Formación académica (título, institución, fecha) \nLicenciatura/Grado/Doctorado \nUniversidad \nAño \nDoctor en Inteligencia Artificial Universidad Politécnica de Madrid  \n2012  \n Máster de Investigación en \ninteligencia artificial \n Universidad Politécnica de Madrid  \n2008  \nIngeniero Informático – título \nhomologado oficialmente \nUniversidad del Valle \n2001  \n \n \nA.3. Indicadores generales de calidad de la producción científica  \nLos datos que se muestran a continuación proceden de Web of Science, como se propone \nen el modelo de curriculum, y de Google Scholar, puesto que en informática una parte de la \nProducción científica corresponde a conferencias, en lugar de revistas. \n• \nCitas totales: 9 (WoS) / 675 (Google Scholar) \n• \nPromedio de citas/año en el periodo 2012-2015: 1.8 citas/año (WoS) / 123.8 (Google \n• \nScholar) \n• \nh-index: 1 (WoS) / 6 (Google Scholar) \n \nParte B. RESUMEN LIBRE DEL CURRÍCULUM  \nAndrés García Silva es doctor en Inteligencia Artificial por la Universidad Politécnica de \nMadrid (UPM).  Actualmente trabaja como investigador contratado en el grupo de Ingeniería \nontológica de la ESTI informáticos de la UPM donde participa en el proyecto CIEN LPS-\nBIGGER financiado por el CEDETI. En el pasado trabajó durante los años 2013 a 2015 \ncomo investigador postdoctoral en el Center for Open Middleware, un centro de tecnología \ncompartido entre la UPM y el banco Santander, en proyectos de transferencia tecnológica \nde sus temas de investigación. Mientras realizaba sus estudios de Máster y Doctorado en \nInteligencia Artificial trabajó  en el grupo de ingeniería ontológica participando en proyectos \nfinanciados por la unión europea (SEEMP y NeON) o por el gobierno de España \n(Geobuddies y España Virtual).  \n \nAndrés recibió una beca de formación de personal investigador FPI del ministerio de ciencia \ny educación para la realización de sus estudios de doctorado. Durante la realización del \ndoctorado realizó diferentes estancias de investigación, con una duración de 3 a 6 meses, \nen la Universidad del Sur de California en Estados Unidos en 2011, la Universidad Libre de \nBerlín en Alemania 2010,  y en la Universidad de Southampon en Inglaterra 2009. Para \ncomplementar su formación realizó una visita al área de investigación y desarrollo de la \ncompañía TimeOut  en Londres Inglaterra en 2011. Además recibió una beca del Banco \nSantander para la realización de sus estudios de Máster en Inteligencia Artificial. Previo a \nlos estudios de postgrado se desempeño durante 5 años como ingeniero de desarrollo, \nFecha del CVA  \n 30/03/2016 \n",
  "speaker": "SYSTEM",
  "uuid": "24caef63-3627-4da9-9194-bb5aa77f5a83"
}