{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 4\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \nComo se puede observar, el precio del parking de larga estancia es notablemente inferior al parking \nnormal, no obstante debemos tener en cuenta en caso de decantarnos por el parking de larga estancia, \nque está situado en la calle de San Severo, es decir, fuera del recinto aeroportuario, de forma que para \nacceder a las distintas terminales habrá que recurrir al servicio de autobús gratuito del que el parking \nde larga estancia dispone a tal efecto. De 07:00 a 0:00 los autobuses realizan de manera continua el \nrecorrido. El tiempo de espera no supera los 10 minutos. De 0.00 a 7.00 se puede solicitar el servicio a \ntravés de los interfonos situados en las cinco paradas que hay dentro del aparcamiento (usuarios que \ntengan que trasladarse a los terminales) y en llegadas del T1, T2 y T3 (usuarios que tengan que \nrecoger su vehículo).  \nPor otra parte hemos de tener en cuenta en caso de decantarnos por el parking de larga estancia que si \nnuestro vuelo sale desde la T4, hemos de desplazarnos en dicho servicio de autobús hasta la T1, y \ndesde allí coger otro autobús hasta la T4; mientras que si el vuelo llega a la T4 hemos de desplazarnos \nen el servicio de autobús hasta la T2 y desde allí coger otro autobús hasta el parking de larga estancia.    \nPara más información sobre tarifas, localización... del parking de larga estancia de barajas, \npincharemos en el siguiente enlace [http://www.largaestancia.com/madrid] \n \n3. Coste kilometraje vehículo particular: cuando nos desplacemos en nuestro vehículo particular con \nmotivo de un viaje, podremos imputarnos como gasto indemnizable una cantidad de dinero por cada \nkilómetro recorrido. De forma que, multiplicaremos la distancia en kilómetros al aeropuerto (que \nhemos apuntado en el paso 1) por  \na) 0,19 € si el desplazamiento se realiza en automóvil \nb) 0,078 € si el desplazamiento se realiza en motocicleta  \ny el resultado se multiplica por dos, pues se trata de un desplazamiento de ida y vuelta.  \n \nConclusión: Si 1>2+3 nos desplazaremos utilizando el vehículo particular, y si 1<2+3 nos \ndesplazaremos en taxi. Es decir, cuando nos desplazamos en nuestro vehículo particular incurrimos en \nun coste igual al del desplazamiento de ida y vuelta más el del parking del coche, pues bien, si ese \ncoste es inferior a la tarifa de ida y vuelta en taxi, nos desplazaremos en nuestro vehículo, en caso \ncontrario lo haremos en taxi.  \n \n* Hemos de tener en cuenta que en caso de decantarnos por el parking de larga estancia de barajas, por ser la \nalternativa más económica, habremos de realizar la reserva antes de acceder a las instalaciones del parking en \nel Tlf.913936937, realizando el prepago de la estancia reservada.' \n** Óscar Corcho sugiere la posibilidad de aparcar en los alrededores de la parada de metro de Barajas pueblo,  \ndado que es gratuito (se aparca en la calle), y suele haber sitio. Únicamente habría que coger el metro  para \ndesplazarse hasta el aeropuerto, lo que supone un coste final de 4 € ida y vuelta. \n",
  "speaker": "SYSTEM",
  "uuid": "24d87c4c-3ee2-4c3a-9d65-9c9f753bc7b5"
}