{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 6\nBÚSQUEDA \n \n6 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nDespués de la anterior introducción informal, podemos resumir lo que sabemos del \nentorno Lisp.  \nLos elementos Lisp que conocemos se agrupan del siguiente modo: \n• Atomos, que a su vez se dividen en: \n•  Números \n•  Símbolos \n• Listas \nSin entrar en detalles léxicos, los números son secuencias de dígitos (también se \npueden manejar en Lisp números reales, racionales y complejos, con los formatos \ncorrespondientes) y los símbolos (su apariencia externa, más bien) son secuencias \nde letras y dígitos (en los que la diferencia entre mayúsculas y minúsculas no es \ntenida en cuenta). Es importante no confundir los símbolos con las cadenas de \ncaracteres (estructuras de datos que serán explicadas más adelante). Las listas se \ndefinen del siguiente modo: un paréntesis que se abre, seguido de un número \ncualquiera de elementos Lisp separados por los delimitadores Lisp (recuérdese: \ncualquier número de espacios en blanco o saltos de línea) y un paréntesis que se \ncierra. Es importante hacer notar que la definición de las listas es recursiva, lo que \npermite el anidamiento con cualquier grado de profundidad de listas (ya hemos visto \nejemplos de estas estructuras anidadas más arriba). Este hecho hace que el \ntratamiento recursivo sea en Lisp más cómodo y más frecuentemente utilizado que \nen otros lenguajes de programación. \nEntender Lisp es equivalente a comprender como funciona el evaluador. Para ello \nvamos a retomar como se comporta el evaluador ante cada una de las familias de \nelementos introducidas antes. \n \n– Atomos: \n \n \n– Números: son evaluados a sí mismos. Ejemplo: \n \n \n> 4 ===> 4 \n \n \n– Símbolos: se comprueba si tienen algún valor asociado; si no tienen \nningún valor, se produce un error: \n \n \n> a ===> ¡¡¡¡ ERROR !!!! \nAquí hemos supuesto que los ejemplos que vamos escribiendo son las únicas \nexpresiones introducidas en una misma sesión, desde que se ha entrado a ella. Lo \nque sucede tras haberse producido un error durante el bucle de lectura-evaluación-\n",
  "speaker": "SYSTEM",
  "uuid": "258c50c7-0f80-4338-8791-4c4dc9bb0d35"
}