{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 9\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 9 \n \nInvestigador responsable: Oscar Corcho García \nNúmero de investigadores participantes: 5 \n \nRef: ProyectoIP05 \nTítulo del proyecto: PlanetData (FP7-257641)  \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Innsbruck, Stichting Centrum voor Wiskunde en Informatica, Ecole \nPolytechnique Federale de Lausanne, Foundation for Research and Technology‐Hellas, Freie \nUniversitat Berlin, Jozef Stefan Institute, Karlsruhe Institute of Technology, Semantic Technology \nInstitute International, Universidad Politecnica de Madrid \nDuración,  desde: 01/10/2010 \nhasta: 30/09/2013     Cuantía de la subvención:  \n3.001.662,00 € (total),  \n \n \n \n \n \n \n \n \n \n \n180.212,00€ (UPM) \nFechas de trabajo en proyecto: 01/10/2010 – actualidad  \nInvestigador responsable: Dieter Fensel (proyecto), Oscar Corcho García (UPM) \nNúmero de investigadores participantes: 40 \n \nRef: ProyectoIP04 \nTítulo del proyecto: BuscaMedia: Hacia una Adaptación Semántica de Medios Digitales Multirred-Multiterminal \n(CEN-20091026) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: ATOS Origin, Activa Multimedia, GFI, Indra, CCMA, Bilbomática, Fractalia, BMAT, \nISID, iSOCO, Daedalus, Universidad Politécnica de Madrid, Universidad Nacional de Educación a Distancia, \nRobotiker Tecnalia, Universitat Pompeu Fabra, Universitat Politécnica de Catalunya, Universidad Carlos III de \nMadrid, Fundació Barcelona Media, Fundación CTIC \nDuración,  desde: 01/10/2009  hasta: 31/12/2012   \n \nCuantía de la subvención: 10.420.464,00€ \n \n \n \n \n \n \n \n \n \n \n290.791,80€ (UPM) \nFechas de trabajo en proyecto: 01/10/2009 – 31/12/2012 \nInvestigador responsable: John Paul Moore Olmstead (proyecto), Oscar Corcho García (UPM) \nNúmero de investigadores participantes: +100 \n \nRef: ProyectoIP03 \nTítulo del proyecto: Ubicuidad de servicios de A/V basados en UPnP (TSI-020100-2008-202 y TSI-020100-\n2009-169) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa Avanza I+D \nEntidades participantes: Telefónica I+D, iSOCO, Universidad Politécnica de Madrid  \nDuración,  desde: 01/09/2008  hasta: 30/06/2010   \nCuantía de la subvención:  \n \n79.035,45€   + 306.123,25€ (subvención total),  \n \n \n \n \n209.955,00€ + 0€ (préstamo total), \n \n \n \n \n22.400,00€   + 78.600,00€ (UPM) \nFechas de trabajo en proyecto: 01/09/2008 – 30/06/2010 \nInvestigador responsable: Francisco Rodríguez García (proyecto), Oscar Corcho García (UPM) \nNúmero de investigadores participantes: 10 \n \nRef: ProyectoIP02 \nTítulo del proyecto: MIO! Tecnologías para prestar servicios en movilidad en el futuro universo inteligente \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: Telefónica I+D, Telvent, AT4 Wireless, iSOCO, Worldnet 21, Instalaciones Inabensa, \nTreeLogic, Caja Navarra, Sugar Factory, TB Solutions, CICtourGUNE, Robotiker-Tecnalia, Universidad \nPolitécnica de Madrid, Universidad Politécnica de Valencia, Universidad de Cantabria, Universidad de \nDeusto, Universidad de Granada, Universidad de Valladolid, Universidad de Málaga, Universidad de \nCantabria, Universidad Rey Juan Carlos, Universidad de Castilla la Mancha, Universidad de Vigo, \n",
  "speaker": "SYSTEM",
  "uuid": "25982b54-4a8e-463c-9949-e5b337381659"
}