{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 48\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 48 \n \nTipo de participación: Póster \nCongreso: XIII Congreso Nacional de Tecnologías de la Información Geográfica \nPublicación: Actas del XIII Congreso Nacional de Tecnologías de la Información Geográfica. Hernández \nCalvento, L.; Parreño Castellano, J.M. (eds.) ISBN: 978-84-96971-53-0 \nLugar celebración: Las Palmas de Gran Canaria \n(España) \nFecha: Septiembre 2008 \n \nRef: Conferencia24 \nAutores (p.o. de firma): López-Cima A, Corcho O, Gómez-Pérez A \nTítulo: ecReport: a collaborative web tool for reporting R&D projects \nTipo de participación: Comunicación \nCongreso: The R&D Management Conference 2008 \nPublicación: -- \nLugar celebración: Ottawa (Canadá) \nFecha: Junio 2008 \n \nRef: Workshop29 \nAutores (p.o. de firma): Belhajjame K, Wolstencroft K, Corcho O, Oinn T, Tanoh F, William A, Goble CA \nTítulo: Metadata Management in the Taverna Workflow System \nTipo de participación: Comunicación \nCongreso: 3rd Int'l workshop on Workflow Systems in e-Science (WSES’2008), in conjunction with IEEE CCGrid \n08 \nPublicación: DOI 10.1109/CCGRID.2008.17. 8th International Symposium on Cluster Computing and the Grid. \nCCGRID2008. Pages 651-656 \nLugar celebración: Lyon (Francia) \nFecha: Mayo 2008 \n \nRef: Conferencia23 \nAutores (p.o. de firma): Vilches Blázquez LM, Ramos Gargantilla JA, Corcho O, Capdevila Subirana J \nTítulo: Hacia una armonización semántica de la Información Geográfica \nTipo de participación: Comunicación \nCongreso: II Congreso Catalán de Geografía \"El mapa com a llenguatge geogràfic\" \nPublicación: -- \nLugar celebración: Barcelona y Vilanova i la Geltrú (España) \nFecha: Mayo 2008 \n \nRef: Póster07 \nAutores (p.o. de firma): Xing W, Sakellariou R, Corcho O, Goble CA, Dikaiakos M \nTítulo: Grid Metadata Lifetime Control in ActOn \nTipo de participación: Poster \nCongreso: CoreGrid Integration Workshop 2008 \nPublicación: -- \nLugar celebración: Heraklion (Grecia) \nFecha: Abril 2008 \n \nRef: Workshop28 \nAutores (p.o. de firma): Vilches-Blázquez LM, Cañete-Pérez JA, Corcho O, Bernabé MA, Rodríguez AF \nTítulo: Pertinencia de aplicación de la Ingeniería Ontológica a la planificación hidráulica del territorio \nTipo de participación: Comunicación \nCongreso: 5th International Congress for Spatial Planning. http://www.5ciot.org/eng/ \nPublicación: -- \nLugar celebración: Málaga (España) \nFecha: Noviembre 2007 \n \nRef: Workshop27 \nAutores (p.o. de firma): López-Pellicer FJ, Vilches-Blázquez LM, Nogueras-Iso J, Corcho O, Bernabé MA, \nRodríguez AF \n",
  "speaker": "SYSTEM",
  "uuid": "2641b418-ebcb-414e-ba07-9bcaedd82c9c"
}