{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 2\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \nemergente transversal vinculado a la innovación con capacidad para promover crecimiento, \ncompetitividad y empleo de calidad. Esto, unido a la importancia del español en el mundo, a la \nexistencia de una buena gobernanza del idioma y de destacados grupos investigación en España, y \na la rica experiencia que supone la existencia de varias lenguas cooficiales, presenta una \noportunidad que no debemos perder. \nPara catalizar este potencial, la Secretaría de Estado para la Sociedad de la Información y la \nAgenda Digital impulsa el Plan de Impulso de las Tecnologías del Lenguaje. Este Plan tiene por \nobjeto fomentar el desarrollo del sector del procesamiento del lenguaje natural y la traducción \nautomática en España, y aprovechar estas novedosas capacidades para mejorar el servicio \npúblico. \n \nPara llevar las acciones contempladas en el Plan de Impulso de las Tecnologías del Lenguaje la \nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital cuenta con un \npresupuesto consignado a tal efecto. Además de esto, la Secretaría de Estado para la Sociedad de \nla Información y la Agenda Digital puede movilizar también financiación de programas \ninternacionales, como el programa \"Fomento de Innovación desde la Demanda y de la Compra \nPública Innovadora\" (en adelante FID) cofinanciado con Fondos Europeos de Desarrollo Regional \n(FEDER) o el programa HORIZONTE 2020 de la Comisión Europea, entre otros. \nPor otro lado, la I+D podría ser financiada por el Centro para el Desarrollo Tecnológico Industrial \n(en adelante CDTI) mediante su adhesión al programa INNODEMANDA. \n \nLa Ley 30/2007, de 30 de octubre, de Contratos del Sector Público, ya contemplaba la Compra \nPública Innovadora, que fue impulsada posteriormente por la Ley 2/2011, de 4 de marzo, de \nEconomía Sostenible. \nEn la misma línea, el Acuerdo del Consejo de Ministros de 8 de octubre de 2010 impulsaba la \nCompra Pública Innovadora en el marco de la Estrategia Estatal de Innovación (aprobada por \nConsejo de Ministros de 2 de julio de 2010) y comprometía la actuación de los poderes públicos \nen esta dirección. \nLa Ley 14/2011, de 1 de junio, de la Ciencia, la Tecnología y la Innovación consagra esta voluntad \nde los poderes públicos y el Acuerdo de Consejo de Ministros de 8 de julio de 2011 dispone el \nprocedimiento de articulación de la contratación pública de actividades innovadoras. \nEl Real Decreto Legislativo 3/2011, de 14 de noviembre, por el que se aprueba el texto refundido \nde la Ley de Contratos del Sector Público mantiene el mismo espíritu, mediante el fomento de la \ncontratación pública de soluciones innovadoras. \nDe acuerdo con lo anterior, el Ministerio de Ciencia e Innovación publicó en 2011, una \"Guía \nsobre Compra Pública Innovadora\" dirigida a las Administraciones Públicas y demás organismos y \nentidades del sector público contratantes para la mejor y más adecuada aplicación de los \nprocedimientos de contratación y adjudicación de la Compra Pública Innovadora. Esta guía se \nactualizó en 2015, con el título de “Guía 2.0 para la compra pública de innovación”. \nEl lanzamiento de un procedimiento de Compra Pública Innovadora o de Compra Pública de \nInnovación (se usan indistintamente ambos términos), mediante el que se pretende implementar \nsoluciones tecnológicamente innovadoras, requiere el conocimiento previo del espacio de las \nsoluciones factibles. La Directiva 2004/18/CE del Parlamento Europeo y del Consejo, de 31 de \nmarzo de 2004, sobre coordinación de los procedimientos de adjudicación de los contratos \n",
  "speaker": "SYSTEM",
  "uuid": "26899767-19d0-47b5-85db-c45ce68a1bbe"
}