{
  "message": "SYSTEM: Mpoveda-CVA-Marzo-2016.pdf: Página 1\n\t\r  \n\t\r  \n1 \n \n\t\r  \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \n \n \nParte A. DATOS PERSONALES \nNombre y apellidos \nMaría Poveda Villalón \nDNI/NIE/pasaporte \n2263580N \nEdad \n32 \nNúm. identificación del investigador \nResearcher ID \n J-4530-2012 \nCódigo Orcid \n 0000-0003-3587-0367 \n \nA.1. Situación profesional actual  \nOrganismo \nUniversidad Politécnica de Madrid    \nDpto./Centro \nDepartamento de Inteligencia Artificial. Escuela Técnica Superior  \nde Ingenieros Informáticos  \nDirección \nCampus de Montegancedo, sn. 28660 Boadilla del Monte, Madrid \nTeléfono \n 913363670 \ncorreo electrónico mpoveda@fi.upm.es\t\r  \nCategoría profesional \nInvestigador contratado  \nFecha inicio \n01/03/2016 \nEspec. cód. UNESCO \n 3304 \nPalabras clave \nOntologías, Open Data \n \nA.2. Formación académica (título, institución, fecha) \nLicenciatura/Grado/Doctorado \nUniversidad \nAño \nIngeniera Informática \nUniversidad Politécnica de Madrid \n2009 \n Máster de Investigación en \nInteligencia Artificial \nUniversidad Politécnica de Madrid \n 2010 \nDoctorado en Inteligencia  \nArtificial \nUniversidad Politécnica de Madrid \n2016 \n \nA.3. Indicadores generales de calidad de la producción científica (véanse instrucciones) \nLos datos que se muestran a continuación proceden de Web of Science, como se propone  \nen el modelo de curriculum, y de Google Scholar, puesto que en informática una parte de la  \nproducción científica corresponde a conferencias, en lugar de revistas.   \n• \nCitas totales: 3 (WoS) / 302 (Google Scholar)  \n• \nPromedio de citas/año en el periodo 2011-2015:  0.6 citas/año (WoS) / 60.4 (Google  \n• \nScholar)   \n• \nh-index: 1 (WoS) / 10 (Google Scholar)  \n• \nPublicaciones en Q1: 1 \n \nParte B. RESUMEN LIBRE DEL CURRÍCULUM (máximo 3500 caracteres, incluyendo \nespacios en blanco) \n \nMaría Poveda Villalón es doctora en Inteligencia Artificial. Actualmente es investigadora \npostdoctoral en el Ontology Engineering Group,  perteneciente  al  Departamento  de  \nInteligencia Artificial de la ESTI Informáticos, en la Universidad Politécnica de Madrid. En \ndicha universidad realizó también los estudios de Ingeniería Superior en Informática (2009) y \nMáster en Investigación en Inteligencia Artificial (2010). Además, forma parte del equipo del \nNodo en Madrid del ODI (Open Data Institute).  \n \nSus intereses en investigación son principalmente la ingeniería ontológica, y más \nconcretamente los problemas relacionados con la conceptualización, implementación y \nevaluación de ontologías. Debido a la aplicabilidad de la ingeniería ontología a la web, otro \nde sus intereses son el desarrollo de tecnologías relacionadas con web semántica y datos \nenlazados. Fruto de sus trabajos en dichas áreas ha publicado resultados tanto en revistas \ny conferencias relevantes como en workshops y artículos de divulgación. Además ha \nparticipado como miembro del comité de programa y organización de eventos científicos así \ncomo revisora en revistas internacionales. \n \nMaría ha participado en varios proyectos nacionales con empresas y europeos, tanto de \ndesarrollo de ontologías, generación y publicación de datos enlazados entre otras \nFecha del CVA  \n 30/03/2016 \n",
  "speaker": "SYSTEM",
  "uuid": "26e3ebff-b203-4919-a39f-c4dd0306c3f6"
}