{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 2\nBodil Nistrup Madsen & Hanne Erdman Thomsen  \n \n2\n \n \nthose types, e.g. ontology, taxonomy and thesaurus. One of the results will be \nsystematic overview in the form of an ontology of ontologies which will \ncomprise proposals for definitions of the different types of ontology. \nThis paper is organized as follows. In section 1 we will give an introduc-\ntion to the principles of terminological ontologies that we will use in the rest \nof the paper. Section 2 gives examples of classifications of ontologies, based \non Gómez-Pérez et al. (2003) and various other authors. In section 3 we pre-\nsent a first draft of a part of an ontology of ontologies that is based on the \nprinciples described in section 1, and in section 4 we compare this proposal \nwith the examples of ontologies in section 2. As already mentioned there are \nvery different understandings of what an ontology is. In section 5 we will dis-\ncuss the distinction between ontology, understood as “concept model” and \nontology, understood as “conceptual data model”.  \n \n1 Principles of terminological ontologies \n \nHere we will briefly present some central principles of terminological ontolo-\ngies, which form a useful basis for a method for concept clarification and sys-\ntematisation. Some of these principles have been used for many years in ter-\nminology work, and some have been developed in the research and develop-\nment project CAOS - Computer-Aided Ontology Structuring, whose aim is to \ndevelop a computer system designed to enable semi-automatic construction \nof concept systems, or ontologies. CAOS is a joint research project carried \nout by researchers at the Department of International Language Studies and \nComputational Linguistics, Copenhagen Business School. The system is in-\ntended to be interactive and presupposes an end-user with a terminological \nbackground. CAOS supports terminological concept modelling. The back-\nbone of this concept modelling is constituted by characteristics modelled by \nformal feature specifications, i.e. attribute-value pairs2. Our use of feature \nspecifications is subject to a number of principles and constraints. For a more \ndetailed description of these principles, see for example: Madsen, Thomsen, \nVikner (2004). \nFigure 1 shows an extract of an ontology for types of prevention, which is \nbased on an ontology, developed by Working Group 07, Prevention, Health \nPromotion and Public Health, the Danish Council for Health Terminology.  \nThe results of the work of this working group may be seen on the web-site of \nthe Danish National Board of Health:  http://begrebsbasen.sst.dk. \n2. This approach to the modelling of characteristics was proposed in Thomsen (1998) and \nMadsen (1998). Cf. also Carpenter (1992). \n \n",
  "speaker": "SYSTEM",
  "uuid": "26e5a0f1-c220-45f8-991c-412b390a247d"
}