{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 252\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n258\n395.- INVESPE. Inventario de entes del sector público estatal del Ministerio\nde Economía y Hacienda\nDirección Web:\nhttp://www.igae.pap.meh.es/Internet/Cln_Principal/ClnInvespe/default.htm\nOrganismo editor: Intervención General de la Administración del Estado. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Administración pública.\nDescripción y comentarios: Permite conocer la estructura, dimensión y composición de\nlos entes del sector público estatal. Esta aplicación ofrece el acceso al Inventario de entes\ndel sector público estatal, constituido por todas las formas jurídicas relacionadas en el\nartículo 2 de la Ley 47/2003, de 26 de noviembre, General Presupuestaria, excepto\n“Administración General del Estado y Entidades gestoras, servicios comunes y las mutuas\nde accidentes de trabajo y enfermedades profesionales de la Seguridad Social en su fun-\nción pública de colaboración en la gestión de la Seguridad Social”. \n396.- LEI. Base de datos de legislación del Ministerio de Economía y Hacienda\nDirección Web: http://www.igae.pap.meh.es/igae/knfind?bd=LEGIS\nWeb adicional:\nhttp://www.igae.pap.meh.es/Internet/Cln_Principal/ClnNormativa/BaseDatosLei/\nOrganismo editor: Intervención General de la Administración del Estado. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nNormas y jurisprudencia\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Justicia. Legislación. Jurisprudencia.\nDescripción y comentarios: Los campos de búsqueda son similares a los de otras bases\nde datos legislativas: texto libre, disposición (rango, número, fecha), órgano emisor, situa-\nción (vigente, derogada, todas), publicación, descriptores y texto. Para facilitar la consul-\nta ofrece un listado de descriptores, órganos emisores y rango de la norma.\nBASES DE DATOS  1/1/04  03:39  Página 258\n",
  "speaker": "SYSTEM",
  "uuid": "2752ac82-e1ed-46bd-a749-34d06def1dd0"
}