{
  "message": "SYSTEM: Wiki: Job Description\nThe AI Center at SRI International is looking for a highly creative  Computer Scientist to join a team of researchers building \nevaluation-driven knowledge-based systems. We are seeking an individual with a strong background in deductive question answering, applied knowledge representation, knowledge acquisition and Lisp programming skills.\nInitial responsibilities will include dedicated work in contributing to the ongoing development and maintenance of complex software systems.Specifically, in the near future, we will implement question answering methods that can answer ``how¹¹ and ``why¹¹ questions, and reason by qualitative simulation. The future work will involve investigating techniques for scalable reasoning. We anticipate applying the techniques developed in this effort to problems that are of interest to both government and business, with an eye toward commercialization opportunities. The most immediate application focus area is science education.\nExperience:\nThis position requires background in applied knowledge representation and reasoning with exposure to logical reasoning systems, large knowledge bases, qualitative simulation and reasoning. Substantial Common Lisp programming experience is desirable.\nThe position requires excellent communication skills, willingness and the ability to work as part of a result-oriented team, and building a significant software system.\nEducation/Discipline:\nPh.D. in computer science or equivalent with specialization in reasoning systems.\nAbout This Division\nSRI International's Information and Computing Sciences Division develops and applies technologies to meet client needs in machine \nintelligence, speech and natural language, perception and visual sciences, bioinformatics, formal methods, and computer security. ICS is organized into four laboratories, all world leaders in their respective fields: the Artificial Intelligence Center; the Speech Technology and Research (STAR) Laboratory, the Computer Science Laboratory, and Vision Technologies.\nFor additional information, please visit the Information and Computing Sciences website:\nhttp://www.sri.com/icsd\nTo apply, please visit\nhttps://careers.sri.com/psp/ps/CAREERS/CAREERS/c/HRS_HRAM.HRS_CE.GBL?Page=HRS_CE_JOB_DTL&Action=A&JobOpeningId=100972&SiteId=2&PostingSeq=1\nor write to Vinay.Chaudhri@SRI.COM",
  "speaker": "SYSTEM",
  "uuid": "277f5cb8-374d-490a-b646-786c1137ff62"
}