{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 5\n3\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nKey Extracts\nA new Ecosystem\nNew open paradigms, language‐neutral development platforms and multilingual development resources\ncould foster disruption, particularly in Europe. (p. 5)\nThe ability to manage and process the tsunami of data across the world’s languages is one of the biggest\nchallenges in the new ICT ecosystem, and one for which LT is a critical enabling technology. (p. 6)\nLT is baked into the future of ICT in the mobile/social/global world of computing. (p.7)\nIn the era of semantics – when we need to know the meaning of the data that flows around the digital uni‐\nverse – Language Technology is essential for innovation. (p.8)\nAlthough LT has been a commercial market for many years, only recently have technological conditions\nmade it possible to exploit LT on a large scale. (p.9)\nMarkets for Language Technology\nThe fastest growth is in non‐European languages, though Spanish and Portuguese gain significance because\nof Latin American markets. Aside from English, Spanish and Portuguese, only five other EU languages\n(German, French, Italian, Polish and Dutch), out of 60 or more spoken in the Union, are published on more\nthan 1% of the top million sites. (p. 10)\nWhile the potential is for a single European digital market with 500+ million customers, the reality is a series\nof fragmented linguistic markets, none bigger than possibly 70/80 million customers, most much smaller. (p.\n11)\nAt present no company or website could be genuinely global using the localisation techniques currently at\nour disposal. Only with large‐scale automation will the limited multilinguality of the web be transformed\ninto a genuinely globally accessible medium. (p. 11)\nWhere language is the very stuff of our digital system – customer interactions, employee conversations,\ntechnical and scientific knowledge, cultural and social objects of all kinds – the era of the Lingua Franca is\nover. Interacting across the many languages of the digital world is no longer optional. (p. 12)\nEurope’s share of the worldwide market will increase slightly to 38% over the five year period. However, that\nshare is significantly lower (24% in 2015) for the software portion of the market... Factors that could change\nthis include:\n• Faster and more extensive deployment of content applications in more European languages, in a coher‐\nent framework for all languages\n• Development – and integration – of speech components (for recognition, generationand identifica‐\ntion/verification) in more European languages, affordably available for European application and solu‐\ntion developers\n• Large‐scale deployment of open source machine translation in open environments using shared\nresources\n• Large‐scale sharing of resources (paid and free) throughout the European industry\n• Development of vertical and industry‐specific platforms for LT development and deployment, engaging\n",
  "speaker": "SYSTEM",
  "uuid": "27aca762-51d9-4314-a2cf-82170c06caee"
}