{
  "message": "SYSTEM: NeOn_Glossary_of_Processes_and_Activities.pdf: Página 2\nOntology Evolution can be seen as a consequence of different activities during the development of \nthe ontology. \n Ontology Extension. It is an ontology enrichment activity for stretching the ontology in width. \n Ontology Feasibility Study [Gómez-Pérez et al., 2003]. It refers to the activity of answering \nquestions such as “Is it possible to build the ontology? and/or “Is it suitable to build the ontology?” \n Ontology Formalization [Gómez-Pérez et al., 2003]. It refers to the transformation of a conceptual \nmodel into a formal or semi-computable model according to a knowledge representation paradigm \n(e.g., description logics, frames, and rules). \n \n Ontology Forward Engineering [Gómez-Pérez and Rojas-Amaya, 1999]. It refers to the activity of \noutputting a new implementation of the ontology on the basis of the new conceptual model. \n Ontology Implementation. It refers to the activity of generating computable models according to \nthe syntax of a formal representation language (e.g., RDF(S), OWL, and FLogic). \n Ontology Integration. It refers to the activity of including one ontology in another ontology. \n Knowledge Acquisition for Ontologies. It comprises activities for capturing knowledge (e.g., T-\nBox and A-Box) from a variety of sources (e.g., documents, experts, data bases, etc.). We can \ndistinguish between Ontology Elicitation, Ontology Learning and Ontology Population. \n \n Ontology Learning. It is a knowledge acquisition activity that relies on (semi-) automatic methods \nto transform unstructured (e.g., corpora), semi-structured (e.g., folksonomies and html pages) and \nstructured data sources (e.g., data bases) into conceptual structures (e.g., T-Box). \n Ontology Localization. It refers to the adaptation of an ontology to a particular language and \nculture. \n Ontology Mapping. It refers to the activity of finding the correspondences between two or more \nontologies and storing/exploiting them. A synonym for this activity is Ontology Aligning. \n Ontology Matching. It refers to the activity of finding or discovering relationships or \ncorrespondences between entities of different ontologies or ontology modules. \nOntology Matching can be seen as the first stage of Ontology Aligning. \n Ontology Merging. It refers to the activity of creating a new ontology or an ontology module from \ntwo or more, possibly overlapping, source ontologies or ontology modules. \n Ontology Modification [Stojanovic, 2004]. It refers to the activity of changing the ontology without \nconsidering the consistency. \n Ontology Modularization. It refers to the activity of identifying one or more modules in an ontology \nwith the purpose of supporting reuse or maintenance. \nWe can make distinctions between: Ontology Module Extraction and Ontology Partitioning.  \n Ontology Module Extraction. It refers to the activity of obtaining from an ontology some concrete \nmodules that could be used for a particular purpose (e.g., to contain a particular sub-vocabulary of \nthe original ontology). \n \n Ontology Module Reuse. It refers to the process of using available ontology modules in the \nsolution of different problems \n Ontology Partitioning. It refers to the activity of dividing an ontology into a set of (not necessary \ndisjoint) modules that together form an ontology but that can be treated separately. \n Ontology Population. It is a knowledge acquisition activity that relies on (semi-) automatic methods \nto transform unstructured (e.g., corpora), semi-structured (e.g., folksonomies and html pages) and \nstructured data sources (e.g., data bases) into instance data (e.g., A-Box).  \n",
  "speaker": "SYSTEM",
  "uuid": "27bc6c3a-b53f-4dd9-b0ca-c37922a8b159"
}