{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 1\nChapter 1\nThe Return of the Entity-Relationship Model:\nOntological Query Answering\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\nAbstract The Entity-Relationship (ER) model is a fundamental tool for database\ndesign, recently extended and employed in knowledge representation and reasoning\ndue to its expressiveness and comprehensibility. We present an extension of the ER\nmodel, called ER+, which is particularly suitable for ontology modeling, as well\nas being ﬂexible and comprehensible. Our model comprises is-a constraints among\nentities and relationships, plus functional and mandatory participation constraints.\nIn particular, it allows for arbitrary permutations of the roles in is-a among rela-\ntionships. We argue that ER-based languages can be proﬁtably used in ontology-\nenhanced database systems, where queries are evaluated against the union of a\ndatabase instance and an ontology, which constitute a logical theory. In such sys-\ntems, the instance has usually large size, therefore ensuring tractable complexity\nof query answering w.r.t. the instance size is crucial. A key notion that ensures\ntractability in ER+ schemata is separability, i.e., the absence of interaction between\nthe functional participation constraints and the other constructs. We provide a pre-\ncise syntactic characterization of separable ER+ schemata by means of a neces-\nsary and sufﬁcient condition. We present a complete complexity analysis of the\nconjunctive query answering problem under separable ER+ schemata, and also un-\nder several sublanguages of ER+. We show that the addition of so-called negative\nconstraints does not increase the complexity of query answering. With such con-\nstraints, our model properly generalizes the most widely-adopted tractable ontology\nlanguages, including those in the well-known DL-Lite family.\nAndrea Cal`ı\nDepartment of Computer Science and Information Systems, Birkbeck University of London, e-\nmail: andrea@dcs.bbk.ac.uk\nGeorg Gottlob\nDepartment of Computer Science, University of Oxford, e-mail: georg.gottlob@cs.ox.ac.uk\nAndreas Pieris\nDepartment of Computer Science, University of Oxford, e-mail: andreas.pieris@cs.ox.ac.uk\n1\n",
  "speaker": "SYSTEM",
  "uuid": "27de435f-f609-4b4b-8131-21a73263162d"
}