{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 181\nMINISTERIO DE CIENCIA E INNOVACIÓN\n187\n255.- IBSST. Índice Bibliográfico de Salud y Seguridad en el Trabajo\nDirección Web: http://ibsst.isciii.es/\nWeb adicional: http://www.isciii.es/htdocs/redes/biblioteca/biblioteca_presentacion.jsp\nOrganismo editor: Instituto de Salud Carlos III.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Sanidad.\nDescripción y comentarios: Salud pública, epidemiología y administración sanitaria, far-\nmacia, veterinaria, psicología, odontología y enfermería. Hay una parte de libre acceso y\notra restringida. En la parte de libre acceso se accede a los datos básicos del documento,\nincluido resumen. Desde la vista restringida se ofrece el acceso al texto completo del mismo.\n256.- LIS-España. Sitios Saludables. Localizador de información en salud\nDirección Web: http://wwwlis.isciii.es/xml2html/xmlListT.php?xml[]=lis-Regional/E/\ndefine.xml&xml[]=lis-Regional/E/defineContent.xml&xsl=lis-Regional/home.xsl\nWeb adicional: http://bvs.isciii.es/E/index.php\nOrganismo editor: Instituto de Salud Carlos III.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Sanidad.\nDescripción y comentarios: LIS-España: sitios saludables, es un buscador especializado\nen sitios de salud, disponibles en Internet y seleccionados mediante criterios de calidad.\nOfrece una descripción del contenido de las páginas y su enlace en Internet. LIS-España\nes el resultado de la cooperación técnica entre la Biblioteca Nacional de Ciencias de la\nSalud de España (BNCS) y el Centro Latinoamericano y del Caribe de Información en\nCiencias de la Salud (BIREME), organismo de la Organización Panamericana de la Salud\n(OPS) / Organización Mundial de la Salud (OMS). La metodología LIS sigue normas y\nformatos internacionales ampliamente adoptados en bibliotecas y centros de documenta-\nción. Está basada en el Global Information Locator Service (GILS) y en el formato Dublin\nCore, con algunos campos adicionales. Es un proyecto de la Biblioteca Virtual en Salud\nque coordina en España este Instituto.\nBASES DE DATOS  1/1/04  03:39  Página 187\n",
  "speaker": "SYSTEM",
  "uuid": "287df504-bdb0-4896-968f-275dc52eb3a8"
}