{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 4\ntheir name and a set of possible quantity spaces. Quantity spaces represent the possible\nvalues a magnitude (or derivative) of a quantity can have, and are deﬁned by their name\nand an ordered set of possible values.\nNext to the model ingredients deﬁned by the modeller, there is also a set of prede-\nﬁned model ingredients called generic building blocks. These include causal relation-\nships, correspondences, the operator relations plus and minus, value assignments, and\ninequalities.\nEntity\nEnvironment\nPopulation\nAnimal\nCarnivore\nHerbivore\nPlant\n(a) The entity hierarchy of the\nplant growth resource model.\nPopulation exists\nPopulation\nPopulation\nBiomass\nZlmh\nHigh\nMed\nLow\nZero\nMortality\nZlmh\nHigh\nMed\nLow\nZero\nProduction\nZlmh\nHigh\nMed\nLow\nZero\nImmigration\nZp\nPlus\nZero\n(b) The Population growth model fragment (from the plant\ngrowth model) incorporates the Population Exists model\nfragment (indicated by the folder with content icon) de-\nscribing the population, its four quantities, and the inequali-\nties. The model fragment introduces the production (I+) and\nmortality (I-) inﬂuences.\nFig. 2. The entity hierarchy and a model fragment of the model of plant growth based on exploita-\ntion of resources [27].\n3\nExport of QR models into OWL\nTo ease the ontology-based deﬁnition of QR models and its later semantic grounding,\nthey are exported [24] to the Web Ontology Language (OWL) [20]. To determine how\nthe QR models can be formalised as ontologies, an ontological perspective on QR is\ntaken. Previous research distinguishes different types of ontologies based on the type of\nontological commitments they make [29]. For example, the ontological commitments\nof a knowledge representation language consist of the domain independent concepts.\nHowever, a domain model created by a knowledge engineer using such a language de-\nﬁnes new concepts based on the concepts in the knowledge representation language.\nWe frame the QR knowledge representation on these different types of ontologies (Fig-\nure 3).\nOWL provides the representational ontology we use to deﬁne the general model\ningredients that can be used in a QR model (i.e. the QR vocabulary). We call the for-\n",
  "speaker": "SYSTEM",
  "uuid": "288e5804-4b4f-4af4-bb7a-9da1202523cc"
}