{
  "message": "SYSTEM: Wiki: Description to be provided soon\nContents\n[\nhide\n]\n1\n2009 Tasks\n2\n2010 Tasks\n3\nMilestones\n4\nCalendar\n5\nComplexities in Non-complex Way\n6\nReferences\n2009 Tasks\n\nPrepare examples of query plans to send to the group in Venezuela who will help us to make our query rewriting more efficient and optimized (1 week).\nStatus: DONE. This is related to cross join problems in the query rewriting. Turned out that it's implementation issue. Fixed.\nCompare the following systems: R2O, D2R and D2R Server, Triplify and Asio Semantic Bridge. Comparison based on theoretical descriptions (1 week), common testbed based on our geographical databases and mappings (2 weeks), and on mapping and query language expressivity (1 week).\nSubtask 1. Literature reading on those tools. Status: DONE. Issue Except for R2O, the other systems don't give clear semantics. Worst is Asio Semantic Bridge, no information besided powerpoint presentation. Email sent to Mike Dean without response.\nSubtask 2. R2O/ODEMapster evaluation based on PSSA testbed. Status: DONE.\nReport\nSubtask 3. Installing and trying D2R(Server), Triplify. Status: DONE\nSubtask 4. Theoretical comparison of R2O+ODEMapster, D2R, Triplify. Status: DONE.\nReport\nSubtask 5. Comparison of tools based on geographical testbed. Status: PENDING\nRead the query rewriting processes proposed by Calvanese et al, and by Pérez-Urbina et al (ISWC2009 - I will send it to you), and analyse implementation of the latter in order to substitute in the future the ODEMapster query generator by this one (1 week).\nSubtask 1. Reading CGLLR & RQR. Status: DONE\nSubtask 2. RQR Implementation Analysis. Status: IN PROGRESS\nMake a presentation to the group about it and about the current FAO extension done (February 4th 2010). Status: DONE.\nDetail\n2010 Tasks\n\nPrunning ontology based on mapping.\nStatus History: PENDING -> IN PROGRESS(20100208) -> POSTPONED(20100210)\nQuery Rewriting with TBox and Mapping.\nStatus History: PENDING -> IN PROGRESS(20100210)\nExtending Hector's Query Rewriting beyond DL Lite. Status: PENDING\nOntology Axioms Stratification in Query Rewriting. Status: PENDING\nDynamic Programming in Query Rewriting. Status: PENDING\nReducing unneeded atoms in query rewriting result. Status: PENDING\nReducing unneeded clauses in query rewriting result. Status: PENDING\nMultiple atoms processing in Query Rewriting. Status: PENDING\nMilestones\n\nM0: phd started\nM6: Draft architecture of the OBDI system\nM9: Alpha version of the system (ODBA + RQR query rewriting)\nM12: Alpha testing with small/normal scale testbed\nM15: Beta version of the system (OBDI+ mapping based rewriting)\nM18: Beta testing with large testbed\nCalendar\n\n<googlecalendar>tdiikbuvbdeo3k803769o6lhkg@group.calendar.google.com</googlecalendar>\nComplexities in Non-complex Way\n\nDL Lite (OWL QL)\nMapping Split (GLAV to GAV) = PTIME (wrt Mapping)\nReasoning (Subsumption Checking, Satisfiability) = PTIME (wrt TBox)\nQuery Answering = LogSpace (wrt ABox)\nDL Lite Extension\nQuery Answering = At least NLogSpace(wrt ABox)\nOWL EL\nQuery Answering = PTime (wrt ABox)\nSQL\nQuery Containment = Undecidable\nConjuctive Queries\nQuery Containment = NP-complete\nReferences\n\nDL Lite\nLinked Data to Ontologies.\nSummary\nQuery Rewriting\nConsistent Query Answers in Virtual Data Integration Systems. Using Answer Set techniques to detect inconsistency of query result.\nTractable Reasoning and Efficient Query Answering in Description Logics : The DL-Lite Family.\nEfficient Query Answering for OWL 2. Resolution based Query Rewriting (RQR) for OWL-QL (based on DL Lite), improvement of Calvanese's algorithm\nOntology Pruning\nA General Method for Pruning OWL Ontologies.\nSummary\nData Integration System\nRetrieving and integrating data from multiple information sources. SIMS.\nMapReduce\nMapReduce: A Flexible Data Processing Tool\nMapReduce and Parallel DBMSs: Friends or Foes\nMiscellaneous\nOther People's Data",
  "speaker": "SYSTEM",
  "uuid": "29e0078b-a6dd-42b8-875e-4be250037a29"
}