{
  "message": "SYSTEM: Ontoterminology_a_new_paradigm_for_terminology.pdf: Página 5\nKEOD-International Conference on Knowledge Engineering and Ontology Development. Madeira October 5-8 2009 \nexperts using a formal language: “saying is not \nmodelling” [Roche 2007] (figures 1 and 2). \n \nBuilding ontoterminology requires a dedicated \nmethodology from concept to term. Experts play a \nkey role for each step of the Ousia method \ndeveloped by the University of Savoie and \nOntologos corp.  They began by identifying \nconcepts and their relationships. The result is a semi-\nformal conceptual network where the part-of and is-\na relationships play a central role. This conceptual \nnetwork is defined using the SNCW tool (Semantic \nNetwork \nCraft \nWorkbench). \nThere \nare \nfew \nconstraints on the conceptual graph as a semi-formal \nrepresentation. It remains to formally define \nconcepts in an ontology. This step is performed \nusing the OCW environment (Ontology Craft \nworkbench). OCW is a software for building \nontology defined by specific differentiation (see \nfigure 2) [Roche 2001]. The next step is to identify \nthe “specialised linguistic units” – which can be \nextracted automatically from texts – and to define \nthem in natural language. The final step consists in \nassociating the terms with the concepts previously \ndefined. \n \n \n \nFigure 4. The conceptual structure of a turbine \n \n \n \nFigure 5. A hyper schema \n4 VALIDATION \nOntoterminology is currently used in different \ntechnical domains. One of them concerns a common \nvocabulary defined for maintenance applications in \nhydraulic installations for EDF’s CIH group. \n \nThe EDF (Electricité de France) Group is a \nleading player in the European energy industry. It is \npresent in all areas of the electricity value chain, \nfrom generation to trading. Leader on the French \nelectricity market, EDF is also solidly implanted in \nthe United Kingdom, Germany and Italy. \n \nThe CIH (Centre d’Ingénierie Hydraulique) \ngroup is in charge of hydraulic installations. \nHydraulic installations are complex structures where \nmany different technical domains have to be taken \ninto \naccount: \nhydraulic \nturbines, \nalternators, \ntransformers, gates, regulation, etc.  \n \nOne of the first tasks to perform was to define a \ncommon dictionary.  Each community of practice \nspeaks its own language but has to communicate and \nexchange information with other communities \nsharing the same environment and the same domain \nconceptualisation. Ontoterminology enabled linking \nthe \ndifferent \nvocabularies \nto \nthe \nsame \nconceptualisation. It then became possible to \nassociate different terms belonging to different \ncommunities to the same concept and vice versa, so \nthat the different ways of referring to a given \nconcept were known for each of them. It was also \n",
  "speaker": "SYSTEM",
  "uuid": "2a96df64-d1e1-42bd-880c-2313ccc1eaa3"
}