{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/InformacionGeneralProyectos \n\nContents\n[\nhide\n]\n1\nReporte de horas de proyectos\n2\nLatex Templates\n3\nInformación útil sobre el FP7\n4\nFirma de informes en teletrabajo\nReporte de horas de proyectos\n\nCuando se cierren reportes económicos de los proyectos europeos en los que los miembros estén implicados, se les dará, como hasta ahora, una hoja de horas con las horas justificadas en ese proyecto. En la hoja de horas vienen las horas por meses y paquetes de trabajo dedicadas al proyecto en cuestión y puede aparecer otra información útil (como fechas de viajes, períodos de baja o permiso, etc.).\nEstas horas, deberá cada uno introducirlas en la aplicación que el Rectorado tiene para este tipo de reportes.\nEsta aplicación está en la siguiente dirección:\n[1]\n. También se puede acceder desde el\nPortal investigador\n[2]\n, en el apartado de\nProyectos de Inv.\n-->\nJustificación Horaria\n-->\nCarga diaria de horas\n. Aquí hay acceso a la aplicación o la opción de carga masiva a través de un fichero excel.\nEl acceso se hace mediante la clave de la cuenta UPM (la de la UPM virtual, del correo @upm.es).\nLas horas mensuales de la hoja de horas ha de repartirlas cada investigador en los días del mes y los paquetes de trabajo, teniendo en cuenta la docencia, los permisos, las bajas, los viajes y los posibles\ndeliverables\n(cada uno sabrá sus fechas). Siempre se ha de rellenar días completos de horas, dejando días enteros libres, que computarán como vacaciones, permisos, asuntos propios, etc.\nAdemás, en los proyectos H2020 hay que meter cada mes las tareas realizadas (eso ya se os dirá lo que poner cuando esté revisado el informe).\nSi\nno se dispone de cuenta UPM\nhay que notificarlo a Ana para que se le pida al Rectorado.\nSi\nno aparece el proyecto\na reportar entre los proyectos asociados al miembro, hay que notificarlo a Ana para que se le asocie ese proyecto.\nTras introducir las horas\n, hay que generar el informe por proyecto para las fechas comprendidas en la hoja de horas y enviarlo a admin-oeg@delicias.dia.fi.upm.es para que coteje que se han metido y metido bien. Una vez el visto bueno de Ana, cada uno imprime el informe, lo firma (en todas las hojas) y lo lleva al 6104 (por supuesto, de 11 a 12).\nLatex Templates\n\nSTARS4ALL:\nhttp://delicias.dia.fi.upm.es/wiki/images/7/7d/Stars4all-latex-template.zip\nMobileAge:\nhttp://delicias.dia.fi.upm.es/wiki/images/a/ab/Mobileage-latex-template.zip\nInformación útil sobre el FP7\n\nUna fotocopiadora en Bruselas:\nD Copy\nRue du Progrès 43 Vooruitgangstraat\n1210 Bruxelles - Brussel\nTel: +32 (0)2 512.70.10\nFirma de informes en teletrabajo\n\nFirma de informes en teletrabajo",
  "speaker": "SYSTEM",
  "uuid": "2b2389f2-d821-45be-bb1c-a76bc4a064eb"
}