{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 6\nEntidad financiadora: Unión Europea. \nConvocatoria: Framework Programme 7 \nEntidades participantes: Universidad Politécnica de Madrid (coordinador); University of Manchester; National and \nKapodistrian University of Athens; University of Southampton; DEIMOS Space S.L., Emu Ltd.y TechIdeas. \nDuración,  desde: Septiembre 2008 \nhasta: Agosto 2011  \nCuantía de la subvención: 3.246.551 € (total) \n \n \n \n \n \n \n \n \n \n            734.624 € (UPM) \nInvestigador responsable: Asunción Gómez Pérez \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nNúmero de investigadores participantes: 40 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: mIO! Tecnologías para prestar servicios en movilidad en el futuro universo inteligente (CENIT-\n2008-1019)  \n \nEntidad financiadora: Centro para el Desarrollo Tecnológico Industrial (CDTI). Ministerio de Ciencia e Innovación  \nConvocatoria: Programa de creación de Consorcios Estratégicos Nacionales de Investigación Técnica (CENIT) 2008 \nEntidades participantes: Telefónica I+D, Telvent, AT4Wireless, iSOCO, WorldNet21, Instalaciones Inabensa, Treelogic, Caja \nNavarra, Sugar Factory, TB Solutions. OPIs y CITs subcontratadas: CICtourGUNE, Robotiker-Tecnalia, Universidad \nPolitécnica de Madrid, Universidad Politécnica de Valencia, Universidad de Cantabria, Universidad de Deusto, Universidad \nde Granada, Universidad de Valladolid, Universidad de Málaga, Universidad de Cantabria, Universidad Rey Juan Carlos, \nUniversidad de Castilla la Mancha, Universidad de Vigo, Universidad Politécnica de Cartagena, CTTC, ECSC, Fundación \nCTIC, CEMITEC, ESI \nDuración,  desde: Marzo 2008 \nhasta: Diciembre 2011 \n \nCuantía de la subvención: 21.952.412 € (total) \n \n \n \n \n \n \n \n \n \n \n            312.742 € (UPM) \nInvestigador responsable: Tomás Cruz Serrano \nInvestigador responsable por la UPM: Óscar Corcho García \nNúmero de investigadores participantes: más de 100 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: Red Temática de Web Semántica (Renovación) (TSI2007-29712-E) \n  \nEntidad financiadora: Ministerio de Educación y Ciencia \nConvocatoria: Acción Complementaria del Plan Nacional de Investigación Científica 2007 \nEntidades participantes: OEG (UPM), SDI (UniZar), GSI (USC), TCMC (UM), DELi (UDeusto), GAIA (UCM), OntoQuercus \n(UNEX), Kybele (URJC), AIKE (UM), KEFEK (UniLeon), GSI (UJI), IE (UAH), LTW (UC3M), SIVA (UCo), CEU, BDI (UPV), \nNETS (UAM), WESO (UOv), KEAM (USC), GruSMA (URV), LTCS-NLP (UNED), ISG (UGr), Alarcos (UCLM), SINBAD \n(UPM), SoftLab (UC3M), Khaos (UMa), eContent (UMon) \nDuración,  desde: Noviembre 2007 \nhasta: Octubre 2008 \n \nCuantía de la subvención:  12.000 €  \nInvestigador responsable: Asunción Gómez-Pérez \nNúmero de investigadores participantes: 120 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: GeoBuddies. Anotación Semántica Colaborativa con Dispositivos Móviles en el Camino de \nSantiago (TSI2007-65677-C02-01)  \n \nEntidad financiadora: Ministerio de Educación y Ciencia \nConvocatoria: Programa Nacional de Tecnologías de Servicios para la Sociedad de la Información (TSI) 2007 \nEntidades participantes: Universidad Politécnica de Madrid, Universidad de Santiago de Compostela \nDuración,  desde: Octubre 2007 \nhasta: Septiembre 2010 \n \nCuantía de la subvención: 151.250 € (total) \n              64.909 € (UPM) \nInvestigador responsable: Asunción Gómez Pérez \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nNúmero de investigadores participantes: 22 \nTipo de participación: Miembro del equipo investigador \n",
  "speaker": "SYSTEM",
  "uuid": "2b2dea4c-7ef5-499d-821c-f0f020684a23"
}