{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nGoal\n2\nOverview\n3\nPeople Involved\n4\nSources\n5\nPlanning\n6\nTO DO List\n7\nAspects to consider\nGoal\n\nMorph (former ODEMapster) aims to be a reference implementation of the R2RML mapping language.\nOverview\n\nThe figure shows the initial architecture of Morph.\nThe architecture is based on the current\nR2RML Specification\n.\nThe mapping module will be based on the following API\nNotes:\nOur aim is to work with relational databases, but Morph has to be extensible to other kind of databases/resources.\nFor the following modules\nR2RML Mapping Reader\nRDF Generator\nRDF Writter\nMorph will be based in the Jena RDF library.\nTo include a minimal configuration module for\nthe location of the r2rml mapping file\nthe database connection information\nPeople Involved\n\nBoris\nJean Paul\nFreddy\nAlex\nDaniel Vila\nSources\n\nThe sources are available at [\nGooglecode\n]\nPlanning\n\nT1. Set up the repository - Done (Thanks JP!)\nT2. First architecture - February 3rd\nT3. Definition of the RDF library to work with - February 3rd\nT4. Identification of modules we can reuse of our previous work - February 3rd\nT5. Implementation of the rest of the modules - ?\nT6. Integration of the modules - ?\nT7. Testing and validation - ?\nFirst alpha version - February 28th\nTO DO List\n\nTo define the architecture - All - T2\nSesame, jena, etc All - T3\nTo check if we can reuse our existing work, for example Freddy would you please check if we can reuse some modules of ODEMapster2 - All - T4\nAspects to consider\n\nWe should be considering a streaming model rather than a batch model (that is, we stream the results as they are obtained, instead of constructing a model in memory that is later on persisted somewhere or flushed into a file or database). This is necessary to ensure robustness and scalability of the approach.\nWe should be also considering the possibility of applying this to a stream of incoming tuples (ala OGSA-DAI), where we apply the changes as tuples come in. I know that this is a difficult architectural decision, but it would make the system very competitive wrt other approaches.",
  "speaker": "SYSTEM",
  "uuid": "2bba036e-d786-43d4-a46b-0e9a20de9dec"
}