{
  "message": "SYSTEM: D5.3.2.pdf: Página 4\nPage 4 of 48 \nNeOn Integrated Project EU-IST-027595 \n \n0.94 \n6-1-2009 \nRosario Plaza \nEnglish general revision \n1.0 \n10-12-2009 \nMari Carmen Suárez-Figueroa \nUpdates and final version  \nExecutive Summary \nMethodologies should involve the following issues: development process, life cycle models and life \ncycle, methods, techniques and tools to be used during the ontology building. Thus, within the \nNeOn project and inside WP5, we are investigating such issues. \nIn deliverable D5.3.1 [ 10] we dealt with the three first issues: development process, life cycle \nmodels and life cycle, and we presented the following results: \n1. The NeOn Glossary of Activities Version 1, which identifies and defines the activities \npotentially involved in the ontology network construction. \n2. The first collection of theoretical ontology network life cycle models, based on those models \ndefined in the Software Engineering field and taking into account the specific features of the \nontology network development. \n3. Guidelines for obtaining the concrete life cycle for an ontology network mainly based on two \ndecision trees: (a) one for selecting the ontology network life cycle model most appropriate \nfor the concrete case and (b) another for selecting which activities, from the NeOn Glossary \nof Activities, should be carried out. \n4. The identification and description of complex scenarios for building network of ontologies \ncollaboratively with special emphasis in reuse, reengineering and merging ontological and \nnon-ontological resources.  \nThus, the main goal of this deliverable is to present a revision and an extension of the \nmethodological issues presented in deliverable D5.3.1 [ 10].  \nConcretely, this deliverable deals with the update of the glossary of activities involved in the \nontology network development process, the update of the ontology network life cycle models,  and \nthe improvements of methodological guidelines for establishing the ontology network life cycle and \nthe schedule for the ontology network development project.  \nThe scope and main contributions of this deliverable are: \n1. The update on the NeOn Glossary of Processes and Activities, and a summary of the \nrelationships between such processes and activities and the NeOn plug-ins.  \n2. A new version of the collection of the ontology network life cycle models, and the \nrelationships between scenarios for building ontology networks and ontology network life \ncycle models. \n3. Methodological guidelines for scheduling ontology network projects. \n4. The main functionalities of the gOntt plug-in, which will be the technological support for the \nscheduling activity. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "2bbffa02-8582-444e-88b4-2a8a3ac133e9"
}