{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/InteligenciaArtificial-grado-10-11 \n\n1. Introducción a la Representación del Conocimiento [\nTransparencias\n]\n2. Marcos [\nTransparencias\n]\n3. Sistemas de Producción [\nTransparencias\n]  [\nEjercicios\n]\n4. Redes semánticas [\nTransparencias\n] [\nEjercicios\n]\nContents\n[\nhide\n]\n1\nPrácticas\n1.1\nPráctica 1\n1.1.1\nNormas de entrega\n1.1.2\nSoftware a utilizar y documentación adicional\nPrácticas\n\nPráctica 1\n\nTransparencias\nSe debe diseñar una red semántica, que debe ser implementada en el lenguaje RDF [1], que represente la información correspondiente a los planes de estudio, cursos, asignaturas, aulas, departamentos, profesores, etc., de la Facultad de Informática [2], y que están disponibles en diversos formatos (Microsoft Excel, PDF, ficheros ASCII, etc.). A partir de estos datos y de su estructura, se deberán crear las ontologías que se consideren más adecuadas, y si es posible, enlazando algunas de estas informaciones con otras redes semánticas disponibles en la Web, como las de DBPedia [4], GeoLinkedData [5], GeoNames [6], etc. También se pueden utilizar buscadores genéricos como sig.ma [7].\nNormas de entrega\n\nLa práctica deberá ser enviada a la cuenta de correo electrónico ocorcho@fi.upm.es antes de las 15:00 del día 26 de octubre de 2010. Si no se ha recibido confirmación explícita de la recepción de la práctica, los alumnos se deberán poner en contacto con el profesor de la asignatura lo más pronto posible.\nSe deberá adjuntar un fichero comprimido con el nombre PrácticaIARedesSemánticas_XXX.zip, donde XXX es el nombre y apellidos de uno de los autores de la práctica. El fichero contendrá la siguiente información:\nFichero “autores.txt” con los nombres y apellidos, y número de matrícula, de cada uno de los alumnos.\nFichero “memoria.pdf”, con la memoria de la práctica, que no debe exceder 5 páginas, donde se deberán incluir las principales decisiones de diseño tomadas para la construcción de la red semántica y la selección de vocabularios y estructura de la red, así como la descripción del proceso realizado para la generación del código RDF.\nFichero “datos.rdf” con la implementación en RDF.\nSoftware a utilizar y documentación adicional\n\nPara la implementación de la red semántica se puede utilizar cualquier software que permita la edición de ficheros de texto o la gestión de datos en el formato RDF, tanto desde una interfaz de usuario (por ejemplo, la herramienta Altova SemanticWorks [8]) como a través de una interfaz de programación (por ejemplo, Jena [9]).\nEn las horas de tutoría de práctica no se atenderán dudas básicas relacionadas con estos sistemas, pues los alumnos deben ser capaces de leer la documentación asociada a los mismos, sino sólo dudas que pueden estar relacionadas con el diseño de la red semántica y el proceso de transformación.\n[1]\nhttp://www.w3.org/RDF/\n[2]\nhttp://www.fi.upm.es/\n[4]\nhttp://dbpedia.org/\n[5]\nhttp://geo.linkeddata.es/\n[6]\nhttp://www.geonames.org/\n[7]\nhttp://sig.ma/\n[8]\nhttp://www.altova.com/semanticworks/rdf-editor.html\n[9]\nhttp://jena.sourceforge.net/",
  "speaker": "SYSTEM",
  "uuid": "2bedbf24-4a64-4287-94d8-2bafca516d58"
}