{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 11\n \n \nPág. 13 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n• \nSubdirección General de Tecnologías de la Información y de las Comunicaciones de la \nAdministración General del Estado del Ministerio de Sanidad, Servicios Sociales e \nIgualdad. \nSe espera además la próxima incorporación de otros organismos que han mostrado su interés \nen formar parte de éste Comité. \nEl Comité Directivo creó, a su vez, un Comité de Expertos para la elaboración de un Informe \nprevio que sirviera de apoyo para la creación del Plan de Impulso de las Tecnologías del \nLenguaje10. Dicho Comité de Expertos está formado por: \n• \nReal Academia Española de la Lengua. \n• \nInstituto Cervantes. \n• \nInstituto de España. \n• \nBiblioteca Nacional de España. \n• \nReal Academia de Ingeniería. \n• \nGrupos investigadores especializados en Procesamiento del Lenguaje Natural y \nTraducción Automática (SEPLN). \n• \nGrandes empresas del sector TIC español. \n• \nAgrupaciones empresariales especializadas en Procesamiento del Lenguaje Natural y \nTraducción Automática. \n• \nRepresentantes de la política de Reutilización de la Información del Sector Público \n(RISP). \n• \nDirección de Tecnologías de la Información y la Comunicación de la Administración \n(DTIC). \n• \nComisión para la Reforma de las Administraciones Públicas (CORA). \n• \nCooperación Internacional y para Iberoamérica. \nEl análisis del Comité de Expertos se resume en el siguiente Análisis DAFO: \nFORTALEZAS \n Desarrollo de líneas de investigación en procesamiento de lenguaje natural en España que \nabarcan casi todos los ámbitos en los que se trabaja actualmente a nivel internacional. Existen \nrecursos y herramientas propias, consolidadas y robustas para hacer el procesamiento básico \nde procesamiento de lenguaje natural y traducción automática para el castellano, catalán, \nvasco y gallego, además del inglés y se dispone de amplia información del sector público \n                                                           \n10 Informe sobre el estado de las tecnologías del lenguaje en España dentro de la Agenda Digital para España. \n",
  "speaker": "SYSTEM",
  "uuid": "2c08665a-aaf5-4d01-9545-805b11dbc907"
}