{
  "message": "SYSTEM: D5.3.2.pdf: Página 19\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 19 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n3. Scenarios for Building Ontology Networks and Life Cycle Models \nBased on the analysis of the NeOn use cases, on the different studies carried out to revise the \nstate of the art of ontology development and on the building of ontologies in different international \nand national projects (Esperonto, Knowledge Web, SEEMP, SEKT, etc.), we have detected that \nthere are different ways or paths to build ontologies and ontology networks.  \nFor this reason within the NeOn project, we identified different scenarios for building ontology \nnetworks, emphasizing the reuse and reengineering. To date we have identified 9 scenarios, and \neight of them were described in deliverable D5.3.1 [ 10]. \nAdditionally, in deliverable D5.3.1 [ 10] we defined an ontology network life cycle model as the \nframework, selected by each organization, on which to map the activities identified and defined in \nthe NeOn Glossary of Activities to produce the ontology network life cycle.  \nSince there is not a unique model valid for all the ontology development projects, in deliverable \nD5.3.1 [ 10] we proposed a collection of theoretical ontology network life cycle models based on the \nmodels commonly used in Software Engineering and taking into account the specific features of \nthe ontology network development. These ontology network life cycle models vary from trivial and \nsimple models to difficult and complex ones.  \nIn this section we describe in detail the scenario not described in deliverable D5.3.1 [ 10], we \nupdate the collection of models, and we establish the relation between scenarios and models. \n3.1. Scenarios for Building Ontology Networks \nThe NeOn methodology [ 11] has identified a set of nine flexible scenarios for collaboratively \nbuilding ontologies and ontology networks, with special emphasis on reusing and reengineering \nknowledge-aware resources (ontological and non-ontological).  \nFigure 5 presents the set of the 9 most plausible scenarios for building ontologies and ontology \nnetworks. The directed arrows with associated numbered circles represent the different scenarios. \nEach scenario is decomposed into different processes or activities. Processes and activities are \nrepresented with coloured circles or with rounded boxes, and are defined in the NeOn Glossary of \nActivities [ 12,  13]. Figure 5 also shows (as dotted boxes) the existing knowledge resources to be \nreused, and the possible outputs that result from the execution of some of the presented scenarios.  \n",
  "speaker": "SYSTEM",
  "uuid": "2ca925c8-266d-4523-9eee-a10e5429d44b"
}