{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Pattern \n\nOntologyDesignPatterns.org is a Semantic Web portal dedicated to ontology design patterns (OPs):\nhttp://ontologydesignpatterns.org/wiki/Main_Page\nPeter Clark, John Thompson, Bruce Porter. Knowledge patterns (2000) In Proc. of KR-2000\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.11.9400\nthe first paper about knowledge pattern\nXi Deng, Volker Haarslev, Nematollaah Shiri. Measuring inconsistencies in ontologies (2007)In ESWC (2007) 326–340\nhttp://www.eswc2007.org/pdf/eswc07-deng.pdf\nAldo Gangemi. Design patterns for legal ontology constructions In 2nd Workshop on Legal Ontologies and Artificial Intelligence Techniques, pp. 65-85\nhttp://ftp.informatik.rwth-aachen.de/Publications/CEUR-WS/Vol-321/paper4.pdf\nGangemi A., Presutti V. (in press). Ontology Design Patterns. In S. Staab, R. Studer (Ed.),  Handbook of Ontologies (2nd edition). Springer: Berlin.\nGangemi A. (2007). Design Patterns for Legal On-tology Construction. In P. Casanovas, P. Noriega, D. Bourcier, F. Galindo (Ed.),  Trends in Legal Know-ledge: The Semantic Web and the Regulation of Elec-tronic Social Systems European Press Academic Pub-lishing.\nGangemi, A. (2005). Ontology Design Patterns for Semantic Web Content. In M. Musen et al. (eds.): Pro-ceedings of the Fourth International Semantic Web Conference Berlin, Springer.\nJoey Lam, Jeff Z. Pan, Derek Sleeman, Wamberto Vasconcelos. A Fine-Grained Approach to Resolving Unsatisfiable Ontologies\nJournal of Data Semantics (JoDS). : pages 62-95\nhttp://www.abdn.ac.uk/~csc280/LPSV06.pdf\nhttp://www.csd.abdn.ac.uk/publications/listpersonal.php?username=jpan\nYue Ma, Pascal Hitzler, and Zuoquan Lin. Approaches to inconsistency handling in description-logic based. In Proc. of WI'06, 2006. 13.\nhttp://www.aifb.uni-karlsruhe.de/WBS/gqi/papers/swws07.pdf\nPresutti V., Gangemi A. (2008). Content Ontology Design Patterns as practical building blocks for web ontologies. In Proceedings of ER2008 Barcelona, Spain.\nthis article is part of the D2.5.1 Neon Deliverable. it describe two CP: information realization and Time indexed person role pattern and how to reuse them in another ontology.\nPresutti V. & al.Neon Deliverable D2.5.1: A Library of Ontology De-sign Patterns <\nhttp://www.neon-project.org\n>\nJoerg Rech, Raimund L. Feldmann, Eric Ras;  \"Knowledge Patterns\". In M. E. Jennex (Ed.), Encyclopedia of Knowledge Management (2nd Edition), IGI Global, USA, 2009.\nJoerg Rech, Bjoern Decker, Eric Ras, Andreas Jedlitschka, Raimund L. Feldmann;  \"The Quality of Knowledge: Knowledge Patterns Knowledge Refactorings\". International Journal of Knowledge Management, Vol. 3, No. 3, p. 74-103, 2007.\nHai Wang, Alan Rector, Nick Drummond, Matthew Horridge, et al. OWL Pizzas: Practical Experience of Teaching OWL-DL: Common Errors & Common Patterns. EKAW 2004\nhttp://www.co-ode.org/resources/papers/ekaw2004.pdf\nexplain the most important errors made by newscomers in DL\n.\nother paper of Alan Rector for the COODE project\nhttp://www.co-ode.org/resources/papers/\nlots about debugging, normalizing and so one...\nSemantic Web Best Practices and Deployment Working Group\nhttp://www.w3.org/2001/sw/BestPractices/\nCollection of antipattern in Laboratory for Applied Ontology\nhttp://wiki.loa-cnr.it/index.php/LoaWiki:MixedDomains\nthey are 4 Logical anti-pattern I do not understand one of them.",
  "speaker": "SYSTEM",
  "uuid": "2ccf0767-a7c7-43c8-8332-9f79fe79e592"
}