{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 20\n \n \nPág. 22 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nEllo comprende también la necesidad de formación especializada a la industria tanto del sector \nde las Tecnologías de la Información como de los distintos sectores verticales que son \npotenciales usuarios de esta tecnología. Ha de lograrse dar una mayor difusión a los proyectos \nactuales y a las capacidades actuales  de la técnica. \nPor otra parte, se plantea el apoyo a la internacionalización de las empresas e instituciones que \ncomponen el sector. Se ha de fortalecer el mantenimiento y creación de recursos lingüísticos \ncon alta capacidad de internacionalización y su adaptación a los países objeto de exportación. \nEsta tarea puede verse amplificada por el alto prestigio y capacidad difusora de instituciones \ncomo la Real Academia Española. La mejora de la visibilidad internacional de empresas e \ninvestigadores españoles debe realizarse de forma coordinada con el trabajo del ICEX, por \nmedio de misiones comerciales, presencia en congresos internacionales, proyectos \ndemostradores, etc. Se prestará una atención especial a la cooperación con la Comunidad \nIberoamericana. \nEje III: La Administración como impulsor de la Industria del Lenguaje \nEl servicio público que prestan las administraciones es un potencial beneficiario de las \ntecnologías del lenguaje. Por su carácter transversal, sus aplicaciones son muy numerosas. \nEjemplos que no agotan estos potenciales beneficios son: \n• \nAumentar la capacidad, calidad y automatismo de los servicios de atención al \nciudadano por los canales telefónico e Internet; y cada vez más, en movilidad. \n• \nMejorar la capacidad y la calidad, al tiempo que se reduce su coste, de la traducción \nentre el castellano y las lenguas cooficiales. \n• \nMejorar la capacidad, calidad y rapidez de la tramitación administrativa \nincorporando etapas de procesamiento automático de información en lenguaje \nnatural. \n• \nMejorar la accesibilidad a personas discapacitadas. \n• \nMejorar el conocimiento profundo y actualizado de los distintos sectores para la \ndirección de políticas públicas. \nSiguiendo, además, el espíritu propuesto por la Comisión para la Reforma de las \nAdministraciones Públicas (CORA), la Administración española se plantea la necesidad de la \neliminación de duplicidades administrativas y de proporcionar servicios públicos comunes de \ncalidad. En consecuencia, en este eje se propone la creación de sendas plataformas comunes de \nprocesamiento del lenguaje y de traducción automática para las Administraciones Públicas. \nPor otro lado, la política de Reutilización de la Información del Sector Público (RISP) representa \nuna extraordinaria oportunidad para el desarrollo de la industria del procesamiento del lenguaje \nnatural por el gran valor potencial como recurso lingüístico que tiene buena parte de la \ninformación que genera el sector público. Dichos recursos comprenden, por ejemplo, textos \nlegales y contractuales, traducciones juradas, diccionarios terminológicos especializados en \ndominios específicos, nombres de entidades (personas, topónimos, organizaciones, empresas, \n",
  "speaker": "SYSTEM",
  "uuid": "2f3b9b41-acc9-4b65-81f5-02146f01eebf"
}