{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nPersonal en vacaciones (redacción del paper para el ISWC2010)\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Extracción de datos para la evaluación del paper del ISWC\nTarea 3. Modelo de anotación híbrido\n.\nTarea Integración y patrones de reconocimiento avanzado 2.\nBúsqueda de un corpus de pruebas y métodos automáticos de evaluación.\nRealización de pruebas sobre un conjunto de páginas web con el fin de obtener resultados y evaluar el servicio REST. Tras las pruebas se han encontrado errores como tratamiento incorrecto de tildes, el servicio de Sindice limita su uso cuando el número de peticiones es elevado y la petición de token ralentiza excesivamente el sistema debido al número de elementos que se han de tratar.\nPrimer intento de migración del servicio REST a regulo.\nCompletar las transparencias de Avances 2010.\nInterfaz Anotación Híbrida\n\n- Se sigue mejorando la persitencia en el sistema final, para compartir las anotaciones con amigos y toda la tendencia social.\n- Se viene formateando salida de RDF con ARC php.\n- Se ha probado una API para publicar en redes sociales con addthis.\n- Se ha cambiado el diseño y el nombre del portal a Navegador Extendido, esto ultimo sugerido por Oscar C.\n- Se esta probando llamadas a servicio de Andres.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha realizado pruebas sobre un entorno con dos máquinas con trabajos simples basado en comandos Linux a fin de comprobar que las tareas se distribuyen correctamente de acuerdo al algoritmo de planificación.\n- Se ha instalado Globus TK y se está procedeciendo a configurar el GridFTP.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSe continúa con la redefinición del formato de escritura manual de los conjuntos de referencia para poder realizar su transcripción automática al formato OEGMappings. Se realizan pruebas con codificación de continuidad de mappings.\nRediseño del conversor automático de conjuntos de referencia en formato manual a\nformato OEGMapping.\nTarea 7.1\n\n- RDF.\n· Continuación de la generación de RDF para otros dominios\n      · Tratamiento de la geometría (bases de datos) para incorporación al RDF\n- Divulgación\n. Redacción de paper para I-Semantics\n      · Envío abstract al ACM SIGSPATIAL",
  "speaker": "SYSTEM",
  "uuid": "2f3eda74-ab14-4206-8e3b-4fe1d5ab4663"
}