{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 303\nMINISTERIO DE EDUCACIÓN, POLÍTICA SOCIAL Y DEPORTE\n309\n495.- Catálogo General de la Biblioteca General del Centro de Investigación\ny Documentación Educativa (CIDE)\nDirección Web: http://www.mcu.es/comun/bases/spa/bmec/BMEC.html\nOrganismo editor: Centro de Investigación y Documentación Educativa (CIDE).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Educación.\nDescripción y comentarios: Catálogo General del CIDE. El catálogo informatizado de la\nbiblioteca (BIBLIOMEC) comprende todo el fondo de la biblioteca en el que están repre-\nsentadas todas las materias que cubren la temática educativa, y de modo especial la legis-\nlación, educación comparada, enseñanza primaria, secundaria, profesional, especial, de\nadultos y universitaria, administración y política educativa. Las ciencias auxiliares de la\neducación, en especial la sociología y la psicología, están igualmente representadas con\nuna importante colección de obras. Esta base de datos, con unos 125.000 registros, es la\nmás importante en el campo de la educación que existe en España. \n496.- Sumarios de Publicaciones Periódicas de la Biblioteca General del Centro\nde Investigación y Documentación Educativa (CIDE)\nDirección Web: http://www.mec.es/cide/jsp/plantilla.jsp?id=bib03\nOrganismo editor: Centro de Investigación y Documentación Educativa (CIDE).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Educación.\nDescripción y comentarios: Todos los sumarios de las publicaciones periódicas son digi-\ntalizados y puestos a disposición de los usuarios el mismo día en que llegan a la Biblioteca.\nEllo permite al usuario interesado estar al día de manera inmediata de las más significati-\nvas publicaciones de todo el mundo en el área educativa. En la actualidad están ya dispo-\nnibles todos los sumarios de las publicaciones periódicas ingresadas desde principios de\n1998 hasta la fecha. La selección de la revista que interesa es sumamente simple, al poder\nelegirla a través de una lista alfabética de títulos, pudiendo a continuación ver todos los\nnúmeros digitalizados para seleccionar aquel que interesa. \nBASES DE DATOS  1/1/04  03:39  Página 309\n",
  "speaker": "SYSTEM",
  "uuid": "2f6745f0-3535-41e4-aba9-cba3371e3131"
}