{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 14\nor two people. Both experiments were carried out with methodological guidelines for \nthe ontology requirements specification activity. Most of the students considered that \nthe guidelines for the ontology requirements specification activity were useful. All of \nthem expressed their intention of using again the methodological guidelines for the \nontology requirements specification activity. However, some of the students \ncommented they would prefer to have such guidelines integrated in an ontology \nrequirements specification tool. Students also stated that they found useful to write the \nontology requirements specification document before going into the ontology \ndevelopment. Additionally, students commented that (1) the three first tasks in the \nmethodological guidelines should be explained in more detail; (2) the tasks of writing \nand validating CQs, as well as giving priority to CQ, could be further described; and \n(3) the task about extracting terminology should be clarified.  \nAs already mentioned, the guidelines for the ontology requirements specification \nactivity proposed here were used in the development of the SEEMP Reference \nOntology16. In Section 4 we present how the final ORSD obtained in such a project \nwas used during the ontology development. Such a final ORSD has been presented in \nSection 2 as an example while the methodological guidelines were explained. \nAdditionally, it is worth mentioning that comments provided by ontology \ndevelopers involved in the aforementioned cases are allowing us to improve and \nupdate the methodological guidelines for the ontology requirements specification \nactivity. \n4   Ontology Requirements Specification and Other Activities \nThe guidelines presented here for the ontology requirements specification activity \nwere used in the development of ontologies in the public e-Employment services \ndomain within the SEEMP project. In this section we present how the ontology \nrequirements specification document allows (a) a more direct search for available \nknowledge resources to be reused in the ontology development, and (b) the evaluation \nof the ontology content. \nTerms with the highest frequency included in the pre-glossary of terms of the \nORSD were used to direct the search of existing knowledge-aware resources that \ncover the terminology in question in internet and in standardization bodies (e.g. ISO \nand proprietary resources in the intranet of companies). We also looked for existing \nontologies using Watson and other semantic search engines. Thus, the ORSD was the \nkey input in the search process in the following way: \n• \nWe searched for time ontologies describing the terms related with time and date \nmanagement (e.g., year, month, etc.). We used the comparative study of nine \ntime ontologies presented in [3] and then we selected the DAML Time \nOntology17. \n• \nWe searched for standards of occupations and economic activities in high reliable \nWeb sites, domain-related sites and resources within organizations, instead of \n                                                           \n16 The resultant ontology is available at http://droz.dia.fi.upm.es/hrmontology/ \n17 http://cs.yale.edu/homes/dvm/daml/time-page.html \n",
  "speaker": "SYSTEM",
  "uuid": "2fc86f98-7177-4f83-9080-fc004d1af6bc"
}