{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 94\nPage 94 of 124\nNeOn Integrated Project EU-IST-027595\nChapter 6\nMethod and tool for re-engineering\nfolksonomies\nThe re-engineering of resources on a speciﬁc domain aims at lowering the cost and effort of creating domain\nontologies from scratch. The goal of this work is to create an ontological structure for a folksonomy of a\nspeciﬁc domain by utilising automatically selected knowledge from online available ontologies.\nIn the following we describe the process of transforming a folksonomy tagset over a speciﬁc domain into an\nontology covering this domain. Our folksonomy semantic enrichment tool, FLOR, described in Section 6.1,\ncan operate on any tagspace independently thus the selection of folksonomy tagspaces depends on the\ndomain of interest. For example many organisations have introduced folksonomies as part of their content\nmanagement procedures. The tags of these close-world corporate folksonomies are provided by the employ-\nees of these organisations thus describe relevant domain concepts. The re-engineering of these corporate\nfolksonomies can result to corporate ontologies for the related organisation.\nAlternatively, in cases where the domain of interest is more generic or independent of speciﬁc organisations\ne.g., Flora or Fauna, the large scale open folksonomies freely available on the web i.e. Flickr or delicious\nprovide social network information such as user groups of interest on speciﬁc domains such as Flowers1 or\nAnimals2. The extraction of these groups’ tags provide a domain related folksonomy tagspace to re-engineer\nand acquire the relevant ontology.\n6.1\nSemantic Enrichment of Tags with FLOR\nWe introduce FLOR, a tool for automatic folksonomy enrichment by combining knowledge from WordNet\nand online ontologies. The goal of FLOR is to transform a ﬂat folksonomy tagspace into a rich semantic\nrepresentation by assigning relevant Semantic Web Entities (SWEs) to each tag. A SWE is an ontological\nentity (class, relation, instance) deﬁned in an online available ontology. While here we describe the process\nof enriching a set of tags with SWEs, the ultimate goal of our FLOR is not just to connect to SWE’s but also to\nbring in other knowledge related to these SWE’s. An example of the inputs and expected outcomes of FLOR\nis demonstrated in Fig. 6.1. The input consists a set of tags and the output is a set of semantically enriched\ntags, connected with each other to an ontological structure. Note that FLOR is agnostic to the way in which\nthis tagset was obtained. It can either be the set of all tags associated to a domain speciﬁc resource, or a\ncluster of related tags obtained through co-occurrence based clustering over the total domain tagspace. The\nexperiments reported in this work used sets of tags associated with a given resource.\nIntuitively, FLOR performs three basic steps (see Fig. 6.1 and 6.2). First, during the Lexical Processing\nthe input tagset is cleaned and all potentially meaningless tags are excluded. We rely on a set of heuristics\nto decide which tags are likely to be meaningless. Second, during the Sense Deﬁnition and Semantic\n1http://www.flickr.com/groups/florus/\n2http://www.flickr.com/groups/animal_planet/\n",
  "speaker": "SYSTEM",
  "uuid": "2fdc214c-9921-43db-bb87-8fdf75cf7afb"
}