{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 9\n \n \nPág. 11 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nde Europa que no pueden abarcar la totalidad del mercado europeo o internacional. El informe \nrecomienda el apoyo a estas empresas con infraestructuras específicas para acceder a recursos \ny tecnología. \nHasta el momento, en traducción automática domina el mercado europeo. Se trata de un sector \nestratégico para la Unión Europea dado que contamos con 24 lenguas oficiales, algunas de ellas \nen peligro de extinción digital. En la actualidad, el sector industrial se compone de unas 2.500 \nempresas y 800 centros de investigación en procesamiento de lenguaje natural6. Según un \ninforme europeo7, el sector de la traducción automática en Europa alcanzó en 2011 la cifra de \n8.600M € y llegará al valor de 14.900 M€ en 2015. Los ratios de crecimiento de otros mercados \nmundiales menos maduros serán mucho mayores. \nEn las convocatorias del programa marco H2020 y en la definición del programa Connecting \nEurope Facillity (CEF) se persigue la puesta en marcha de servicios digitales a nivel paneuropeo, \nincluyendo servicios lingüísticos para garantizar un mecanismo de coordinación de información \ny acceso a recursos lingüísticos para las lenguas de Europa.  \nEl español es la lengua más hablada del mundo después del chino, si tenemos en cuenta los \nhablantes nativos, y también la segunda lengua en un cómputo global de hablantes. Representa \nel 6,7% de la población mundial contando con casi 470 millones de hablantes. Se prevé que en \n2030 los hispanohablantes serán el 7,5% de la población mundial8. \nEl uso del mismo idioma aumenta por tres la cuota de exportaciones de España a los países de \nhabla hispana. Nueve de cada diez usuarios de la tecnología que se potencia en el presente Plan \nse encuentran fuera de nuestras fronteras. Además, existen otras comunidades \nhispanohablantes en Norteamérica con un enorme potencial de crecimiento. Nuestra \nproximidad geográfica, histórica y lingüística nos acerca además a la otra gran lengua de la \nComunidad Iberoamericana, el portugués.  \nPor otra parte, España cuenta con prestigiosas organizaciones internacionales especializadas en \nla lengua española, entre las que destacan la Real Academia Española o el Instituto Cervantes, \ncon una enorme capacidad de difusión en Iberoamérica. También se cuenta con prestigiosas \nacademias en áreas de conocimiento especializadas como Medicina, Ingeniería, etc. \nAdicionalmente, los investigadores y una buena parte de la Industria del sector, se encuentran \nagrupados alrededor de la Sociedad Española para el Procesamiento del Lenguaje Natural \n(SEPLN), que ha cumplido su XXXI aniversario en 2015. En España existen numerosos grupos \ninvestigadores de reconocido prestigio internacional trabajando en procesamiento del lenguaje \nespañol y lenguas cooficiales así como grupos especializados en semántica. Asimismo, se han \nconfigurado algunas agrupaciones científico-empresariales en Cataluña,  País Vasco y Madrid \nalrededor de la industria del lenguaje. \nA pesar de que existe el potencial para disponer de una industria de éxito, el estudio realizado \npor la Multilingual Technology Alliance (META) y la red de excelencia asociada META-NET \n                                                           \n6 “Strategic Agenda for the Multilingual Digital Single Market”, CRACKER and LT_Observatory. \n7 \"LT2013: Status and Potential of the European Language Technology Markets”, LT-Innovate. \n8 “El español: una lengua viva” Informe 2015, Instituto Cervantes. \n",
  "speaker": "SYSTEM",
  "uuid": "2ff89197-91b9-4476-94e7-1789060e6961"
}