{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 19\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 19 de 42 \nEntidades participantes: Telefónica I+D, iSOCO, Universidad Politécnica de Madrid  \nDuración,  desde: 01/09/2008  hasta: 30/06/2010   \nInvestigador responsable por la UPM: Oscar Corcho García \n \nTítulo del proyecto: España Virtual  (CENIT 2008-1030) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: Deimos Space S.L., Androme Iberica, S.L., Centro Nacional de Información \nGeográfica, Dnextep Consulting, S.L., Grid Systems, S.A., GeoSpatiumLab, S.L., GeoVirtual, S.L., Indra \nEspacio, S.A., Universidad Politécnica de Madrid, Universidad Carlos III de Madrid, Universidad de \nMálaga, Barcelona Media, Animante Baleares, Universidad de Zaragoza, Universidad de Valladolid, \nUniversidad Jaume I, Solucions on Hand, ELIMCO Sistemas, SIGRID, IVER, UNED, Universidad \nPolitécnica de Catalunya, Universitat de les Illes Balears, Bot Consulting.  \nDuración,  desde: 01/10/2008 hasta: 31/12/2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: mIO! Tecnologías para prestar servicios en movilidad en el futuro universo \ninteligente (CENIT 2008-1019) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: Telefónica I+D, Telvent, AT4 Wireless, iSOCO, Worldnet 21, Instalaciones \nInabensa, TreeLogic, Caja Navarra, Sugar Factory, TB Solutions, CICtourGUNE, Robotiker-Tecnalia, \nUniversidad Politécnica de Madrid, Universidad Politécnica de Valencia, Universidad de Cantabria, \nUniversidad de Deusto, Universidad de Granada, Universidad de Valladolid, Universidad de Málaga, \nUniversidad de Cantabria, Universidad Rey Juan Carlos, Universidad de Castilla la Mancha, Universidad \nde Vigo, Universidad Politécnica de Cartagena, Centre Tecnològic de Telecomunicacions de Catalunya \n(CTTC), European Centre for Soft Computing, Fundación CTIC, European Software Institute \nDuración,  desde: 01/09/2008 hasta: 31/12/2011 \nInvestigador responsable: Oscar Corcho García (UPM) \n \nTítulo del proyecto: SemsorGrid4Env Semantic Sensor Grids for Rapid Application Development for \nEnvironmental Management (FP7-223913) \nEntidad financiadora: Unión Europea \nEntidades participantes: Universidad Politécnica de Madrid (coordinator); University of Manchester; \nNational and Kapodistrian University of Athens; University of Southampton; DEIMOS Space S.L., Emu \nLtd.y TechIdeas \nDuración, desde: \n01-09-2008 \nhasta: 31-08-2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez  \nCoordinador del proyecto: Asunción Gómez Pérez \n \nTítulo del proyecto: ADMIRE Advanced Data Mining and Integration Research for Europe (FP7-215024) \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Edinburgh; University of Viena; Universidad Politécnica de \nMadrid; Ústav informatiky, Slovenská akadémia vied; Fujitsu Labs of Europe y ComArch S.A. \nDuración, desde: \n01-03-2008 \nhasta: 28-02-2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez  \n \n \n \n \nCONTRATOS I+D desde 2010: \n \nTítulo del proyecto: Asesoría técnica para la gestión de proyectos de la Unidad de Gestión de la Web \nMunicipal utilizando metodologías ágiles y sus herramientas asociadas \nEntidad financiadora: Ayuntamiento de Zaragoza \nEntidades participantes: UPM \nDuración, desde: \n03-11-2014 \nhasta: 19-12-2014 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: Micro proyecto demostrador para el diseño e implementación de una ontología para \nun sistema de vigilancia del sector TIC \n",
  "speaker": "SYSTEM",
  "uuid": "2ff9c271-c1f9-4ab1-9f0a-e862c681d553"
}