{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_viajes2 \n\nAquellos miembros que viajen con más frecuencia tienen la posibilidad de contar con tarjeta mastercard de investigador OTT, de forma que puedan pagar gastos de desplazamientos (avión, trenes, alquiler de coche, gasolina), alojamiento e inscripciones.\nLos miembros que soliciten (o bien ya posean) dicha tarjeta tendrán igualmente una serie de obligaciones, de forma que el incumplimiento en tres ocasiones de cualquiera de ellas, comportará la cancelación de la tarjeta:\n1. Firmar un documento en el se comprometan a elegir una de las dos siguientes opciones :\na) Hacerse responsables de la consulta del extracto de movimientos de la tarjeta, de forma que cada vez que realicen un viaje (\nen el plazo de una semana\n), deberán facilitar junto con su declaración de gastos, el/los importe/s que efectivamente se hubieran cargado en la cuenta de la tarjeta, como consecuencia de los gastos pagados con ésta. \nb) Delegar en el equipo de gestión del OEG dicha obligación, facilitando para ello el código PIN de su tarjeta, de forma que éstos puedan consultar el extracto de movimientos a fin de agilizar la tramitación de la declaración de gastos. Ello sin perjuicio de la obligación de cada miembro de cumplimentar debidamente su declaración de gastos.\n2. No pagar con la tarjeta OTT:\n- Gastos personales\n- Gastos cuyo anticipo se hubiera solicitado\n- Peajes de autopistas\n- Comidas en restaurantes\n- Taxis, salvo que éstos superen los 50 euros y se tenga permiso para cogerlo\n- Tickets de metro y autobús\n- Gastos inferiores a 10€\n3. Es muy importante que las facturas vayan a nombre de la persona a la que se haya autorizado el gasto en la hoja previaje. En el caso de que un único miembro pague gastos “comunes” de dos o más miembros con la tarjeta OTT, se solicitarán facturas individuales de forma que, en la factura de cada uno de ellos figuren su nombre y apellidos.\nEn todos los casos\n\n1. Los miembros del OEG se comprometen a entregar al equipo de gestión sus hojas previaje con\n15 días\nde antelación (independientemente de que se solicite anticipo); así como sus declaraciones de gastos debidamente cumplimentadas (conforme a las instrucciones aquí reflejadas y las que se pudieran recoger en la propia hoja de viaje), junto con la  documentación  que acredite dichos gastos, en el plazo máximo de\n7 días naturales\n, desde la finalización del viaje. Se exceptuarán de este plazo, los casos en que un miembro deba realizar dos viajes seguidos, es decir, dos viajes sin acudir a la UPM entre uno y otro.\n2. Durante el viaje los miembros deberán conservar todos los tickets, facturas, billetes, tarjetas de embarque... que documenten gastos que deseen justificar. Por lo que se refiere a los gastos de manutención, se pagará en todos los casos el total del importe justificado mediante facturas. Estos gastos deberán reflejarse en la hoja posviaje en forma de múltiplos de dietas, de forma que habrá que calcular el total de gastos por ese concepto, y aproximarlo a dietas medias o enteras.\n3. Todos los miembros habrán de firmar un documento en el que constatarán que tienen conocimiento de todo lo expuesto en el presente protocolo de viajes, haciéndose responsables individualmente del retraso que pudiera derivarse en el cobro de los gastos de viaje, en el caso de que lo incumplan.\nDIETAS\n\nNota: Cuidado que Holanda viene como Países Bajos\nPaís\nManutención\nAlojamiento\nEspaña\n36,66\n58,90\nResto del mundo\n40,87\n108,78\nAlemania\n59,50\n132,82\nAndorra\n37,86\n46,88\nAngola\n59,50\n135,23\nArabia Saudita\n54,09\n101,57\nArgelia\n44,47\n101,57\nArgentina\n55,29\n111,19\nAustralia\n51,09\n81,14\nAustria\n58,90\n95,56\nBélgica\n82,94\n148,45\nBolivia\n36,66\n51,09\nBosnia-Herzegovina\n49,88\n72,72\nBrasil\n79,33\n128,02\nBulgaria\n37,86\n53,49\nCamerún\n48,68\n88,35\nCanadá\n51,69\n94,36\nChile\n50,49\n102,17\nChina\n46,28\n71,52\nColombia\n78,13\n123,81\nCorea\n55,29\n102,17\nCosta de Marfil\n49,28\n61,30\nCosta Rica\n44,47\n65,51\nCroacia\n49,88\n72,72\nCuba\n33,06\n56,50\nDinamarca\n64,91\n122,61\nRepública dominicana\n36,66\n64,31\nEcuador\n43,27\n64,91\nEgipto\n39,07\n91,35\nEl Salvador\n43,27\n66,11\nEmiratos Árabes Unidos\n56,50\n101,57\nEslovaquia\n43,27\n75,73\nEstados Unidos\n69,72\n143,04\nEtiopía\n37,86\n119,60\nFilipinas\n39,67\n71,52\nFinlandia\n65,51\n114,79\nFrancia\n65,51\n122,61\nGabón\n52,89\n100,37\nGhana\n37,26\n66,71\nGrecia\n39,07\n69,12\nGuatemala\n42,67\n89,55\nGuinea ecuatorial\n50,49\n87,75\nHaití\n37,86\n45,08\nHonduras\n42,07\n69,72\nHong Kong\n51,69\n121,40\nHungría\n46,28\n115,39\nIndia\n38,46\n99,77\nIndonesia\n42,67\n102,17\nIrak\n39,07\n66,11\nIrán\n44,47\n80,54\nIrlanda\n48,08\n93,16\nIsrael\n56,50\n92,56\nItalia\n63,11\n131,02\nJamaica\n46,28\n46,93\nJapón\n96,76\n159,87\nJordania\n42,67\n93,16\nKenia\n39,67\n82,34\nKuwait\n44,47\n122,61\nLíbano\n34,86\n115,39\nLibia\n54,69\n102,17\nLuxemburgo\n55,89\n135,83\nMalasia\n34,26\n91,95\nMalta\n31,85\n46,28\nMarruecos\n39,67\n99,17\nMauritania\n39,07\n49,28\nMéjico\n43,27\n81,74\nMozambique\n42,67\n67,31\nNicaragua\n52,89\n94,36\nNigeria\n46,88\n117,80\nNoruega\n80,54\n132,82\nNueva Zelanda\n40,27\n65,51\nPaíses Bajos\n64,31\n126,81\nPakistán\n37,26\n58,30\nPanamá\n36,66\n64,91\nParaguay\n33,06\n45,68\nPerú\n43,27\n79,93\nPolonia\n42,67\n99,77\nPortugal\n43,87\n97,36\nReino Unido\n82,94\n156,86\nRepública Checa\n43,27\n101,57\nRumanía\n38,46\n126,81\nRusia\n73,32\n227,78\nSenegal\n45,08\n67,91\nSingapur\n48,08\n85,34\nSiria\n46,28\n83,54\nSudáfrica\n48,08\n64,31\nSuecia\n75,13\n147,25\nSuiza\n61,30\n148,45\nTailandia\n39,07\n69,12\nTaiwán\n48,68\n81,74\nTanzania\n30,05\n76,93\nTúnez\n46,28\n51,69\nTurquía\n39,07\n61,30\nUruguay\n41,47\n57,70\nVenezuela\n36,06\n78,13\nYemen\n43,27\n132,82\nYugoslavia\n49,88\n98,57\nZaire/Congo\n54,09\n101,57\nZimbawe\n39,07\n76,93\nSOL MELIA - Acuerdo de colaboración 2010\n\nDietas\nen territorio español y en hoteles internacionales: Ajustadas a las publicadas en el BOE y con altísima disponibilidad de habitaciones. Estas cuantías basadas principalmente en habitaciones dobles para uso individual (1 persona) o individual. Las Dietas solo se podrán utilizar para viajes de trabajo \"comisión de servicio\":\nFile:UNIVERSIDAD POLITECNICA DE MADRID Dietas 2010.xls\nGovernment Program\n: consiste en un valor añadido del 10% de descuento sobre la mejor tarifa disponible.  Este descuento es aplicable para todos los hoteles de Sol Meliá en el Mundo, tanto para hoteles urbanos como vacacionales. Este programa podrá ser aplicado tanto para viajes de trabajo (si es más ventajoso que las dietas) como para viajes de ocio.\nFile:2010 Government Program by Sol Meliá.pdf",
  "speaker": "SYSTEM",
  "uuid": "2ff9e19d-f59f-4348-ba16-fd41796d7b70"
}