{
  "message": "SYSTEM: Wiki: Lugar y fecha: Madrid, 23 de octubre de 2007\nSala: Sala de reuniones, frente al despacho de Asun\nAsistentes: Manuel Lama (USC), Eduardo Sánchez (USC), Guadalupe Aguado (UPM), María de los Santos Pérez (UPM), Pilar Herrero (UPM), Asunción Gómez (UPM), Oscar Corcho (UPM), Jose Angel Ramos (UPM), Mariano Fernández (CEU)\nAgenda\n\n9:00-9:30 Repaso general de la propuesta: objetivos, participantes, paquetes de trabajo, presupuesto y contrataciones a realizar (FPIs, becas y contratos).\nAsun\n[\npresentación\n]\nA continuación, una serie de presentaciones de 15 minutos y discusión de 15 minutos con la siguiente estructura:\ndescripción general del paquete de trabajo, con deliverables y milestones, técnicas y tecnologías de base sobre las que se basará el trabajo a realizar, plan general con ideas sobre el trabajo a realizar y plan detallado para la fase 1 del proyecto\n.\n9:30-10:00 WP1: Plataforma.\nOscar\n10:00-10:30 WP2: Ontology-Based Multilingual Information Integration.\nAsun\n([\nPresentation\n])\n10:30-11:00 WP3: Semantic Social Tagging.\nLupe\n([\nPresentation WP3\n])\n11:00-11:30 Café\n11:30-12:00 WP4: Collaborative Filtering.\nEduardo\n12:00-12:30 WP5: Data transfer in mobile environments.\nMaría/Pilar\n12:30-13:00 WP6: Dynamic composition and execution of services.\nManuel\n13:00-13:30 WP7: User interfaces and user interaction models.\nEduardo\n13:30-14:30 Comida\n14:30-15:30 WP8: Application. Mockups, development phases, etc.\nManuel\nEsta presentación incluirá brainstorming de ideas\n15:30-16:00 Administrative matters: how to report, how to include new members, how to organise work with IGN, mailing lists, wikis, blogs, conference calls, etc.\nAsun y todos\n[\nPresentación\n]\n16:00-16:30 Dissemination and exploitation plans (conferences, workshops -ESWC?-, journals, Xunta, ...).\nTodos\n[\npresentación\n]\n16:30-17:00 Café\n17:00-18:00 Planificación para la fase 1 (meses 0-6, deadline: 31 marzo 2008).\nTodos",
  "speaker": "SYSTEM",
  "uuid": "30e1a508-157c-4581-a81d-731ebfaf88aa"
}