{
  "message": "SYSTEM: Curriculum_abreviado_CVA_Proyectos_2016.MRA.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nHe was also Honorary Professor at the Computer Science and Engineering Department \n(EPS) of the Autonomous University of Madrid (UAM).  \nDuring 2010-2013 he was a postdoctoral Teaching Assistant at EPS-UAM in the GHIA \nResearch Group. In 2010 he was a postdoc researcher at EPS-UAM and Associate \nprofessor at the Telematics’ Engineering Department in the Universidad Carlos III de Madrid \n(UC3M). From 2003 to 2009 he was a teaching assistant at the EPS-UAM.  \nMariano holds a MSc. in Physics Sciences (1992) (Fundamental Physics specialist), MSc. \n(Advanced Studies Diploma) in Computer Science and Telecommunication (2004) and a \nPhD. in Computer Science and Telecommunication (2009) by Universidad Autónoma de \nMadrid (UAM). He is accredited as Associate Professor since January 2010 and as Lecturer \nsince September 2012 by the Spanish quality agency ANECA (a full member of European \nAssociation for Quality Assurance in Higher Education). \nHis research activities are focused on Semantic Web and Linked Data, but he is also \ninterested in Natural Language, Virtual Worlds, Human-Computer Interaction and Web \nTechnologies.  \nFrom 1992 to 2003 he worked in private R&D centers as Software Engineer, Software \nArchitect and Project Manager in different research and applied fields related to new \ntechnologies. He had two predoctoral stays at Digital Enterprise Research Institute (DERI) in \n2004 and 2005, in which he was also Erasmus Teacher at the National University of Ireland, \nGalway (NUIG). In 2011 he had a short stay at the Web-based Systems Group, Freie \nUniversität (FU) at Berlin (Germany). From 2013 he also is related to the AKSW Research \nGroup (Leipzig University, Germany) for his involvement as head of the DBpedia Spanish \nchapter. From 2014 he is related to the Semantic Computing Group (univ. Bielefeld, \nGermany), with activities related to Question Answering, Linguistics and Linked Data. \n \nMain scientific and technological achievements \nDuring his period in private companies (1993-2003) he worked in Human-Computer \nInteraction, Multiplatform User Interfaces and Advanced Web Technologies. In the pre-\ndoctoral period (2003-2009) he was focused on Semantic Web. Currently, in his first post-\ndoctoral period (2009-2014) he combined his main line in Semantic Web and Linked Data \nwith a research line based on non-immersive virtual worlds. From 2014 I also works with \nNatural Language applied to Linked Data, specifically, ontology lexicalization and software \nsystems aimed at creating guided pseudo-natural language queries. \n \nLine of research goals (in the medium- and long-term) \nHis current 3 year contract is focused on Natural Language and Linked Data, specifically, \ncreation of ontology lexicalizations and software systems aimed at creating guided pseudo-\nnatural language queries. \nA detailed description can be found at \n   http://sites.google.com/site/marianorico/welcome/research \n \nHis publications can be found here: \n  - ISI-WOS Researcher ID: http://www.researcherid.com/rid/A-5566-2008 \n  - ORCID profile: http://orcid.org/0000-0001-5878-8521 \n  - Google Scholar profile: http://scholar.google.com/citations?user=hl5WPQEAAAAJ \n  - ResearchGate profile: https://www.researchgate.net/profile/Mariano_Rico \n \nParte C. MÉRITOS MÁS RELEVANTES \nC.1. Publicaciones \n1 Scientific paper. M. Rico; D. Camacho; Ó. Corcho. (3/1). 2010. A Contribution-based \nFramework for the Creation of Semantically-enabled Web Applications. Information \nSciences. 180-10, pp.1850-1864. \n2 Scientific paper. M. Rico; et al. (4/1). 2011. A Semantically Enhanced UPnP Control Point \nto Enhance Multimedia Home Sharing Networks. IEEE Internet Computing. 15-6, pp.58-64. \n3 Scientific paper. M. Rico; et al. (5/1). 2011. A Programming Experience of High School \nStudents in a Virtual World Platform. International Journal of Engineering Education. 27-1, \npp.52-60. \n4 Scientific paper. J. Ramírez; et al (5/2). 2011. An OpenSim-based Virtual Lab for \nbiotechnology education. IEEE Learning Technology. pp.18-20. ISSN 1438-0625. \n",
  "speaker": "SYSTEM",
  "uuid": "314e8718-bd82-4555-99cf-ef3158671007"
}