{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 21\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 21 de 42 \n \nTítulo del contrato: Para la generación, publicación y enlazado de los datos del SIGNA en Linked Data, \nel estudio de las capacidades de análisis de la información geoespacial y el asesoramiento en ISO/TC \n211 \nEmpresa financiadora: Instituto Geográfico Nacional – Ministerio de Fomento \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 04-01-2012  \nhasta: 30-11-2012 \nInvestigador responsable: Asunción Gómez Pérez \n \nTítulo del contrato: Generación de datos enlazados a partir del catálogo bibliográfico y de autoridades \nEmpresa financiadora: BNE – Biblioteca Nacional de España \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 20-12-2011  \nhasta: 19-06-2012 \nInvestigador responsable: Asunción Gómez Pérez \n \nTítulo del contrato: Development of the Ontology Network Specification Requirements and \nConceptualization \nEmpresa financiadora: Organización Mundial de la Salud \nEntidades participantes: UPM \nDuración,  desde: 15/06/2009  \nhasta: 31/01/2010 \nInvestigador responsable: Oscar Corcho García \n \n2.3 \nDetalle de publicaciones de los últimos cinco años \n2010: \n1. Aguado de Cea. Problemas del traductor como terminólogo en el campo de la \ninformática. La traducción y la interpretación: formación, mercado y salidas \nprofesionales I Congreso para Jóvenes Traductores. Madrid. 30 abril 2010 \n2. Aguado de Cea G, Gómez-Pérez A, Montiel-Ponsoda E, Vilches-Blázquez LM. Rivière \nor fleuve? Modelling multilinguality in the hydrographical domain. 1st Workshop on the \nMultilingual Semantic Web (MSW 2010). Raleigh, North Carolina, USA. Marzo 2010 \n3. Barrios MA, Vilches-Blázquez LM. Is it possible to enrich ontologies with a specialized \ndomain linguistic resource? TKE - Terminology and Knowledge Engineering \nConference 2010. Presenting Terminology and Knowledge Engineering Resources: \nModels and Challenges. Úna Bhreathnach and Fionnuala de Barra-Cusack (eds.). \nFiontar. Dublin City University. Dublin, Ireland. 14th of August 2010 \n4. Bredeweg B, Liem J, Linnebank F, Bühling R, Wissner M, Gracia J, Salles P, Beek W, \nGómez Pérez A. DynaLearn: Architecture and Approach for Investigating Conceptual \nSystem Knowledge Acquisition. 8th International Conference on Intelligent Tutoring \nSystems. Lecture Notes in Computer Science Springer-Verlag Redwood City, San \nFrancisco Bay, USA. Noviembre 2010 \n5. Calbimonte JP, Corcho O, Gray AJG. Enabling Ontology-based Access to Streaming \nData Sources. 9th International Semantic Web Conference (ISWC2010). Part I. ISBN: \n978-3-642-17745-3. Volumen: LNCS 6496. Páginas: 96 - 111. Noviembre 2010 \n6. Cimiano P, Montiel-Ponsoda E, Buitelaar P, Espinoza M, Gómez-Pérez A. A Note on \nOntology Localization. Journal of Applied Ontology. IOS Press (ISSN: 1570-5838 \n(Print) 1875-8533 (Online)). Volumen: 10-30. Páginas: 127 - 137. Abril 2010 \n7. Corcho O, García-Castro R. Five Challenges for the Semantic Sensor Web. Semantic \nWeb – Interoperability, Usability, Applicability. ISSN: 1570-0844. IOS Press. Volumen: \n1(1-2). Páginas: 121 - 125. Diciembre 2010 \n8. Declerck T, Buitelaar P, Wunner T, McCrae J, Montiel-Ponsoda E,  Aguado de Cea G. \nLemon: An Ontology-Lexicon model for the Multilingual Semantic Web. W3C Workshop: \nThe Multilingual Web - Where Are We? Madrid. 26-27 octubre 2010 \n9. Garcia A, O’Neill K, Garcia LJ, Lord P, Stevens R, Corcho O, Gibson F. Developing \nOntologies withing Decentralized Settings. Semantic e-Science. Annals of Information \n",
  "speaker": "SYSTEM",
  "uuid": "31d4dd99-1d1d-4e29-92e5-9df682b49877"
}