{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 15\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97740\nñ)  Orden EDU/2164/2009, de 29 de julio, sobre delegación de competencias del \nMinisterio de Educación.\no)  Orden ECI/266/2008, de 6 de febrero, por la que se establecen las bases \nreguladoras de la concesión de subvenciones públicas en el marco de la línea instrumental \nde actuación en recursos humanos del Plan Nacional de Investigación Científica, Desarrollo \ne Innovación Tecnológica (I+D+i) 2008-2011 (BOE de 9 de febrero).\np)  Orden CIN/2657/2008, de 18 de septiembre, por la que se regula el procedimiento \nadministrativo para la evaluación de la actividad investigadora del personal investigador en \nformación (BOE de 22 de septiembre).\nResolución de 16 de julio de 2008, de la Dirección General de Universidades, sobre \ndiversos aspectos relativos a las enseñanzas de máster y doctorado en la nueva ordenación \nacadémica.\nq)  Resolución de 16 de julio de 2008, de la Dirección General de Universidades, \nsobre diversos aspectos relativos a las enseñanzas de máster y doctorado en la nueva \nordenación académica.\nr)  Resolución de 29 de diciembre de 2008, de la Dirección General de Universidades, \npor la que se establece el procedimiento para la verificación de enseñanzas oficiales de \ndoctorado.\nY demás normas vigentes que sean de aplicación.\nCAPÍTULO II\nInstrucción, resolución y publicación de las ayudas\nArtículo 21.  Órganos competentes para la instrucción y resolución del procedimiento.\n1.  El órgano competente para la instrucción del procedimiento de las solicitudes de \nayudas a las que se refiere las presentes bases, será la Subdirección General de Formación \ny Movilidad del Profesorado perteneciente a la Dirección General de Política Universitaria, \nque establecerá los procedimientos adecuados y dará las instrucciones necesarias para la \ntramitación y gestión de la convocatoria.\n2.  Corresponde a la Secretaría General de Universidades la resolución de concesión \no denegación de las solicitudes, que se llevarán a efecto dentro de los plazos señalados \nen el apartado correspondiente a cada una de los tipos de ayudas indicados.\nArtículo 22.  Presentación de solicitudes y documentación.\n1.  Las solicitudes de ayudas para la presente convocatoria, podrán presentarse por \nlos titulados que cumplan los requisitos establecidos para cada una de las ayudas, de \nconformidad con los plazos y el procedimiento que se describe en este y los respectivos \napartados.\n2.  En la dirección electrónica http://web.educacion estará disponible el formulario de \nsolicitud que deberá cumplimentarse a través de los medios telemáticos habilitados para \nello en la citada página Web, de acuerdo con las instrucciones que para cada caso se \nrecogen en la misma y de conformidad con el procedimiento que se describe en este y \nsiguientes apartados.\n3.  Una vez debidamente cumplimentado el formulario de solicitud y confirmado, se \ndeberá imprimir y presentar firmado y acompañado de la documentación adicional que en \ncada caso se requiere en esta convocatoria.\n4.  Las solicitudes de nuevas ayudas, dirigidas a la Dirección General de Política \nUniversitaria, podrán presentarse en el Registro del Ministerio de Educación (C/ Albacete, 5, \n28071 Madrid) o en cualquiera de los lugares señalados en el artículo 38.4 de la Ley \n30/1992, de 26 de noviembre, de Régimen Jurídico de las Administraciones Públicas y del \nProcedimiento Administrativo Común. En el caso de que los solicitantes optaran por \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "320119f5-bf98-47cc-afd2-7b0ce0eb2a68"
}