{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 100\nPage 100 of 124\nNeOn Integrated Project EU-IST-027595\nFigure 6.5: Enriched FlorTag lake\nSense 1. Water, H2O: (binary compound that occurs at room temperature as a clear colorless odorless\ntasteless liquid) →Binary Compound AND →Liquid\nSense 2. Body of water, Water: (the part of the earth’s surface covered with water) →Thing\nOnce the correct sense is selected and the tag is semantically expanded with hypernyms (there are no syn-\nonyms for this sense of Lake) then the third phase of FLOR queries the online ontologies through WATSON\nand selects the SWEs that correspond to this sense. As shown in Fig. 6.5 both selected entities have the\nterm Lake in their localname and their superclass in the ontology contains one or more of the hypernyms\nreturned by WordNet, Water and Thing, as a whole or as a compound. This example shows that our an-\nchoring to ontologies is strict for the tags to be deﬁned (their lexical representations and synonyms) and the\nlocalnames and labels of the entities and ﬂexible for the ontological parents and hypernyms. Note also that\nthe selected SWEs carry additional information about two superclasses of Lake (Waterway, Waterfeature)\nand an instance of Lake (Lake Baikal) thus further enriching the tag.\n6.1.5\nExperiments: Applying FLOR on a Flickr dataset\nTo assess the correctness of FLOR enrichment (i.e., whether tags were linked to relevant SWEs) we applied\nFLOR on a Flickr data set comprised of 250 randomly selected photos with a total of 2819 individual tags.\nDuring the Lexical Isolation we removed 59% of the initial tags resulting to 1146 tags in total. We isolated 45\ntags with two characters (e.g., pb, ak), 333 tags with numbers (e.g., 356days, tag1), 86 tags with special\ncharacters (e.g., :P, (raw →jpg)), and 818 non English tags (e.g., turdus, arbol). Then we ﬁltered\nout the photos that exclusively contained the isolated tags (24 photos) and obtained a dataset of 226 photos\nwith a total of 1146 tags. After running the FLOR enrichment algorithm for these 226 photos, one of the\nauthors manually checked all the assignments between tags and SWE’s.\nThe assignment of a SWE to a tag is considered correct if the concept described by the SWE is the same\nas the concept of the tag in the context of its tagset. To decide that the evaluator was given a tagset and\nthe SWEs linked to its tags. She evaluated each tag enrichment as CORRECT if the tag was linked to the\nappropriate SWE and INCORRECT otherwise. In cases when she was not sure about the intended meaning\nof the tag, she rated the enrichment as UNDETERMINED. Finally, a NON ENRICHED value was assigned\nto tags that were not associated to any SWE. The results are displayed in Table 6.1.\nOut of the individual 1146 lexically processed tags, FLOR correctly enriched 281 tags and incorrectly en-\nriched 20 tags thus leading to precision results of 93%.\nAn example of incorrect enrichment is that of\nsquare in the context {street, square, film, color, documentary}. While its intended mean-\ning is Geographical area, because during the disambiguation phase square did not return high similarity\n",
  "speaker": "SYSTEM",
  "uuid": "32524f4a-8611-4795-8c88-fe5e13570f51"
}