{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_vacaciones_y_permisos \n\nContents\n[\nhide\n]\n1\nCuadro resumen\n2\nProcedimiento vacaciones\n3\nProcedimiento permisos (enfermedad, maternidad/paternidad, defunción de familiar, matrimonio...)\n4\nProcedimiento faltas\nEstá página recoge la información relativa a las vacaciones y días de permiso de los miembros del Grupo, en función de la modalidad bajo la que haya sido contratados, así como el procedimiento a seguir para la solicitud de los mismos.\nLos días de vacaciones y permisos quedan sujetos a posibles mejoras o modificaciones, bajo la aprobación del responsable\n.\nCuadro resumen\n\nModalidad contratación\nVacaciones\nPermisos\nBaja por incapacidad temporal (enfermedad o accidente)\nBeca OTT\nNo\n(Art.3 del Reglamento sobre Becarios de la UPM)\nNo\n(Art.3 del Reglamento sobre Becarios de la UPM)\nNo\n(Art.3 del Reglamento sobre Becarios de la UPM)\nBeca FPI\n22 días hábiles\n(Art.22.1 c) Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\n(Art.21.1 Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\nSí\n(Art.21.1 Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\nContrato de trabajo en prácticas FPI\n22 días hábiles\n(Art.22.1 c) Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\n(Art.22.1 c) Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\nSí\n(Art.22.2 Resolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación)\nBeca FPU\n22 días hábiles\n(Art.8.1 c) de la Orden EDU/3083/2009)\n(Art.15.2 de la Orden EDU/3083/2009)\nSí\n(Art.8.1 f) de la Orden EDU/3083/2009)\nContrato de trabajo en prácticas FPU\n22 días hábiles\n(Art.8.1 c) de la Orden EDU/3083/2009)\n(Art.8.1 c) de la Orden EDU/3083/2009)\nSí\n(Art.8.1 f) de la Orden EDU/3083/2009)\nBeca UPM y Cofinanciada UPM\n22 días hábiles\n(Art.5 del Real Decreto 63/2006, de 27 de enero, por el que se aprueba el Estatuto del personal investigador en formación)\n(Art.3.3 de la Resolución de 26 de octubre de 2009 del Rector de la UPM)\nSí\n(Art.3.3 de la Resolución de 26 de octubre de 2009 del Rector de la UPM)\nContrato de trabajo en prácticas UPM y Cofinanciado UPM\n22 días hábiles\n(Art.5 del Real Decreto 63/2006 EPIF)\n(Art.5 del Real Decreto 63/2006 EPIF)\nSí\n(Art.5 del Real Decreto 63/2006 EPIF)\nContrato de trabajo en prácticas FINNOVA\n22 días hábiles\n(Real Decreto 5/2015)\n(Real Decreto 5/2015)\nSí\n(Real Decreto 5/2015)\nContrato OTT\n22 días hábiles\n(Real Decreto 5/2015)\n(Real Decreto 5/2015)\nSí\n(Real Decreto 5/2015)\nTanto los 22 días hábiles de vacaciones, como los 6 de asuntos propios, están referidos al año natural, de tal forma que si el tiempo de trabajo durante el año es menor, habrá que calcular los días que proporcionalmente correspondan en función del tiempo trabajado.\nProcedimiento vacaciones\n\nPara solicitar vacaciones hay que escribir un correo a\nausencias@delicias.dia.fi.upm.es\ncon copia al responsable (IP del proyecto en que se trabaje, director de tesis, etc.), que contestará aprobándolas.\nSon vacaciones para todo el personal los días de cierre de la Facultad (Semana Santa, agosto, Navidades). Si existe una justificación (entrega de proyectos o publicaciones, etc.) que obligue a no disfrutar esos días de vacaciones, se notificará a\nausencias@delicias.dia.fi.upm.es\ncon copia al responsable, que contestará aprobándolo.\nTodo el mundo debe realizar la solicitud de vacaciones antes del 20 de junio. En caso de que los miembros no realicen la solicitud de sus vacaciones de verano, automáticamente se entenderá que sus vacaciones se les asignarán por su responsable y/o por el cierre de la Facultad.\nLas vacaciones no consumidas en el año natural podrán disfrutarse, salvo permiso expreso, sólo hasta el 31 de enero del año natural siguiente.\nProcedimiento permisos (enfermedad, maternidad/paternidad, defunción de familiar, matrimonio...)\n\nSe mandará un correo electrónico a\nausencias@delicias.dia.fi.upm.es\n, con copia al responsable informando de la contigencia con la mayor antelación posible.\nPara que los días no trabajados se consideren como días de permiso, será necesario acreditar documentalmente la contigencia correspondiente: partes semanales de baja (se pueden entregar vía foto por correo electrónico), libro de familia, acta de defunción...\nEn el caso del permiso por asuntos propios no será necesario ningún tipo de acreditación.\nSe recuerda que durante la baja por enfermedad no se va a cobrar el 100% del sueldo. Será dependiendo de qué días de la baja sean según lo establecido en la\nResolución Rectoral de 30 de noviembre de 2012\n.\nProcedimiento faltas\n\nEn aquellos casos en los que, por cualquier causa, un miembro del Grupo trabaje desde casa, o bien se ausente del puesto de trabajo por motivos personales (fuera de los supuestos contemplados en los permisos), igualmente habrá que mandar un correo electrónico a\nausencias@delicias.dia.fi.upm.es\n, con copia al responsable.",
  "speaker": "SYSTEM",
  "uuid": "32ad4e2d-9672-4beb-9f07-f2ebbc80a6b6"
}