{
  "message": "SYSTEM: Wiki: A continuación se incluyen los comentarios a las prácticas recibidas. En primer lugar se incluyen comentarios generales y más adelante se incluyen comentarios detallados por grupo de prácticas. Hemos preferido hacer estos comentarios públicos pues en el pasado han ayudado a mejorar el trabajo de todos. Si alguien prefiere que los comentarios que se hacen sobre sus prácticas sean privados en el futuro, que nos lo haga saber.\nEn este\nenlace\npodéis encontrar un ejemplo de una de las mejores prácticas entregadas el año pasado en otro dominio.\nComentarios generales\n\nEl comentario general que se puede proporcionar sobre las prácticas entregadas es que en la mayor parte de ellas la búsqueda que se ha realizado es más o menos exhaustiva, combinando documentos de todo tipo (artículos específicos y generales), glosarios y ontologías, aunque en general los glosarios no han sido identificados en un gran número de casos.\nAsimismo, en el análisis suele faltar una indicación de la relevancia de las fuentes identificadas teniendo en cuenta los objetivos del trabajo a realizar (que claramente será algo que se haga en la práctica sobre metodología).\nFinalmente, no se han encontrado, en general, ontologías u otros recursos que traten con aspectos de más alto nivel sobre recursos multimedia.\nComentarios particulares\n\nLeandro Fumega y José Edward Ortiz\n. El análisis de recursos existentes que habéis proporcionado es un análisis sencillo, en el que se muestra cómo habéis buscado con buscadores como Watson algunas ontologías en RDF u OWL que defina aspectos relacionados con imágenes, fotos, etc. Asimismo, habéis encontrado algunos artículos sobre temas relacionados con el hogar digital. Sin embargo, se echa en falta una síntesis de lo encontrado en la que se analice claramente cuáles son las características de los recursos encontrados. Debéis encontrar más recursos para la próxima entrega y mejorar vuestro análisis comparativo.\nSebastián Ortega y Eduardo Ballesteros\n. El análisis que habéis proporcionado es un buen comienzo para el desarrollo de la práctica. Justificais adecuadamente la selección de algunas de las fuentes de información, aunque no habéis buscado recursos más estructurados y mejor desarrollados (ontologías existentes en el área).\nJuan José Pérez y Josué Burgos\n. El análisis realizado es adecuado. Se han identificado fuentes importantes, y sólo faltan algunas fuentes de más alto nivel para la descripción de recursos multimedia que se podrían utilizar.\nJuan Ramírez Fernández\n. Se han identificado sólo algunas ontologías que contienen términos que podrían ser utilizados, pero el análisis no es exhaustivo y falta más detalles de recursos no ontológicos. Para los idiomas, una recomendación es mirar recomendaciones ISO sobre idiomas.\nJuan Manuel Garitagoitia y Octavio López\n. El análisis sobre términos importantes es adecuado, y la búsqueda de información también es bastante exhaustiva, aunque se necesita mayor nivel de detalle sobre ontologías en el área que podrían ser reutilizadas.\nClara Izquierdo y Adrián Siles\n. El análisis sobre ontologías existentes que podrían ser candidatas a ser reutilizadas es exhaustivo, aunque faltan fuentes de más alto nivel. Los glosarios son también una buena fuente de información que se podría explotar.\nJavier Díaz-Romeral\n. El análisis realizado es exhaustivo y bien sustentado. Recomendaría buscar fuentes de más alto nivel y algunos glosarios.\nJosé Miguel Alonso\n. El análisis realizado es exhastivo, aunque faltan glosarios y un análisis más detallado de cuáles de las fuentes de información proporcionadas son más relevantes que otras.\nMarta Ariza y Gema Romero de Ávila\n. El análisis realizado muestra un buen número de fuentes, fundamentalmente documentos de donde se puede obtener información, pero es escaso en lo relacionado con ontologías y glosarios de términos disponibles. Asimismo, se debería hacer un análisis de la relevancia de las fuentes de información.",
  "speaker": "SYSTEM",
  "uuid": "33066c47-ea48-485d-946e-e9d7c3ba6525"
}