{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 13\n \n \nPág. 15 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nDEBILIDADES \ncobertura entre las empresas y las academias, lo que dificulta la implantación de métodos \nque garanticen la re-utilización, generando duplicidades y dispersión de esfuerzos en la \nconstrucción de corpus, herramientas, etc.  \n Déficit de interdisciplinariedad debido a la baja interacción entre lingüistas e informáticos en \nla creación y compartición de recursos y aplicaciones, motivado por la rigidez estructural \nuniversitaria y la falta de centros de investigación sobre procesamiento de lenguaje natural y \ntraducción automática. \n Discontinuidad en la financiación de la investigación en procesamiento de lenguaje natural y \ntraducción automática, lo que dificulta el progreso en la investigación y el mantenimiento de \nequipos de trabajo especializados.  \n Insuficiente inversión en formación de especialistas altamente cualificados. Falta de \noportunidades educativas vinculadas a postgrados, masters y becas específicas lo que se \ntraduce en un escaso número de spin-off en la universidad española.  \n Insuficiencia de líneas de financiación que ayuden a la internacionalización de las empresas y a \nacometer los proyectos de I+D+I. No obstante, la necesidad de inversión es alta en tiempo y \ncoste para el desarrollo de nuevas herramientas tecnológicas. \n Insuficiente capacidad de inversión en investigación e innovación y poca capacidad de \ninternacionalización de sus productos por falta de capitalización, ya que la mayoría de \nempresas son  PyMEs y microempresas.  \n Insuficiente investigación básica y desarrollo tecnológico en torno al procesamiento de \nlenguaje natural o a la traducción automática por parte de las Agencias Públicas de \nInvestigación y disminución del número de grupos de investigación en procesamiento de \nlenguaje natural y traducción automática en grandes empresas en España (IBM, TIC, etc.) \n Reducida disponibilidad de recursos y herramientas para el español hispanoamericano.  \n Existencia de una debilidad en cuanto al tratamiento de textos especializados ya que el \ncastellano no es un idioma mayoritario en literatura científica y patentes. \n Escaso conocimiento de los estándares, licencias y modelos de negocio ya consensuados en \nEuropa por las empresas en España. \n Falta de reconocimiento de esta disciplina en la academia nacional pese a ser un ámbito de \ninvestigación interdisciplinar. La formación está incluida en diferentes especialidades, lo que \ndificulta su visibilidad. \n Falta de un mayor conocimiento de las características de esta tecnología con poco coste de \nlicencia de programas, pero alto coste de inversión en localización y adaptación (lengua y \ndominios de actividades) para lograr procesos mucho más eficientes en múltiples áreas de \naplicación en la Administración. \n Carencia de una norma específica de interoperabilidad. \n Reducida definición de la estrategia de comercialización generando grandes dificultades para \nacceder al mercado. \n",
  "speaker": "SYSTEM",
  "uuid": "330f10a5-9d24-4f4b-9daa-67bce3d4bd41"
}