{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 14\nPage 14 of 124\nNeOn Integrated Project EU-IST-027595\ntion of the information; (2) the data model, that is, the design data model used to represent the knowledge\nencoded by the resource; and (3) the resource implementation.\nFig. 2.1 shows the three levels of the categorization of non-ontological resources: type, data model and\nimplementation levels.\nFigure 2.1: Non-Ontological Resources Categorization\n1. According to the type of non-ontological resource we classify them into\n• Glossaries: A glossary is an alphabetical list of terms or words found in or relating to a speciﬁc\ntopic or text. It may or may not include explanations, and its vocabulary may be monolingual,\nbilingual or multilingual [WB97]. An example of glossary is the FAO Fisheries Glossary1.\n• Lexicons: In a restricted sense, a computational lexicon is considered as a list of words or lex-\nemes hierarchically organized and normally accompanied by meaning and linguistic behaviour\ninformation [Hir04]. An example is WordNet2, the best known computational lexicon of English.\n• Classiﬁcation schemes: A classiﬁcation scheme is the descriptive information for an arrange-\nment or division of objects into groups based on characteristics that the objects have in common\n[ISO04]. For example, the Fishery International Standard Statistical Classiﬁcation of Aquatic\nAnimals and Plants (ISSCAAP)3.\n• Thesauri: Thesauri are controlled vocabularies of terms in a particular domain with hierarchical,\nassociative and equivalence relations between terms. Thesauri are mainly used for indexing and\nretrieving of articles in large databases [ISO86]. An example of thesaurus is the AGROVOC4\nthesaurus.\n• Folksonomies: Folksonomies are Web 2.0 systems that allow users to upload and annotate their\ncontent effortlessly and without requiring any expert knowledge. This simplicity has made folk-\nsonomies widely successful that has resulted in a massive amount of user-generated and user-\nannotated web content. The main advantage of folksonomies is the implicit knowledge they con-\ntain. When users tag resources with one or more tags, they assign these resources the meaning\n1http://www.fao.org/ﬁ/glossary/default.asp\n2http://wordnet.princeton.edu/\n3http://www.fao.org/ﬁgis/servlet/RefServlet\n4http://www.fao.org/agrovoc/\n",
  "speaker": "SYSTEM",
  "uuid": "332e0aec-6066-4c3e-b63a-c32def8448a1"
}