{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 29\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97754\n5.  La correspondiente resolución de concesión se publicará en el plazo de dos meses \na partir de las fechas respectivas de finalización del plazo de presentación de solicitudes.\nArtículo 50.  Pago y justificación del traslado temporal.\n1.  El abono de las ayudas anteriores se realizará directamente a los organismos y \nentidades de adscripción, por el mismo procedimiento establecido para las estancias \nbreves.\n2.  Los organismos y entidades de los centros de adscripción con beneficiarios de \ntraslados temporales, entregarán por adelantado las cantidades concedidas a los \nbeneficiarios; dicha entrega se llevará a cabo con fecha anterior al inicio de la estancia.\n3.  Una vez concluido el traslado temporal, en el plazo de quince días contados desde \nel día siguiente a su regreso, los beneficiarios justificarán la realización de la misma. El \nformulario de justificación, en el impreso normalizado disponible en la página Web http//\nwww.educación.es/, deberá presentarse con la firma original de los beneficiarios ante los \nórganos competentes de los organismos y entidades que dependan los centros de \nadscripción, con la siguiente documentación:\na)  Certificación del responsable del grupo receptor en la que constará el día de inicio \ny el de finalización de la estancia.\nb)  Memoria descriptiva con una extensión máxima de 3.000 palabras, en la que \nfigurará el visto bueno del director de la tesis; dicha memoria irá encabezada por el título \ndel proyecto de tesis y por la referencia del beneficiario.\n4.  Los organismos y entidades de los que dependan los centros de adscripción de \nbeneficiarios de ayudas para traslado temporal, remitirán toda la documentación a la \nDirección General de Política Universitaria.\n5.  En caso de no llevarse a cabo el traslado temporal en las condiciones que fue \nconcedido o de no poderlo justificar, el organismo o entidad preceptora de la ayuda está \nobligado a devolver la totalidad de la cantidad percibida. En el caso de reducción del \nperíodo concedido, deberán justificar las causas. A la vista de las mismas, la Dirección \nGeneral de Política Universitaria resolverá la procedencia de la devolución total o parcial \nde las cantidades percibidas.\n6.  De acuerdo con el artículo 16.1.d) de la Ley 40/1998 del Impuesto sobre la Renta \nde las Personas Físicas, las ayudas para estancias temporales no tendrán la consideración \nde rendimientos del trabajo, por lo que no estarán sujeta a retención y pago del Impuesto \nsobre la Renta de las Personas Físicas.\nCAPÍTULO VII\nAyudas de precios públicos por matrícula en el doctorado o máster\nArtículo 51.  Objeto y cuantía.\n1.  Las ayudas por los precios públicos de las matrículas de los beneficiarios de la \npresente convocatoria, afectarán única y exclusivamente al curso 2009-2010 para los \nconceptos de matrícula del correspondiente programa de doctorado o máster que forme \nparte del programa de doctorado realizado en la universidad española. Dichas ayudas no \npodrán aplicarse en los casos de convalidaciones de estudios realizados con \nanterioridad.\n2.  Las ayudas no podrán exceder de la cuantía máxima de 32 créditos cuando se \ntrate de estudios de doctorado organizados conforme a la normativa del Real Decreto \n778/1998 o un máximo de 60 créditos, correspondientes al período formativo del programa \nde Doctorado cuando se trate de estudios de doctorado organizados conforme a la \nnormativa de los Reales Decretos 56/2005 y 1393/2007, todo ello durante el período \nmáximo de disfrute de la ayuda. En el caso de las universidades privadas sin fin de lucro, \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "333c97c0-4bd1-4f39-a061-df84ed83be25"
}