{
  "message": "SYSTEM: 2010CVAlvarezdeMon.pdf: Página 4\nParticipación en Proyectos de I+D financiados en Convocatorias públicas.  \n \n \n(nacionales y/o internacionales) \n \n \n \n \nTíitulo del proyecto:  \"Geobuddies: Anotación semántica colaborativa con dispositivos \nmóviles en el Camino de Santiago.\"  \nEntidad finavciadora : PROFIT  TSI2007-65677-C02-01 \nDuración desde:            2007                    HASTA: 2010  \n \nInvestigador  responsable: Asunción Gómez Pérez \n \n \n \n \n \nTítulo del proyecto: Proyecto europeo NeOn IST-2004-027595 \nEntidad financiadora: Unión Europea  \nEntidades participantes: The Open University,   Universitaet Karlsruhe, Universidad \nPolitécnica de Madrid, Software AG, Intelligent Software Components, S.A., Institut Jozef \nStefan, Institut Nacional de Recherche en Informatique et en Automatique INRIA, The \nUniversity of Sheffield, Universitaet Koblenz-Landau, Consiglio Nazionale delle Ricerche, \nONTOPRISE GMBH, Asociación Española de Comercio Electrónico AECE, Food and \nAgriculture Organisation of the United Nations FAO, Atos Origin S.A.. \nDuración, desde: \n01-03-2006 \nhasta: 28-02-2010 \nInvestigador responsable: Dr. Enrico Motta \n \n \n \nTítulo del proyecto: Infraestructura Tecnológica de Servicios Semánticos para la Web \nSemántica (TIN-2004-02660) \nEntidad financiadora: Ministerio de Ciencia y Tecnología. Dirección General de \nInvestigación. Subdirección General de Proyectos de Investigación. \nEntidades participantes: Universidad Politécnica de Madrid y Universidad de Santiago de \nCompostela \nDuración, desde: 13-12-2004 \nhasta: 13-12-2007 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:  \n \n \n \nTítulo del proyecto: Esperonto Services. Application Service Provision of Semantic \nAnnotation, Aggregation, Indexing and Routing of Textual, Multimedia, and Multilingual \nWebContent.  Referencia: IST-2001-34373 (FP5) \nURL: http:///www.esperonto.net \nEntidad financiadora: Unión Europea (Action Line IST-2001-3.4.1) \nEntidades participantes: Intelligent Software Components (iSOCO), Universidad Politécnica \nde Madrid, Institut Für Informatik der Universität Innsbruck (IFI), Universitaet des Saarlandes, \nUniversity of Liverpool, Residencia de Estudiantes, Centre d'Innovacio i desenvolupament \nempresarial (CIDEM), Biovista \n",
  "speaker": "SYSTEM",
  "uuid": "33d08766-1f7d-4cca-a0ab-2c584578f3d7"
}