{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 33\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 33 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n \nPhase II: Development of the different prototypes for the different subproblems. This phase \nincludes the following main stages for each prototype: (a) knowledge adquisition, (b) \nconceptualization and formalization, (c) implementation and (d) evaluation and validation. \n \nPhase III: Development of the complete and integrated KBS. \n \nPhase IV: Perfective maintenance of the KBS. \n \nPhase V: Proper technology transfer. In this phase, the technology transfer is organized \nand the documentation of the KBS is completed. \n2.5. Knowledge Engineering: Life Cycle Models \nWhen building a knowledge-based system (KBS) or an expert system (ES), the aim is to model the \nbehaviour of the experts working in their domain of expertise. In this type of systems it is very \ndifficult to establish the requirements to design a system that models the subjective expert \nbehaviour [39]. This implies that it is difficult to establish a priori the requirements and less so a \ndefinition of specifications. So, it is necessary to use a process of progressive improvement to \ndefine the requirements gradually. In addition, the operative product will never be completely \nterminated since its use by the experts should improve their services which should in turn lead to a \nnew version of the system, thus producing a feedback cycle which, at least to begin with, although \ntoned down, is positive and therefore unending. \nIn this deliverable we include briefly the KBS life cycle models proposed by two Knowledge \nEngineering methodologies: CommonKADS and IDEAL. \nIn CommonKADS methodology [50], the life cycle model proposed is a cyclic, risk-driven model \nsimilar to Boehm’s life cycle model (presented in Section 2.3.7). For each project a specialized \nlife cycle, based on the life cycle model proposed, is configured depending on specific project \nobjectives and risks. \nIn a CommonKADS project, the KBS development [50] usually consists of several cycles, \ndepending on the identification of new objectives and risks. Steps within a cycle can be repeated \nmany times. The CommonKADS model set (described in Section 2.4) provides a comprehensive \nand organized collection of aspects that can be relevant in a KBS project. However, this does not \nmean that in an actual project all models have to be fully developed; only those model components \nand states that bear on the project objectives and risks are selected. Whenever possible, parallel \ndevelopment of models is encouraged. Models must be maintained over the life cycle of the KBS. \nControl of quality and progress is integrated through regular checking of model states that must be \nreached in each cycle. \nFigure 7 gives a stylized representation of how project management and development works are \nconnected through model states. At the start of a management cycle, objectives for the cycle are \ndefined, and associated risks are identified. From these objectives and risks, a set of model states \nis derived that must be realized within the cycle. These target model states are projected onto \ndevelopment activities that should result in “filling” elements of the CommonKADS models. \n",
  "speaker": "SYSTEM",
  "uuid": "34919329-e10f-41b7-8c12-bbea44448d16"
}