{
  "message": "SYSTEM: Wiki: Esta página incluye información para alumnos del máster de tecnologías de la información.\nContents\n[\nhide\n]\n1\nObjetivos de la asignatura\n2\nClases de Inteligencia Artificial sobre Representación de Conocimientos\n3\nProgramación docente y materiales\n3.1\nDocumentación de Metodologías\n4\nPrácticas\n4.1\nPráctica 1 (se incluye en la práctica 3)\n4.2\nPráctica 2 (11/11/2009)\n4.3\nPráctica 3. Entrega 1 (Miércoles 25 de Noviembre)\n4.4\nPráctica 3. Entrega 2 (Miércoles 2 de Diciembre)\n4.5\nPráctica 3. Entrega 3 (A determinar la fecha)\n4.6\nPráctica 4 (Miércoles 13/01/2010)\n4.7\nTrabajo Final Recopilatorio (entrega: día del examen)\n5\nOfertas de trabajo relacionadas\nObjetivos de la asignatura\n\n[\nDescripción\n]\nClases de Inteligencia Artificial sobre Representación de Conocimientos\n\nSe recomienda asistir del 5 al 26 de Noviembre a las clases de Inteligencia Artificial en el aula 5102\nHorario de mañana: Miércoles de 9 a 11 y jueves de 12 a 13 horas.\nHorario de tarde: Miércoles de 15 a 17 y jueves de 17 a 18 horas.\nProgramación docente y materiales\n\nEl aula en el que se impartirán las clases es el 6206, y el horario será de 19:15 a 21:00.\n1/10/2009. Normas e Introducción (Asun y Oscar)\n[1]\n8/10/2009. Terminología en lingüística computacional (Lupe)\n[2]\n15/10/2009. Fundamentos sobre ontologías (Asun)\n[3]\n22/10/2009. Lenguajes de Ontologías. RDF(S) (Oscar)\n[4]\nEjemplos RDF(S)\n29/10/2009. Lenguajes de Ontologías. SPARQL (Raúl)\n[5]\nDBPedia SPARQL Endpoint\nSoftware a instalar: Este\nfichero\ncontiene los materiales necesarios para la clase con instrucciones de cómo instalarlos.\n5/11/2009. Metodologías (I): Introducción y especificación (Asun)\n[6]\n12/11/2009. Metodologías (II): Ciclo de Vida y planificación (Asun)\nMetodologías (II)\n.\n19/11/2009. Metodologías (III): Reutilización de recursos ontológicos y no ontológicos (Asun)\n[7]\n( Old ones\n[8]\n[9]\n)\n26/11/2009 y 3/12/2009. Lenguajes de Ontologías: OWL (Oscar)\nOntology languages (OWL)\nEjemplo1\nEjemplo 2\nResolución parcial de clase del ejemplo 2\nEjemplo 3\n10/12/2009. Anotación lingüística y semántica (Andrés y Elena)\n[10]\n17/12/2009. Ejemplo completo de desarrollo de una ontología y dudas sobre la práctica a realizar (Asun)\n[11]\nLa clase comenzará a las 7:45\n14/1/2010.  Anotación de recursos y acceso basado en ontologías a bases de datos de legado (Oscar)\n[12]\n21/1/2010. Aplicaciones de ontologías y Dudas sobre la práctica a realizar (Asun)\n28/1/2010. No hay clase porque es la fiesta de Santo Tomás de Aquino.\n11/2/2010. Examen de la asignatura. Aula 3202. 10:00-11:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\n7/9/2010. Examen de la asignatura. Aula por confirmar. 17:00-20:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\nDocumentación de Metodologías\n\nD5.3.1 NeOn Development Process and Ontology Life Cycle\nNeOn Glossary of Activities\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[13]\nPrácticas\n\nTodas las prácticas se deben entregar por correo electrónico a masterTI09@delicias.dia.fi.upm.es.\nPráctica 1 (se incluye en la práctica 3)\n\nTrabajo de recopilación de fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido.\nPráctica 2 (11/11/2009)\n\nDesarrollo de taxonomías de conceptos y relaciones entre ellos en RDF Schema, con algunos individuos de ejemplo para poder mostrar cómo éstos se representan en RDF. Se puede hacer el desarrollo de manera manual (con un editor de texto, no recomendado) o con herramientas de edición de RDF(S). Asimismo, se deberán escribir 10 consultas en SPARQL teniendo en cuenta las taxonomías y relaciones implementadas, e intentando explotar las posibilidades expresivas de este lenguaje de consultas, junto con un análisis de cómo se abordarían estas consultas en una base de datos relacional.\nSe puede utilizar cualquier herramienta para la generación de RDF(S): editores de textos, herramientas específicas (por ejemplo, Altova SemanticWorks) o APIs de gestión de ontologías (por ejemplo, Jena, Sesame, etc.).\nPráctica 3. Entrega 1 (Miércoles 25 de Noviembre)\n\nEl objeto de esta práctica es realizar la especificación de requisitos de la ontología, la busqueda de recursos (veáse la práctica 1) y la planificación del desarrollo de la ontología.\nGuías Metodológicas:\nEspecificación de Requisitos\n;\nPlanificación (Scheduling)\nCapitulos 3 y 4\nVersión del NeOn Toolkit y plugins asociados:\nDescargar\nNueva versión del NeOn Toolkit y plugins asociados:\nDescargar\nTemplate para escribir el ORSD (documento de especificación de requisitos de la ontología):\nORSD Template\nFreeMind Software\n[14]\nDocumentar en detalle cómo se han realizado la actividad de\nEspecificación de Requisitos\ny elaborar el Documento de Especificación de Requisitos de la Ontología.\nDocumentar en detalle cómo se han realizado la actividad de\nBúsqueda de Recursos\n. Dado que la práctica 1 se ha anulado, en esta entrega se incluirán las fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido. Para la búsqueda de ontologías se utilizará Watson\n[15]\n.\nDocumentar en detalle cómo se han realizado la actividad de\nPlanificación\n. La Planificación del desarrollo de la ontología se debe realizar de las siguientes dos formas:\nPlanificacion\nsin gOntt plug-in\n, usando por ejemplo Excell.\nPlanificacion\ncon gOntt plug-in\n; en este caso se ha de completar la planificación inicial que proporciona gOntt con los procesos y actividades necesarios y no incluidos en dicho plan inicial.\nEn ambos casos y cada uno por separado, se debe indicar en la entrega de la práctica:\nEl conjunto de actividades necesarias para el desarrollo de la ontología.\nEl modelo de ciclo de vida a utilizar para el desarrollo de la ontología y justificar por qué se usa.\nEl conjunto de posibles escenarios en la construcción de la ontología.\nEl ciclo de vida concreto a seguir para desarrollar la ontología --> construir un diagrama Gantt para el desarrollo de la ontología.\nTiempo empleado en cada una de las dos formas; y comentarios relacionados con el uso del gOntt plug-in.\nRellenar el\ncuestionario\nsobre la utilidad y usabilidad de las guías metodológicas para la especificación de requisitos.\nRellenar el\ncuestionario\nsobre el gOntt plug-in.\nPráctica 3. Entrega 2 (Miércoles 2 de Diciembre)\n\nLa práctica comienza el 25 de noviembre 2009. \nLa información y recursos necesarios estarán disponible en el wiki.\nLos estudiantes que no figuran en la lista del Ejercicio 3.1 o 3.2, por favor enviar un mail a bvillazon at fi dot upm dot es, haciendo conocer su elección (si desean realizar 3.1 o 3.2)\nRecommended reading:\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[16]\nChapter 6: Non-Ontological Resource Reuse and Re-engineering.\nD2.2.2. Methods and Tools Supporting Re-engineering\n[17]\nChapter 2: State of the Art.\nChapter 3: NeOn Method for Re-engineering Non-ontological Resources.\nChapter 4: Methods for Re-engineering Classification Schemes.\nChapter 5: Methods for Re-engineering Thesauri.\nEjercicio 3.1\nSe proporciona a los estudiantes  un\nclassification scheme\n, de un determinado dominio, implementado en una base de datos\nLos estudiantes crean manualmente el modelo conceptual utilizando el classification scheme.\nLos estudiantes entregan el modelo conceputal creado (30 de Noviembre de 2009).\nSe proporciona a los estudiantes de la librería de software (\nNota: es indispensable entregar primero el modelo conceptual\n).\nLos estudiantes generan la ontología utilizando la librería de software y el classification scheme.\nLos estudiantes rellenan dos cuestionarios.\nLos estudiantes entregan la ontología generada, y los cuestionarios (2 de Diciembre 2009).\nEstudiantes:\nJavier Campo Trapero\nJavier Sánchez Soriano\nEvaristo\nAntonio Roque\nIgnacio López Viesca\nJacobo Enríquez Gabeiras\nEjercicio 3.2\nSe proporciona a los estudiantes un\ntesauro\n, de un determinado dominio, implementado en un xml.\nLos estudiantes crean manualmente el modelo conceptual utilizando el tesauro.\nLos estudiantes entregan el modelo conceputal creado (30 de Noviembre de 2009).\nSe proporciona a los estudiantes de la librería de software (\nNota: es indispensable entregar primero el modelo conceptual\n).\nLos estudiantes generan la ontología utilizando la librería de software y el tesauro.\nLos estudiantes rellenan dos cuestionarios.\nLos estudiantes entregan la ontología generada, y los cuestionarios (2 de Diciembre 2009).\nEstudiantes:\nRaphael Alexánder Alvear Abello\nSergio Yébenes Moreno\nCamilo\nRubén Alvarez Ochoa\nMiguel Villeta Espada\nYovan Íñiguez del Río\nSjoerd\nLas instrucciones para la descarga del software se encuentran\naqui\nPor favor rellenar los cuestionarios sobre esta práctica. Los cuestionarios se encuentran\naqui\n.\nEnviar los cuestionarios a bvillazon at fi dot upm dot es\nPráctica 3. Entrega 3 (A determinar la fecha)\n\nEl objeto de esta entrega es realizar la conceptualización de la ontología que se va a desarrollar indicando:\nComentar si es necesario la reutilización y reingeniería de otras ontologías. Justificar los criterios utilizados a la hora de seleccionar una ontología entre varias disponibles.\nClasificar en la \"pirámide de ontologías\" donde se incluyen cada una de las ontologías que se necesitan para la aplicación.\nModelo Conceptual de alto nivel de la ontología, indicando si las ontologías se obtienen de otros recursos ontológicos o de otras ontologías.\nConstruir el modelo Conceptual detallado de la ontología, identificando cuáles son los conceptos principales involucrados y las relaciones entre ellos.\nImplementar una parte de la ontología con el NeOn Toolkit , incluyendo propiedades en los conceptos e identificando algún axioma.\nOpcionalmente, si el plugin RADON está disponible, se realizará la evaluación de la ontología.\nRellenar el siguiente\ncuestionario\nsobre la parte metodológica del curso.\nPráctica 4 (Miércoles 13/01/2010)\n\nDesarrollo de ontologías en OWL, basado en el desarrollo que se ha realizado con RDF Schema y los comentarios recibidos para la práctica anterior. Se debe hacer el desarrollo con herramientas de edición de OWL (herramientas recomendadas: Protégé 4\n[18]\ny SWOOP). Las ontologías deben contar al menos con 40 clases y 20 relaciones (ObjectProperties), y de las clases representadas al menos 10 deben ser definidas. Asimismo, la taxonomía escrita y la inferida deben ser distintas. También se deben incluir ejemplos de definiciones de clases que harían la ontología inconsistente y definiciones de instancias inconsistentes, y describir por qué.\nTrabajo Final Recopilatorio (entrega: día del examen)\n\nCada grupo realizará un trabajo final en el que unificará y resumirá las prácticas realizadas a lo largo del curso. El objetivo del trabajo es mejorar los trabajos individuales y agruparlos en un único documento. Se pide:\nPresentar con un enfoque metodológico la ontología construída, justificando aspectos como: la planificación de la ontología, la especificación de requisitos, los recursos no ontológicos reutilizados para su construcción, la conceptualización obtenida y la evaluación realizada a la ontología.\nImplementar la ontología en OWL con los métodos, técnicas y herramientas presentados a lo largo del curso.\nValorar  los contenidos de la asignatura, los contenidos aprendidos y los métodos docentes empleados\nLas prácticas se presentarán oralmente ese mismo día. Cada grupo hará una breve presentación de 10 minutos y se le harán preguntas durante otros cinco minutos.\nEl examen es el día 11 a las 10 de la mañana en el aula 3202\nNota\n: Rellenar el siguiente\ncuestionario\nsobre la parte metodológica del curso y enviarlo por correo electrónico a\nmasterTI09@delicias.dia.fi.upm.es\nantes del día del examen.\nOfertas de trabajo relacionadas\n\nIreland. Galway. Project Research Interns\nGalmar2011\n(más información: contactar con Óscar Corcho)\nBélgica. Gent. Developer\nGentmar2011\n(más información: contactar con Óscar Corcho)\nBélgica. Bruselas. Junior researcher\nBrusmar2011\n(más información: contactar con Óscar Corcho)\nEEUU. California. Computer Scientist\nCalifmar2011\n(más información: contactar con Óscar Corcho)\nReino Unido. M.Sc.\nseevlmar2011\n(más información: contactar con Óscar Corcho)\nReino Unido. Londres. Research Assistant or Research Associate\nLondresmar2011\n(más información: contactar con Óscar Corcho)\nIreland. Galway. Senior Developer\nDevGalway2011\n(más información: contactar con Óscar Corcho)\nEspaña. Desarrolladores.\nXimdexfeb2011\n(más información: contactar con Óscar Corcho)\nReino Unido. Londres. Web Developer Programmes\nWebDevfeb2011\n(más información: contactar con Óscar Corcho)\nEEUU. Tejas. Software Engineer\nTejasfeb2011\n(más información: contactar con Óscar Corcho)\nReino Unido. Londres. Research Assistants in Semantic Web / Music Informatics\nLondresfeb2011\n(más información: contactar con Óscar Corcho)\nSlovenia. Ljubljana. Junior data integration engineer\nLjubljanafeb2011\n(más información: contactar con Óscar Corcho)\nIreland. Galway. Internship on Semantic Technologies\nGalwayjan2011\n(más información: contactar con Óscar Corcho)\nEspaña. Barcelona. Data engineer\nBarcelonajan2011\n(más información: contactar con Óscar Corcho)\nAustria. Viena. Software Application Engineer\nVienajan2011\n(más información: contactar con Óscar Corcho)\nEEUU. Stanford. Senior Software Engineer\nStanfordjan2011\n(más información: contactar con Óscar Corcho)\nFrance. Marseilles. Biodiversity Informatics / Semantic Web Engineer\nMarseillesjan2011\n(más información: contactar con Óscar Corcho)\nAustria. Innsbruck. Semantic technologist\nInnsbruckjan2011\n(más información: contactar con Óscar Corcho)\nItaly. Ancona. Project Research position\nAnconajan2011\n(más información: contactar con Óscar Corcho)\nCanada. New Brunswick. Computer Scientist\nCanadadec2010\n(más información: contactar con Óscar Corcho)\nGermany. Munich. PhD positions and Post-doc position\nMunichdec2010\n(más información: contactar con Óscar Corcho)\nAustria. Vienna. Software Engineer.\nGnowsisnov2010\n(más información: contactar con Oscar Corcho)\nBélgica. Bruselas. Junior/Senior Engineers.\nCollibra2010\n(más información: contactar con Oscar Corcho)\nGermany. Munich. Data Web developer/content architect.\nWoltersKluwer2010\n(más información: contactar con Oscar Corcho)\nCanada. New Brunswick. Bioinformatics.\nC-BRASS2010\n(más información: contactar con Oscar Corcho)\nGermany. Karlsruhe. Septiembre 2010. PhD Position.\nKIT.2.2010\n(más información: contactar con Oscar Corcho)\nFrancia. Montpellier. Septiembre 2010. Scientific Developer.\nDataLift2010\n(más información: contactar con Oscar Corcho)\nGermany. Munich. Agosto 2010. Researcher: SEMANTIC TECHNOLOGIES and SERVICE-ORIENTED COMPUTING.\nDOCOMO2010\n(más información: contactar con Oscar Corcho)\nItaly. Ancona. Julio 2010. Semantic Web Applications.\nSemWebApp2010\n(más información: contactar con Oscar Corcho)\nAlemania. Berlín. Julio 2010. Semantic Web Developer.\nSemWew2010\n(más información: contactar con Oscar Corcho)\nAlemania. Berlín. Abril 2010. DBPedia developer.\nDBPediaApr2010\n(más información: contactar con Oscar Corcho)\nAustria. Enero 2010. Semantic-technologies software engineer en Playence (más información: contactar con Oscar Corcho)\nReino Unido. Milton Keynes (Knowledge Media Institute). Enero 2010. Short internship (más información: contactar con Oscar Corcho)\nEspaña. Madrid. Becario a tiempo parcial. Enero 2010. iSOCO (más información: contactar con Oscar Corcho)\nAlemania. Senior researcher. Diciembre 2009. Semantic Web:\nSeniorResearcherKoblenz\nAustralia. Senior Scientist en CSIRO. Diciembre 2009. Semantic data management and sensor information systems:\nhttps://recruitment.csiro.au/asp/job_details.asp?RefNo=2009%2F800\nFrancia. Postdoc en LORIA/INRIA. Noviembre 2009. Semantic wikis:\nPostdocLORIA\nIrlanda. Bell Labs. Octubre 2009. Semantic Web expert.\nBellLabsIrelandOct2009\nInglaterra. Julio 2009. Ontology Engineer.\nhttp://www.trueknowledge.com/jobs/\nAustria. Febrero 2009.\nhttp://www.sti-innsbruck.at/about/jobs/\nNature Publishing Group:\nhttp://www.cs.man.ac.uk/~hulld/npg.pdf\nFujitsu, Londres, Enero 2009:\nhttp://delicias.dia.fi.upm.es/wiki/images/2/2b/OfertaTrabajoFujitsu_Jan09.pdf\nBerlin, Alemania, Enero 2009.\nhttp://www.corporate-semantic-web.de/reader/items/we-are-hiring---ppen-phd-position-at-corporate-semantic-web.html\nAustralia. Enero 2009.\nhttps://recruitment.csiro.au/asp/job_details.asp?RefNo=2008%2F1497\nReino Unido. Enero 2009.\nhttp://kmi.open.ac.uk/jobs/vacancy-5245.php",
  "speaker": "SYSTEM",
  "uuid": "3540aadd-b4aa-40fb-91f8-282fedd32fec"
}