{
  "message": "SYSTEM: NeOn-Methodology-OntologySpecificationGuidelines.pdf: Página 9\nNeOn Methodology for Building Ontology Networks: Ontology Specification \nPage 9 of 18 \nbut it just describes the most important points. A detailed and complete specification is described in \n[2]. Next we described the steps we followed: \nTask 1. Identify purpose, scope and level of formality. \nThe development of the Reference Ontology is motivated by scenarios related to the application \nthat will use the ontology. Such scenarios describe a set of the ontology requirements that the \nontology should satisfy after being formally implemented. The motivating scenarios are described \nin [1]. In summary, the purpose of building the Reference Ontology is to provide a consensual \nknowledge model of the employment domain that could be used by public e-Employment services  \n(PES), more specifically within the ICT (Information and Communication Technology) domain. \nSince SEEMP project relies on WSMO, the implementation language of the resultant ontology will \nbe WSML. \nTask 2. Identify intended users. \nAs it was mentioned before, the Reference Ontology will be the core component of the SEEMP \nplatform; the peers on the SEEMP interoperate with each other from their local ontologies via the \nReference Ontology. The analysis of the motivating scenarios allowed us to identify the following \nintended users of the ontology: \nUser 1. Candidate who is unemployed and searching for a job or searching another \noccupation for immediate or future purposes \nUser 2. Employer who needs more human resources. \nUser 3. Public or private employment search service which offers services to gather CVs or \njob postings and to prepare some data and statistics. \nUser 4. National and Local Governments which want to analyze the situation on the \nemployment market in their countries and prepare documents on employment, social \nand educational policy. \nUser 5. European Commission and the governments of EU countries which want to analyze \nthe statistics and prepare international agreements and documents on the \nemployment, social and educational policy. \nTask 3. Identify intended uses.  \nThe analysis of the motivating scenarios described in [1], allowed us to identify the following main \nintended uses of the ontology: \nUse 1. Publish CV. Job seeker places his/her CV on the PES Portal.  \nUse 2. Publish Job Offer. An Employer places a Job Offer on the PES Portal. \nUse 3. Search for Job Offers. The Employer looks for candidates for the Job Offer through \nPES Portal. \nUse 4. Search for Employment information. Job Seeker looks for of general information about \nemployment in a given location at the PES Portal. \nUse 5. Provide Job Statistics. The PES Portal provides employment statistics to the Job \nSeeker and Employer. \nTask 4. Identify requirements. \nFor specifying the ontology requirements we used the competency questions techniques. We \nfollowed the bottom up approach for identifying them. Competency questions were stored in an \nExcel file and then rewritten in a mind map tool as appears in Figure 2 and Figure 3, respectively. \nIn total we identified sixty competency questions, which are described in detail in [1]. Examples of \nsome competency questions are:  \n",
  "speaker": "SYSTEM",
  "uuid": "356f3666-9338-45e8-a83b-0ce8c89ee64e"
}