{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 37\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 37 de 42 \nConference (ISWC'16), Kobe (Japan), ISBN 978-3-319-46546-3. Springer Vol. 9982. \nPp. 47-55. Octubre 2016 \n34. Gracia J, Marta Villegas, Asunción Gómez-Pérez, Núria Bel. The Apertium Bilingual \nDictionaries on the Web of Data. Semantic Web Journal, ISSN 1570-0844. IOS Press. \nThe Netherlands, septiembre 2016 \n35. Hossain M. A.; Abawajy J.H.; García-Castro R.; Cheng W.-H.; Ahmed D. T. Sensor-\nWeb Systems, Applications, and Services. International Journal of Distributed Sensor \nNetworks. Volumen 2016. Abril 2016. Hindawi Pulishing Corporation. 1550-1477 \n36. Li T; Juan M. Corchado; Jesús García; Javier Bajo Perez. MEAP: Approximate optimal \nestimate extraction for the SMC-PHD filter. \"19th International Conference on \nInformation Fusion, FUSION 2016\".pp. 2309 - 2316. ISBN 978-0-9964-5274-8. Julio \n2016. \n37. Marcu O, A. Costan, G. Antoniu, M.S. Perez. Spark versus Flink: Understanding \nPerformance in Big Data Analytics Frameworks. IEEE Cluster 2016. Taipei, septiembre \n2016. \n38. Matri P, A. Costan, G. Antoniu, J. Montes, M.S. Perez. Towards Eficient Localization of \nDynamic Replicas for Geo-Distributed Data Stores. 7th Workshop on Scientific Cloud \nComputing (ScienceCloud) 2016, ACM HPDC. ACM, Pp. 3-9. Kyoto, junio 2016 \n39. Matri P, A. Costan, G. Antoniu, J. Montes, M.S. Perez. Tyr: Blob Storage Systems Meet \nBuilt-In Transactions. SC '16 Proceedings of the International Conference for High \nPerformance Computing, Networking, Storage and Analysis. Article n. 49. Salt Lake \nCity, noviembre 2016. \n40. McCrae JP, Mihael Arcan, Kartik Asooja, Jorge Gracia, Paul Buitelaar, Philipp Cimiano. \nDomain adaptation for ontology localization. Web Semantics: Science, Services and \nAgents on the World Wide Web, ISSN 15708268. Elsevier. Vol. 36. Pp. 23-31. Enero \n2016 \n41. McCrae JP, Christian Chiarcos, Francis Bond and Philipp Cimiano, Thierry Declerck, \nGerard de Melo, Jorge Gracia, Sebastian Hellmann, Bettina Klimek, Steven Moran, \nPetya Osenova, Antonio Pareja-Lora, Jonathan Pool. The Open Linguistics Working \nGroup: Developing the Linguistic Linked Open Data Cloud. 10th Language Resources \nand Evaluation Conference (LREC'16) Portorož (Slovenia), ISBN 978-2-9517408-9-1. \nELRA. Pp. 2435-2441. Mayo 2016 \n42. Memishi B, S. Ibrahim, M. S. Pérez and G. Antoniu. On the Dynamic Shifting of the \nMapReduce Timeout. Capítulo de \"Managing and Processing Big Data in Cloud \nComputing\". Eds. R. Kannan, R.U. Rasool, Hai Jin and S.R. Balasundaram. IGI Global. \nISBN 978-1-466-69767-6. Febrero 2016. \n43. Memishi B, S. Ibrahim, M. S. Pérez and G. Antoniu. Fault Tolerance in MapReduce: A \nSurvey. Capítulo del libro \"Resource Management for Big-Data Platforms: Algorithms, \nModelling, and High-Performance Computing Techniques (Computer Communications \nand Networks)\". Eds. F. Pop, J. Kolodziej and B. di Martino. F. Pop, J. Kolodziej and B. \ndi Martino. ISBN 978-3-319-44880-0. 2016. \n44. Memishi B, M.S. Pérez and G. Antoniu. Feedback-based resource allocation in \nMapReduce-based systems. Scientific Programming. Hindawi Publishing Corporation, \nAbril 2016. \n45. Mihindukulasooriya N.; García-Castro R.; Esteban-Gutiérrez M.; Gómez-Pérez A. A \nsurvey of RESTful transaction models: One model does not fit all. Journal of Web \nEngineering. Editors: M. Gaedke, G.-J. Houben, D. Schwabe, B. White. Volumen 15. \nPáginas: 140-169. Marzo 2016. Rinton Press. ISSN: 1540-9589 \n46. Mihindukulasooriya N., Garcia-Castro R., Gomez-Perez A. LD Sniffer: A Quality \nAssessment Tool for Measuring Accessibility of Linked Data. 20th International \nConference on Knowledge Engineering and Knowledge Management (EKAW2016). Pp. \n1-4. Bolonia, 21 de noviembre de 2016 \n47. Mihindukulasooriya N., Gonzalez E., Serena F., Badenes C., Corcho O. FarolApp: Live \nLinked Data on Light Pollution. 15th International Semantic Web Conference \n(ISWC2016). Vol., 1690. Pp. 1-4. Kobe, 19 octubre 2016 \n48. Mihindukulasooriya N, Poveda-Villalón M, Raúl García-Castro and Asunción Gómez-\nPérez. Collaborative Ontology Evolution and Data Quality - An Empirical Analysis. 13th \nOWL: Experiences and Directions Workshop and 5th OWL reasoner evaluation \nworkshop. Pp: 20. Bolonia, 20 noviembre 2016 \n",
  "speaker": "SYSTEM",
  "uuid": "363491a7-e60e-44c9-91fe-3c34f4d5770c"
}