{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Dev8dTalks/AmazonEC2Tutorial \n\nAmazon EC2\n\nS3\nSimple storage service\nyou store \"Stuff\" in buckets\nbucket names are globally unique\nrest API\nheader based authentication with key-pairs\nEC2 Elastic compute 2\nElastic compute\nAMIs = ISOs in Amazon\nhttp://aws\nCons: is like a live CD, 78$ per mont (to just run an instance)\nStatic (moveable) IPs, you can assing your won DNS\nPersistent storage thriugh an EBS volume (S3 mounted as a volume)\nDarse de alta en Amazon EC2\ngo to Management console and log in into EC2, choose region (EU West), they are not region compatible\ngo to AMIs and search the desired one. Take into account that this is like a live CD.\ndefine security rules, new group, add http, the protocol to connect to the machine\nreview instance's details, and launch it\ngo to security groups in the running instances group, refresh, check the one you created and add ssh\nlogin ssh into the instance\ndownload the tutorial wget\nhttp://SplashURL.net/aeT\ngo to par1 folder and ./setup.ssh\nthen it is configured everything, the MySQL,\nElastic Block Store\nAmazon only charges you for the snapshot you allocate, not the size. This creates a hard drive that can be attached to your running instances. Both intance and EBS volume must be in the same region!\ngo to directory workshop_part2\nwe use some scripts to start and stop mysql from the ssh in the EC2 instance\nhttp://developer.amazonwebservices.com/connect/entry.jspa?externalID=1663\nwe halt the instance: $halt\nNew instance: lenny-base-65-200910...\nspecify the same area grupo than the disk we created beforen (us-east-1b)\nmount again the volume and see that the files are still there mount /dev/sdf /vol\ncheck the new address:\nhttp://ec2-174-129-153-109.compute-1.amazonaws.com/\nend notes\nif you want your machine in all regions, you have to upload it in all regions\nyou have all the ec2 commands in the image running ssh ec2-*\nec2-bundle-vol and ec2-upload-bundle\nin AMI it is possible to register a new one, adding a Manifest Path. The XML file that is in the ec2 image\ndelete all volumes and stop (halt) everything when you stop using it. YOU PAY FOR THIS!\nLinode Section\n\nhttp://www.linode.com/",
  "speaker": "SYSTEM",
  "uuid": "365ae246-dc4c-447c-b858-8e678f772d29"
}