{
  "message": "SYSTEM: Resoluci%C3%B3n_de_3_de_junio_de_1991%2C_de_la_UPM_por_la_que_se_acuerda_la_publicaci%C3%B3n_del_Reglamento_de_Becarios_de_dicha_Universidad.pdf: Página 5\n22524\nViernes 5 julio 1991\nBüE núm. I/JO\nEl bL'l:ario,\nANEXO V\nVenckdor\n115,129\n129.117\n62.809\n18,532\n1:>4.863\nSA-n\n305.322\n55.775\n16.259\n168.066\n72,017\n57.490\n100.796\n72,752\n82.797\n17.374\n16,097\n26,412\n892,477\n87.763\n114.785\n128.731\n62.621\n18.476\n184.309\n8.416\n304.408\n55.607\n16,211\n167.562\n71.301\n57.318\n100.494\n72.534\n8.2,549\n17,322\n16.049\n26.332\n889.803\n87,501\nI\nI\nCamb¡ú~\nMercado de Divisas\nBANCO DE ESPAÑA\nCambios IJ.!7ciales del dia 4 de juliv de 1991\nt dólar USA\n1 ECl!\nI marco alemán\n1 franco franee>;\n¡ libra esterlina\n100 liras\nitalianas\nlOO francos belgas y luxemburgueses\n1 florín holandés\n1 corona danesa\n1 libra\nirlandesa\n100 escudos portugueses\n100 dracmas griegas\n1 dólar l\"<lnadiense\n1 ¡ranco suizo\n100 lens Japoneses\n1 corona sUt.>t:a\n1 (:orona\nnoruega\nI marco finlandés\n100 chelines austriacos\nI dólar australiano\n17479\nHe resuelto:\nCOMUNIDAD AUTONOMA\nDE CATALUÑA\nRESOLUCION de 29 de octubre de 1990, de la Dirección\nGeneral del Patrimonio Cultural del DI'partameltlv de\nCultura, por la que se incoa expediente de declaración de\nmonUntl'nto a favor de la iglesia de Sam Climenl d'/ran,\nen El Pont de Suert (Afia Rihagorra).\nVista la propuesta del Servicio del Patrimonio Arquitectónico, fa-\nvorable a la incoación del expediente de declaración de monumento a\nfavor de la iglesia de Sant Climent d'lran, en El Pont de Suert (Alta\nRibagor~a);\nConsiderando lo que disponen el articulo 9 de la Ley 16/1985, de\n25 de junio, del patrimonio histórico, y el artículo 11 del Real Decre-\nto 1Uj1986, de 10 de enero, para el desarrollo parcial de dicha Ley,\nPrimero.-Incoar expediente de declaración de monumento, como\nbien de intefeS cultural, a favor de la iglesia de San Climcnt d'Iran,\nen El Pont de Suert (Alta Ribagor~a).\nSegundo,-Definir el entorno de monumento, que queda deEmita-\ndo en el plano Que se adiunta al exocdiente de incoación. Los bienes\nmuebles contenid.os en el-inmueble, que deben ser afectados por la de-\nclaración serán debidamente determinados durante la tramitación del\nexpediente.\nTercero.-Seguir la tramitación del expediente según las disposicio~\nnes vigentes.\nCuarto.-Dar traslado de esta Resolución al Alcalde de El Pont de\nSuert y hacerle saber que, de acuerdo con lo que establece el articulo\n16 de la Ley 16/1985, de 25 de junio, la presente incoación determina\nla suspensión de los efectos de las licencias de parcelación, edificación\no demolición en la zona afectada y los efectos de las licencias ya otor-\ngadas, y que la realización de obras en esta zona deberá ser autoriza-\nda por la Dirección General del Patrimonio Cultural.\nQuinto.-Que, de acuerdo con 10 que dispone el artículo 12.2 del\nReal Decreto 111/1986, de 10 de enero, para el desarrollo parcial de\nla Ley\n16!1~85, se notifique esta Resolución a los interesados. a los\nefectos oportunos, y al Registro general de bienes de interés cultural.\npara su anotación preventiva.\nBarcelona, 29 de octubre de 1990.-EI Director general del Patri-\nmonio Cultural, Eduard CarboneU i EstelleL\n17480\nIngles Il Y su didáctica\n} 4»\nFrancés Il y su didáctica\nCORRECCIO:'¡ de araIas de la ResolucltÍlI de 28 de alml\nde 1991, de la enirasidad de Baiccfona. por la que Si' !lace\npública la homologación de! Plan de estudios de la Facul-\ntad de Derecho de Lirída de la L'IIÍlwsidad de Barcelona.\nHa de constar.\n«Idioma:\n17477\nCORRECC/ON de errores de la Resolw::i6n de 28 de abril\nde 199/, de la Universidad de Barcelona, por la que se hace\npúblico el Plan de estudios de la Escuela Universitaria de\nFormación del Profesomdo de Educación General Básica\n«Blanquerna», adscrita a esta Universidad\nAdvertidos errores en el texto remitido para su publicación de la\nmencionada Resolución, inserta en el «Boletín Oficial del\nEstadm~\nnüm~ro 135, de fecha 6 de junio de 199L página 18599, columna\nprimera, se transcriben a continuación las oportunas rectificaciones:\nEn el anexo, primer curso, especialidad de Ciencias, a la asignatura\n«Lengua 1 y su didaetica» le corresponden cuatro horas semanales.\nEn el anexo, segundo curso, especialidad Filología consta:\n«Idioma: Ingles tI y su didáctica\n4\nFrances Il y su didáctica\n4»\n3.\nPresentar en el plazo convenido los\nt¡abajos que le sean\nencomendados dentro del Convenio citado.\n4.\nDevolver las cantidades indebidamente percibidas en los casos\ncontemplados en el artículo 28.1 del Reglamento antes referido.\nl'\\ifadrid, a\nde\nde\n,\nCredencial del becario de la Universidad Politécnica de l\\Iadrid\nDon Rafael Portaencasa Baeza. Rector ma~nífico de la Universidad\nPolitécnica de Madrid, en virtud de las atribuCIones que tiene conferidas\npor el articulo 76 de sus Estatutos, aprobados por Real Decreto\n2536/1985. de 27 de diciembre (<<Boletin Oficial del Estado» de 22 de\nenero de 1986), y de conformidad con la política general de becas y\nayudas a los estudiantes a que se refiere el artículo 26.3 de la Ley\nOrgánica t 1/1983, de 25 de agosto «<Boletín Oficial del Estado» de 1 de\nseptiembre), de Reforma Universitaria, instrumentada por el Regl....\nmento sobre becarías de la Universidad Politécnica de Madrid, apro-\nbado por su Junta de Gobierno, y con los efectos que en el mismo se\nestablcren, tengo a bien nombrar a:\nDon\n_\nbecario de·la Universidad\nPolitécnica de Madrid por la modalidad de:\nBecas para la formación del Personal Docente.\nBecas de Colaboración en los Convenios, Contratos o Proyectos de\nInvestigación Científica y Técnica.\n.\nBolsas y Ayudas al Estudio.\n.\nBolsas y Ayudas al Estudio para Programas de Cooperación Educa-\ntiva.\nBecas de Colaboración con cargo a Programas financiados por\nOrganismos supranacionales..\nTodo ello con los efectos, responsabilidades y limitaciones que en\ndicha norma se contienen, al igual que las derivadas en los actos\nadministrativos de que la presente credencial\ntrae causa, que\nel\ndesignado conoce y acepta de plena conformidad.\nMadrid,'a\nde _\nde\n.\nEl Rector, Rafael Portaencasa Baeza.\n17478\nPadecido error en\nla inserción de\nla\nmencionada\nResolución.\npublicada en el «Boletín Oficial del Estado» numero 135, de fecha 6 de\njunio de 1991, página 18597, columna primera, se tranSCrIbe a continua~\nción la oportuna rectificación:\nEn el texto del sumaría donde consta:\n«..., por la que se hace pública la homologación de la modificación\ndel Plan de estudios... ~)\nHa de constar:\n««..., por la que se hace pública la homologación del Plan de\nestudios.._»\n",
  "speaker": "SYSTEM",
  "uuid": "368bdc59-50fa-4442-bc30-f968cd811e11"
}