{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Madrid,_16_Enero_2009 \n\nLugar\n: H-1002\nSesión común con IGN\n\n9:30 - 10:00 Presentación del primer prototipo, equivalente a la presentación realizada en Santiago para la conferencia sobre turismo y nuevas tecnologías en diciembre de 2008 (Manuel)\n10:00-10:15 Estrategia de diseminación - newspaper-style y scientific papers - y de evaluación para verano 2009 (Eduardo/Oscar)\n10:15-10:45 Descripción de arquitectura y características técnicas implementadas en el primer prototipo (Roi/Víctor)\n10:45-11:00 Descripción de principales problemas técnicos encontrados en el primer prototipo (Roi/Víctor)\n11:00-11:15 Datos: IGN, otros productores, estrategia a seguir, etc. (Eduardo/Oscar)\n11:15-11:30 Nuevos servicios disponibles en el IGN (IGN)\n11:30-12:00 Café\nSesión privada del proyecto GeoBuddies\n\n12:00-13:30 Nuevas funcionalidades para el prototipo 2: búsqueda geoposicionada y expandida (semántica, tags, etc.), recomendación, tagging, vídeos, redes sociales, etc. Aquí se abordan sin gran detalle funcionalidades que deberían ser abordadas, y que luego se explicarán con más detalle. Si es muy difícil hacerlo así, se puede empezar por las descripciones de trabajos a realizar en cada WP.\n13:30-14:30 Comida\n14:30-15:00 Arquitectura: descripción detallada de los nuevos trabajos a realizar (Víctor). Nuevos servicios a incluir?\n15:00-15:30 Tagging: descripción detallada de los nuevos trabajos a realizar (Andrés). Algoritmos a implementar?\n15:30-16:00 Recomendación: descripción detallada de los nuevos trabajos a realizar (Eduardo). ¿Cuánto de semántico?\n16:00-16:30 Mappings: descripción detallada de los nuevos trabajos a realizar (José Angel). Explotación de mappings?\n16:30-17:00 Café\n17:00-17:30 Grid: descripción detallada de los nuevos trabajos a realizar (María). Inclusión final de vídeos. Cloud computing? Amazon data clouds?\n17:30-18:00 Interfaces: descripción detallada de los nuevos trabajos a realizar (Roi). Android?",
  "speaker": "SYSTEM",
  "uuid": "369e57cf-bb59-4e21-858c-87d85419486c"
}