{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MeteorologiaLinkedData \n\nVocabulary reusing Metoffice\nScript to check the files from the repository\nBoris has to introduce Nor2O to everyone\nExtend Nor2O to read the .csv from AEMET.\nComplete the tutorial on the Pubby configuration file: load some rdf to Virtuoso, and access it form Pubby successfully.\nTutorial on Nor2O (Nor2O for dummies)\nResearch on special character on Pubby (accents, ñ, etc).\nHow to publish new contents in the visualizer made by Alex, Miguel Angel and Boris.\nScovo for statistics\nRegister AEMET's domain\nVisualizador: Feedback y cosas a hacer tras la primera versión\nQue la interfaz se asemejara en el blurb que aparece más a lo que se muestra en sensors.ijs.si o en la propia AEMET para esos mismos datos.\nQue en la parte de facetas no apareciera ese texto tan feo, sino algo más centrado en estaciones o algo así\nLo ideal sería poder mostrar que como resultado de una consulta (dime las estaciones que han tenido más de x litros por metro cuadrado en los últimos días) se muestre esto en el mapa (esa es la que no es fácil hacer ahora mismo con la información que se proporciona si no se trata de alguna manera.\nSpark o Widgets de google para ver gráficas.\nColor de las chinchetas según la temperatura, viento, etc. Se puede hacer con una sparql query simple.\nNext Week - 25/02/2011\n\nDaniG&Mora\nDocumentar el proceso de uso de NOR2O\nGhis&Maria\nOntologia\nIdafen&Dani\nProbar el visualizador\nSole&DaniV\nAnalizar los datos con GoogleRefine\nNext Week - 18/03/2011\n\nOscar\nNos pasa el documento que le pasaron los de AEMET\nMaria&Boris&Ghis&Pablo&Mikel\nTerminar modelo básico el lunes (depende disponibilidad de Boris)\nInteractuar para la generación del modelo\nAñadir la ssn y alinear con el modelo actual.\nMora\nCambiar el script para generar el RDF siguiendo el modelo básico de María&Ghis\nPasar a rdflib para automatizar  y que no haya fallos.\nGenerar ya la información de las estaciones\nDaniV&Sole\nMirar el tema del cleansing\nAlcazar\nCrear el dominio aemet.linkeddata.es\nDani&Idafen\nSubir el RDF generado y el modelo.\nVisualizador: intentar ver gráficas de diezminutales. LightBox con los datos de la observacion actual\nRoadmap\nSecond iteration\n\nMiguel Ángel and Mora\nSet the generation and automate the load of an RDF file in the server every 10 minutes.",
  "speaker": "SYSTEM",
  "uuid": "37013026-1791-4c09-b95a-9e9955a4c429"
}