{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Evaluación Definitiva del proceso de asociación de semántica a etiquetas Sem4Tags\n1) Se ha comprobado y validado el dataset que hemos extraído de Flickr para realizar la evaluación definitiva del proceso. Este dataset tiene como características principales la multilingualidad y la variedad de usuarios, fotos y etiquetas.\n2) se ha probado la aplicación de evaluación y funciona correctamente.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea Integración y patrones de reconocimiento avanzado 2.\nAmpliación de las listas de reconocimiento de términos. Inclusión de nuevas categorías dentro de la opción Lookup de las NE.\nAnálisis de resultados sobre un conjunto de recursos usando el modelo JENA junto con el tratamiento lingüísticos.\nReunión de trabajo en OEG sobre los avances del proyecto. Toma de decisiones y modificación del plan de acción.\nInterfaz Anotación Híbrida\n\n- Se continua trabajando en Yii framework para implementar la gestion de usuarios y el almacenamiento de contenidos en base de datos.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se continua trabajando para restaurar los servidores y clientes Fura.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nRedefinición del formato de escritura manual de los conjuntos de referencia para poder realizar su transcripción automática al formato OEGMappings.\nLectura de entregable 7.2.4 para evaluar la posible relación del trabajo de servicio\nde acceso a ontologías terminológicas y del trabajo que se está desarrollando en este\npaquete 1.4.\nTarea 7.1\n\n- Linked Data.\n· Difusión (CaixaForum y noticia en Madri+d)\n- RDF.\n· Continuación del pintado RDF en mapa. Beta en disponible en:\nhttp://geo.linkeddata.es:8181/GeoLinkedDataBrowser/#dashboard\n· Desarrollo de ontologías para nuevos dominios (redes, unidades administrativas)\n      · Generación de RDF para otros dominios (redes)\n      · Iniciación del tratamiento de la geometría (bases de datos) para incorporación al RDF",
  "speaker": "SYSTEM",
  "uuid": "389cde2e-b332-4c30-bae8-f5b0908178f2"
}