{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 6\nof RESTful services. We selected this storage model in order to increase efficiency in \nthe recovery of the RESTful services. \nTable 2. Syntactic description of our two sample RESTful services. \nService 1: \ncountryInfo($country,bBoxSouth,isoNumeric,continent,fipsCode,areaInSqKm,languages,iso\nAlpha3,countryCode,bBoxNorth,population,bBoxWest,currencyCode,bBoxEast,capital,geo\nnameId,countryName)  \nService 2: \nrest/venues/search($location,$app_key,id,link_count,page_count,longitude,trackback_count,\nversion,venue_type,owner,url,country_name,event_count,total_items,city_name,address,na\nme,latitude,page_number,postal_code,country_abbr,first_item,page_items,last_item,page_si\nze,country_abbr2,comment_count,geocode_type,search_time,venue_name) \n3.3   Semantic annotation \nSome of the difficulties that arise in the semantic annotation of RESTful services are \nbriefly described in [1, 11]. In order to cope with them, we rely on techniques and \nprocesses that permit: a) semantic annotation using only the syntactic description of \nthe services and their input/output parameters, or b) semantic annotation by \nidentifying a set of example values that allow the automatic invocation of the service. \nThe starting point of the semantic annotation process is the list of syntactic \nparameters obtained previously. Once the RESTful service is syntactically described \nwith all its identified input and output parameters, we proceed into its semantic \nannotation. We follow a heuristic approach that combines a number of external \nservices and semantic resources to propose annotations for the parameters as shown in \nFigure 2. Next, we describe the main components of the semantic annotation. \n3.3.1 A model for describing RESTful services \nIn order to describe semantically these services we define a model to show \nrelationships of different parameters with diverse resources used in the semantic \nannotation process. Some of the elements of this model are domain-independent, \nwhile others are related to the geospatial domain, which is the domain where we have \nperformed our experiments in order to evaluate the feasibility of our approach.  \n \nThis model (Figure 3) defines the following components: \n- \nParameter. This class provides a list of all parameters (inputs and outputs) \ncollected from different services. Likewise, we search for additional information \nfor each parameter, such as suggestions and synonyms, for enriching the initial \ndescription of parameters. The relation hasCollection relates Parameter \nwith DBpediaOntology. This relation has a cardinality of 1 in the \nParameter end, and 0..* in the DBpediaOntology. \n",
  "speaker": "SYSTEM",
  "uuid": "38a33e1b-d397-46a3-9ca5-af801ebeba27"
}