{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Sample_GESTS_invitation \n\nDear Author\nHello? As a general chair of GESTS, I am happy to invite you for the acceptance of your paper to be published in the GESTS International Transactions. This e-mail has been sent only to the authors who chose as a high quality paper that had been accepted as one of two parts of GESTS international transactions as follows:\n-Part 1:\nPaper Number : CSE1175-727\n   Paper Journal: GESTS International Transactions on Computer Science\n                  and Engineering\n   Paper Field  : Computer and Its Application\n   Volume Number: Vol.57 and No.2\n   ISSN Number  : 1738-6438\n   Publication date: November 30, 2009.\n   Journal Type : hard copy with a green color cover\n   Online Journals: publication on the web in parallel to the printed journals.\n-Part 2:\nPaper Number : CSP1175-112\n   Journal Title: GESTS International Transactions on Communication \n                  and Signal Processing\n   Paper Fields : Information Communication Engineering, Signal Processing, \n                        Image and Video Processing, Acoustics, etc.\n   Volume Number: Vol.13 and No.11\n   ISSN Number  : 1738-9682\n   Issue Date   : November 30, 2009.\n   Journal Type : hard copy with an orange color cover\n   On-line Issue: publication on the web in parallel to the printed journals.\nPlease, click the mouse on the \" Major Conference Author's Paper Submission \" at the home page,\nhttp://www.gests.org/\n. If the paper will be submitted through the web page, we will e-mail back with the details of how to proceed the submission of registration fees and copyright format.\nImportant dates for publication of the GESTS international transactions are :\n- an improved paper and copyright format by November 30, 2009, \n    (\nhttp://www.gests.org/gests-full.rtf\n)\n  - the acceptance notification within ten days receiving your paper,\n  - the registration format with fees by November 30, 2009,\n  - the publication of GESTS International journal by November 30, 2009,\n  - and delivery start from GESTS to authors by December 10, 2009.\nIf you have a new paper or an improved version to be issued in GESTS international transactions, please, send us the final camera-ready version by November 30, 2009. At least one author of each paper must be accomplished with the registration.\nWe are looking forward to see your contributions at GESTS.\nSincerely yours,\nDr. Bruce M. Bae, a general chair of GESTS,\nhttp://www.gests.org/",
  "speaker": "SYSTEM",
  "uuid": "39ac1f71-81e4-40f2-ba18-b227e08af35b"
}