{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual04112010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nRealización de análisis de cómo la longitud del contexto (es decir el número de etiquetas en el contexto) afecta la precisión de nuestro enfoque.\nEn el caso de etiquetas en Ingles obtenemos los mejores resultados cuando tenemos en el contexto entre 6 y 15 palabras (alcanzando el máximo entre 11 y 15). Lo interesante es que el 58% de las fotos analizadas tenían un contexto en este rango.  Contextos muy pequeños (1-5) o muy grandes (>=16) decrecen la precisión del enfoque. Contextos pequeños no proveen suficiente evidencia (i.e., palabras para medir el solapamiento con las palabras que definen cada significado) para seleccionar el significado apropiado. Por otra parte, contextos muy grandes pueden contener palabras que indiquen un significado y otras que indiquen otro significado.  En el caso de Español, contextos de longitud entre 1 y 10 alcanzan la mayor precisión, mientras contextos mas grandes (>=11) la decrecen hasta estabilizarse alrededor del 78%. La diferencia entre el procesamiento de etiquetas en Español e Inglés podría estar ligada al hecho de que de acuerdo a la información extraída de la Wikipedia hay mucha más ambigüedad en Inglés. Sin embargo, mas investigación se requiere en este aspecto.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nSeguimos analizando el código facilitado por el grupo CSAIL del MIT. Estaremos una semana más (al menos) analizando el código para ver si se puede adaptar al castellano.\nTarea 2.3\n\n- Instalación y prueba de herramientas cloud: Nimbus y OpenNebula.\n- Documentación sobre Cloud Providers: SLA y pricing.\nTarea 1.4\n\nConfección de casos de uso reales para el sistema integrado de explotación de OEGMappings.\nPosible integración dentro del AEI4.4.\nTarea 7.1\n\n- Heurísticas\n· Pruebas detección duplicados vía geometría + atributos temáticos (perímetro + área)\n      · Revisión de resultados obtenidos conforme a gold standard",
  "speaker": "SYSTEM",
  "uuid": "39aebdca-accb-4002-b63d-8467f83c2cda"
}