{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 14\n14\nGraeme Hirst\n1.5 Lexically based ontologies and ontologically based lexicons\nDespite all the discussion in the previous section, it is possible that a lexicon with\na semantic hierarchy might serve as the basis for a useful ontology, and an on-\ntology may serve as a grounding for a lexicon. This may be so in particular in\ntechnical domains, in which vocabulary and ontology are more closely tied than\nin more-general domains. But it may also be the case for more-general vocabular-\nies when language dependence and relative ontological simplicity are not problem-\natic or are even desirable—for example if the ontology is to be used primarily in\ngeneral-purpose, domain-independent text-processing applications in the language\nin question and hence inferences from the semantic properties of words have special\nprominence over domain-dependent or application-dependent inferences. In partic-\nular, Dahlgren (1995) has argued for the need to base an ontology for intelligent\ntext processing on the linguistic distinctions and the word senses of the language in\nquestion.\n1.5.1 Technical domains\nIn highly technical domains, it is usual for the correspondence between the vocabu-\nlary and the ontology of the domain to be closer than in the case of everyday words\nand concepts. This is because it is in the nature of technical or scientiﬁc work to\ntry to identify and organize the concepts of the domain clearly and precisely and to\nname them unambiguously (and preferably with minimal synonymy). In some ﬁelds\nof study, there is a recognized authority that maintains and publishes a categoriza-\ntion and its associated nomenclature. For example, in psychiatry, the Diagnostic and\nStatistical Manual of the American Psychiatric Association (2000) has this role. In\nbotanical systematics, so vital is unambiguous communication and so enormous is\nthe pool of researchers creating new names that a complex system of rules (Greuter\net al. 2000) guides the naming of genera, species, and other taxa, and the revision of\nnames in the light of new knowledge.\nObviously, the construction of explicit, deﬁnitive ontologies, or even explicit,\ndeﬁnitive vocabularies, does not occur in all technical domains. Nor is there always\ngeneral consensus in technical domains on the nature of the concepts of the domain\nor uniformity in the use of its nomenclature. On the contrary, technical terms may\nexhibit the same vagueness, polysemy, and near-synonymy that we see exhibited\nin the general vocabulary. For example, in the domain of ontologies in information\nsystems, the terms ontology, concept, and category are all quite imprecise, as may\nbe seen throughout this volume; nonetheless, they are technical terms: the latter two\nare used in a more precise way than the same words are in everyday speech.\nHowever, in technical domains where explicit vocabularies exist (including glos-\nsaries, lexicons and dictionaries of technical terms, and so on, whether backed by an\nauthority or not), an ontology exists at least implicitly, as we will see in section 1.5.2\nbelow. And where an explicit ontology exists, an explicit vocabulary certainly does;\nindeed, it is often said that the construction of any domain-speciﬁc ontology im-\nplies the parallel construction of a vocabulary for it; e.g., Gruber (1993, p. 909):\n",
  "speaker": "SYSTEM",
  "uuid": "3a8f2011-c58a-4121-bfd0-37e480ba8286"
}