{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 3\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97728\n2.  La cuantía total máxima de las ayudas correspondientes a este subprograma, \npodrá ser complementada con 7.000.000 de euros de otros créditos que se puedan \nreasignar, generar, incorporar, o con ampliaciones de crédito, con posterioridad a la entrada \nen vigor de la presente Orden. Esta dotación presupuestaria adicional se publicará en la \npágina Web del Ministerio de Educación y en el «Boletín Oficial del Estado» («BOE»). El \nposible incremento del montante de la financiación destinada a la convocatoria no implicará \nen ningún caso la apertura de un nuevo plazo de presentación de solicitudes.\nLa efectividad de la cuantía adicional indicada queda condicionada a la declaración de \ndisponibilidad del crédito como consecuencia de las circunstancias antes señaladas y, en \nsu caso, previa aprobación de la modificación presupuestaria que proceda, en un momento \nanterior a la resolución de la concesión de las ayudas.\nArtículo 4.  Beneficiarios.\n1.  Podrán ser beneficiarios de las ayudas los titulados universitarios que, en la fecha \nde cierre del plazo de presentación de solicitudes, cumplan todos los requisitos que se \nestablecen en el artículo 27 de esta convocatoria.\n2.  Los beneficiarios de estas ayudas no podrán encontrarse incursos en ninguna de \nlas circunstancias que prohíben la obtención de la condición de beneficiario, recogidas en \nel artículo 13 de la Ley General de Subvenciones, y deberán cumplir las obligaciones \nrecogidas en el artículo 14 de la Ley General de Subvenciones.\n3.  Los beneficiarios estarán sujetos a las actuaciones de control que lleven a cabo \nlas instituciones facultadas para ello por la Ley General de Subvenciones, así como a \nfacilitar cuanta información les sea requerida por la Intervención General de la Administración \ndel Estado, por el Tribunal de Cuentas, y por la Comisión Europea y las autoridades de \ngestión, certificación y auditoría del Fondo Social Europeo, en su caso.\nArtículo 5.  Centros de adscripción.\n1.  A los efectos de la presente Orden, se entenderá por organismo, centro o entidad \na los que podrán adscribirse los beneficiarios de las ayudas que se concedan por el \npresente programa a:\na)  Las universidades españolas públicas y privadas sin fin de lucro, el Consejo \nSuperior de Investigaciones Científicas (CSIC) y los Organismos Públicos de Investigación \nreconocidos por la Ley 13/1986, de 14 de abril, de Fomento y Coordinación de la \nInvestigación Científica y Técnica.\nb)  Los centros de I+D públicos y privados sin fin de lucro, con personalidad jurídica \npropia y diferenciada, vinculados o dependientes de la Administración General del \nEstado, de Administraciones Públicas Autonómicas y de Administraciones Locales, \nindependientemente de su personalidad jurídica. Dichos centros deberán tener capacidad \nde contratación laboral.\n2.  Los organismos o entidades a los que se refiere el punto anterior, asumirán la \ncondición de entidad colaboradora a los efectos de lo dispuesto en la Ley 38/2003, de 17 \nde noviembre, General de Subvenciones, para todos los beneficiarios de las ayudas que \nse concedan en este programa, para lo que suscribirán el correspondiente convenio de \ncolaboración con el Ministerio de Educación.\n3.  Los centros de adscripción que no sean universidades, deberán mantener la \nvinculación necesaria con las universidades en las que los beneficiarios de las ayudas se \nencuentren matriculados para la realización del doctorado, de forma que éstos puedan \nrealizar la formación docente e investigadora para cumplir el objeto de la beca en cuanto \na formación de profesorado universitario.\nArtículo 6.  Duración de las ayudas.\n1.  La duración máxima de las ayudas será de cuarenta y ocho meses, contados a \npartir de la fecha de alta en el centro de adscripción, sin perjuicio del resultado de la \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "3abfb03f-d33f-4725-8336-2e6a12e223a5"
}