{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Software_interesante \n\nContents\n[\nhide\n]\n1\nDesarrollo\n2\nEdición de datos\n3\nHerramientas online\n4\nHerramientas de visualización\n5\nDiseminación\n6\nGestión\nDesarrollo\n\nControl de calidad de código Java: FindBugs\nhttp://findbugs.sourceforge.net/\nProject management tools (online):\nhttp://www.projectpier.org/\n,\nhttp://www.egroupware.org/\n,\nhttp://projects.zoho.com/\n.\nProject management tools (to be installed):\nhttp://www.basecamphq.com/\n,\nhttp://www.redmine.org/\n,\nhttp://www.dotproject.net/\nGestión de máquinas virtuales:\nhttp://www.vmware.com/products/player/\n,\nhttp://www.vmware.com/products/server/\nEdición de datos\n\nGeobide\nes una herramienta desarrollada en España que permite editar y convertir rápidamente diferentes sistemas geoespaciales. Muy útil cuando las librerías de GDAL no permiten realizar estas conversiones para introducir datos geoespaciales en dataset o simplemente visualizarlos. Tiene versión gratuita y solo funciona en Windows al estar en .Net\nHerramientas online\n\nEasyRDF\nes una herramienta online que permite de forma sencilla convertir un fichero en un formato determinado a otro. Muy útil cuando no tenemos instalado Jena en nuestra máquina o tenemos que hacer conversiones on the fly. Supuestamente tiene límite de memoria de buffer de 5Mb.\nHerramientas de visualización\n\nSandance\nes una herramienta de Microsoft que aún no ha visto la luz, pero que pinta muy bien en las distintas demos que hemos visto. Sirve para pintar datasets de recursos que tengan geolocalización. Es muy fácil estudiar la distribución de los puntos en el mapa, seleccionarlos, clasificarlos por sus facetas y separarlos según sus atributos.\nWorldwide Telescope\nes una herramienta de Microsoft (gratis) que permite pintar muchos puntos en mapas dinámicamente. Los puntos se cargan en csvs. Como un Map4RDF extendido.\nDiseminación\n\nCapturas de pantalla (Mac y Windows): Jing\nhttp://www.jingproject.com/\nGeneración automática de bibliografía en MS word a partir de bibtex:\nhttp://www.ee.ic.ac.uk/hp/staff/dmb/perl/index.html\nZotero es una extensión para firefox para el manejo de referencias bibliográficas:\nhttp://www.zotero.org/\nDividir animaciones de powerpoint en varias transparencias (para pasar a pdf, slideshare...):\nlink\nFuentes de LaTeX en true type (para word, powerpoint, ...)\nlink\nGestión\n\nAnálisis de características de websites:\nhttp://www.wiriki.net/",
  "speaker": "SYSTEM",
  "uuid": "3cf378e2-9fcf-4277-b2d3-2f9dfefab677"
}