{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 12\ntodavía quedan muchas cosas por hacer para que las previsiones de la Directiva se concre-\nten plenamente en la práctica.\nTal y como afirma Javier Hernández-Ros, “lo que necesitamos en la Unión Europea no\nes más legislación, sino campeones nacionales, como en Inglaterra: OPSI (Oficina para la\nInformación del Sector Público)”12.\nEn cuanto a derecho a acceso, como afirma José Luis Torreros, magistrado de la\nAudiencia Nacional, “corresponderá a los poderes públicos trazar la línea divisoria que fije\nlos límites del derecho de los ciudadanos a la información y el derecho de las empresas a\nla explotación de la información pública con fines comerciales”13.\n4.1. Recomendaciones de ePSIplus\nTeniendo en cuenta que la Directiva se ha adoptado tarde y de manera no uniforme en\nalgunos de los países de la Unión Europea, la principal conclusión por parte de ePSIplus\nes la de que es demasiado pronto para ajustar la Directiva a través de otra legislación. Se\nrecomienda derivar el esfuerzo de revisión hacia un proceso de clarificación y explicación\nde la Directiva que garantice su cumplimiento y eficacia. \nSin embargo, se han detectado algunos problemas prácticos en la implantación de la\nDirectiva:\n– Necesidad de establecer mecanismos de reclamación y reparación más ágiles que los\ntradicionales tribunales de justicia. No existe, por lo general, un organismo nacional\nencargado de velar por el cumplimiento de la normativa que transpone la Directiva,\npor lo que muchos actores del sector de la reutilización ven limitadas sus posibilida-\ndes de aprovecharse en la práctica de las oportunidades que el nuevo marco de re-\nutilización proporciona. Los dos casos más importantes son los de Eslovenia (el\nComisionado de la Información) y Reino Unido (con la Oficina para la Información\ndel Sector Público - OPSI). En el caso de España no existe ningún órgano similar,\naunque algunos organismos reguladores podrían servir de modelo para esto último.\n– Existencia de prácticas discriminatorias, como los acuerdos exclusivos entre empre-\nsas y entidades públicas, negación del hecho de que un determinado acervo de infor-\nmación caiga dentro del ámbito de la Directiva, establecimiento de condiciones con-\ntractuales injustas con el sector privado, imposibilidad de obtener acceso a datos de\nejemplo para valorar el interés de invertir en la compra de todo el conjunto, existen-\ncia de políticas oscurantistas de precios (que no posibilitan verificar su carácter no\ndiscriminatorio) o problemas con el tiempo empleado en responder a peticiones de\ninformación.\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n16\n12 Commission and Member State responses on the proceedings of the day: panel session / Three Member State\nministries responsible for PSI, Javier Hernández-Ros, Head of Unit, Digital Libraries and Public Sector Information,\nDG INFSO, European Commission, Kalliopi Angeletopoulo, Ministry of the Interior, Public Administration and\nDecentralisation, Greece, Carol Tullo, Office of Public Sector Information (OPSI), UK, John Dolan, Department of\nFinance, Ireland. En: PSI Re-use – Who Takes Action Next / ePSIplus Conference, Bruselas, 13 de junio de 2008. En:\nhttp://www.epsiplus.net/events/epsiplus_conference_psi_re_use_who_takes_action_next (última consulta: 04 de julio\nde 2008) Notas personales.\n13 TERREROS, José Luis. Marco normativo para reutilizar la información pública. En: http://www.\nnjbosch.com/archivos/802209215201.pdf (última consulta: 26 de junio de 2008).\nBASES DE DATOS  1/1/04  03:39  Página 16\n",
  "speaker": "SYSTEM",
  "uuid": "3d04cbf3-ecc9-46d6-bf55-a5f8ef9a815e"
}