{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 67\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 67 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nAdditionally, ontologies or ontology modules, related to the domain that the ontology network \nmust cover, should be made available. \n Sequence of activities: Existing ontologies are being collected in both ontology library \nsystems, which offer various functions for managing, adapting and standardizing groups of \nontologies [20], and ontology repositories that support knowledge access and reuse by humans \nand machines. \nAn ontology repository is a structured collection of ontologies, modules and additional meta \nknowledge. The software that manage an ontology repository is known as ontology repository \nmanagement system; this system stores, organizes, modifies and extracts knowledge from an \nontology repository. Related to this, the ontology registries should be also mentioned since \nsuch registries store descriptions of ontologies and not ontologies themselves. \nAs more ontologies are available in ontology library systems, in ontology repositories and on \nthe Internet, software developers and ontology practitioners could also consider the reuse of \nexisting ontologies or ontology modules. Domain and general ontologies can be reused to build \nothers of more granularity and coverage.  \nThus, the following activities should be carried out as part of the ontology reuse activity, which \ncan be seen as a process composed of activities (following the ‘process’ definition of Section \n2.1):  \n1. To search ontologies or ontology modules in repositories and registries like Knowledge \nZone10, ONTHOLOGY.org11, Oyster12, Swoogle13, and WATSON14, through the ontology \nsearch activity. Software developers and ontology practitioners search for candidate \nontologies or modules that satisfy the requirements. These ontologies or modules could \nbe implemented in different languages or could be available in different ontology tools.  \n2. To assess ontologies or ontology modules through the ontology assessment activity. \nAfter the ontology search, software developers and ontology practitioners must inspect \nthe content and granularity of the ontologies or modules to find out if they satisfy their \nneeds.  \n3. To compare ontologies or ontology modules through the ontology comparison activity. \nSoftware developers and ontology practitioners should compare the ontologies or \nmodules found, taking into account a set of criteria identified by the software developers \nand ontology practitioners (e.g., ontology language, ontology coverage, existing \nontology documentation, etc.) and their ontology network requirements. \n4. To select ontologies or ontology modules through the ontology selection activity. Based \non the comparisons, software developers and ontology practitioners should select the \nset of ontologies or modules that are the most appropriate for their ontology network \nrequirements.  \n5. To define the reuse mode: at this point, software developers and ontology practitioners \nneed to decide how they will reuse the selected ontologies or ontology modules. There \nare three modes: \n \nThe selected ontologies or modules will be reused as they are. \n                                                 \n10 http://smiprotege.stanford.edu:8080/KnowledgeZone/ \n11 http://www.onthology.org/ \n12 http://oyster.ontoware.org \n13 http://swoogle.umbc.edu/ \n14 http://watson.kmi.open.ac.uk/WatsonWUI/ \n",
  "speaker": "SYSTEM",
  "uuid": "3d9bf611-0dba-4284-99b2-8980d75bb661"
}