{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 3\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n1. Definición del dominio. El arte en el Camino de \nSantiago \nEl Camino de Santiago fue la ruta de peregrinación más importante de la \nEuropa medieval y uno de los hechos de mayor importancia y beneficio \npara la historia de España. Esta ruta de peregrinación está formada por \nnumerosos caminos que confluyen en la catedral de Santiago de \nCompostela, donde se encuentra el sepulcro del apóstol Santiago, \npredicador del cristianismo por la Hispania romana. Gracias al Camino de \nSantiago los aislados y pequeños reinos hispánicos pudieron abrirse a \nEuropa para dar y recibir de los pueblos traspirenaicos una gran riqueza \ncultural. Por este motivo, el Camino de Santiago no sólo tiene \nrepercusiones de tipo religioso sino que también, gracias a la \nperegrinación se construyeron iglesias, monasterios, puentes y hospitales, \nsurgieron nuevas ciudades, nuevos asentamientos de emigrantes francos y \nun intercambio cultural y artístico sin precedentes. El arte y la cultura, la \nreligión y la leyenda se aúnan en esta peregrinación que se convierte en \nun viaje a través del legado de toda una civilización.  De ahí, que en el camino haya sido \nreconocido como el \"Primer Itinerario Cultural Europeo\" por parte del Consejo de Europa y la \nUNESCO lo haya declarado \"Patrimonio de la Humanidad\".  \nFig. 1: Apóstol \nSantiago. \nNo es de extrañar, por tanto, que uno de los aspectos que más interés suscita entre los peregrinos \nque se adentran en el camino sea el aspecto artístico. A lo largo del Camino de Santiago se \npueden encontrar expresiones de arte de todas las disciplinas, desde las pinturas románicas \npresentes en las bóvedas de todos los edificios religiosos, hasta muestras de arte popular o \nartesanía como alfarería, ebanistería, tapicería, etc. Así,  la información referente a pinturas, \nesculturas, música, poesía, literatura, estilos artísticos y todas aquellas actividades relacionadas \ncon expresiones artísticas, es una de la más demanda, tanto por los peregrinos que recorren el \ncamino como por todas aquellas personas a las que les interesa el arte o el Camino de Santiago.  \nUna posible clasificación de los servicios o información artística que puede ser solicitada sobre \nel Camino de Santiago sería la siguiente: \n• Museos que se pueden visitar a lo largo del camino (localización, horario, precio y obras \nde arte que se pueden contemplar como pinturas, esculturas, etc.). \n• Archivos eclesiásticos que se pueden consultar sobre el Camino de Santiago. \n• Archivos musicales a los que se puede acceder a lo largo del Camino de Santiago. \n• Obras pictóricas que se pueden contemplar a lo largo del  Camino de Santiago. \n• Esculturas que se pueden contemplar a lo largo del camino. \n• Mitología y simbología (por ejemplo, señales que se encuentran grabadas a lo largo del \ncamino). \n \n3\n",
  "speaker": "SYSTEM",
  "uuid": "3e075061-0ee2-4c21-9ede-f3db7aecc8b5"
}