{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 22\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97747\n4.  La Dirección General de Política Universitaria, a la vista de la financiación \ndisponible, del número de solicitudes presentadas por áreas científicas, del número y \ndistribución de las becas activas para el ejercicio 2010, establecerá una estimación del \nnúmero de becas que pueden adjudicarse para cada área científica y la hará pública en \nsus tablones de anuncios para general conocimiento.\n5.  La Comisión de Selección estará integrada por un máximo de siete expertos \nrepresentantes de los diferentes ámbitos de conocimientos, designados por la Dirección \nGeneral de Política Universitaria. Dicha Comisión estará presidida por el titular de la unidad \ninstructora del procedimiento y será la encargada de elevar la correspondiente propuesta \nde concesión.\nArtículo 33.  Relación provisional y aceptación de la beca.\n1.  La Comisión de Selección elevará una relación priorizada por áreas científicas en \nfunción del número de becas a conceder en cada una de ellas, de acuerdo con lo señalado \nen el apartado 4 del artículo anterior, que se publicará como relación provisional con la \nfinalidad de que los beneficiarios confirmen la aceptación de la beca y presenten la \ndocumentación para la concesión definitiva de las ayudas en el plazo de diez días naturales \ncontados a partir del siguiente de la publicación de dicha relación en la Web del Ministerio \nde Educación, con la advertencia de que si no lo hiciese, se considerará que renuncia a la \naceptación de la beca.\n2.  La relación provisional incluirá una lista de candidatos suplentes para el caso de \nque se produjeran renuncias o los candidatos propuestos no pudieran acreditar alguna de \nlas condiciones requeridas.\n3.  Los candidatos que acepten la beca deberán presentar la siguiente documentación \nen el plazo señalado en el punto 1 de este artículo:\na)  Escrito de aceptación de la ayuda en los términos señalados en esta \nconvocatoria.\nb)  Acreditación de la formalización de la matrícula en el doctorado o en el máster que \nforme parte del mismo para el curso 2009-2010, con la especificación de si tiene concedida \nla Mención de Calidad para dicho curso.\nEn la acreditación de matrícula deberá constar:\nb.1)  En los programas de doctorado regulados por el RD 778/1998, que comprende \nla realización de actividades académicas que integren un curso completo constituido por \nun mínimo de 20 créditos en el período de docencia (primer curso), o por lo 12 créditos en \nel período de investigación (segundo curso) o la matrícula del DEA o de tutela de tesis. En \nel caso de que la matrícula comprenda menos créditos que los exigidos para cada curso, \ndeberá acompañarse de la superación de los créditos restantes, de la convalidación de los \nmismos o de la matrícula si se trata de créditos fuera del programa.\nb.2)  En los estudios de doctorado regulados por el RD 56/2005 o por el RD 1393/2007, \ndeberán hacerse constar las actividades académicas a realizar, ya sea del máster que \nforma parte del posgrado o de tutela de tesis doctoral. En el caso del máster, el número de \ncréditos será de 60 o los que falten por completarlos en el caso de tener superados o \nreconocidos parte de ellos. En el caso de que la matrícula sea inferior a 60, deberá \nacompañarse de la superación de los créditos restantes, de la convalidación de los mismos \no de la matrícula si se trata de créditos fuera del programa.\nc)  Declaración de haber disfrutado de otras becas o ayudas de análoga naturaleza, \na los efectos de fijar la duración máxima de la ayuda concedida en la resolución de \nconcesión, todo ello en aplicación de lo estipulado en el artículo 6 de la presente convocatoria \ny sobre el régimen de incumplimientos establecido en el artículo 19.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "3e792afb-ffa5-403e-9d5f-8bfe0b8ee6b2"
}