{
  "message": "SYSTEM: Resoluci%C3%B3n_de_3_de_junio_de_1991%2C_de_la_UPM_por_la_que_se_acuerda_la_publicaci%C3%B3n_del_Reglamento_de_Becarios_de_dicha_Universidad.pdf: Página 2\nBOE núm. 160\nViernes 5 julio 1991\n22521\nDerecho laboral y de la Seguridad Social. con la única excepción de lo\nestablecido en el articulo 27.6 de la Ley Orgánica 11/1983. de 25 de\nagosto. de Reforma Universitaria.\n4.\nEn el caso de Que, en desarrollo de las actividades del alumnado\no de los investigadores a la formación a que hace, referencia d presente\nReglamento. se diere lugar al reconocimiento de la exístenc13 de una\nrelación laboral o a cualquier tipo de derechos o indemnizaciones. se\nestará a 10 dispuesto en el artículo 1432 de los Estatutos de esta\nUniversidd o en los articulos 140 y siguientes de la Ley General\nPresupuestaria. respectivamente.\nArt. 3.\\}\nSerán condiciones generales para ser _beneficiario de becas\nde la Universidad Politécnica de Madrid las sigUientes:\na)\nEstar en posesión del titulo académico correspondiente o encon·\ntrarsc cursando, en condiciones de cursar o haber concluido estudiOS en\nla Universidad.\nb)\nSer nombrado\nbecario\npor\nla\nUniversidad\nPolitécnica\nde\nMadrid.\ntcniendo extendida credencial al efecto. a través de los\nprocedimientos que se establecen en el prcs<;nte Reglamento.\nArt.\n4.°\nEl\nRector de\nla\nUniversidad\nPolitécnica de\nMadrid\nresolverá las especialidades que se produzcan en la aplicación del\npresente Reglamento, particularmente al respecto de las cuantias de las\nbecas, para lo cual actuará en· el marco de las líneas de actuación\nsenaladas por los correspondientes órganos universitarios.\nI~ualmente podrá aprobar disposiciones generales en desarrollo o\nsupliendo las omisiones del presente Reglamento.\nCAPITULO 1I\nBecas para la formación del personal docente\nArt. 5.°\n1.\nLa Junta de Gobierno aprobará programas concretos\nde dotación de becas {'ara la formaciónde.l personal docente, propo·\nniendo al Consejo SOCial la cuantia global de cada programa, para su\naprobación, y la individual correspondiente a cada beca, a los efectos\nretributivos del artículo 46.2 de la Ley de Reforma Universitaria, en el\ncaso de que esté destinada a Profesores de la Universidad Politécnica de\nMadrid.\n2.\nLas becas para Profesores tendrán carácter indemnizatorio para\ncubrir los gastos precisos para su formación.\nArt. 6.°\n1.\nEl Rector suscribirá las convocatorias para la adjudica-\nción de becas, a las qur' se dará publicidad por inserción en los tablones\nde anuncios de la Universidad.\n2.\nEn dichas convocatorias se contemplará:\na)\nRequisitos 'que habrán de reunir las solicitudes.\nb)\nFormalización de solicitudes, plazo para hacerla efectiva. docu-\nmentación a aportar y restantes normas de procedimiento.\ne)\nSelección de los candidatos.\nd)\nObligaciones de los beneficiarios. compatibilidad o incompatibi-\nlidad con otras becas, bolsas o ayudas.\ne)\nCondiciones de renovación y revocación de las becas.\n3.\nContra las resoluciones de inadmisión de candidaturas y de\nadjudicación de becas podrá interponerse recurso de reposición ante el\nRcuor en ci plazo de un mes, pasado, en su caso, el penodo de\nreclamaciones que pueda senalar la convocatoria.\nArt. 7.°\n1.\nSin perjuicio de otros programas de dotación de becas\nQUI.': se puedan aprobar, se crean en este momento:\na)\nBecas para [a realizaCión del Doctorado por Proícsores de la\nUniversidad Politécnica de Madrid. a cuyas convocatorias podrán\nconcurrir quienes cuenten con dedicación a tiempo completo en la\nmisma y mantengan una relación jurídica de las contempladas en el\ntítulo V de la Ley de Reforma Universitaria, debiendo tener admitido\nel\nproyecto\nde\ntesis\na\nque\nse\nrefiere\nel\nartículo\n7,4\ndel\nReal\nDecreto 185/1985, de 23 de enero (<<Boletín Oficial del Estado» de 16\nde febrero).\nb}\nBecas para la realización del Doctorado en los Departamentos e\nInstututos de la Universidad Politecnica de Madrid, de carácter general\no relativas a las líneas de investigación que senale cada convocatoria.\nPodrán solicitar estas becas Quienes cumplan\nel\nultimo\nrequisito\ncontemplado en el precedente inciso de este artículo.\nArt. 8.°\n1.\nLos programas de dotación de becas tendrán una\nduración p[urianual. pudiendo establecerse tramos intermedios para\nreno\\ación, mantenimiento o rc\\ocación de las becas concedidas, a la\nyisla de la superacion de los controles de seguimiento que el Rectorado\nacuerde establecer.\n2.\nEl Rector podrá acordar la suspensión o retirada del derecho al'\ndisfrute de la beca, por cumplimiento deficiente de las actividades\nconducentes a la finalidad que motivan su adjudicación o a petición de\nlos adjudicatarios, previo infarme del\nDirector de\nla\ntesis\ny del\nDepartamento o\nInstituto universitario que dirija o supervise los\nestudIOS de Doctorado.\n3.\nPodrán adjudicarse avudas para gastos concretos de realización\nde las tesis doctorales de eñtre los becarios de los programas de la\nlJnivcrsidad Polilécnica de Madrid para material. bibliograt1a. viajes y\notros, debiendo quedar en beneficio del\nDepartamento o\nInstituto\nuniversitario los bienes que se adquieran a su cargo. tras la aplicación\nal desarrollo de la tesis doctoral.\nCAPITULO ¡¡¡\nBeeas de colaboración en contr3to\"í, pro,·cetos o\nconv~níl)s\nde investigadón\n.\nArt. 9.°\n1.\nEn los contratos y convenios que celebren el Recto·\nrada, los Departamentos e Institutos unl\\Trsitaríos podrán asignarse\nfondos para complementos o becas de qUienes colaboren en su cjt:cu-\nción.\n2.\nPara que sea autorizado el\nnon:tbrami~nto (,le. becarios en. los\nrestantes convenios o contratos, los Proícsores W[er.....-mH:ntes garantIzan\nincluso pt.'1\"SOnalmente la total exoneración de re,,!X?nsablltdades a que se\nrefiere el artículo 143.2 de los Estatutos de la UnIversidad Politécnica de\nMadrid, sin necesIdad de acto expreso que lo declare, resultando\nejecutoria la deuda, que se satisfará a la Univcrsidad por el\nI?ro~edl­\nmiento scnalado cn el articulo\n!O4.1 de la Ley de Procedimiento\nAdministrativo.\nArt, 10.\nDllracióll.-En ningún caso podrá exceder e.l periodo de\nduración de la beca del que corresponda al convenio o contrato concreto\npara el que se concede, salvo. excepcionalmente y previa autorización\nrectoral, para la evacuación y estudio de sus resultados. No obstante,\npodrán hacersc nombramientos por períodos infcriores al\nmismo.\nrenovables hasta la finalización del convenio o contrato correspon-\ndiente, y del período de evaluación y estudio.\nDe no hacerse las pertinentes especificaciones, se entenderá automá-\nticamente concluida la beca cuando lo haga el convenio o contrato del\nque traiga causa, sin que tenga derecho a indemnización alguna en\nningún caso su beneficiario.\nEl comienzo de la eficacia del nombramiento de becarios no podrá\nanticiparse. en\nningún caso a\nla\nautorización\ndel correspondiente\nconvenio o contrato o a la fccha en que se permita el nombramiento. en\nlos supuestos de que la autorización sc entienda concedida por silencio\nadministrativo positivo, debiendo imputarse las responsabilidades ante-\ncedentes en el tiempo a su causante. a tftulo particular, de conformidad\ncon lo establecido en el artículo 2,4 precedente; lo cual igualmente\nprocederá en los supuestos de exceso de la duración o permnnencia sin\ntítulo suficiente en la situación de becario. cn relación con el establecido\nen el nombramiento. o cuando no exista nombramiento en forma legal.\nArt. 11.\nla dedicación a las becas de colaboración con cargo a\nconvenios, contratos o proyectos de investigación podrá ser la siguiente:\na)\nA tiempo completo: Por una duración de más de treinta horas\npor semana.\nb)\nA tiempo parcial: Por una duración inferior a la antes señalada.\nArt.\n12.\nLa Junta de Gobierno\ndeterminará anualmente.\ncon\ncarácter general. las cuantías máxima y minima de las remuneraciones\npor becas, dependiendo la cantidad concreta a abonar de la cualillca-\nciión ) grado de participación del becario en la actividad.\nHasta tanto se produzca las oportunas revisiones, y ..in pl.'rjuicio de\nlo señalado en el articulo 4.'\\ de esta disposición, se aplicad a las\neorrespondient~s euamias el indice general de precios al consumo que\napruebe el Instituto Nacional de Estadistica u Organo qu~ le sustlluya.\nArt.\n13.\nIncoII/patibilidadc:s.-Los contratos y becas a los. que- se\nrdit:re la presente resolución se celebraran y concederán con SU]CC10n a\nlas normas de incompatlb¡lldadc-s existentes para personal de AdminIS-\ntración y Servicios de las Universidades, y con arreglo a la Ley 5311984.\nde 26 de diciembre (<Boletín Oficial del Estado» de 4 de enero de IY85l.\nv Real Decreto 598/1985. de 3D de abril (<<Boletín Oficial del EstadO))\nde 4 de mayo}. No obstante, podrá declararse la compatibilidad, por el\nprocedimiento de artículo 1.2 del Real Decreto 1930/1984, de 10 de\noctubre (<<Boletín Oficlal del Estado)} de 5 de nOVIembre}, para varias\ndedicaciones a tiempo parcial, que en cómputo horario no slgmfiquen\nmayor ocupación temporal, en la acti..-idad a la que se concrete el\ncontrato o convenio de investigación, superior a la jornada máxima legal\ndel personal de las Administraciones Publicas. Dicho límite máximo\noperará para las becas de colaboración a tiempo compkw () para la\nsuma de dedicaciones de las becas a tiempo parcial. sin perjuicio de lo\nprevenido en el articulo 4.° de esta norma.\nCon independencia de ello, habrá de estarse a las incompatibilidades\nespecifi<;;as respecto a las becas que, concedidas por otra Administración\nPublica. mantengan lficomoatibilidad específica al respecto de las que se\nregulan en el presente Regiamento.\nCAPITULO IV\nBolsas y ayudas al estudio\nArt. 14.\nSe podrán conceder estas bolsas y ayudas de\ncará~ter\ngeneral para cursar todas o parte de las materias del plan de estudlOS.\nLas bolsas y ayudas de carácter especial scr referinin a aSDectos\n",
  "speaker": "SYSTEM",
  "uuid": "3f1044c4-1052-4f7a-84d2-e0900fe9ac7d"
}