{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 28\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 28 \n \nLugar de publicación: Berlin (Alemania) \n \nRef: CL06 \nAutores (p.o. de firma): Contreras J, Corcho O, Benjamins VR \nTítulo: Semantic Content Mediation and Acquisition: The Challenge for Semantic e-Business Solutions \nRef. Libro: Semantic Web Technologies and eBusiness: Virtual Organization and Business Process Automation \nClave: CL \nVolumen:   \n \nPáginas, inicial:   \n \nfinal:  \n \nFecha: \nDiciembre 2006 \nEditorial (si libro): Idea Group Publishing, Inc. ISBN 1-59904-192-8 \nLugar de publicación:  \n \nRef: CL05 \nAutores (p.o. de firma): Corcho O, Gómez-Pérez A \nTítulo: Chapter 7. A Layered Model for Building Ontology Translation Systems \nRef. Libro: Semantic Web-Based Information Systems: State-of-the-Art Applications. Editores: Amit P. Sheth, \nMiltiadis Lytras. ISBN: 1-59904-426-9 \nClave: CL \nVolumen:   \n \nPáginas, inicial: 161 \nfinal:189 \n \nFecha: \nNoviembre 2006 \nEditorial (si libro): IGI Global. Advances in Semantic Web and Information Systems (ASWIS) Book Series \nLugar de publicación: Hershey, Pennsylvania \n \nRef: CL04 \nAutores (p.o. de firma): Corcho O, Losada S, Benjamins VR, Bas JL, Bellido S \nTítulo: Personal eBanking solutions based on Semantic Web Services \nRef. Libro: E-Service Intelligence -- Methodologies, Technologies and Applications. ISBN-10: 3-540-37015-3 \nClave: CL \nVolumen: 37  \n \nPáginas, inicial:   \n287 \nfinal: \n306 \nFecha: \nNoviembre 2006 \nEditorial (si libro): Springer-Verlag. Studies in Computational Intelligence Series \nLugar de publicación: Berlín (Alemania) \n \nRef: CL03 \nAutores (p.o. de firma): Corcho O, Fernández-López M, Gómez-Pérez A \nTítulo: Ontological Engineering: principles, methods, tools and languages \nRef. Libro: Ontologies for Software Engineering and Technology. ISBN: 978-3-540-34517-6 \nClave: CL \nVolumen:   \n \nPáginas, inicial:   \n1 \nfinal: \n48 \nFecha: \nJulio \n2006 \nEditorial (si libro): Springer Verlag \nLugar de publicación: Berlín (Alemania) \n \nRef: CL02 \nAutores (p.o. de firma): Corcho O, Fernández-López M, Gómez-Pérez A, López-Cima A \nTítulo: Building legal ontologies with METHONTOLOGY and WebODE \nRef. Libro: Law and the Semantic Web. ISBN: 978-3-540-25063-0 \nClave: CL \nVolumen: LNCS 3369 \nPáginas, inicial: 142  \nfinal: 157 \n \nFecha: Febrero \n2005 \nEditorial (si libro): Springer-Verlag \nLugar de publicación: Berlín (Alemania) \n \nRef: CL01 \nAutores (p.o. de firma): Corcho, O.; Gómez-Pérez, A. \nTítulo: Ontology markup languages \nRef. Libro: Yearbook on Science and Technology 2003. ISBN: 978-0071410625 \n",
  "speaker": "SYSTEM",
  "uuid": "3f345a47-c2f9-43d5-a4b7-5b863df3bfe2"
}