{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nW3C RDF Stream Processing Community Group\n2\nW3C Semantic Sensor Network Incubator Group\n3\nW3C Provenance Incubator Group\n4\nW3C RDB2RDF Working Group\n5\nW3C SPARQL Working Group\n6\nW3C eGovernment Interest Group\n7\nW3C Library Linked Data Incubator Group\n8\nW3C Media Annotations Working Group\n9\nW3C Semantic Web Health Care and Life Sciences (HCLS) Interest Group\n10\nW3C Linked Data Platform Working Group\n11\nW3C Government Linked Data Working Group\n12\nW3C Ontology Lexica Comunnity Group\n13\nW3C Best Practices for Multilingual Linked Open Data Community Group\nW3C RDF Stream Processing Community Group\n\nURL:\n[1]\nDescription:\nThe mission of the RDF Stream Processing Community Group (RSP) is to define a common model for producing, transmitting and continuously querying RDF Streams. This includes extensions to both RDF and SPARQL for representing streaming data, as well as their semantics\nStart date:\nSeptember 2013\nDue date:\n--\nCurrent status of the group:\nOngoing\nRole in the group:\nThree members of the OEG (Oscar Corcho, Alejandro Llaves, Javier Fernández) are participating in the biweekly discussions and writing of the final report.\nEnrolled:\nAdditional information:\nOutcome:\nW3C Semantic Sensor Network Incubator Group\n\nURL:\n[2]\nDescription:\nThe mission of the Semantic Sensor Network Incubator Group, part of the Incubator Activity, was to begin the formal process of producing ontologies that define the capabilities of sensors and sensor networks, and to develop semantic annotations of a key language used by services based sensor networks.\nStart date:\nMarch 2009\nDue date:\nSeptember 2010\nCurrent status of the group:\nFinished\nRole in the group:\nTwo members of the OEG (Raúl García Castro and Óscar Corcho) participated in the weekly discussions, development of use cases, development of the semantic sensor network ontology, and writing of the final report.\nEnrolled:\nAdditional information:\nThe group's\nFinal Report\nsummarizes the activities of the group.\nThe group's\nwiki\n.\nThe\nSSN ontology\n.\nOutcome:\n“Final Report of the W3C Semantic Sensor Network Incubator Group.” Laurent Lefort, Cory Henson, Payam Barnaghi, Michael Compton, Oscar Corcho, Raúl García-Castro, John Graybeal, Arthur Herzog, Krzysztof Janowicz, Holger Neuhaus, Andriy Nikolov, Kevin Page, and Kerry Taylor. Available from\nhttp://www.w3.org/2005/Incubator/ssn/wiki/Incubator_Report\n.\nW3C Provenance Incubator Group\n\nURL:\nWiki of the group\nDescription:\nThe mission of the Provenance Incubator Group, part of the Incubator Activity, is to provide a state-of-the art understanding and develop a roadmap in the area of provenance for Semantic Web technologies, development, and possible standardization. See the charter for more information. The group's activities are public, and are recorded on the W3C Provenance Incubator Group wiki.\nStart date:\n21-09-2009\nDue date:\n11-2010\nCurrent status of the group:\nFinished\nRole in the group:\nTo participate in the weekly discussions, to help developing the requirements for the scenarios, to help developing the bibliography collection in provenance and to participate and to review the final report.\nEnrolled:\n07-05-2010\nAditional information:\nThe group's\nFinal Report\nsummarizes the activities of the group and also proposes a new Working Group for Provenance, with a 2 year charter.\nOutcome:\n“Final Report of the W3C Provenance Incubator Group.” Yolanda Gil, James Cheney, Paul Groth, Olaf Hartig, Simon Miles, Luc Moreau, and Paolo Pinheiro da Silva. Report from the W3C Provenance Incubator Group, first release: November 30, 2010.  Available from\nhttp://www.w3.org/2005/Incubator/prov/XGR-prov-20101214/\n“Towards Provenance Interoperability: Defining Mappings between Provenance Terminologies.” Satya Sahoo, Paul Groth, Olaf Hartig, Simon Miles, Sam Coppens, James Myers, Yolanda Gil, Luc Moreau, Jun Zhao, Michael Panzer, and Daniel Garijo. Submitted to the Journal Web of Semantics. 2010. Available from\nhttp://www.w3.org/2005/Incubator/prov/wiki/Provenance_Vocabulary_Mappings\nW3C RDB2RDF Working Group\n\nURL:\nRDB2RDF Working Group Charter\nDescription:\nThe mission of the RDB2RDF Working Group, part of the Semantic Web Activity, is to standardize a language for mapping relational data and relational database schemas into RDF and OWL, tentatively called the RDB2RDF Mapping Language, R2RML.\nStart date:\n30 September 2009\nDue date:\n30 September 2011\nCurrent status of the group:\nOpen\nRole in the group:\nEffective participation to RDB2RDF Working Group is expected to consume one work day per week for each participant; two days per week for editors. The RDB2RDF Working Group will allocate also the necessary resources for building Test Suites for each specification.\nEnrolled:\n10-05-2010\nAditional information:\nCommunication:\nThis group primarily conducts its work on the public mailing list public-rdb2rdf-wg at w3.org.\nWorking documents:\nR2RML: RDB to RDF Mapping Language\nA Direct Mapping of Relational Data to RDF\nR2RML Test Cases\nW3C SPARQL Working Group\n\nURL:\nSPARQL Working Group\nDescription:\nThe mission of the SPARQL Working Group, part of the Semantic Web Activity, is to develop SPARQL, the query language for the Semantic Web. The scope of this charter is to extend SPARQL technology to include some of the features that the community has identified as both desirable and important for interoperability based on experience with the initial version of the standard.\nStart date:\nJuly 2009\nDue date:\n31 July 2011\nCurrent status of the group:\nOpen\nRole in the group:\nEditor of the SPARQL 1.1 Basic Federated Query.\nEnrolled:\n21-07-2010\nAditional information:\nCommunication:\nThis group primarily conducts its work on the public mailing list public-rdf-dawg and public-rdf-dawg-comments at w3.org.\nWorking documents:\nSPARQL 1.1 Query\nUpdate\nProtocol\nService Description\nDescribes the use of the HTTP protocol for managing named RDF graphs on an HTTP server.\nEntailment\nProperty Paths\nBasic Federated Query\nW3C eGovernment Interest Group\n\nURL:\neGovernment Interest Group Charter\nDescription:\nThe mission of the eGovernment Interest Group, part of the eGovernment Activity, is to document, advocate, coordinate and communicate best practices, solutions and approaches to improve the interface between citizens and government through effective standards-based use of the Web. See the charter for more information.\nStart date:\nDue date:\nCurrent status of the group:\nClose?\nRole in the group:\nTBD\nEnrolled:\nW3C Library Linked Data Incubator Group\n\nURL:\nLibrary Linked Data Incubator Group wiki\nDescription:\nThe mission of the Library Linked Data incubator group is to help increase global interoperability of library data on the Web, by bringing together people involved in Semantic Web activities—focusing on Linked Data—in the library community and beyond, building on existing initiatives, and identifying collaboration tracks for the future.\nStart date:\n05-2010\nDue date:\n20-05-2011\nCurrent status of the group:\nOpen\nRole in the group:\nTo participate in the weekly discussions, to help developing the requirements for the scenarios, to help developing the bibliography collection.\nEnrolled:\n08-03-2011\nW3C Media Annotations Working Group\n\nURL:\nMedia Annotations Working Group Charter\nDescription:\nThe mission of the Media Annotations Working Group, part of the Video in the Web Activity, is to provide an ontology and API designed to facilitate cross-community data integration of information related to media objects in the Web, such as video, audio and images.\nStart date:\nSeptember 2008\nDue date:\n30 June 2011\nCurrent status of the group:\nOpen\nRole in the group:\nOne member of the OEG (Mari Carmen Suárez-Figueroa) is currently participating in the weekly discussions, the development of the media ontology, and the revision of working reports.\nEnrolled:\nNovember 2010\nW3C Semantic Web Health Care and Life Sciences (HCLS) Interest Group\n\nURL:\nMain page\nDescription:\nThe mission of the Semantic Web Health Care and Life Sciences Interest Group, part of the Semantic Web Activity, is to develop, advocate for, and support the use of Semantic Web technologies for health care and life science, with focus on biological science and translational medicine. These domains stand to gain tremendous benefit by adoption of Semantic Web technologies, as they depend on the interoperability of information from many domains and processes for efficient decision support.\nStart date:\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nOne member of the OEG (Mikel Egaña Aranguren) is currently participating in the weekly discussions\nEnrolled:\nMay 2011\nW3C Linked Data Platform Working Group\n\nURL:\n[3]\nDescription:\nThe mission of the Linked Data Platform (LDP) Working Group is to produce a W3C Recommendation for HTTP-based (RESTful) application integration patterns using read/write Linked Data. This work will benefit both small-scale in-browser applications (WebApps) and large-scale Enterprise Application Integration (EAI) efforts. It will complement SPARQL and will be compatible with standards for publishing Linked Data, bringing the data integration features of RDF to RESTful, data-oriented software development.\nStart date:\nJune 2012\nDue date:\nJune 2014\nCurrent status of the group:\nOpen\nRole in the group:\nThree members of the OEG (Raúl García, Miguel and Nandana) are actively participating\nEnrolled:\nJune 2012\nW3C Government Linked Data Working Group\n\nURL:\n[4]\nDescription:\nThe mission of the Government Linked Data (GLD) Working Group is to provide standards and other information which help governments around the world publish their data as effective and usable Linked Data using Semantic Web technologies. The group, a part of the eGovernment Activity and closely connected with the Semantic Web Activity, will collect and make available information about government Linked Data activities around the world. It will use that information and the experience of its participants to develop W3C Recommendations for Best Practices and for RDF Vocabularies necessary for publication of government data in RDF, as Linked Data. Concurrently with this Working Group, W3C has chartered the eGovernment Interest Group for broad community discussion of government use of the Web\nStart date:\nJune 2011\nDue date:\nMay 2013\nCurrent status of the group:\nOpen\nRole in the group:\nTwo members of the OEG (Boris Villazón-Terrazas and Daniel Vila-Suero) participated in the weekly discussions, and development of documents\nEnrolled:\nAdditional information:\nThe group's\nwiki\n.\nW3C Ontology Lexica Comunnity Group\n\nURL:\n[5]\nDescription:\nThe mission of the Ontology-Lexicon community group is to: (1) Develop models for the representation of lexica (and machine readable dictionaries) relative to ontologies. These lexicon models are intended to represent lexical entries containing information about how ontology elements (classes, properties, individuals etc.) are realized in multiple languages. In addition, the lexical entries contain appropriate linguistic (syntactic, morphological, semantic and pragmatic) information that constrains the usage of the entry. (2) Demonstrate the added value of representing lexica on the Semantic Web, in particularly focusing on how the use of linked data principles can allow for the re-use of existing linguistic information from resource such as WordNet. (3) Provide best practices for the use of linguistic data categories in combination with lexica. (4) Demonstrate that the creation of such lexica in combination with the semantics contained in ontologies can improve the performance of NLP tools. (5) Bring together people working on standards for representing linguistic information (syntactic, morphological, semantic and pragmatic) building on existing initiatives, and identifying collaboration tracks for the future. (6) Cater for interoperability among existing models to represent and structure linguistic information. (7) Demonstrate the added value of applications relying on the use of the combination of lexica and ontologies.\nStart date:\nJuly 2011\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nThree members of the OEG (Elena Montiel, Lupe Aguado, Jorge Gracia) participated in the bi-weekly discussions, identification of use cases and requirements, and development of documents.\nEnrolled:\nJuly 2011\nAdditional information:\nThe group's\nwiki\n.\nW3C Best Practices for Multilingual Linked Open Data Community Group\n\nURL:\n[6]\nDescription:\nThe target for this group is to crowd-source ideas from the community regarding best practises for producing multilingual linked open data. The topics for discussion are mainly focused on naming, labelling, interlinking, and quality of multilingual linked data, among others. Use cases will be identified to motivate discussions. Participation both from academia and industry is expected. The main outcome of the group will be the documentation of patterns and best practices for the creation, linking, and use of multilingual linked data.\nStart date:\nApril 2013\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nOne member of OEG acts as co-chair (Jorge Gracia) and jointly to other OEG members (Daniel Vila, Elena Montiel, Lupe Aguado) will participate actively in the discussions and development of documents.\nEnrolled:\nApril 2013",
  "speaker": "SYSTEM",
  "uuid": "3fd6d80d-1454-4d32-b591-316f4dc7744c"
}