{
  "message": "SYSTEM: Resoluci%C3%B3n_de_3_de_junio_de_1991%2C_de_la_UPM_por_la_que_se_acuerda_la_publicaci%C3%B3n_del_Reglamento_de_Becarios_de_dicha_Universidad.pdf: Página 4\nBOE núm. 160\nViernes 5 julio 1991\n22523\nGarantizo. incluso personalmente. la exoneración de rc<;ponsabilida-\ndes a la\nUniverSidad (sólo en\nlos supue<;tos del articulo 5.1\ndel\nR:glamento y el artículo 143.2 de los Estatutos de la UPM).\n\"\nCorresponde al Rector ordenar la instruccIón y resolución del\ne.xpedicntc a que hace relación el apartado anterior.\n3.\nLas responsabilidades a que hace referencia el presente artí<..'ulo\nse entienden SIO pcrjucio de las de orden académico, dlsclplinano o\npenal en que pudiere haberse incurrido.\nMadrid. a .\nde\n.\nde.\nA:-iEXO II\nExcmo. )\" Magfco. Sr. Rector de la Univ<.'rsidad Polit0cnic.l de Madrid.\nDon/dona.\n.\nde nacionalidad cspanola. nJn DNI o\npasaporte ..\n..\ncomo bcclflo de la UP\\1. con cargo al\nConvenio n.o (en su casol.\n.\n, en el Departamento de .\nde la Escuela/Facultad de\n.\n..\nde acuerdo con el Reglamento de Becarios de la Universidad PolitecnÍC\"a\nde Madrid. -respecto a incompatibilidades de este tipo de becas.\nJURA O PROMETE ex.presamente que no percibe remunnación.\nbeca o ayuda alguna con cargo a los presupuestos de los Entes que\nintegran las distintas esferas de la Administración, ni de las Empresas\ndependientes de los mismos ni de otras Empresas de caracll'r privado;\nque no ha sido sancionado por faltas de disciplina acadcmica. ni ha\nperdido el derecho a otra beca. y quc cumple los requisitos especiales de\nla respectiva resolución de adjudicación. (En caso contrario, indicarlo al\npie de este escrito.)\ny para que conste. firmo la presente declaración en,\nb)\nInformo sobre las situaciones a que se rdieren los aniculos 14\ny 2.:t dd Reglamemo sobre becarios de la UPM. o sobre la ,;:¡dccu,;:¡ción\ndd candidato a becario a la acti\\idad objeto del Cony~mo o Contrato,\nlu sigUlenie:\nc)\nCurrículum del ocClrio propuesto.\nd)\nDatos bancarios:\n~\nNombre de la Entidad de Crédito.\nDirección de. la s.ucursa! o agencia.\n.\n.\nNum. de la J¡breta o cuema corri..·ntc\n.\nInforme del proponente de la ~('a. la situación del becario prOpUl\"'ito, o\nsu adecuación 11 la aethidad objeto del Convenio o Contrato\nDon\n.\n\".., como Director o Decano de la Escuela.\nFacultad. Departamento. InstitUID. responsable o inH\"'Stigador pnncipal\ndel Convenio. Contrato o Proyecto. hllgO Constar:\na)\nDatos personales del candidato a la beca propuesto:\nDon\nDNI (o pasaporte n.O).\n.\nexpedido\nen\nFecha\nDomicilio\n.\nn.o\n.\nD. P.\nTeléfono ..\nFccha de nacimiento.\n.\nLugar de nacimicOlo.\nNombre del padre\nNombre de la madre.\nDISPOSICIONES ADICIONALES\nPrimcra.-Las cuantias a que hace rdación el artículo 12 del presente\nReglamento. contemplará como tccho cconomlCO la remuneraCIón de\n100.000 pesetas mensuales. que pueda percibir cada bcrario a razón de\nun máximo de trcinta horas semana!cs.\nScgunda.-En cuanto a las indemnizaciones por causa de convenios,\ncontratos y proyectos- que tengan derecho a pcrribir los becarios. se\naplicarán los Reglamentos de actuación financiera. contable y ge.stlon de\nla oficina de transferencia de tecnología. publicado por ResolUCIón de 7\nde maflO de 1990 (<<Boletín Oficial del Estado» del 23), y de indemniza-\nciones. aprobado por la Junta de Gobierno en su reunión del dia 27 de\nnoviembre de 1990, salvo en aquellas materias que el presente derogue\ntácitamente.\nDISPOSICION FINAL\nEl presente Reglamento entrará en vigor al día siguiente de su\npublicación en el «Boletín Oficial del Estado».\nDlSPOSICION DEROGATORIA\nSe deroga expresamente el Reglamento sobre becarios. publicado por\nResolución de 11 de septiembre de 1989 (<<Boletín Oficial del Estado»\nde 9 de octubre). y, tácitamente. la restante normativa que se oponga a\nlo prevenido en esta disposición.\nDISPOSICION TRANSITORIA\nLas becas concedidas en virtud de la anterior nonnativa de esta\nUniversidad seguirán rigiéndose por ella, de no realízarse las precisas\nadecuaciones a la presente.\nANEXO I\nPropuesta indh'idualizada de designación de becario UPM\nDon/doña\ncomo Director o Decano de Escucla.\nFacultad, Departamento o Instítuto. o responsable principal del Conve~\nnio, Contrato o Proyecto (táchese lo que no proceda)\n.\nnúmero\n.\nPROPONGO que le sea concedida una BECA-UP\\'1 en base ti su\nReglamento sobre becarios y por la siguiente modalidad:\nal\nBeca de Colaboración en los Convenios, Contratos o Proyectos\ndc Investigación Científica y Técnica.\nb)\nBolsas y Ayudas al Estudio.\nc)\nBolsas y Ayudas al Estudio para Programa:; de Cooperación\nEJu~¡¡,ti....a.\nd)\nHomologación del titulo de becario con cargo a Programas\nfinanciados por Organismos supranacionates a:\nDon/doña\n.\nDNI o pasaporte\n.\nTitulación (si procede)\nEstudiante del\n. curso de la\nEscuela/Facultad\n.\nN.O de matrícula.\nEstudiante del tercer cido del Departamento o del Curso de Especializa-\nción\n, adscrito a la Escuela. Facultad. Departamento\no Instituto\n.\nMadrid, a\nde .\nMadrid. a\nde .\nFirmado\n.\nde\n.\nEl becario.\nFirmaoo\nANEXO III\n.\nde .\nCon las siguientes caraeterí!'>ticas:\nDuración\nmeses.\nDcdicación\nde\nn/semana.\nDotación.\nvalor/hora.\nde acuerdo con el programa de trabajo. Mcmona justif¡o.;:ltlva en base al\ninforme que se adjunta.\nSe hace constar que el candidato c'>tá inscnto en el Registro referido\nen el articulo 23 del Reglamento de Becarios de la l'P\\'f y qUL' se\ngarantiza que la sc!et'ción de! bcc3rio sc ha n::ahzado cumpliendo los\nprincipios constitucionales de Igualdad. mérito) capacidad.\nSe adjunta:\nCurrículum vitae resumido del interesado.\nFotocopia del DNI o pasaporte.\nDeclaración jurada de no realizar activídad sujeta a incompatibili-\ndad ......\nInforme sobra la situación de! becario.\nAceptación individualizada del becario\nAl'iEXOIV\nAceptación indhidualizada del becario o c:lOdidato a 1.1 beca\nDonidoña\ncon DNI {O jX1SJpOrle n.\nDeclara que le ha sido concedida una hcca para colaborar en d\nCOD\\cnio. Contrato. Proyccto de Invcstlgación o Programa de Coopera·\ncon Educaltvtl\n_\n.\nque conoce y acepta de plena ...:onformidad. al igualLjuc ,,.'j R..::g!arncnto\nsobre Becanos J..:: la UPM. para Jo cual SI? compromete a:\n1.\nDedicarse durante el plam establecido. v de acuerdo con d\ncará({cr de la\nbL\"q1. a las tarcas de\nformación que\nle\nhaya\nsido\nencomcndada.\n2.\nAjustarse durante la colaboración al calendario establecido por la\ndirc;ción del Convenio. Contrato, Proyecto. Programa o Actividad.\n",
  "speaker": "SYSTEM",
  "uuid": "4004b013-36c1-45ca-8820-84d01fd72ca0"
}