{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ElViajeroLinkedData \n\nIr a LinkedData\nContents\n[\nhide\n]\n1\nURI Naming Convention\n2\nNamespaces\n3\nGeometry model\n4\nDecisiones de diseño\n5\nCodificación\n6\nGrafos\n7\nPubby settings\n8\nTérminos adicionales\n8.1\nConcepto de Viaje\n8.2\nModelado del Viaje\n8.3\nPropuesta a implementar\n8.4\nEjemplo\n9\nTO DO List\nURI Naming Convention\n\nURL base del directorio de ontologías:\nhttp://webenemasuno.linkeddata.es/ontology/\nURI de la ontología extendida del OPM:\nhttp://webenemasuno.linkeddata.es/ontology/OPMO/\nURI de la ontología extendida del MPEG-7:\nhttp://webenemasuno.linkeddata.es/ontology/MPEG7/\nURI que siguen los recursos:\nhttp://webenemasuno.linkeddata.es/resource/elviajero/\n<Type>/<ResourceName>\nNamespaces\n\nrdfs:\nhttp://www.w3.org/2000/01/rdf-schema#\nopmo:\nhttp://openprovenance.org/model/opmo#\nopmv:\nhttp://purl.org/net/opmv/ns#\nsioc:\nhttp://rdfs.org/sioc/ns#\nmpeg7:\nhttp://metadata.net/mpeg7/mpeg7.owl#\nmpeg7Ext:\nhttp://webenemasuno.linkeddata.es/ontology/MPEG7/\nopmopviajero:\nhttp://webenemasuno.linkeddata.es/ontology/OPMO/\ngeo:\nhttp://www.w3.org/2003/01/geo/wgs84_pos#\ndcterms:\nhttp://purl.org/dc/terms/\nfoaf:\nhttp://xmlns.com/foaf/0.1/\nGeometry model\n\nSe incluye un \"Punto\" por recurso, y al punto se le añaden la latitud y longnitud:\nhttp://webenemasuno.linkeddata.es/resource/elviajero/\n<Type>/<ResourceName>\nhttp://www.w3.org/2003/01/geo/wgs84_pos#location\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#long\nxsd:double\nhttp://www.w3.org/2003/01/geo/wgs84_pos#Point\nhttp://www.w3.org/2003/01/geo/wgs84_pos#lat\nxsd:double\nPara designar localizaciones, hemos distinguido dos tipos de relaciones distintas: las que denotan que  una acción ocurre en un sitio (place) y las que son de guías que hablan de un sitio (refersTo). Así podemos tener que una guía \"refersTo\" Barcelona (de manera un poco más abstracta), pero que su edición 'took \"place\" in' Madrid.\nSe utilizan xsd:doubles como rango de latitud y longitud, para que sea compatible con linked data y porque es lo que vamos a enlazar.\nPara enlazar localidades (con sameAs) para esta iteración hemos decidido quedarnos con el primer resultado.\nDecisiones de diseño\n\n1.- Razón por la que no se importan las clases de las ontologías mapeadas con el OPM (que lo especializan sependiendo del dominio), en lugar de crear una clase en la ontología extendida, y hacer el mapping.\nSe hace debido a los namespaces: si añadimos la clase de la ontología que queremos mapear directamente, cuando creemos una instancia de esa clase se referirá a la ontología original, por lo que no se conserva la jerarquía que capturamos con OPM.\nPor ejemplo, si queremos decir que un post es una subclase de Artifact, y que el post es un sioc:post, si añadimos directamente sioc:post como subclase de nuestra ontología, al crear una instancia se creará como una instancia de sioc:post y se referirá a su ontología. Sin embargo, en dicha ontología no encontramos la relación de post como subclase de artifact, por lo que sería incorrecto.\nLa solución aceptada es crear una clase post como subclase de artifact y establecer una relación de equivalencia con sioc:post.\nCodificación\n\nEn un principio se ha almacenado todo en UTF-8 en el repositorio de Jena-TDB.\nComo se utiliza Virtuoso en los servidores de la facultad, se ha pasado el modelo a un archivo y de ahí se ha cargado en Virtuoso.\nPara pasar de Jena a Virtuoso se ha decidido utilizar la codificación Turtle (.ttl). RDF/XML no es la más adecuada, dado que si hay fallos en la codificación con caracteres raros (algo más que normal teniendo en cuenta el orígen de los datos) no se puede generar el fichero. N3 no produce problemas, pero automáticamente cambia la codificación y se pierden los acentos y \"ñ\" de los literales. TURTLE no produce problemas y mantiene los literales en UTF-8, por lo que ha sido el elegido.\nGrafos\n\nActualmente se han creado 3 grafos. De esta manera se puede cambiar cualquiera de ellos según haya necesidad y añadir nuevos datos en posteriores grafos.\nhttp://webenemasuno.linkeddata.es/dataset/viajero/IPTCS\n- Grafo donde se guardan las guías (noticias)\nhttp://webenemasuno.linkeddata.es/dataset/viajero/POSTS\n- Grafo donde se guardan los posts\nhttp://webenemasuno.linkeddata.es/dataset/viajero/UPOS\n- Grafo donde guardamos las localizaciones\nhttp://webenemasuno.linkeddata.es/dataset/viajero/GENERAL\n- Por problemas de accesibilidad en pubby, se ha creado un nuevo grafo, union de los 3 anteriores.\nEstos datos están en la siguiente instancia\nInstance name\nSPARQL Endpoint\nInstallation Path\niSQL Port\nHTTP Port\nCredentials\nDescription\nwebenemasuno\nhttp://webenemasuno.linkeddata.es/sparql\n/opt/virtuoso-6.1.1/webenemasuno\n1122\n8902\ndba/geo8\nProduction instance for webenemasuno.linkeddata.es\nPubby settings\n\nTérminos adicionales\n\nConcepto de Viaje\n\nEn la última reunión del proyecto se ha introducido el concepto de \"Viaje\".\nUn viaje es un tipo de recurso que se va a poder compartir, modificar y reproducir por parte de los usuarios. Se crea en 3 partes: Antes del viaje (consultas de contenidos para usar como referencia), durante el viaje (subida de contenidos dinámica y consulta) y después del viaje (sobre todo subir vivencias y conclusiones del viaje).\nAntes del viaje, se decide el lugar (o lugares) que se va a visitar, por lo que se puede tener un itinerario. Se pueden añadir y guardar fotos y videos de referencia que vayamos a utilizar, otros viajes, guías del país, etc.\nSuponemos que cuando le damos al botón \"Crear Viaje\" ya tenemos alguna referencia seleccionada (en caso de que se haya escogido alguna, claro).\nUn viaje será el contenedor de los contenidos que generemos durante el propio viaje (fotos, vídeos, posts, etc).\nCada uno de estos recursos tiene un proceso independiente de creación (ya sea usando otras referencias o mediante un conjunto de procesos que haya llevado a cabo el usuario).\nTambién pueden tener metadatos descriptivos propios de los recursos (título, subtítulo, creador, derechos, fecha, etc.).\nUn viaje se puede modificar añadiendo nuevos contenidos como referencias del viaje, (Ejemplo: He creado el viaje, pero he olvidado añadir esta guía que tanto me gusta! O: Voy a modificar el itinerario añadiendo un nuevo destino). Incluir modificaciones del viaje en el prototipo? ¿Cómo denominamos a las distintas \"Versiones\"? Por ejemplo, si un viaje se guarda como un id y lo modificamos,¿ la nueva versión tiene un id nuevo o conservaría el antiguo como ocurre en los posts?.\nPor tanto, un viaje debe soportar eliminar contenidos asociados al mismo (propongo que para el prototipo esto no se implemente aún, ya que es un poco complicado a primera vista)\nYa que un viaje está geolocalizado y un usuario sube recursos desde lugares, se podría mostrar la visualización con multilíneas, y cuando se pinchase en cada punto, ver qué ha subido ahí el usuario (en una caja), y guías relevantes del sitio del País en otra caja.\nModelado del Viaje",
  "speaker": "SYSTEM",
  "uuid": "40ca7847-9ce5-4b8d-a097-6e88f3f4f406"
}