{
  "message": "SYSTEM: Wiki: Composed by\n:\nAcademic staff\n: Oscar Corcho\nPostdocs\n: Luis M. Vilches, Jean Paul Calbimonte,\nPhD Students\n: Víctor Saquicela,\nJosé Mora\n, Freddy Priyatna\nCollaborators\n: Carlos Buil\ne-mail address\n: dataintegration@delicias.dia.fi.upm.es\nContents\n[\nhide\n]\n1\nDescripción general\n2\nProyectos\n3\nTasks (out of the scope of specific R&D projects where each member is working)\n4\nData Integration WG Calendar\n5\nNext meetings and presentations\n6\nIndividual Meetings\n7\nCurrent projects\n8\nPast projects\n9\nProposals of MSc and Bachelor thesis\n10\nGeneral Roadmap\n11\nMiscellaneous\n12\nTools\n13\nResources\n14\nReferences\n14.1\nData Quality\n14.2\nSemantic Grid\n14.3\nGeospatial Semantics\n14.4\nSemantic e-Science\n14.5\nIntroduction, integration process\n14.6\nGaV and LaV approaches\n14.7\nQuery rewriting\n14.8\nTechnologies (EII, EAI, ETL, CTF)\n14.9\nData Integration - Web 2.0 (Mashups) - Ontology\n14.10\nSensor Networks Data Management\n14.11\nSemantic Sensor Web\n14.12\nContinuous queries\n15\nReading list\nDescripción general\n\nEn términos de soporte gráfico para R2RML, la verdad es que no hay mucho hecho por el momento. Espero que en un par de meses tengamos disponible un sistema muy sencillo para dar soporte a la creación gráfica de mappings R2RML, de tipo standalone y que será similar al plugin ODEMapster de NeOn Toolkit. Lo anunciaré en la lista cuando esté disponible. Estará disponible como open source en github.\nEn cuanto a la evolución de ODEMapster para dar soporte a R2RML, tenemos varias líneas abiertas en el grupo, que no sé si te resultarán interesantes o no, pero que te pueden servir para continuar explorando el área.\nMorph (\nhttps://github.com/jpcik/morph/\n), desarrollado por Jean Paul Calbimonte. Su soporte para SPARQL es limitado, pero podría valer para hacer alguna prueba. Está basado en el algoritmo de Elliot y está implementado en Scala.\nAcceso a streams de datos mediante SPARQL-Stream (\nhttps://github.com/jpcik/morph-streams\n), también desarrollado por Jean Paul Calbimonte como resultado de su tesis doctoral, que defendió hace dos semanas (\nhttp://www.slideshare.net/jpcik/phd-19957460\n). Este sistema hace query rewriting de consultas en SPARQL-Stream, una extensión de SPARQL para streams de datos, utilizando mappings R2RML, y puede utilizar complex event processors, data stream management systems o sensor middleware (COSM, GSN).\nAcceso a Google Fusion Tables basado en R2RML [1], desarrollado por Freddy Priyatna. En dos o tres semanas lo haremos disponible como servicio en la Web para que cualquiera lo pueda utilizar para crear SPARQL endpoints virtuales con autenticación y autorización a partir de Google Fusion Tables privadas. También, gracias a otro de mis antiguos estudiantes de doctorado, Carlos Buil, podemos también hacer consultas federadas que combinan datos públicos y privados, utilizando SPARQL-DQP (\nhttp://www.oeg-upm.net/index.php/es/technologies/166-sparql-dqp\n).\nOptimización de reescritura de consultas basada en R2RML a bases de datos mySQL y Postgres, también realizado por Freddy Priyatna, que nos permite ejecutar consultas reescritas con un overhead muy pequeño, y que también se puede utilizar para la generación en modo ETL. Estamos ahora mismo preparando un artículo para el evaluation track de ISWC2013, así que cuando terminemos de escribir y ejecutar todos los tests que estamos haciendo ahora mismo, lo haremos disponible para la comunidad.\n[1] Freddy Priyatna, Carlos Buil-Aranda and Oscar Corcho. Applying SPARQL-DQP for federated SPARQL querying over Google Fusion Tables. ESWC2013 Demo&Poster session. May 2013\nProyectos\n\nQuery rewriting work from José Mora.\nODEMapster for relational DBs\nNOR2O for spreadsheets\nSemantic SEO (including sitemap4rdf, CKAN registration, Google registration, etc.)\nQuery federation over distributed endpoints. It would be great to have access not only to SPARQL endpoints, but also to wrapped sources with ODEMapster, NOR2O, etc.\nMappingpedia\nDISPEL usage and OGSA-DAI usage\nCarlos: Distributed SPARQL querying. In my PhD thesis I work in accessing and optimising different and distributed RDF repositories. Currently there is a repid increase of RDF repositories which are queriable using the SPARQL query language. Most of these RDF repositories offer access to them via SPARQL Endpoints which receive as an input a SPARQL query and the results are then presented to the users. In this PhD work I propose a way for accessing and optimising the queries to a set of SPARQL endpoints using SQL optimisation techniques.\nCarlos' Tasks\nJean Paul: Semantic Integration of Streaming Data from Heterogeneous Sensor Networks. I work on data access and integration of streaming data sources, using an ontology-based approach. User applications access a unified view of the streaming data sources, that is represented through a global domain-ontology. Using a stream-to-ontology mapping the system is able to rewrite the queries in terms of the original sources. The result is thrown as a continuous stream of annotated rdf triples, windowed subsets of triples or spaqrl result sets. We deal with time constraints, heterogeneity of data, integration with stored traditional data, noise and data uncertainty, common in sensor network deployments.\nJosé Mora:\nlink to description\nFreddy: Large scale ontology based data integration using MapReduce. In my PhD thesis, I will study the properties of data intensive science and explore the possibilities to employ Map Reduce concepts into large scale Ontology Based Data Integration in order to solve computational problems. That study involves using MapReduce concept to solve memory problem of ODEMapster and bulding formal logical foundation for this Map Reduce + Ontology Based Data Integration, and the possibility to attach weight in data integration elements, where this weight value may represent time or hierarchy in order to deal with inconsistency. I am also interested in using Answer Set Programming for Query plan generation, and dealing with impendance mismatch problem of R2O+ODEMapster, from the point of view of the language, processor, and interface.\nTasks & Progress\nTasks (out of the scope of specific R&D projects where each member is working)\n\nVideo explicando de manera intuitiva el funcionamiento de ODEMapster (responsables: I need a champion!!)\nShould be similar to\nhttp://weblog.clarkparsia.com/2011/03/07/sdq-information-integration-in-the-real-world/\nReplicate the content of this article (\nhttp://www.devx.com/semantic/Article/38700\n) with our tools.\nDownload and check\nhttp://trinity.datagraph.org/\nfor the provision of a Linked Data Web server (responsable: Alex)\nCheck out the following sites:\nhttp://infochimps.org/\n,\nhttp://kaggle.com/\n,\nhttp://datamarket.com/\nData Integration WG Calendar\n\n<googlecalendar>obe7c6ro0qlt8tqnedjgrdo4n4%40group.calendar.google.com&ctz=Europe/Madrid</googlecalendar>\nNext meetings and presentations\n\nEach week one of the members of the group should present briefly his status.\n2010-01-22 --> Oscar (on the planning of IGN database linked data generation). Details\nhere\n2010-02-04 --> Freddy (ODEMapster - Lessons learned so far). Details\nhere\n2010-02-25 --> Details\nhere\n2010-03-10 --> Freddy on ODEMapster 2 Architecture.\nSlides\nIndividual Meetings\n\n2010-02-09 --> Carlos, Freddy. General discussion about architecture of (proposed) our data integration system.\nMinutes\nCurrent projects\n\nSemantic Grid / Semantic e-Science\n:\nADMIRE\n,\nSemsorGrid4Env\nGeospatial Semantics\n:\nEspañaVirtual\nOther\n:\nWebN+1\n,\nPlanetData\nPast projects\n\nWS-DAIOnt-OWL, RSSGRID,\nOntoGrid\n,\nGeoBuddies\nProposals of MSc and Bachelor thesis\n\n---\nGeneral Roadmap\n\nThis\nis a general roadmap displaying how all the work fits together, the\noriginal file\n(in visio) is available for (wiki)modification. The following two tables display the present and future status of the modules and interfaces in the previous diagram.\nName\nIs done\nWill be done\nCannot be done\nIs used\nWill be used\nCannot be used\nQuery\nLogical Query\nSources Information\nExpanded Query\nDB Sub-query\nWSN Sub-query\nRDF Sub-query\nWS Sub-query\nName\nIs done\nWill be done\nCannot be done\nQuery converter\nRegistry\nQuery Planning\nPartitioning - jmora\nfull - jmora\nno limitations identified so far\nDQP\nDB Wrapper\nWSN Wrapper\nRDF Wrapper\nWS Wrapper\nMiscellaneous\n\n[News] 2010-01-20. Google patents MapReduce.\nhttp://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&Sect2=HITOFF&d=PALL&p=1&u=/netahtml/PTO/srchnum.htm&r=1&f=G&l=50&s1=7,650,331.PN.&OS=PN/7,650,331&RS=PN/7,650,331\n[Trivia Facts / Quiz] \"Data integration is a mess\". That is the first sentence of a paper from a famous researcher.\nhttp://drawntoscalehq.com/\nTools\n\nTriplify.\nReview\nTrinity.\nReview\nLinked Data API from Talis:\nhttp://purl.org/linked-data/api/spec\nand\nhttp://code.google.com/p/linked-data-api/\nOBDALib.\nReview\nSpreadsheet to RDF: NOR2O,\nhttp://www.revelytix.com/content/spyder\n,\nhttp://www.cambridgesemantics.com/products/anzo-express\n,\nhttp://www.slideshare.net/der42/industrialized-linked-data\n(slide 26)\nOEG Hadoop Cluster\nResources\n\nFAO's geopolitical ontology\n[1]\n- versión OWL:\n[2]\nDatasets: Contactar con Carlos Duarte (Instituto Mediterráneo de Estudios Avanzados); Francisco Martín está asistiendo a un seminario sobre e-Ciencia en Andalucía a finales de enero.\nSPARQLpedia\nis a public repository of SPARQL queries, which may be submitted, searched and executed. The API allows submitting, deleting and finding.\nKaggle\nis a site that lists contests on KDD (not many att). Datasets are made available for that task.\nInfochimps\nis a dataset list of many very different topics, tagged, very specific at most cases, as twitter messages related with the Haiti earthquake, in several formats, including web forms. Sources are linked and require some browsing before reaching the actual data.\nCatálogos de datos:\nckan\n,\nlinkeddata\n,\ndatospublicos\n,\naporta\n,\ninternetinvisible\n,\nworld government data\n,\nMº economía y hacienda\n.\nReferences\n\nReference list in BibSonomy + Exhibit:\nhttp://delicias.dia.fi.upm.es/~aleon/bib/integration/\nData Quality\n\nChris Bizer's PhD thesis (in particular pp. 10-35)\nErhard Rahm and Hong Hai Do (2000): Data Cleaning: Problems and Current Approaches, IEEE Data Eng. Bull. 23(4): 3-13 (2000)\nWayne W. Eckerson (2002): Data Quality and the Bottom Line, Report, The Data Warehousing Institute\nWand, Y. and Wang, R. (1996): Anchoring Data Quality Dimensions in Ontological Foundations, Communications of the ACM, November 1996. pp. 86–95.\nWang, R., Kon, H. & Madnick, S. (1993): Data Quality Requirements Analysis and Modelling, Ninth International Conference of Data Engineering, Vienna, Austria.\nFürber, Christian and Hepp, Martin: Using SPARQL and SPIN for Data Quality Management on the Semantic Web, in: BIS 2010. Proceedings of the 13th International Conference on Business Information Systems, May 3-5, 2010, Berlin, Germany, Springer LNBIP Vol 47, pp. 35-46.\nhttp://www.heppnetz.de/files/fuerber-hepp-sparql-spin-dqm.pdf\nFürber, Christian and Hepp, Martin: Using Semantic Web Resources for Data Quality Management, in: Proceedings of the 17th International Conference on Knowledge Engineering and Knowledge Management (EKAW2010), October 11-15, 2010, Lisbon, Portugal, Springer LNCS Vol. 6317, pp.  211-225, 2010.\nhttp://www.heppnetz.de/files/dataquality-semweb-ekaw2010.pdf\nSemantic Grid\n\nPapers about\nGrid\nPresentation about ISSGC2009 made by Carlos Buil to the OEG group (4/9/2008):\nhttp://delicias.dia.fi.upm.es/wiki/index.php/Image:ISSGC08.ppt\nhttp://www.forrester.com/rb/Research/topic_overview_information_architecture/q/id/55951/t/2?src=Alert\nGeospatial Semantics\n\nAlonso G, Abbadi AE (1994) “Cooperative modelling in applied geographic research”. International Journal of Intelligent and Cooperative Information Systems, 3(1): 83-102\nBishr Y (1998) “Overcoming the semantic and other barriers to GIS interoperability”. International Journal of Geographical Information Science, 12(4): 299–314.\nInternational Standard Organization (ISO) (2003) ISO 19112:2003 “Geographic Information – Spatial referencing by geographic identifiers”.\nFonseca FT, Egenhofer MJ, Davis CA, Câmara G (2002) “Semantic Granularity in Ontology-Driven Geographic Information Systems”. Annals of Mathematics and Artificial Intelligence. Volume: 36, 2002. Issue: 1-2, p. 121 – 151.\nGreenwood J, Hart G (2003) “Sharing Feature Based Geographic Information – A Data Model Perspective”. 7th Int. Conference on GeoComputation. United Kingdom.\nHakimpour F (2003) “Using Ontologies to Resolve Semantic Heterogeneity for Integrating Spatial Database Schemata”. Ph.D. thesis, Zurich University. Switzerland, 2003.\nHakimpour F, Timpf S (2001) “Using Ontologies for Resolution of Semantic Heterogeneity in GIS”. 4th. AGILE Conference on Geographic Information Science, Brno, Czech Republic, 2001.\nISO 19110 (2005) “Geographic Information” – Methodology for feature cataloguing.\nISO 19112 (2003) “Geographic Information” – Spatial referencing by geographic identifiers.\nLopez-Pellicer F, Vilches-Blázquez LM, Nogueras-Iso J, Corcho O, Bernabé MA, Rodríguez AF (2007) Using a hybrid approach for the development of an ontology in the hydrographical domain. In: Proceedings of 2nd Workshop of COST Action C21 -Towntology Ontologies for urban development: conceptual models for practitioners.\nNomenclátor Geográfico Conciso de España, versión 1.0. “Presentación y Especificaciones”. Instituto Geográfico Nacional. Octubre 2006.\nhttp://www.idee.es/ApliVisio/\nNomenclator/NGCE.pdf\nOGC (2003) “OpenGIS Reference Model”, Version 0.1.2, OGC Inc. Wayland, MA, USA.\nRodríguez Pascual AF, García Asensio L (2005) “A fully integrated information system to manage cartographic and geographic data at a 1:25,000 scale”. XXII International Cartographic Conference (ICC2005). A Coruña, Spain. ISBN: 0-958-46093-0\nSevilla Sánchez, C, Rodríguez Pascual A.F., González Matesanz FJ, Blanco Ortega LM, Vilches-Blázquez LM (2006) “Un SIG corporativo en el IGN para la gestión integrada, publicación y análisis de datos geográficos”. In proceedings of XII Congreso Nacional de Tecnologías de la Información Geográfica. Camacho Olmedo, M.T.; Cañete Pérez, J.A.y Lara Valle, J.J. Ed. ISBN: 84-338-3944-6 Depósito Legal: GR-1855-2006\nStuckenschmidt H, Visser U, Schuster G, Vögele T (1999) “Ontologies for geographic information integration”. Proceedings of Workshop Intelligent Methods in Environmental Protection: Special Aspects of Processing in Space and Time, 13. International Symposium of Computer Science for Environmental Protection, CSEP 1999, pp. 81-107.\nVilches-Blázquez LM, Rodríguez Pascual A F, Mezcua Rodríguez J, Bernabé Poveda MA, Corcho O (2007a) “An approach towards a harmonized framework for hydrographic features domain”. In Conference Proceedings of XXIII International Cartographic Conference. 4-10 August 2007. Moscow, Russia.\nVilches Blázquez LM, Bernabé Poveda MA, Suárez Figueroa MC, Gómez-Pérez A, Rodríguez Pascual A F (2007b) “Towntology & hydrOntology: Relationship between Urban and Hydrographic Features in the Geographic Information Domain”. Ontologies for Urban Development Ed. Teller, J.; Roussey, C.; Lee, J. Springer-Verlag, 2007. ISBN: 978-3-540-71975-5. pp: 73-84.\nMans Shapshak  , Tracasa SA  \"Combining GIS and Semantic Technology to Create a Cultural Visualizer.\"\nSemantic e-Science\n\n- The Fourth Paradigm.\nhttp://research.microsoft.com/fourthparadigm\nIntroduction, integration process\n\n- Beauty and the beast: The theory and practice of information integration. Laura Hass\n[3]\n- Data integration: The teenage years. Alon Y. Halevy\n[4]\n- Information Integration: Conceptual Modeling and Reasoning Support. Diego Calvanese, Giuseppe De Giacomo, Maurizio Lenzerini, Daniele Nardi, Riccardo Rosati.\n[5]\n- Three Decades of Data Integration: All Problems Solved? Patrick Ziegler and Klaus R. Dittrich\n[6]\n- Ontology-Based Integration of Information - A survey of Existing Approaches. H.Wache, T. Vogole\n[7]\nReview\nGaV and LaV approaches\n\n- Information integration using logical views. Jeffrey D. Ullman\n[8]\n- Data integration: A theorical Perspective. Maurizio Lenzerini\n[9]\n- Logic-based techniques in data integration. Alon Levy\n[10]\nQuery rewriting\n\n- Answering queries using views. Alon Y. Levy, Alberto O. Meldenzon.\n- Complexity of Answering Queries Using Materialized Views. Sergi Abiteboul, Oliver M. Dushka\n- Tractable query answering and rewriting under description logic constraints. Héctor Pérez-Urbina, Boris Motik, Ian Horrocks\n[11]\n- The Return of the Entity-Relationship Model: Ontological Query Answering. Andrea Cali, Georg Gottlob and Andreas Pieris.\n[12]\n- A general Datalog-based framework for tractable query answering over ontologies. A. Calì, G. Gottlob, and T. Lukasiewicz. Journal of Web Semantics, 2012.\n[13]\n- Logic Program Optimization. Tekle, K. Tuncay. State University of New York, 2007.\n[14]\nTechnologies (EII, EAI, ETL, CTF)\n\n- Semantic Data Integration for the Enterprise. An Oracle White Paper.\n[15]\n- Kossmann D. The state of the art in distributed query processing. ACM Computing Surveys 32(1) (2000) 422-469\n[16]\n- Quilitz B, Leser U. Querying distributed RDF data sources with SPARQL. ESWC2008:521-538\n[17]\n- Langegger A, WoB W, Blochl M. A semantic web middleware for virtual data integration on the Web. ESWC2008:493-507\nData Integration - Web 2.0 (Mashups) - Ontology\n\n- Dynamic Fusion of Web Data. Erhard Rahm, Andreas Thor...\n- Mashing Up Search Services. Daniele Braga, Stefano Ceri, David Martinenghi\n- Damia - A Data Mashup Fabric for Intranet Applications. Mehmet Altinel, Susan Cline.\n- An online Plataform for Web APIs and Service Mashups. Michael Maximilien, Ajith Ranabahu,...\n- Composing RESTful Services and Collaborative Workflows. Florian Rosenberg, Francisco Curbera, .....\n- Data Integration  Support for Mashups. Andreas Thor, David Aumueller\n- The RDF Book Mashups: From Web APIs to a Web of Data. Christian Bizer, Richard Cyganiak.\n- An Architecture for Dynamic Data Source Integration. Ian Gorton, Justin Almquist....\n- Dynamic Data Integration Using Web Services. Fujun Zhu, Mark Turner.\n- A flexible Integration Framework for Semantic Web 2.0 Applications. Eyal Oren, Armin Haller,...\n- Ontology-Based Integration of Information - A survey of Existing Approaches. H.Wache, T. Vogole\n[18]\nReview\n- SEWSIP: Semantica based Web services Integration in P2P. LI Juanzi XU Bin.\n- Undersatanding Mashup Development. Jin Yu, Boualem Benatallah...\n- SA-REST: Semantically Interoperable and Easier-to-Use and Mashups. Amit P. Sheth, Karthik Gomadam.\n- How Will We Interact with the Web of Data?. Tom Heath.\nSensor Networks Data Management\n\n- Data Management in the Worldwide Sensor Web - M. Balazinska, Amol Deshpande, Michael J. Franklin, Phillip B. Gibbons, Jim Gray, Suman Nath, Mark Hansen, Michael Liebhold, Alexander Szalay, Vincent Tao\n[19]\n- Data Management in the Worldwide Sensor Web Presentation -\n[20]\nSemantic Sensor Web\n\nSheth, A, C Henson, and S S Sahoo. “Semantic sensor web.” IEEE Internet Computing (2008): 78-83.\nPatni, H, C Henson, and A Sheth. “Linked sensor data.” In CTS, 362-370, 2010.\nCorcho, O, and R Garc’ia-Castro. “Five challenges for the Semantic Sensor Web.” Semantic Web 1, no. 1 (2010): 121-125.\nCalbimonte, Jean-Paul, Óscar Corcho, and Alasdair J. G. Gray. “Enabling Ontology-based Data Access to Streaming Data Sources.” In ISWC’10: Proceedings of the 9th International Semantic Web Conference, 2010.\nContinuous queries\n\nArasu, Arvind, Shivnath Babu, and Jennifer Widom. “The {CQL} continuous query language: semantic foundations and query execution.” The VLDB Journal 15, no. 2 (2006): 121-142.\nhttp://dx.doi.org/10.1007/s00778-004-0147-z\n.\nBarbieri, Davide Francesco, Daniele Braga, Stefano Ceri, Emanuele Della Valle, and Michael Grossniklaus. “{C-SPARQL}: A Continuous Query Language for {RDF} Data Streams.” In (IJSC), 3-25, 2010.\nReading list\n\nhttp://static.lod2.eu/Deliverables/Deliverable_4.3.1_FP7_LOD2_20110131.pdf\n(to be presented by José Mora on 17/03/2011) (\npresentation\n)\nD. Le-Phuoc, JX Parreira, M Hausenblaus, M. Hauswirth. Continuous Query Optimisation and evaluation over unified linked stream data and linked open data. DERI Technical report 2010-09-27 (to be presented by Oscar?JeanPaul? on 31/03/2011)  -->> Oops, not available that day since I am at the DynaLearn review, so probably some other paper can be presented.\nD. Kossmann. The state of the art in distributed query processing. ACM Computing Surveys, 32(4):422{469, 2000.\nhttp://www.computer.org/cms/Computer.org/ComputingNow/homepage/2011/0311/W_IC_ClientandCloud.pdf\ne-Science oriented\nG. Konstantinidis and J. L. Ambite, “Scalable Query Rewriting: A Graph-Based Approach,” presented at the not yet in press.\nBasca C., Bernstein A. Avalanche: Putting the Spirit of the Web back into Semantic Web Querying. Submitted to SSWS2010.\nD. Le-Phuoc, J. X. Parreira, M. Hausenblas, Y. Han, and M. Hauswirth, “Live linked open sensor database,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nP. N. Mendes, A. Passant, and P. Kapanipathi, “Twarql: tapping into the wisdom of the crowd,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nS. Speiser and A. Harth, “Taking the LIDS off data silos,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nP. E. Salas, K. K. Breitman, J. V. F, and M. A. Casanova, “Interoperability by design using the StdTrip tool: an a priori approach,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nR. Troncy, B. Malocha, and A. T. S. Fialho, “Linking events with media,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010. Also submitted to COLD2010\nO. Hassanzadeh et al., “BibBase triplified,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nB. Haslhofer, E. Momeni, M. Gay, and R. Simon, “Augmenting Europeana content with linked data resources,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nP. Dudchuk, V. P. Klintsov, and D. Hladky, “Ontos clip and share,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-2, 2010.\nT. Lebo and G. T. Williams, “Converting governmental datasets into linked data,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nR. Cyganiak, F. Maali, and V. Peristeras, “Self-service linked government data with dcat and gridworks,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nA. D. León, V. Saquicela, L. M. Vilches, B. Villazón-Terrazas, F. Priyatna, and O. Corcho, “Geographical linked data: a Spanish use case,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nA. Fogarolli and P. Bouquet, “Linking data for public administrations,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nC. Böhm et al., “Linking open government data: what journalists wish they had known,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nG. Ladwig and D. T. Tran, “Linked Data Query Processing Strategies,” in Proceedings of the 9th International Semantic Web Conference (ISWC '10), 2010.\nR. Fink et al., “SPROUT 2: A Squared Query Engine for Uncertain Web Data” (2011). (\npaper\n) (\nsite w/ description\n)\nLDIF (\nmail\n) (\nlink\n)\nCarlos Buil-Aranda, Marcelo Arenas and Oscar Corcho. Semantics and Optimization of the SPARQL 1.1 Federation Extension. To appear in Proceedings of the 8th Extended Semantic Web Conference (ESWC'11), Heraklion, Greece, 2011.\nS. Stefanova and T. Risch, “Optimizing Unbound-property Queries to RDF Views of Relational Databases,” in The 7th International Workshop on Scalable Semantic Web Knowledge Base Systems (SSWS 2011), n.d., 43. (\npdf\n)\nO. Curé, M. Lamolle, and C. Le Duc, “Ontology Based Data Integration Over Document and Column Family Oriented NOSQL stores,” in The 7th International Workshop on Scalable Semantic Web Knowledge Base Systems (SSWS 2011), n.d., 122. (\npdf\n)\nR. Rosati, “Prexto: Query Rewriting under Extensional Constraints in\nDL\n−\nLite\n,” in The Semantic Web: Research and Applications, vol. 7295, E. Simperl, P. Cimiano, A. Polleres, O. Corcho, and V. Presutti, Eds. Springer Berlin / Heidelberg, 2012, pp. 360–374. (\npdf\n)\nM. Rodríguez-Muro and D. Calvanese, “Dependencies: Making ontology based data access work in practice.” (\npdf\n)",
  "speaker": "SYSTEM",
  "uuid": "4147b1e2-6816-47b9-8041-1728c2327fc9"
}