{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_agencia \n\nProtocolo agencia NO OFICIAL\n\nCómo interactuar con la agencia de viajes Juliá Central de Viajes.\nPartimos de una máxima: Hay que pedir presupuesto SIEMPRE a la\nagencia.\nLa agencia da servicio de transporte y alojamiento. O sea, aviones,\ntrenes, autobuses, barcos, etc. O sea, transporte no urbano (metro, bus,\ntaxi). Y hoteles, apartamentos, etc.\nCómo interactuar y qué hacer\n\n1.- Se pide presupuesto a la agencia. Se le envía un correo con el\ndestino, las fechas, etc. a empresasmad@centralvia.es. Se puede\nconcretar todo lo que se quiera. Se pueden pedir vuelos y hoteles\nexplícitos o rangos de horario para viajar...\n2.- En tres horas dentro de horario laboral tiene que contestar la\nagencia con un presupuesto.\n2.1.- Si no contestan en plazo, se puede comprar por nuestra cuenta el\nviaje. Hay que notificar la incidencia a Esther Alonso\n(esther.alonso.casado@upm.es). El correo se guarda e imprime porque hay\nque aportarlo como prueba de que se ha tenido que comprar por libre ya\nque no se ha obtenido respuesta. Si la agencia responde después de las\ntres horas (y ya se ha reservado y comprado el viaje), se adjuntará\ntambién este correo para demostrar que no se ha cumplido el plazo.\n2.2.- Si contestan en plazo\n2.2.1.- Si se quiere lo ofrecido por la agencia, hay que seguir las\nindicaciones de la misma (previaje, códigos DIR que proporcionará Ana\npara cada caso, etc.).\n2.2.2.- Si no se quiere lo ofrecido por la agencia y se tienen otros\nvuelos u hoteles con precios mejores, hay que enviar a la agencia los\nvuelos y los hoteles con los precios para que la agencia emita un\ncertificado de que no puede mejorar el precio. La agencia tiene dos\nhoras para emitir este certificado.\n2.2.2.1.- Si la agencia iguala el precio o lo mejora (en iguales vuelos\ny hoteles), hay que contratar con la agencia siguiendo las indicaciones\nde la misma.\n2.2.2.2.- Si la agencia no iguala el precio ni lo mejora, emitirá un\ncertificado.\n2.2.2.3.- Si la agencia no contesta en dos horas, se puede contratar\ndirectamente sin necesidad del certificado. Y hay que notificar la\nincidencia a Esther Alonso (esther.alonso.casado@upm.es).\nAdicional:\na) La agencia emite factura a nombre de la UPM, si lo compra el viajero\nlas facturas han de emitirse a nombre y datos fiscales de UPM también.\nb) Contratando con la agencia adelanta el dinero la agencia, si compra\nel viajero adelanta el dinero el viajero.",
  "speaker": "SYSTEM",
  "uuid": "4199c938-50ba-47e9-877f-3f6f9e35046b"
}