{
  "message": "SYSTEM: D5.3.2.pdf: Página 7\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 7 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n1. Introduction \nThe Semantic Web of the future will be characterized by the use of a very large number of \nontologies embedded in ontology networks built collaboratively by distributed teams, where an \nontology network or a network of ontologies is defined as a collection of ontologies (called \nnetworked ontologies) related together through a variety of different relationships such as mapping, \nmodularization, version, or dependency relationships [ 4]. So, future Semantic Web applications will \nbe based on networks of contextualized ontologies, which will be in continuous evolution. Such \nnetworks could include ontologies that already exist or they could be developed by reusing either \nother ontologies or non-ontological but knowledge-aware resources (e.g., thesauri, lexicons, text \ncorpora, DBs, UML diagrams, etc.) built by others [ 2]. \nWith this new vision of the ontologies and the Semantic Web, it is important to provide strong \nmethodological support for the knowledge reuse, collaborative and context-sensitive development \nof ontology networks.  \nMethodologies should involve the following issues: development process, life cycle models and life \ncycle, methods, techniques and tools to be used during the ontology building. In the NeOn project, \nand in particular in WP5, we are investigating these issues and present them in the following \ntechnical reports:  \n\u0001 NeOn Deliverable D5.3.1 [ 10], which dealt with the first three issues: development process, \nlife cycle models and life cycle.  \n\u0001 NeOn Deliverable D5.4.1 [ 11], which dealt with methods, techniques and tools for different \nprocesses and activities. Concretely, such a deliverable presented methodological \nguidelines for the ontology specification activity, for the reuse and reengineering of non-\nontological resources, and for the reuse of ontological resources (general or common \nontologies, domain ontologies, ontology statements, and ontology design patterns). \n\u0001 NeOn Deliverable D5.3.2, that is this deliverable, is a revision and an extension of the \nresults already presented in D5.3.1 [ 10].   \nAs stated in deliverable D5.3.1 [ 10], the degree of maturity of the ontological engineering field is \nvery low if we compare it with the Knowledge Engineering field and, especially, with the Software \nEngineering field. The long term goal of the Ontology Engineering field is to reach a similar degree \nof maturity to the degree of Software Engineering field today.  \nUnlike what happens in the Software Engineering field, the Ontology Engineering field has several \ndistinct characteristics: \n1. Prior to NeOn project, there was no activity glossary that could identify and define the activities \nthat potentially could be carried out when single ontologies and ontology networks are \ndeveloped. None of the best known methodologies (METHONTOLOGY, On-To-Knowledge \nand DILIGENT) includes a definition for the activities they propose. It is also remarkable that \nduring the last years, new activities were identified when building ontologies, though they have \nno formal and precise definition for new and old activities. This situation results from a lack of \nstandardization on the ontology engineering field terminology, in contrast with the IEEE \nStandard Glossary of Software Engineering Terminology [ 1] in the Software Engineering field. \nFor this reason, in deliverable D5.3.1 [ 10] the NeOn Glossary of Activities Version 1, which \nidentifies and defines the activities potentially involved in the ontology network construction, \nwas built. \n",
  "speaker": "SYSTEM",
  "uuid": "425abf9e-e76b-4277-98c2-13080112ee87"
}