{
  "message": "SYSTEM: CVOscarCorcho_CICYT_29Abril2013.pdf: Página 4\nCurriculum Vitae, Oscar Corcho García, 1/11/2012 \nPágina 4 \n \nAdemás de las contribuciones previamente mostradas, que están bien establecidas y reconocidas, \ncomo se puede desprender de los indicadores de reconocimiento y difusión comentados en la tabla, \nhay otros logros científicos y tecnológicos que son horizontales a todas estas áreas y que se \nencuentran actualmente en una etapa temprana de desarrollo, pero que merece la pena destacar:  \n• \nPublicación basada en ontologías de datos procedentes de redes de sensores [Calbimonte et al., \n2010].  \n• \nCaracterización ontológica de datos procedentes de redes de sensores [Sequeda et al., 2009], \nfolksonomías [García et al., 2009] y conjuntos de datos relacionales.  \n• \nEjecución de consultas SPARQL distribuidas [Buil et al., 2011]. Premio al mejor artículo \nESWC2011. \nLiderazgo científico: reconocimiento y difusión de las contribuciones realizadas \nCada disciplina científica tiene distintos conjuntos de indicadores que pueden mostrar el \nreconocimiento y la difusión de las contribuciones de investigación. En el caso de la Informática, \ndonde la mayor parte del trabajo de mi investigación ha sido realizada durante mi carrera académica \ny profesional, los resultados de investigación se publican preferentemente en conferencias \ninternacionales de prestigio, con procesos duros de revisión por pares e índices de aceptación bajos \nen general, en lugar de preferentemente en revistas especializadas.  \nSe han seleccionado algunos de los indicadores más relevantes del trabajo descrito anteriormente: \n- \nCitas y el valor del índice h. De acuerdo con Google Scholar, mi índice h es de 24, mientras que \nen Thomson ISI, que no cuenta algunas publicaciones en conferencias, workshops y libros, el \nvalor de este índice es 8.  \n- \nUtilización del software desarrollado. La plataforma de desarrollo de ontologías WebODE, en \nla que participé activamente para la generación de traductores directos e inversos a y desde \nlenguajes de implementación de ontologías, ha sido usada por más de 10.000 usuarios desde el \naño 2000 hasta el año 2008, cuando se terminó de dar soporte a la misma. ODESeW ha sido \nusado como plataforma básica para generar más de diez websites de Proyectos. Y R2O y \nODEMapster están siendo utilizados por organizaciones como la FAO.  \n- \nNúmero de invitaciones para escribir capítulos de libro y artículos de revista. Basado en la \nimportancia del trabajo realizado, he recibido varias invitaciones para escribir artículos de revista \n(en revistas como AI Magazine e IEEE Internet Computing), y capítulos de libro relevantes. \nOtra medida de la relevancia y reconocimento por parte de la comunidad es la continua participación \nen los comités organizadores de conferencias internacionales de primera línea. Las más \nrelevantes son: \n- \nCodirector del comité de programa de la 11th European Semantic Web Conference (ESWC2013) \n- \nCodirector del comité de programa del PhD Symposium de la 10th European Semantic Web \nConference (ESWC2012). \n- \nDirector del comité de programa de la 7th International Conference on Knowledge Capture \n(KCAP2011). \n- \nMiembro del comité de programa senior de la 22nd y 23rd International Joint Conference on \nArtificial Intelligence (IJCAI2011, IJCAI2013). \n- \nCodirector de posters y demos de la 17th International Conference on Knowledge Engineering \nand Knowledge Management (EKAW2010), y de la 8th International Semantic Web Conference \n(ISWC2009). \n- \nCodirector de programa de la Semantic Sensor Network track de la 8th European/Extended \nSemantic Web Conference (ESWC2010). \n- \nOrganizador local de la Sixth European Semantic Web Conference (ESWC2008). \nAsimismo, he participado en la organización de escuelas de verano internacionales de prestigio en \nlas áreas de e-Ciencia y Web Semántica:  \n- \nCodirector del comité de programa de la 7th International Summer School on Grid Computing \n(ISSGC-2009), cuyo programa se centra en computación Grid y e-Ciencia. \n- \nVice-director de la 7th y 8th Summer School on Ontological Engineering and the Semantic Web \n(SSSW2009, SSSW2011), cuyo programa se centra en la Ingeniería de Ontologías y el desarrollo \nde aplicaciones de la Web Semántica. \n",
  "speaker": "SYSTEM",
  "uuid": "432201e0-4cb8-42cc-b0c7-13f8d4ea93ee"
}