{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 2\nWhile our professional paths have not been very close over the years, nevertheless I've always recognized\n\u0019\nDick in the halls of Bell Labs and have always had tremendous admiration for what he was doing. I think\nthe record speaks for itself. It is too long to go through all the details, but let me point out, for example, that\n\f\nhe has written seven books and of those seven books which tell of various areas of mathematics and\n\u001a\ncomputers and coding and information theory, three are already well into their second edition. That is\n\u0007\ntestimony indeed to the prolific output and the stature of Dick Hamming.\n\f\nI think I last met him - it must have been about ten years ago - at a rather curious little conference in\nDublin, Ireland where we were both speakers. As always, he was tremendously entertaining. Just one more\nexample of the provocative thoughts that he comes up with: I remember him saying, ``There are\n\b\nwavelengths that people cannot see, there are sounds that people cannot hear, and maybe computers have\n\nthoughts that people cannot think.'' Well, with Dick Hamming around, we don't need a computer. I think\n\f\nthat we are in for an extremely entertaining talk.\n\f\nTHE TALK: ``You and Your Research'' by Dr. Richard W. Hamming\n\u001b\nIt's a pleasure to be here. I doubt if I can live up to the Introduction. The title of my talk is, ``You and Your\nResearch.'' It is not about managing research, it is about how you individually do your research. I could\n\u0015\ngive a talk on the other subject - but it's not, it's about you. I'm not talking about ordinary run-of-the-mill\n\u0017\nresearch; I'm talking about great research. And for the sake of describing great research I'll occasionally say\nNobel-Prize type of work. It doesn't have to gain the Nobel Prize, but I mean those kinds of things which\n\u0011\nwe perceive are significant things. Relativity, if you want, Shannon's information theory, any number of\n\noutstanding theories - that's the kind of thing I'm talking about.\n\u000e\nNow, how did I come to do this study? At Los Alamos I was brought in to run the computing machines\n\u0011\nwhich other people had got going, so those scientists and physicists could get back to business. I saw I was\n\na stooge. I saw that although physically I was the same, they were different. And to put the thing bluntly, I\n\t\nwas envious. I wanted to know why they were so different from me. I saw \n\nFeynman up close. I saw Fermi\nand Teller. I saw \n\t\nOppenheimer. I saw Hans \n\u001c\nBethe: he was my boss. I saw quite a few very capable people. I\nbecame very interested in the difference between those who do and those who might have done.\n\u001d\nWhen I came to Bell Labs, I came into a very productive department. Bode was the department head at the\n\u0019\ntime; Shannon was there, and there were other people. I continued examining the questions, ``Why?'' and\n\f\n``What is the difference?'' I continued subsequently by reading biographies, autobiographies, asking people\nquestions such as: ``How did you come to do this?'' I tried to find out what are the differences. And that's\n\u0010\nwhat this talk is about.\n\nNow, why is this talk important? I think it is important because, as far as I know, each of you has one life to\n\u0011\nlive. Even if you believe in reincarnation it doesn't do you any good from one life to the next! Why\nshouldn't you do significant things in this one life, however you define significant? I'm not going to define\n\u0006\nit - you know what I mean. I will talk mainly about science because that is what I have studied. But so far\n\u001e\nas I know, and I've been told by others, much of what I say applies to many fields. Outstanding work is\n\t\ncharacterized very much the same way in most fields, but I will confine myself to science.\n\u0007\nIn order to get at you individually, I must talk in the first person. I have to get you to drop modesty and say\nto yourself, ``Yes, I would like to do first-class work.'' Our society frowns on people who set out to do\n\f\nreally good work. You're not supposed to; luck is supposed to descend on you and you do great things by\n\u0018\nchance. Well, that's a kind of dumb thing to say. I say, why shouldn't you set out to do something\n\u0007\nsignificant. You don't have to tell other people, but shouldn't you say to yourself, ``Yes, I would like to do\n\u0006\nsomething significant.''\n\u0006\nIn order to get to the second stage, I have to drop modesty and talk in the first person about what I've seen,\nwhat I've done, and what I've heard. I'm going to talk about people, some of whom you know, and I trust\n\nthat when we leave, you won't quote me as saying some of the things I said.\n\f\nLet me start not logically, but psychologically. I find that the major objection is that people think great\n\u001f\nscience is done by luck. It's all a matter of luck. Well, consider Einstein. Note how many different things he\n\u0006\ndid that were good. Was it all luck? Wasn't it a little too repetitive? Consider Shannon. He didn't do just\n \ninformation theory. Several years before, he did some other good things and some which are still locked up\nin the security of cryptography. He did many good things.\n\u001e\n",
  "speaker": "SYSTEM",
  "uuid": "439c4570-e9b8-4e0a-87d9-8ff8b5971332"
}