{
  "message": "SYSTEM: 2016.04.CVA.Victor.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nPublication: an Example in Building Energy Consumption. Automation in \nConstruction. Vol. 57, pp. 178–187 \n E. Rodríguez, J. Delgado, L. Boch, V. Rodríguez-Doncel. (2015) Media Contracts \nFormalization Using a Standardized Contract Expression Language, IEEE \nMultimedia, ISSN: 1070-986X, Vol. 22(2), pp. 64-74 \n P. Kudumakis, M. Sandler, A. G. Anadiotis, I. S. Venieris, A. Difino, X. Wang, G. \nTropea, M. Grafl, V. Rodríguez-Doncel, S. Llorente, J. Delgado. (2014). MPEG-M: A \nDigital Media Ecosystem for Interoperable Applications, Signal Processing: Image \nCommunication. Vol. 29 (1), pp. 150–166 \n García-Silva, V. Rodriguez-Doncel, O. Corcho. 2013. Semantic Characterization of \nTweets Using Topic Models: A Use Case in the Entertainment Domain. Int. Journal \non Semantic Web and Information Systems, Vol. 9(3), pp. 1-13 \n V. Rodríguez, J. Delgado, F. Chiariglione, M. Preda, C. Timmerer. (2011) \nInteroperable Digital Rights Management based on the MPEG Extensible \nMiddleware. Multimedia Tools and Applications. Vol. 53(1), pp. 303-318 \n Timmerer, F. Chiariglione, M. Preda, V. Rodriguez Doncel. (2010) Accelerating \nMedia Business Developments with the MPEG Extensible Middleware. IEEE \nMultimedia. Vol. 17(3), pp. 74-78 \n V. Rodríguez and J. Delgado. (2009) A Media Value Chain Ontology for MPEG-21, \nIEEE Multimedia, vol. 16(4), pp. 44-51 \n V. Rodríguez-Doncel, N. Nikolaidis, I. Pitas. (2007) An Optimal Detector Structure \nfor the Fourier Descriptors Domain Watermarking of 2D Vector Graphics, IEEE \nTransactions on Visualization and Computer Graphics. Vol. 13(5), pp. 851-863 \nLibros completos \n Inception of a Media Value Chain Ontology (MVCO), Víctor Rodríguez, Jaime \nDelgado. ISBN 978-3639019318. Ed. VDM Verlag Dr. Müller. (204 pags.) Sep. 2010 \n Estudio Matemático de la Quiniela, Víctor Rodríguez Doncel. ISBN 978-8499160191. \nEd. Bubok Publishing S.L. (140 pags.). Apr. 2009 \nCapítulos de libros \n Enhancing Electronic Contracts with Semantics. The Case of Multimedia Content \nDistribution, V. Rodriguez Doncel and J. Delgado, In: Intelligent Multimedia. \nManaging Creative Works in a Digital World, pp. 289-305, ISBN: 978-8-88398-063-3. \nEd. EPAP, May 2010  \n Accelerating Media Business Developments with the MPEG Extensible Middleware, \nC. Timmerer, F. Chiariglione, M. Preda, V. Rodriguez Doncel, In: Towards the Future \nInternet - Emerging Trends from European Research, pp. 217 - 226, ISBN 978-1-\n60750-538-9, Ed. IOS Press, Apr. 2010 \n Normalización y aplicación de ontologías para la gestión digital de derechos sobre \ncontenidos multimedia, V. Rodríguez Doncel and J. Delgado, In: Lecturas sobre \nDerecho y Web Semántica, pp. 389-408, ISBN: 978-8-49836-907-6, Ed. Comares, \nOct. 2012 \n \nC.2. Proyectos \n \nHe participado en otros 13 proyectos subvencionados (5 europeos, 5 nacionales y 3 \nde financiación privada). \n FP6 IST-2003-506946. VISNET (Networked audiovisual media technologies). \nUniversidad Aristóteles de Tesalónica. Inv. Principal: Ioannis Pitas. 2.2M€ (2003-05) \n FP7 IST-2004-511299. AXMEDIS (Automating Production of Cross Media Content for \nMulti-channel Distribution). Universitat Politècnica de Catalunya. Inv. Principal: Jaime \nDelgado. 8.4M€ (2005-08) \n FP7 IST-2006-038398 VISNET-II (Networked Audiovisual Media Technologies). Inv. \nPrincipal: Jaime Delgado 6.1M€ (2006-09) \n FP7 ICT-2011.6.6 - CP-IP-289067. SUPERHUB (SUstainable and PERsuasive Hu-\nman Users moBility in future cities). Barcelona Digital Centro Tecnológico. Inv. \nPrincipal: Marc Torrent. 9.8M€ (2011-14) \n",
  "speaker": "SYSTEM",
  "uuid": "43d77cda-7175-41f5-8b87-99a73e9b0250"
}