{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 13\n– Problemas de acceso a la información, de manera que una parte muy importante de\nla información no se puede descubrir porque las instituciones encargadas de hacerla\ndisponible no han concienciado todavía su obligación de hacerlo. La capacidad de\nacceso fácil a la información es fundamental para el establecimiento de un Espacio\nEuropeo Único de la Información. En la actual situación la información permanece\nalmacenada en “islas de información” de las que el sector privado no es conocedor,\no a las que no puede acceder, de manera que no se puede plantear siquiera una pro-\npuesta comercial de reutilización de la información. Para solucionar este problema\nsería necesario implicar en primer lugar a los organismos productores de la informa-\nción en un esfuerzo de estandarización, que posiblemente incluiría la utilización de\nmetadatos, así como de tecnologías derivadas de la Web 2.0 o de la Web Semántica.\nLa máxima expresión de estos esfuerzos sería la creación de repositorios de activos\nde información nacionales que proporcionaran un punto de acceso único a toda la\ninformación del sector público en un Estado miembro.\n– Existen algunos mercados asentados de la información del sector público, como los\námbitos legales, meteorológicos, geográficos, de créditos o viajes. Sin embargo, exis-\nten dificultades para el desarrollo de mercados fuera de estos ámbitos, debido a fac-\ntores como la sensación de riesgo percibida por las empresas en lo tocante al sector\npúblico en general, la feroz competencia que oponen determinadas instancias del sec-\ntor público y la falta de capacidad para prever con suficiente antelación los precios y\nlas condiciones de acceso. ePSIplus recomienda en este sentido la movilización del\nsector privado a través de iniciativas como la “PSI Alliance”14.\n– La actividad económica en torno al mercado de la información del sector público\ngenera ingresos indirectos para el Estado (en forma del impuesto de sociedades o su\nequivalente en otros Estados miembros, por ejemplo). Varios estudios mantienen que\nlos beneficios generados de esta forma son mucho mayores que los que se obtienen\nde la comercialización directa de la información por parte de entidades públicas. Sin\nembargo, para muchos ministerios es difícil afrontar el problema de aumentar las par-\ntidas presupuestarias necesarias para garantizar precios bajos (o incluso la gratuidad)\npara la información que generan. En este caso la recomendación de ePSIplus es la de\nque la Comisión Europea encabece el seguimiento de la actividad económica de al\nmenos un sector público de un Estado miembro de manera que se proporcionen datos\nconcretos sobre la viabilidad del modelo.\n– Existen dos debilidades estructurales en la Directiva que probablemente son fruto de\nla necesidad inicial de consenso para su aprobación. La primera de ellas está relacio-\nnada con el hecho de que la puesta a disposición de la información para su reutiliza-\nción es optativa, por lo que el éxito de la Directiva depende por completo de la volun-\ntad de los Estados miembros. La segunda hace referencia a los precios de la\ninformación, ya que la Directiva sólo establece que no deben superar los costes de\nrecolección, producción y diseminación más un “retorno razonable de la inversión”,\nlo que es a todas luces demasiado difuso. La recomendación de ePSIplus en este sen-\ntido se basa en que sea la Comisión la que proporcione su ayuda a los países miem-\nbros y que impulse el establecimiento de tarifas adecuadas, así como de condiciones\nde reutilización reguladas.\nASPECTOS DE LA DIRECTIVA DE 2003/98/CE DEL PARLAMENTO EUROPEO Y DEL CONSEJO…\n17\n14 La PSI Alliance es una organización que aglutina entidades del sector privado para impulsar las prácticas de comer-\ncio limpio con la información del sector público. Más información en: http://www.psialliance.eu/.\nBASES DE DATOS  1/1/04  03:39  Página 17\n",
  "speaker": "SYSTEM",
  "uuid": "43fd72b5-90ca-4894-9fce-b0e008af5b4e"
}