{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 88\nPage 88 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nFigure 37. Decision Tree for Selecting Activities \n4. Map the selected activities into the selected ontology network life cycle model.  \nFor carrying out this mapping, software developers and ontology practitioners should match the \nselected activity outputs against the requirements of the selected ONLCM.  \nSelected activities are employed in a phase or stage of the selected ONLCM to fulfil the \npurpose and outcomes of that phase. \nThis step provides an activity map or matrix for the ontology network development. More \ndetails on this step will be included in the next version of this deliverable (D5.3.2). \nOnce the activity matrix has been obtained, software developers and ontology practitioners \nshould verify that all the selected activities are fully mapped onto the selected ONLCM, and \nthat such matrix contains all of the activities needed for completing successfully their ontology \nnetwork project. \n5. Set the order of the activities: the result is the ontology network life cycle for the \nontology network.  \nAfter obtaining the activity map or matrix, software developers and ontology practitioners \nshould place in order the activities of this matrix, obtaining in this way the ontology network life \ncycle. \nThe order in which activities will be performed are determined by three major factors: \na) The selected ONLCM will dictate an initial ordering of activities.  \nb) Schedule constraints may require the overlapping of activities in the ONLCM and may thus \nimpact the ordering. In this case, activities may be mapped for parallel execution rather \nthan for serial execution. \nc) Selection and ordering of activities might be impacted by the entry and exit criteria of \nassociated activities. The availability of output information from one activity could affect the \nstart of another activity. The second activity might require, as inputs, one or more of the \noutputs of the first. \n \n",
  "speaker": "SYSTEM",
  "uuid": "43ff19af-c723-4e63-923d-944d42182041"
}