{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 71\n69\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nTrends for Professional Translation Technology\nThere are several trends affecting this sector: the transition from desktop to client/server and then to cloud\nbased (SaaS) services, the translation from licensed software to subscription (SaaS) business models, and the\ntrend toward integration solutions (for example, translation management systems that are integrated with\nweb publishing or CMS platforms). \nComputer aided translation tools have gone through three distinct phases of development since their incep‐\ntion. First generation tools were largely designed to be used as stand‐alone applications, largely due to the\nfact that network connectivity was limited at the time of their development, and due to the “low tech” his‐\ntory of the translation industry, as it predates the computing industry by far. Some of these tools, such as\nSDL/Trados, continue to thrive, and can be upgraded to interoperate with new cloud based translation plat‐\nforms.\nAs companies deployed local and wide area networks, and then later connected to the Internet, client/serv‐\ner CAT tools and systems became commonplace. These tools were developed during the 1990s, and mirror\nthe technologies available at the time. These systems enabled their operators to centralize the storage and\nmanagement of translation assets and project management, which enabled significant productivity gains in\ntranslation workflow. These tools were largely Windows based, and most utilized proprietary communica‐\ntion protocols for client/server communication.\nThe latest generation of CAT tools are largely cloud based SaaS (Software‐as‐a‐Service) offerings that elimi‐\nnate the need for the operator to own and manage on premise equipment. These services, many of them\ndeveloped by emerging companies such as XTM International and Smartling, are also built from the ground\nup around web based technologies, and are accessible from virtually any operating system or device. This is\na significant advantage over second generation tools, as they are largely tied to the Windows operating sys‐\ntem, and are not easily accessed via the web or mobile devices. \nFrom licensing to professional services and SaaS\nTranslation platforms have gone through a similar evolution from per‐seat perpetual licenses to profession‐\nal services and most recently, to a SaaS (Software‐as‐a‐Service) pricing model. \nEarly products were sold as shrink‐wrapped software, essentially a perpetual license based on the number\nof installed seats. Most software was packaged this way at that time, so this approach made sense in its day.\nSince then, small and large translation technology companies, from start‐ups to industry leaders like SDL, are\nshifting to SaaS pricing models.\nThese contracts are typically priced as monthly or annual subscriptions, with rates linked to one of several\nvariables, including: the number of words or segments stored in the system, translation volume, number of\ntarget languages, or number of active users. Transifex, for example, prices its localisation management serv‐\nice based on the number of words stored in its central repository. The pricing formula varies from company\nto company, but is generally linked to usage, storage or translation volume, so each customer pays based on\ntheir usage of the service. \nIntegration with content management systems\nLeading translation management systems, such as SDL World Server, are integrated with popular content\nmanagement systems, including Drupal, Sharepoint, and others. This has become a requirement as compa‐\nnies use CMS platforms to manage their source content, editorial and publishing workflows. Integrating with\nthese systems enables translation companies from re‐inventing tools that have already been done well by\nother companies.\n",
  "speaker": "SYSTEM",
  "uuid": "44617ac8-a170-4ead-9417-6e9f8f2f2950"
}