{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Vienajan2011 \n\nWe are looking for a full-time or part-time\nSoftware Application Engineer (f/m)\nto extend our development team in Vienna. You will work on a scalable distributed database for our web software, lowering response times for our users and integrating semantic functionalities into the system for advanced queries.\nIdeally you have the following technical skills:\n* Proficiency in Java and/or Python\n   * Experience in database development, data modeling, indexing, and distributed data management\n   * Familiarity with web technologies and Semantic Web standards\nYour background:\n* Familiarity with SCRUM and agile development methodologies\n   * Bachelor or Master of Science degree in computational intelligence, computer science or related fields\n   * Two years industry experience in application development\nYou can demonstrate:\n* Evidence based thinking: gathering data to make decisions\n   * Customer orientation: understanding customer's requirements and inputs\n   * Team based collaboration: bringing diverse ideas to shared problems\n   * Emphasis on delivery: ownership, execution and follow-through\n   * Self-starter: take initiative, drive consensus\n   * Think creatively: there is always a way to get there\n   * Good oral and written communication skills in English\n   * Ability to work in multi-site project teams\nWe offer:\n* an interesting, diversified occupation in a cutting-edge high-tech startup\n   * the possibility to significantly influence the software development process\n   * cooperation within a young, highly motivated and skilled team, and with renowned partners from industry and academia\n   * the entrepreneurial spirit of a Web startup company\nWe are looking forward to receiving your CV and cover letter in English or German and will invite you for a personal interview. Send your application and all other questions to jobs@gnowsis.com.",
  "speaker": "SYSTEM",
  "uuid": "458d4516-f9fc-4902-b1db-6fbd2f714a66"
}