{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nInstalación de la nueva versión de Sem4Tags en regulo (esta versión es para la cual se reportó la evaluación en el hito 6). Además, se migro el repositorio de significados a la nueva versión que contiene información de alrededor de 1500 etiquetas.\nSe actualizo la versión de DBpedia a la última versión liberada.\nSe modificó el mensaje para aquellas etiquetas que eran identificadas como Palabras_Vacías o StopWords, el nuevo mensaje dice: No se han encontrado entidades semánticas.\nLa próxima semana se trabajará en el caso de la etiqueta ESA y en la migración de la aplicación Web de prueba del servicio a Glassfish 3.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n. \nPrimeras pruebas con Gate para textos en español. Uso de TreeTagger. \nExploración de herramientas para detección de Named Entities.\nTarea 3. Modelo de anotación híbrido\n.\nInterfaz Anotación Híbrida\n\n- Se a terminado el widget de presentacion de llamada a Sig.ma, directamente sin utilizar servicio java de regulo. Por respuestas mas rapidas que hacerlo a traves del webservices que se encuentra en regulo.\n- Se prueba migrar todo el codigo realizado a Drupal, para la gestión social de la anotación.\n- De momento se han instalado en Drupal modulos RDF, SPARQL, OPENCALAIS, para proveer los servicios, implementados con gate.\n- Se analizará un plugin de mozilla RDFaDeveloper para obtener ideas para widgets de la interfaz.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el diseño e implementación de las pruebas a ejecutar.\nTarea 1.4\n\nBibliogafía\nRevisión de la última bibliografía publicada dentro del área de trabajo.\nTarea 7.1\n\n- RDF\n· Re-generación de RDF\n      · Carga de nuevos datos (estadística)\n      · Mejoras en el visualizador\n- Divulgación\n. Participación en el curso de verano Linked Data, una oportunidad o un riesgo? Organizado por la UPM - Curso de verano.",
  "speaker": "SYSTEM",
  "uuid": "458f106d-69ff-45ec-a6eb-34191933876d"
}