{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 8\n8\nMariano Rico, Óscar Corcho et al.\n(e.g., a media request, an event message, etc.). This last modi\u001ccation is done\nto inform the UPnP Remote Extension about the type of message that we are\nhandling, so that its processing can be done faster as it can be directed to the\nappropriate handler. The only exception to this modi\u001ccation is when URIs are\nalready global public URIs (eg. when we access a Media Server available in a\ndevice that is connected to the Internet and has a permanent public IP address).\nFig. 3 shows an example of these modi\u001ccations, and the process followed in\norder to retrieve a multimedia resource from a remote home. Let us imagine\nthat we are connected to a friend's home and we want to access the movie \u0010The\nGodfather\u0011, which is available in AVI format. The process is this:\n192.168.0.22\nhttp://192.168.0.22:50872/content/thegoodfather.avi\n192.168.0.22\n192.168.0.1\n192.168.116.4\n192.168.0.1\n192.168.116.4\nhttp://192.168.116.4:2345/Media/192.168.0.22-50872/content/\nthegoodfather.avi. \n192.168.116.5\nhttp://192.168.0.1:2346/Media/192.168.116.4-2345/Media/\n192.168.0.22-50872/content/thegoodfather.avi \n192.168.116.5\n192.168.0.1\n192.168.0.165\n1.\n2.\n3.\nFig. 3: Sample interaction and resource URI transformation across homes\n1. Our friend's computer is working as an UPnP Media Server. When we ask for\nthe location of the movie \u0010The Godfather\u0011 it returns http://192.168.0.22:\n50872/content/thegoodfather.avi.\n2. This response arrives at the UPnP Remote Extension of our friend's net-\nwork, which reads it and modi\u001ces the URI by adding the public IP ad-\ndress of our home network: http://192.168.116.4:2345/Media/192.168.\n0.22-50872/content/thegoodfather.avi. This is the public global URI\nthat will be used across home networks and to link with the metadata that\nwill be stored in metadata servers.\n3. When this package arrives to our UPnP Remote Extension, we add its private\nIP address, so that it can be handled by UPnP-enabled services as if it was\na local resource: http://192.168.0.1:2346/Media/192.168.116.4-2345/\nMedia/192.168.0.22-50872/content/thegoodfather.avi.\nAfter these steps, our local renderer receives a \u0010local\u0011 URI (the one generated\nin step 3) that can be directly converted into a physical location by our Home\nGateway. If we decide to play this movie, the UPnP Remote Extension will\nextract from this \u0010local\u0011 URI the IP address and port of our proxy, and the\nadditional information about the type of message, and will send the request to\nthe address speci\u001ced in the rest of the URI path.\n",
  "speaker": "SYSTEM",
  "uuid": "45e080eb-fb2c-4e1f-9515-b2156e80c0ed"
}