{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SEALS-EvaluatingClassifiers \n\nTuve muchos problemas siguiendo algunos de los ejemplos proporcionados debido a que no es claro donde se hace el enlace entre la versión de los datos y la colección.\nTambién tuve problemas porque no sabia que la propiedad hasName iba a ser el identificador de la colección. Pensé que era metadata y que podia contener cualquier cadena de caracteres.\nDe acuerdo a esta frase \"Please note, that, although, the test data represents a test suite, it is not describing using the Suite Ontology but using a ontology defined in WP10.\" no esta claro los datos de prueba se deben especificar con la ontologia del WP10, o si opcionalmente también se pueden describir con la Suite Ontology.\nTampoco sabia como se borran colecciones y versiones del repositorio?\nPara borrar colecciones se debe usar el sesame workbench (\nhttp://localhost:8080/openrdf-workbench/\n), seleccionar el repositorio testdata y borrar el correspondiente contexto con la opción\nclear\n.\nConsultas al repositorio de pruebas:\n\nOjo: depende de la versión del repositorio.\nRecuperar el RDF que describe el conjunto de casos de prueba (i.e., suite)\nhttp://.../tdrs-web/testdata/persistent/\n[collection name]/[version number]/suite/\ndonde [collection name] es el valor de\nseals:hasName\nasociado a la colección, y [version number] es el valor de\nseals:hasVersionNumber\nasociado a la versión de los datos. Así la url resultante es:\nhttp://localhost:8080/tdrs-web-1.1-b/testdata/persistent/Categorized+Theatre+Tweets/1.0/suite/\nRecuperar un data item (fichero de datos de prueba):\nhttp://seals.sti2.at/tdrs-web/testdata/persistent/\n[collection name]/[version number]/suite/[suite item identifier]/item/[item identifier]/\ndonde [collection name] y [version number] se definen de la manera descrita previamente y [suite item identifier] es el valor de\ndc:identifier\nasociado al test case (\nseals:SuiteItem\n) e [item identifier] es el valor de\ndc:identifier\nasociado al fichero de pruebas (\nseals:DataItem\n). Así la url es:\nhttp://localhost:8080/tdrs-web-1.1-b/testdata/persistent/Categorized+Theatre+Tweets/1.0/suite/suite+item+01/item/cirque_topics_01\nMejoras:\n\nSi se quiere hacer un dump del rdf de las pruebas para luego hacer consultas SPARQL las instancias de TestDataVersion y Suite deberian tener el mismo URI. Sin embargo esta relación no existe en la ontología.\nLa relación entre persistentTestData y TestDataVersion no esta explicita en la ontología. Esta relación solo es evidente en la URL de creación y de acceso a los datos de prueba.\nDefinición de ficheros de resultados",
  "speaker": "SYSTEM",
  "uuid": "469c3851-0344-4ebf-92da-e736e023b82e"
}