{
  "message": "SYSTEM: NeOn_Glossary_of_Processes_and_Activities.pdf: Página 3\n Ontology Pruning. It refers to the activity of discarding conceptual structures (e.g., part of T-Box) of \na given ontology that are not or no longer relevant. \nPruning can be used in combination with ontology learning methods to discard potentially irrelevant \nlearned concepts/relations. \n Ontology Quality Assurance [Gómez-Pérez et al., 2003]. It refers to the activity of assuring that \nthe quality of each and every process carried out and each an every product built (ontology, \nsoftware and documentation) is satisfactory.  \n Ontology Reengineering [Gómez-Pérez and Rojas-Amaya, 1999]. It refers to the process of \nretrieving and transforming a conceptual model of an implemented ontology into a new, more correct \nand more complete conceptual model, which is re-implemented. \n Ontology Repair. It refers to the activity of solving errors (incompleteness, incorrectness) in the \nontology. This activity is triggered by ontology diagnosis. \n \n Ontology Requirements Specification. It refers to the activity of collecting the requirements that \nthe ontology should fulfill (for example, reasons to build the ontology, identification of target groups \nand intended uses). Such requirements may be reached through a consensus process.  \n Non-Ontological Resource Reengineering. It refers to the process of retrieving and transforming \nan non-ontological resource1 (data bases, controlled vocabularies, etc.) into an ontology.  \nThis process could be compared with the ontology learning activity with the difference that in this \nactivity the knowledge is only transformed into conceptual structures, whereas in the process of \nreengineering non-ontological resources the sources can be transformed into conceptual structures \nand instance data. \n Non-Ontological Resource Reverse Engineering. It refers to the activity of analyzing a non-\nontological resource in order to identify its underlying components and creating a representation of \nthe resource at higher levels of abstraction. \n Non-Ontological Resource Transformation. It refers to the activity of generating an ontological \nmodel at different levels of abstraction from the non-ontological resource. \n Ontology Restructuring [Gómez-Pérez and Rojas Amaya, 1999]. It refers to the activity of \ncorrecting and reorganizing the knowledge contained in an initial conceptual model, and detecting \nmissing knowledge.  \nThis activity contains two different tasks: analysis and synthesis. The goal of the analysis is to \nevaluate the ontology technically, that is, to check that the hierarchy of the ontology and its classes, \ninstances, relations and functions are complete (contain all the definitions required for the domain of \nchemical substances), consistent (there are no contradictions in the ontology and with respect to the \nknowledge sources used), concise (there are no explicit and implicit redundancies) and syntactically \ncorrect. On the other hand, the synthesis task seeks to correct the ontology after the analysis phase \nand to document any changes made. \n Non-Ontological Resource Reuse. It refers to the process of taking the available non-ontological \nresources (data bases, controlled vocabularies, etc.) for the development of ontologies.  \n Ontological Resource Reuse. It is defined as the process of using available ontological resources2 \n(ontologies, modules, statements, or ontology design patterns) for solving different problems (e.g., \nthe development of different ontology-based applications, the activity of ontology aligning (as \nbackground knowledge  \n                                                 \n1 Non-ontological resource is defined as a knowledge resource whose semantics has not yet been formalized by means of an \nontology. Elements in this set are glossaries, dictionaries, lexicons, classification schemes and taxonomies, and thesauri. \n2 Ontological resource is defined as a set of elements extracted from a set of available ontologies in order to solve a need. \nElements from this set can be ontologies, ontology modules, ontology statements or ontology design patterns. \n",
  "speaker": "SYSTEM",
  "uuid": "471fc790-c383-4f74-8dd2-4a38dee8699e"
}