{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 5\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97730\nEn ningún caso podrá accederse a la fase de contrato en prácticas si se ha obtenido el \ntítulo de doctor en la fase de beca.\n3.  Los beneficiarios de ayudas de la presente convocatoria que cursen estudios \nde tercer ciclo regulados por el RD 1393/2007 deberán estar matriculados en el curso \n2010-2011 en el período investigador del doctorado. Salvo situaciones excepcionales por \ncausas graves de enfermedad del beneficiario o sustentador del mismo, el no cumplimiento \ndará lugar a la revocación de la beca.\n4.  Quienes accedan a la condición de beneficiarios de una ayuda en régimen de \nbeca como consecuencia de las renuncias previstas en el artículo 34.4 de la presente \nconvocatoria, disfrutarán igualmente hasta un máximo de 48 meses de ayuda desde la \nfecha de su incorporación al centro de adscripción de la ayuda, sin perjuicio de lo señalado \nen el párrafo segundo del punto 1 anterior.\nArtículo 7.  Transición del período de beca a contrato.\n1.  Cuando el beneficiario de la ayuda en período de beca, cumpla los requisitos para \npasar a contrato en prácticas, este deberá formalizarse de forma inmediata sin que exista \ninterrupción en la actividad.\n2.  Si al término del período de beca el beneficiario no cumpliera con los requisitos \npara formalizar el contrato en prácticas, tendrá un período máximo de cuatro meses para \npoder acreditarlo y durante el mismo el beneficiario no percibirá ninguna de las dotaciones \nde la ayuda.\nSi al término de dicho período de cuatro meses no acreditara los requisitos para poder \nser contratado, perderá los derechos a la continuidad de la ayuda.\nArtículo 8.  Derechos de los beneficiarios.\n1.  De manera general, los beneficiarios de ayudas del programa de FPU tendrán los \nsiguientes derechos:\na)  Obtener de los centros de adscripción a los que se incorporen la colaboración y \napoyo necesario para el desarrollo normal de sus estudios y programas de investigación, \nde acuerdo con las disponibilidades de aquellos.\nb)  Solicitar las ayudas de movilidad para estancias breves y traslados temporales de \nen los términos que se establecen en los capítulos V y VI de esta Orden.\nc)  Los restantes derechos establecidos en el artículo quinto del Real Decreto 63/2006, \npor el que se aprueba el Estatuto del personal investigador en formación.\nd)  Percibir la ayuda económica que corresponda a la ayuda en la forma establecida \nen la presente convocatoria.\ne)  Abono de los precios públicos de los créditos de los estudios de doctorado, de \nacuerdo con lo especificado en el capítulo VII de esta resolución de convocatoria.\nf)  Cobertura del Régimen General de la Seguridad Social, en los términos establecidos \nen la Disposición adicional primera del Real Decreto 63/2006, de 27 de enero, por el que \nse aprueba el Estatuto del personal investigador en formación.\n2.  Durante el período de contrato en prácticas que suscriban con el organismo o \ninstitución de adscripción de la ayuda, tendrán del mismo modo derecho a todos los \nbeneficios laborales y sociales inherentes al mismo.\nArtículo 9.  Obligaciones de los beneficiarios.\n1.  De manera general, el personal investigador en formación tendrá las siguientes \nobligaciones:\na)  Incorporarse a su centro de adscripción en el plazo establecido en el artículo 14.2 \nde la presente convocatoria.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "474af9b9-3f29-461b-aa6b-852ef6f184ac"
}