{
  "message": "SYSTEM: Mpoveda-CVA-Marzo-2016.pdf: Página 2\n\t\r  \n\t\r  \n2 \n \n\t\r  \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nactividades relacionadas con tecnologías semánticas. El español es su lengua materna y \ntambién habla inglés.  Además ha realizado tres estancias de investigación en centros \nextranjeros: 3 meses en la University of Liverpool (2011), 4 meses en la Free University of \nBerlin (2012) y 4 meses en la empresa Mondeca en Paris (2013).  \n \nEl principal resultado de su tesis doctoral es un sistema online para la evaluación de \nontologías llamado OOPS! (OntOlogy Pitfall Scanner! -  http://oops.linkeddata.es). OOPS! \nque ya ha sido ya utilizado en más de 50 países con más de 2000 ejecuciones, es una \nherramienta independiente del editor de ontologías empleado y realiza un mayor número de \ncomprobaciones automáticas que el resto de herramientas existentes. Además, se ha \nutilizado en distintas empresas internacionales como herramienta para evaluación de \nontologías y como material de soporte en procesos de formación. Por último, las \nfuncionalidades de OOPS! se han integrado en varios registros de ontologías y otros \nsistemas desarrollados por terceras partes. \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \n1. M. Poveda-Villalón, A. Gómez-Pérez, M.C. Suárez-Figueroa. “OOPS! (OntOlogy \nPitfall Scanner!): An On-line Tool for Ontology Evaluation”. International Journal on \nSemantic Web and Information Systems (IJSWIS). ISSN: 1552-6283. IGI Publishing. \nVolumen: 10(2) Páginas: 7-34. 2014. Índice impacto (2014): 0,903 \n2. M. Poveda-Villalón, M.C. Suárez-Figueroa, A. Gómez-Pérez. “Validating ontologies \nwith OOPS!.” 18th International Conference on Knowledge Engineering and \nKnowledge Management. En Knowledge Engineering and Knowledge Management. \nISBN: 978-3-642-33876-2. Volume:  7603 2012. Páginas: 267-281. Galway, Irlanda. 8 \nal 12 de octubre de 2012 \n3. Filip Radulovic, María Poveda-Villalón, Daniel Vila-Suero, Víctor Rodríguez-Doncel, \nRaúl García-Castro, Asunción Gómez-Pérez. “Guidelines for Linked Data generation \nand publication: An example in building energy consumption”. Automation in \nConstruction. ISSN: 0926-5805. ELSEVIER. Volumen: 57. Páginas: 178-187. 2015. \nÍndice impacto (2014): 1.812 \n4. Pierre-Yves Vandenbussche, Ghislain A. Atemezing, María Poveda-Villalón, Bernard \nVatant. “Linked Open Vocabularies (LOV): a gateway to reusable semantic \nvocabularies on the Web”. Semantic Web Journal. ISSN: \n1570-0844. \nELSEVIER. \nAceptado para publicación. \n5. M. Poveda-Villalón, M.C. Suárez-Figueroa, A. Gómez-Pérez. “Common Pitfalls in \nOntology Development”. Current Topics in Artficial Intelligence. 13th Conference of \nthe Spanish Association for Artificial Intelligence, CAEPIA 2009, Seville, Spain, \nNovember 9-13, 2009, Selected Papers. ISBN: 978-3-642-14264-2. Volumen: LNAI \n5988/2010. Páginas: 91- 100. 2010. Springer-Verlag \n6. C.M. Keet, M.C. Suárez-Figueroa, M. Poveda-Villalón. ”Pitfalls in Ontologies and \nTIPS to Prevent Them”. In Knowledge Discovery, Knowledge Engineering and \nKnowledge Management. ISBN: 978-3-662-46549-3. Volumen: 454. Páginas: 115-\n131. 2015.  Springer-Verlag \n7. A. Gómez-Pérez, M. Poveda-Villalón, M.C. Suárez-Figueroa. “Ontologías, Datos \nEnlazados (Linked Data) y Web Semántica”. Capítulo en libro: Big intelligence. \nNuevas capacidades big data para los sistemas de vigilancia Estratégica e \nInteligencia Competitiva. ISBN: 978-84-15061-61-8. Páginas: 112-131. 2015. \n8. C.M. Keet, M.C. Suárez-Figueroa, M. Poveda-Villalón. “The Current Landscape of \nPitfalls in Ontologies” 5th International Conference on Knowledge Engineering and \nOntology Development (KEOD2013). En Proceedings of the 5th International \nConference on Knowledge Engineering and Ontology Development. ISBN: 978-989-\n8565-81-5. Volume: 1. Páginas: 132-139. Vilamoura, Algarve, Portugal. 19 al 22 de \nSeptiembre de 2013 \n9. M. Poveda-Villalón, B. Vatant, M.C. Suárez-Figueroa, A. Gómez-Pérez. “Detecting \nGood Practices and Pitfalls when Publishing Vocabularies on the Web”. 4th \nWorkshop on Ontology Pattern (WOP2013) Workshop at the 12th International \n",
  "speaker": "SYSTEM",
  "uuid": "479fb7b1-aac3-40b5-86cc-59f844f4e719"
}