{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Proyectos_Fin_de_Carrera \n\nExtension de VoID y desarrollo de un generador de descripciones VoID\n. Responsable: Mari Carmen. El trabajo consta de dos partes: (1) extension del vocabulario VoID para representar conocimiento relacionado con criterios de reutilizacion de ontologías (VoID-Re) y (2) desarrollo de un generador de descripciones VoID-Re a partir de datos en formato tabular.\n[Propuesto en Septiembre de 2012].\nDesarrollo de una herramienta de especificación de requisitos de una ontología\n. Responsable: Mari Carmen. El trabajo consistirá en crear un plug-in (para Protege y/o NeOn toolkit) que permita especificar los requisitos de una ontologia. [Revisado Junio 2014]\nDesarrollo de una aplicación web para seleccionar las ontologías más adecuadas en base a una serie de criterios\n. Responsable: Mari Carmen [Propuesto Junio 2014]\nDesarrollo de ontología de competencias educativas\n. Responsable: Mari Carmen [Propuesto Junio 2014]\nDesarrollo de ontología de títulos de grado\n. Responsable: Mari Carmen [Propuesto Junio 2014]\nDesarrollo de ontología de títulos de posgrado (máster)\n. Responsable: Mari Carmen [Propuesto Junio 2014]\nDesarrollo de ontología de títulos de posgrado (doctorado)\n. Responsable: Mari Carmen [Propuesto Junio 2014]\nMejora de OOPS! con técnicas lingüisticas\n. Responsables: Mari Carmen y María [Propuesto Junio 2014]\nAplicación de escritorio para OOPS!\n. Responsables: Mari Carmen y María [Propuesto Junio 2014]\nIntegración de OOPS! en Protege\n. Responsables: Mari Carmen y María [Propuesto Junio 2014] --> Primera versión ya desarrollada (Septiembre 2017)\nGestor web de políticas y licencias en RDF\n. Responsable: Víctor + X [Propuesto Noviembre 2014]\nSemantic Web\n\nImplement RDFHarvester\n(Responsable: Raúl García Castro) RDFHarvester is a tool that crawls documents and extracts the RDF content in them. Documents can be structured or non-structured, online or offline. [Propuesto Junio 2014]\nCreación de graphical interface para R2RML generation\n(Responsable: Oscar Corcho). [Propuesto en Septiembre 2013]\nMultilingual MIRROR\n(una herramienta que genera una ontologia que refleja el structure de un BBDD y genera default R2RML mappings con possibilidad de definir las idiomas de BBDD y la ontologia).\nHerramienta de creación de RDFa\n(Responsable: Oscar Corcho). [Propuesto en Septiembre 2013]\nPlataforma de comercio de datos con tecnologías semánticas\n(Responsable: Víctor Rodríguez) [Propuesto en Septiembre 2013]\nEn los últimos años, se han publicado en la red conjuntos de datos\nexpresados en RDF cuyo valor es explotable comercialmente, pero que han\ncarecido de las plataformas adecuadas para su intercambio.  La\ntraslación de las licencias actuales (CreativeCommons etc.) a su forma\nen RDF, junto con su extension para soportar modelos de negocio no\nexclusivamente abiertos podría crear un ecosistema de datos donde se\ncreen, publiquen, consulten y consuman datos en confianza y beneficiando\na todas las partes. El proyectista deberá construir algunos de los servicios para la\nimplementación de una plataforma que encarne esta idea, habiendo de ser\ncapaz de generar e interpretar expresiones de derechos en RDF, y\ndesarrollar prototipos de servicios web. Requisitos:\n- Creatividad e interés por aprender tecnologías nuevas\n- Familiaridad con los conceptos de RDF y la web semántica\n- Capacidad para desarrollar servicios web, escritos en Java\nGeneración de RDF desde OpenStreetMap (creación automática consultas OverpassQL) dado un vocabulario (OWL)\n(Responsables: Carlos Badenes-Olmedo, Esteban Gonzalez, Fernando Serena, Nandana Mihindukulasooriya y Oscar Corcho). [Propuesto en Octubre 2016]\nDado un vocabulario, el sistema construiría y ejecutaría consultas OverpassQL optimizadas sobre OpenStreetMap para extraer todas las posibles instancias que identifique en una región dada, y transformarlas en RDF (siguiendo el vocabulario dado).\nNosotros identificamos dos partes diferenciadas en esta propuesta: la primera construiría las consultas OverpassQL, y la segunda generaría RDF a partir de los resultados de las consultas. Siendo el vocabulario dado el factor común en ambas partes.\nAprendizaje de ontologías desde tipologías de Nodo en OpenStreetMap\n(Responsables: Carlos Badenes-Olmedo, Esteban Gonzalez, Fernando Serena, Nandana Mihindukulasooriya y Oscar Corcho). [Propuesto en Octubre 2016]\nEn OpenStreetMap se manejan recursos georeferenciados en forma de nodos + atributos.  La propuesta busca aprender un modelo conceptual a partir un conjunto nodos  que pueden ser identificados por una serie de atributos o filtrados previamente por un area. No debería quedarse únicamente en transformar los atributos del nodo en propiedades del concepto en la ontología, debería consensuar un modelo a partir de todas las anotaciones.  Por ejemplo, construir una ontología que describa los nodos etiquetados con `highway=streetlight`.  El sistema podría apoyarse en las recomendaciones descritas en la wiki de OpenStreetMap (\nhttp://wiki.openstreetmap.org/wiki/Key:highway\n).\nAplicación Web de Visualización de Corpus documentales basado en Tecnologías Semánticas\n(Responsable: Carlos Badenes-Olmedo).[Propuesto Julio 2018]\nCreación de un frontal web que permita explorar el contenido de grandes colecciones de documentos mediante la carga online de archivos en múltiples formatos (inicialmente PDF). Se integrará con servicios externos mediante peticiones HTTP-Rest y tendrá respaldo en un sistema de almacenamiento de documentos (Solr o Elasticsearch).\nSemantics and Big Data\n\nExtension of morph-streams with streaming systems like Spark, Google Big Query, Apache Samza, etc.\n(Oscar Corcho) [Propuesto en septiembre 2013]\nDevelopment of an RDF Stream processing framework that combines static and dynamic data. In this thesis, existing frameworks for RDF Stream processing that are being described in the context of the W3C RDF Stream Processing community group will be analysed, so as to select the most suitable framework to start with for the consideration of the combination of static and dynamic RDF data that can be useful for the development of applications in the context of Smart Cities.\nExploiting REST interfaces for query federation over Linked Data streams. In this thesis, existing work on RDF query processing over Linked Data (such as the Linked Data Fragments framework) will be enhanced with the implementation of physical query operators that respect the REST nature of Linked Data interfaces while at the same time provide efficient query processing for static and dynamic RDF data.\nLinked Connections for more efficient public transport routing. Linked Connections is a joint effort with the University of Ghent that has recently received the best demo award at the ISWC2015 conference, and which aims at exploiting REST interfaces for the provision of information about connections that can be done in multimodal transport routes. A set of utilities are expected to be developed in the context of this thesis in order to improve the current framework and extend it to more places in the world where transport data is available (normally in the form of GTFS files, but also as real-time feeds).\nPerfiles de investigadores a partir de sus publicaciones\n(Carlos Badenes-Olmedo): Uso de técnicas de modelado de tópicos junto con PLN y Word Embeddings para la construcción de modelos que permitan caracterizar a los investigadores a partir de sus publicaciones científicas.\nVisualización de tópicos, tendencias y evoluciones en corpus de gran tamaño\n(Carlos Badenes-Olmedo): Construcción de un sistema web que permita explorar las anotaciones derivadas de los modelos de tópicos generados a partir de corpus de gran tamaño.\nSemantics and Big Data",
  "speaker": "SYSTEM",
  "uuid": "47e946c0-5dc9-4d17-8962-7128549479c9"
}