{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 56\nPage 56 of 124\nNeOn Integrated Project EU-IST-027595\nscheme items are subClassOf.\n• PR-NOR-CLTX-02. Pattern for re-engineering a classiﬁcation scheme which follows the adjacency list\ndata model, into a taxonomy. In that case, the semantics of the relations between classiﬁcation scheme\nitems are subClassOf.\n• PR-NOR-CLTX-03. Pattern for re-engineering a classiﬁcation scheme which follows the snowﬂake data\nmodel, into a taxonomy. In that case, the semantics of the relations between classiﬁcation scheme\nitems are subClassOf.\n• PR-NOR-CLTX-04. Pattern for re-engineering a classiﬁcation scheme which follows the ﬂattened data\nmodel, into a taxonomy. In that case, the semantics of the relations between classiﬁcation scheme\nitems are subClassOf.\n• PR-NOR-CLLO-03. Pattern for re-engineering a classiﬁcation scheme which follows the snowﬂake\ndata model, into a lightweight ontology. In that case, which the semantics of the relations between\nclassiﬁcation scheme items are subClassOf, and ad-hoc relations.\n• PR-NOR-CLLO-04. Pattern for re-engineering a classiﬁcation scheme which follows the ﬂattened data\nmodel, into a lightweight ontology. In that case, which the semantics of the relations between classiﬁ-\ncation scheme items are subClassOf, and ad-hoc relations.\n4.3.1\nPatterns for Re-engineering Classiﬁcation Schemes into Taxonomies\nIn this section we present four re-engineering patterns for re-engineering classiﬁcation schemes into tax-\nonomies. Since a taxonomy [SFBG+07] is a hierarchical structure of classes only related by subsumption\nrelations, these patterns follow the transformation approach, mentioned in section 2.2.2, for transforming re-\nsource content into an ontology schema, because it is the suitable for dealing with the resource data models\nand the target taxonomies.\nPR-NOR-CLTX-01. Pattern for re-engineering a classiﬁcation scheme which follows the path enumer-\nation data model\nThe pattern for re-engineering non-ontological resource shown in Table 4.1 suggests a guide to transform\na classiﬁcation scheme into an ontology. The classiﬁcation scheme is modeled/represented with a path\nenumeration data model. This pattern aims at creating a taxonomy from the classiﬁcation scheme, being the\nsemantics of the relations between classiﬁcation scheme items the subClassOf relationship.\nTable 4.1: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\npath enumeration data model\nSlot\nValue\nGeneral Information\nName\nClassiﬁcation scheme to Taxonomy (path enumeration model)\nIdentiﬁer\nPR-NOR-CLTX-01\nType of Component\nPattern for Re-engineering Non-Ontological Resource (PR-NOR)\nUse Case\nGeneral\nRe-engineering a classiﬁcation scheme which follows the path enumeration model to design\na taxonomy.\nExample\nSuppose that someone wants to build an ontology based on the International Standard Clas-\nsiﬁcation of Occupations (for European Union purposes) ISCO-88 (COM). This classiﬁcation\nscheme follows the path enumeration data model.\nPattern for Re-engineering Non-Ontological Resource\nINPUT: Resource to be Re-engineered\n",
  "speaker": "SYSTEM",
  "uuid": "482c13fa-c4c5-4375-a127-ba6bba69694d"
}