{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_accidentes_de_trabajo \n\n(Este procedimiento ha sido aprobado por el Comité de Seguridad y Salud de la Universidad Politécnica de Madrid en su reunión celebrada el día 14/07/2009).\nCon objeto de minimizar las consecuencias que provoca un accidente acaecido en cualquier Centro de la UPM y asegurar una rápida respuesta en la atención al accidentado, se establece el presente procedimiento interno de actuación para conocimiento de todas las personas que conforman la comunidad universitaria.\nContents\n[\nhide\n]\n1\nActuación en caso de accidente grave o muy grave\n2\nActuación en caso de accidente leve\n3\nConsideraciones generales\n4\nDocumentación a presentar en la UPM\n5\nInformación de las enfermerías existentes en el Campus de Montegancedo\nActuación en caso de accidente grave o muy grave\n\n1. Hacer seguro el lugar, tanto para el accidentado como para la persona que le atienda, alejando al accidentado y a uno mismo del peligro. Por ejemplo: no atenderemos a un electrocutado sin antes desconectar la corriente causante del accidente; no atenderemos al intoxicado sin antes proteger nuestras vías respiratorias.\n2.Llamar al Servicio de Emergencias (tlf. 112), indicando el lugar y la dirección de la urgencia y explicando de forma clara los hechos ocurridos. Se deberá actuar conforme las indicaciones que señalen los Servicios de Urgencias. En aquellos Centros de la UPM que dispongan de Enfermería, se avisará al ATS/DUE para que se persone en el lugar y preste los primeros auxilios hasta la llegada de los Servicios de Urgencias.\n3. Se avisará a la Conserjería del Centro, para que a la llegada de los servicios de emergencias, faciliten el acceso y orienten a la ambulancia hasta el lugar del accidente.\n4. El responsable de la Unidad/ Laboratorio, Taller etc. donde se haya producido el accidente o, en ausencia de este, quien haya dado aviso al Servicio de Emergencias, avisará, lo mas rápidamente posible, al Servicio de Prevención de Riesgos Laborales de la Universidad (Extensiones 3812 / 5907).\nActuación en caso de accidente leve\n\n1. En aquellos Centros de la UPM que dispongan de Enfermería, se avisará al ATS/DUE para que el accidentado reciba la primera asistencia.\n2. En el caso de que el Centro no tenga Enfermería, el accidentado deberá dirigirse a:\nTrabajadores de MUFACE: al centro hospitalario que le corresponda, en función de su pertenencia al INSS o a la entidad médica que tenga concertada el trabajador. Más información en:\n| Conciertos de MUFACE\nTrabajadores del Régimen General de la Seguridad Social - Mutua FREMAP: al centro hospitalario o asistencial de FREMAP más próximo al lugar del accidente. Más información en:\n| Centros de FREMAP en Madrid\nAlumnos menores de 28 años (Seguro Escolar): al Centro de Salud Pública que correspondas. Más información en:\n| Seguro escolar\nConsideraciones generales\n\n1. Accidente de trabajo: es toda lesión corporal que el trabajador sufra con ocasión o por consecuencia del trabajo que ejecute por cuenta ajena, incluidos aquellos que sufra el trabajador al ir o al volver del lugar de trabajo, denominados “in itinere”.\n2. Accidente escolar: es toda lesión corporal que sufra el asegurado con ocasión de actividades directa o indirectamente relacionadas con su condición de estudiante, incluidas las deportivas, asambleas, viajes de estudios, de prácticas o de fin de carrera y similares, siempre que estas actividades hayan sido organizadas o autorizadas por los Centros de Enseñanza. Se precisa que el alumno tenga menos de 28 años, si bien el seguro escolar cubrirá todo el año escolar en el que el estudiante cumpla dicha edad.\n3. Parte de comunicación de accidente: con la finalidad de hacer posible la investigación de los accidentes ocurridos, ya sea muy graves, graves o leves, y corregir las causas para que no vuelvan a suceder, el responsable de la Unidad/ Laboratorio, Taller…donde se haya producido el accidente, cumplimentará el Parte de Comunicación de Accidente que se acompaña como anexo, y lo remitirá, dentro de las 48 horas, al Servicio de Prevención de Riesgos Laborales de la UPM\n[1]\nDocumentación a presentar en la UPM\n\nIndependientemente del parte de comunicación de accidente referido en el apartado anterior, el trabajador que haya sufrido un accidente, con o sin baja, deberá remitir a su Centro de destino y en el menor plazo posible, el informe médico que le haya proporcionado el centro o entidad que le prestó la asistencia.\nInformación de las enfermerías existentes en el Campus de Montegancedo\n\ntlf. 91 336 16 28\nFacultad de Informática, Bloque IV, Planta Sótano, sala LC-4S02 Horario: de lunes a viernes; de 09:00-13:00 y de 16:00-20:00 horas, excepto festivos y el mes de agosto.\nEl alumnado, profesorado y el PAS de la Facultad de Informática, que sufra un accidente en el recinto, podrán dirigirse al Hospital Montepríncipe, previa autorización expresa de la dirección de la Facultad.",
  "speaker": "SYSTEM",
  "uuid": "48ef0cc7-bbd9-4c0f-a939-0ec95b88fda8"
}