{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 10\nBodil Nistrup Madsen & Hanne Erdman Thomsen  \n \n10\n \nWith one exception all types of ontologies are found at the same level, hav-\ning the top concept ontology as immediately superordinate concept, but be-\nlonging to different groups, each characterized by their own subdividing cri-\nteria. This means that it would be possible to describe one ontology as a sub-\ntype of several ontologies, e.g. an ontology could at the same time be a for-\nmal ontology and an ontology with type relations.  \nThere is one explicit case of such a polyhierarchy in Figure 9: the concept \napplication specific ontology is a subconcept of both domain specific ontol-\nogy and task specific ontology, and inherits both characteristics “DOMAIN: \nspecific” and “PURPOSE: specific”. In our view this is a better structure than \nthe one found in Figure 3, where task ontology, domain ontology and general \nontology are coordinate concepts at the same level, belonging to the same \nsubdivision criterion.  \nAccording to the ontology in Figure 9, an ontology may at the same time \nbe a top-level ontology and a general ontology, since these two concepts are \nsubordinate concepts of two superordinate concepts, that belong to two dif-\nferent subdivision criteria. In our understanding a top-level ontology com-\nprises general concepts with a view to level, while a general ontology com-\nprises concepts that belong to general language, and not domain specific lan-\nguage. \nThe concept universal ontology constitutes a special case, since it may \ncomprise both a top-level ontology and a specific ontology. \n \n4 Comparison with the ontologies in section 2 \n \nThe concepts at the lowest level in Figure 3, i.e. the subconcepts of task \nontology and domain ontology, remain subconcepts of these concepts in Fig-\nure 9. \nThe concept meta ontology in Figure 3, based on Mizoguchi et al. (1995), \ncorresponds to the concept knowledge representation ontology in Figures 4 \nand 8, based on van Heijst at al. (1997) and Gómez-Pérez et al. (2003) re-\nspectively. In our opinion the term meta ontology is more descriptive than \nknowledge representation ontology, and the characteristic in Figure 9 better \ndescribes the concept (“ISSUE OF CONCEPTUALIZATION: meta con-\ncepts”).  \nIn our understanding the concept content ontology in Figure 3 corresponds \nto the concept knowledge modelling ontology in van Heijst et al. (1997), cf. \nFigure 4 and our ontology in Figure 9. However, it is somewhat difficult to \ntell from the descriptions of the concept in Mizoguchi et al. (1995) and van \nHeijst et al. (1997). \n",
  "speaker": "SYSTEM",
  "uuid": "49aff4e2-778d-45e9-87c0-8cf21eab4ae8"
}