{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Normas_para_estancias_dependientes_de_cada_pa%C3%ADs \n\nInformación para viajar a EEUU\n\nSi el viaje es breve (inferior a 9 días) el correspondiente visado es el\nB-1\n. (Puede que uno de turismo valga\ncomprobar alguien que sepa más\n)\nSi se va a estar un tiempo inferior a 90 días los ciudadanos de bastantes países, principalmente Europeos e incluyendo España, pueden hacer uso del programa de\nexención de visado\n. Es necesario presentar un billete de ida y vuelta que se corresponda con el tiempo que se va a estar y llegar a los EEUU con una\ncompañía\nque haya suscrito el acuerdo con el Servicio de Nacionalidad e Inmigración.\nPara estancias superiores a 90 días, como estudiantes, hay principalmente dos visados a considerar, el\nJ-1\n(aun más información en\n[1]\n) y el\nF-1\n.\nCon respecto al J-1 igualmente se pide para un periodo de tiempo determinado, pero es posible llegar hasta 30 días antes y permanecer 30 días después de su finalización. Requiere el pago de\ntasas asociadas\n(se puede realizar\nonline\n) y la institución a la que se vaya a viajar debe rellenar y presentar el documento\nDS 2019\npreviamente a la solicitud del visado, no hay plantilla para este documento, se genera con\nSEVIS\n. Con esto y el resto de la\ndocumentación requerida\nes posible solicitar el visado en la\nembajada de Madrid\n. Es importante tener en cuenta también los\ntiempos\nque puede requerir la obtención de un visado.\nCon respecto al F-1, el tiempo de gracia en lugar de 30 días son 60 días. No tiene la cláusula que restringe la obtención de otros visados por dos años y el formulario a rellenar en lugar del DS-2019 es el I-20. Sin embargo es para estudiantes de instituto, etc. para investigadores de intercambio el correspondiente es el J-1, así que la combinación de circunstancias que puedan permitir obtener el F-1 es poco probable. Por lo demás son prácticamente iguales, aunque se recomienda comprobar información más detallada y actualizada en los enlaces suministrados.\nConcretamente los pasos para obtener el visado J-1 son los siguientes:\nObtener el formulario DS-2019, ha de emitirlo la institución receptora.\nPagar con eso las tasas de emisión, puede hacerse\nonline\ncon tarjeta o puede enviarse un cheque, lo tienen que sellar en el banco.\n...\nAsistir a la entrevista con toda la\ndocumentación necesaria\n.",
  "speaker": "SYSTEM",
  "uuid": "4a181652-0425-47d4-a905-b5ea02d7837b"
}