{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Art%C3%ADculos_relacionados_con_el_data_provenance \n\nAutores :\nYolanda Gil y Donovan Artz.\nFecha :\nDiciembre 2007, Universidad de California del Sur.\nArtículo que quizá no está muy relacionado con el provenance, puesto que se centra en cómo clasificar de manera óptima la información disponible cuando un usuario reliza una busqueda en la Web. No se centra sólo en el contenido de la información, (como hacen la mayoría de los modelos\nexistentes), sino que se tiene en cuenta las circunstancias que rodean a la fuente.\nPara ello, se distingue entre la \"Confianza de entidad\",(juicio de confianza de una entidad basándose en su identidad y comportamiento), y \"Confianza de contenido\"(juicio de confianza de una información concreta en un contexto dado), resaltando la dificultad de gestionar ambos debido al carácter subjetivo que tienen y su dependencia del contexto.\nPero ¿cuáles son los factores que influyen determinantemente en la confianza sobre el contenido? En el artículo se exponen hasta 19, desde el tópico del que se está tratando, su popularidad, la autoridad de la fuente (no es lo mismo si un gobierno da la información que si es un señor anónimo), recomendación, provenance (si la fuente es fiable, el contenido adquiere fiabilidad), hasta lo reciente que es el contenido o la falta de otras fuentes con las que comparar la información.\nSin embargo, muchos de estos factores son parecidos, y se agrupan en 4 grupos principales: Autoridad, Fuentes asociadas (las relaciones de una fuente con otras influye en su confianza), Provenance y Bias (capacidad de una fuente de omitir información para parecer más fiable).\nModelo propuesto :\nSe toma un recurso r como la unidad básica de contenido, cualquier cosa que pueda ser referenciado por una URI. Cada recurso es representado por un subset de todas las asociaciones A. Cada miembro de A es representado mediante una tupla, <ar,ae>, que contiene la relación de la asociación \"ar\" y la entidad asociada \"ae\".\nSe definen varias funciones, cada una de las cuales devuelve un valor representativo de la confianza. El rango de todas ellas es t, que puede ser discreto o continuo, (por ejemplo, puede ser un set con los valores, confianza, desconfianza y neutralidad).\nUAT: user association trust,(la confianza de un usuario en una asociación para una consulta especícica): Q,A,U->t, donde Q es el grupo de queries, A, las asociaciones y U los usuarios.\nURT: user resource trust,(la decisión sobre la confianza de un usuario se calcula partir de las decisiones de las asociaciones de la fuente para una consulta dada): QRU->t\nAT: association trust,(confianza global de una asociación): Q,A->t\nRT: resource trust, (confianza global en un recurso): Q,R->t. Se deriva de URT.\nERT: estimated resource trust, (confianza estimada del recurso): mapedada por la función Q,R->t.\nEAT: estimated association trust, (confianza estimada en la asociación): Q,A->t\nCada recurso o fuente tiene una puntuación de relevancia, s^q:R->O, donde O es el set de valores que pueden ser usados para efectuar el ránking de recursos.\nEn último lugar, se presentan varios casos de uso donde aplicar el modelo, demostrando mediante los resultados el funcionamiento del mismo. Sin embargo, se hace hincapié en que se necesita más investigación en el área, puesto que los casos de uso propuestos puede que no sean los suficientemente genéricos como para dar por concluido el problema. Además hay que tener en cuenta que la web semántica no será sólo usada por personas, sino por razonadores y agentes que también seleccionan las fuentes en función de su confianza.\nConceptos reutilizables del estado del arte de los proyectos mIO! y España Virtual\n\nEn el estado del arte de España Virtual no he encontrado nada que creo que sea aplicable al data provenance.\nEn el estado del arte de mIO! me parece que el punto 1.1, \"Computación sensible al contexto\", aunque no trata directamente del data provenance, puede ser interesante nombrarlo. Plantea que el contexto en el que se ejecutan las acciones cambia, y como el provenance al final es un sistema mediante el cual podemos recuperar las acciones pasadas, es importante almacenar también el contexto en el que se ejecutan.\nDe no ser así, si recuperamos con éxito las acciones que un determinado usuario efectuó en un momento dado, pero no sabemos en qué contexto se ejecutaron, los resultados que se producirían si las volviéramos a reproducir podrían ser totalmente opuestos.\nProblem-Solving Methods for understanding Process Executions\n\nAutores :\nJose Manuel Gómez-Pérez y Oscar Corcho\nFecha :\n2008, iSOCO, Universidad Politécnica de Madrid y Universidad de Machester\nPaper donde se realiza una descripción del problema existente con el provenance dada la cantidad de datos que se han de manejar, y cómo el usuario que los va a usar no tiene porqué saber nada acerca de todo el sistema que gestiona dichos datos.\nSe usan los métodos de resolución de problemas (en inglés PSMs), para dotar al provenance de varios niveles de abstracción. La idea es que se interpreten los eventos pasados en vez de modelarlos. Los PSMs definen cuatro tipos de recursos de conocimiento:\nTareas: Describen lo que un proceso va a conseguir\nPSMs: Describen cómo un proceso consigue llevar a cabo una tarea, es decir, su estrategia, cómo se debe descomponer en subtareas, etc\nModelos de dominios: Describen el dominio particular al que aplicar las tareas y PSMs.\nOntologías: Dotan al resto de la semántica necesaria.\nTambién podemos representar los PSMs en 3 vistas: la vista de interacción, (que viene a ser una perspectiva de caja negra), la vista de flujo de conocimiento, (que indica cómo se intercambia la información entre subtareas), y la vista de descomposición, (donde se puede ver cómo el PSM se divide en subtareas).\nSe presenta KOPE, (\"Knowledge-Oriented Provenance Environment\"), como un sistema que el usuario puede instalar para analizar los logs del provenance. Su arquitectura se divide en 3 bloques principales: una infraestructura provenance para documentar y consultar la información acerca de los procesos, un editor PSM para que los usuarios gestionen las librerías PSM y ontologías, y el motor KOPE, que usa los métodos en las librerías PSM y las ontologías para analizar las distintas ejecuciones de los procesos.\nEn último lugar, se narra la participación de KOPE en el \"Provenance Challenge\", con el doble objetivo de evaluar su interoperabilidad con otros sistemas provenance, (como PASOA, en el cual está basado), y para probar su capacidad de análisis, (analizando la ejecución del workflow del atlas del cerebro (brain atlas workflow's execution)). Los resultados fueron positivos, ya que KOPE describió el proceso de creación del atlas del cerebro con un nivel 3 de refinamiento sobre 4.\nValidation of E-Science Experiments using a Provenance-based Approach (presentación)",
  "speaker": "SYSTEM",
  "uuid": "4a310250-35b6-4715-865e-ba8f36bb07de"
}