{
  "message": "SYSTEM: Wiki: Calendar 2015\n\nDate\nPlace\nSpeaker\nTopic\nJanuary 29\nAndrés\nSesión de lluvia de ideas para un proyecto de Detección del Fraude en seguros de coches)\nFebruary 5\nH-1003\nOscar, Asun, Mariano, Jorge, Dani V.,\npresentaciones cortas de los proyectos actualmente en evaluación (ETNs, ETSA, Wisdom, Alexandria, WD4R, etc.)\nFebruary 12\nH-1003\nOscar\n¿Qué hacemos en Localidata? (a partir de las 12:00, pues tengo phone call hasta entonces)\nFebruary 19\nH-1003\nMaría y Dani G\nvocab.linkeddata.es and others? Minutes:\nhttps://www.evernote.com/l/AEFt06X8w4VGYavHGSeNmL-msLvdG-TrzQc\nFebruary 26\nH-1003\nDragan Djuric, Nikola Milikic (Universidad de Belgrado)\npresentaciones cortas del grupo de investigación de Belgrado\nMarch 26\nH-1003\nMarie Claude L'Homme. Visiting professor from U. Montreal.  Head of \"l'Observatoire de linguistique Sens-Texte (OLST)\"\nPresentación de su grupo de trabajo y de los proyectos que han hecho\nApril 9\nH-1003\nJorge Gracia\nApertium RDF, linking bilingual dictionaries on the Web of Data\n[1]\nApril 16 (10:00)\nH-1003\nJohn McCrae. University of Bielefeld, Germany\nLinghub: Harmonizing Heterogeneous Metadata about Language Resources\nApril 16 (11:00)\nH-1003\nAsun + Nandana + Apuntate\nDiagnose and Repair Linked Data\nVictor: presentación de los trabajos de D&R  sobre licencias\n   Dani V: presentacion de los trabajos de D& R sobre el analisis de lenguajes\n   María: qué se puede exportar/aprovechar de opps!\n   Raul : modelo para determinar la calidad de un data set\n   Dani V: Como usar los datos de la BNE para reparar datos de otras fuentes.\n   Mariano Rico: aplicar estas ideas de D&R para mejorar la esDBpedia\n   Mariano Rico Como usar wikidata para reparar esDbpedia.\n   Filip: como aplicar los modelos de selección a la selección de un data set\n   A. Llaves: detection of missing observations in sensor data sets with stream processing.\n   Rafa: Ontology Learning\n   Piensa cómo aquellas técnicas en las que eres especialista se pueden utilizar para D&R un dataset.\nApril 23\nH-1003\n...\n...\nApril 30\nH-1003\n...\n...\nMayo 7\nH-1003\nAlejandro Llaves\nPresentación sobre la estancia en CSIRO - RDF Stream Processing\nMayo 14\nH-1003\nAlferov Eugene\nResearch interests and report of the internship work in OEG during the last 2 months\nMayo 21\nH-1003\nPablo Calleja\nReconocimiento de enfermedades en fichas técnicas de medicamentos y su anotación a SNOMED-CT\nMayo 28\nH-1003\nPierre Matri\nTýr, towards a distributed, transactional and fault-tolerant BLOB storage system for clouds.\nJunio 4\n...\n...\n...\nJunio 11\n...\n...\n...\nJunio 18\n...\nFreddy Priyatna\nMIRROR: Automatic R2RML Mapping Generation from Relational Databases\n[2]\nJunio 25\n...\n...\n...\nJulio 2\nA-3203 15:00\nAhmad Alobaid\nIntroducing OnToology: a tool for collaborative development of ontologies using GitHub.\nJulio 30\nA-3203 11:30\nRosángelis\nUsing GeoKettle and TripleGeo to generate GeoSPARQL\nSeptiembre 10\nH-1003 11:00\nOlga Giraldo / J.A.R.G.\nSMART Protocols: current work / Protocolos de funcionamiento\nSeptiembre 17\nH-1003\nVictor Rodriguez\nConditional Linked Data Server\nSeptiembre 24\nH-1003\nFreddy, Dani, Carlos / Miquel Colobrán (invitado UPC)\nEDBT Summary (Overview and problems in Graph databases), Miquel's PhD thesis topic. Using Ontologies in security modeling (20 minutes)\nOctubre 1\nH-1003\nNandana, Raul, Maria\nLoupe\nOctubre 15\nH-1003\nMariano Rico\nLemonade Tools and LODTrooper status\nOctubre 22\nH-1003\nAlejandro Llaves\nVirtual clusters for (RDF) stream processing\nOctubre 29\nH-1003\nFilip Radulovic\nA generic Web application for recommendations (RIDER-WebApp)\nNoviembre 5\n?\nAsun\nODI\nNoviembre 12\n?\nVadim Ermolayev\nGravitation and Fitness in Ontology Dynamics\n(Slides)\nNoviembre 26\n?\nDaniel Garijo\nPráctica para defensa de tesis: Mining Abstractions in Scientific Workflows.\n2 diciembre\nH-1001\nÓscar Muñoz\nDEFENSA DE TESIS: \"Methods and techniques for segmentation of consumers in socialmedia\"\n3 diciembre\nH-1001\nDaniel Garijo\nDEFENSA DE TESIS: \"Mining Abstractions in Scientific Workflows\"\n10 diciembre\nH-1003\nZhijia Fang (East China University of Science and Technology)\nZhisi.me in the LLOD cloud\n17 diciembre\nH-1001\nJosé Mora\nDEFENSA DE TESIS: \"\"\n18 diciembre\nH-1001\nFreddy Priyatna\nDEFENSA DE TESIS: \"Methods and Techniques for the Generation and Efficient Exploitation of RDB2RDF Mappings\"",
  "speaker": "SYSTEM",
  "uuid": "4a3c0260-ee7b-4b70-a47b-749379eb0b34"
}