{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 55\n53\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nLegend: very low, low, moderate, high, very high\nSpeech Technology Value Chain\nThe following graphs present the value chain for Speech Technologies as well as for the different speech\ntechnological components and tools. This value chain also represents the value of speech technologies when\noften implemented for high throughput in operations.\nLack of standardi-\nzation and shared\nresources\nLinguistic and audio data resources are usually expen-\nsive or no shared by companies. LT companies must\nrecreate the required resources inhibiting a faster time-\nto-market and the proper market development.\nModerate\nShort-term\nInhibitor\n\n\nLT Consolidation\nLT are mature and are living a progressively conver-\ngence not only between them but also with other tech-\nnologies such as content analytics, In-memory process-\ning, in-database analytics, search-based applications,\nnon-row databases, and non-SQL analytics.\nHigh\nLong-term\nAccelerator\n\n\nAccuracy\nSpeech technologies can be considered mature as they\nhave 90% accuracy. This performance is helping the\nmarket to growth whenever a solid business case is\nfound.\nModerate\nShort-term\nAccelerator\n\n\nBusiness solutions\nawareness\nAlthough business applications for call centres are well-\nknow, there still exists ignorance regarding the potential\nuses for speech in other industries. Speech vendors\nshould increase the awareness of new business cases.\nModerate \nMedium-\nterm\nInhibitor\n\n\nBiometrics massifi-\ncation\nThe performance of speaker verification products, and\nthe ubiquity of digital access, is also boosting take-up in\nbiometrics.\nHigh\nMedium-\nterm\nAccelerator\n\n\nSpeaker adaptive\ntechnology maturity\nThe highly costs of speaker adaptive technology are an\nimportant factor to deliver new business value proposi-\ntions. Whenever the cost will be reduced (using for\nexample Cloud), the market will be able to boost its\ngrowth.\nHigh\nMedium-\nterm\nAccelerator\n\n\nLabour supply\nTalent scarcity\nThe availability and the skill level of talent have a direct\nimpact on LT markets such as speech, translation or\nintelligent content. Whilst in the previous decades, the\nLT talent scarcity has been covered by IT experts, the\ncurrent availability may inhibit adoption rates and mar-\nket development and growth.\nModerate\nMedium-\nterm\nInhibitor\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "4ab96453-417c-4c33-a033-a53224fe252e"
}