{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 3\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 3 de 42 \n11  INTRODUCCIÓN\nINTRODUCCIÓN  \nEl Ontology Engineering Group (OEG) de la Universidad Politécnica de Madrid es uno de los \ncentros de referencia en Ingeniería Ontológica y Datos Enlazados de Europa. Creado en 1995 \npor Dña. Asunción Gómez Pérez a su regreso de la Universidad de Stanford (USA), es el \nprimer grupo especializado en esta temática que se creó en España. Desde entonces, el grupo \nha participado exitosamente en numerosos proyectos de I+D+i financiados por la Comisión \nEuropea, en proyectos del Plan Nacional y en proyectos con financiación privada, siendo el \ngrupo de referencia en español en esta temática a nivel mundial. Actualmente el grupo ocupa el \noctavo lugar de los más de doscientos grupos de investigación reconocidos en la \nUniversidad Politécnica de Madrid.  \nEntre los últimos hitos conseguidos, merece destacarse, por un lado, el proyecto de \ninvestigación IBM-Watson en el contexto de la convocatoria Shared University Research (SUR) \nAwards competitiva a nivel mundial. Por otro lado ha obtenido la  Primera sede del Open Data \nInstitute en España: ODI-Madrid \n1.1 \nRecursos humanos \nEl Grupo de Ingeniería Ontológica (Ontology Engineering Group) está integrado por \ninvestigadores de áreas de conocimiento complementarias: Ontologías, Ingeniería Lingüística, \nLingüística Computacional, Integración Semántica de Datos, Datos Enlazados e Internet del \nFuturo. El grupo está formado por 39 miembros, de los cuales la mitad (21) son doctores. \nLos miembros del grupo son técnicos, ingenieros y especialistas (personal con máster y \ndoctorados) con dilatada experiencia, y está preparado para dar respuesta a todas las \nexpectativas depositadas en esta solicitud. La sección 2.1 incluye el listado de personas. \n• \nCatedráticos: 3 \n• \nDoctores: 17 \no \n2 profesores titulares \no \n3 contratado doctor \no \n2 ayudantes doctor \no \n1 Marie Curie \no \n2 Juan de la Cierva incorporación \no \n7 doctores contratados por proyectos \n• \nDoctorandos: 11 (8 contratados y 3 becarios) \n• \nPersonal de gestión: 2 \n• \nAdministrador de sistemas: 1 \n• \nIngeniero software: 3 \n• \nImagen y publicidad: 1 \n1.2 \nProyectos del OEG \nDesde finales de los años noventa, el grupo ha participado en numerosos proyectos de I+D+i \nfinanciados por la Comunidad Europea, en proyectos del Plan Nacional y en proyectos con \nfinanciación privada, con excelentes resultados. \nEl número de proyectos y la financiación obtenida por el profesorado del OEG en el marco de \nlos Planes Nacionales, en convocatorias públicas competitivas internacionales y en contratos \ncon entidades públicas o privadas en ámbito no competitivo nacional e internacional, muestra \nque las investigaciones, desarrollos y productos de innovación realizados por el OEG en \nlas áreas de Ontologías, Web semántica y Datos Enlazados tienen solvencia científica y \ntecnológica, y ofrecen grandes aplicaciones para la industria. \nA continuación se aportan datos concretos sobre proyectos de investigación y financiación, \nobtenidos por el OEG así como las instituciones nacionales e internacionales con las que ha \ncolaborado. La sección 2.2 incluye la relación  de proyectos de los últimos cinco años. \n",
  "speaker": "SYSTEM",
  "uuid": "4acc85d2-7e90-4a0c-aad7-c1cc38934d78"
}