{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master-TI-10-11 \n\nEsta página incluye información para alumnos del máster de tecnologías de la información.\nContents\n[\nhide\n]\n1\nObjetivos de la asignatura\n2\nProgramación docente y materiales\n3\nPrácticas\n3.1\nEnunciado\n3.1.1\nNormas de entrega\n3.1.2\nSoftware a utilizar y documentación adicional\n4\nEvaluation\n5\nOfertas de trabajo relacionadas\nObjetivos de la asignatura\n\n[\nDescripción\n]\nProgramación docente y materiales\n\nEl aula en el que se impartirán las clases es el 3103, y el horario será de 19:00 a 21:00.\n30/09/2010. Introducción (Asun)\n[1]\n07/10/2010. Terminología en lingüística computacional (Lupe)\n[2]\n14/10/2010. Introducción a la representación de Conocimientos\n[3]\n, Redes Semánticas\n[4]\ny  Fundamentos sobre ontologías\n[5]\n(Asun)\n21/10/2010. Lenguajes de Ontologías. RDF(S) (Oscar)\n[6]\nEjemplos RDF(S)\n28/10/2010. Lenguajes de Ontologías. SPARQL (Oscar)\n[7]\nDBPedia SPARQL Endpoint\n4/11/2010. Metodologías (I): Introducción, especificación y búsqueda de recursos (Asun)\n[8]\n11/11/2010. Metodologías (II): Ciclo de Vida y Planificación (Mari Carmen)\n[9]\n; Reutilización de patrones de diseño (Mari Carmen)\n[10]\n.\n25/11/2010. Metodologías (III): Reutilización de recursos no ontológicos y Conceptualización(Asun)\n[11]\nNOR2O overview and an example\n[12]\n2/12/2010. La Web de Datos: Generación (I) (Oscar, Boris)\n[13]\n9/12/2010. La Web de Datos: Enlaces (II) (Oscar, Boris)\n[14]\n. Nota: Mirar los enlaces que incluyen la información acordada la última clase.\n16/12/2010. Resolución de dudas sobre la práctica a realizar (Asun)\n[15]\nEjemplos SCOVO y Geometria\n13/1/2011. OWL (Oscar)\n[16]\nEjemplo\n20/1/2011. Aplicaciones de ontologías (Asun)\n3/2/2011. Examen de la asignatura. Aula 3203. 17:00-19:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\nxx/xx/2011. Examen de la asignatura. Aula xxx. xx:00-x:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\nPrácticas\n\nTodas las prácticas (entregas parciales o final) se deben entregar por correo electrónico a masterTI10@delicias.dia.fi.upm.es.\nLas fechas son:\nxx/xx/2010: Entrega de la práctica sobre RDF(S) y SPARQL\n22/11/2010: Entrega de la Ontología\n15/12/2010: Entrega de los datos en RDF\n12/01/2011: Entrega de los enlaces con otros recursos\nDía previo al examen de la asignatura: Práctica completa\nEnunciado\n\nSe debe diseñar una ontología, que debe ser implementada en el lenguaje RDF(S), que represente la información correspondiente a alguno de los bancos de datos gratuitos y de libre disposición que están disponibles en las páginas Web del Ministerio de Educación y Ciencia o de Universidades, y que están disponibles en diversos formatos (Microsoft Excel, PDF, ficheros ASCII, etc.). Una vez creada la ontología, se deben transformar los datos almacenados en los diferentes bancos de datos a RDF y se deben enlazar  con otras datos disponibles en la Web, como las de DBPedia [1], GeoLinkedData [2] o GeoNames [3]. También se pueden utilizar buscadores genéricos como sig.ma [4]. Finalmente, un vocabulario que puede ser de utilidad para la representación de estadísticas, en caso de que se consideren útiles, puede ser SCOVO [5].\nNormas de entrega\n\nLa práctica deberá ser enviada a la cuenta de correo electrónico de la asignatura el día fijado, como muy tarde a las 23:59. Si no se ha recibido confirmación explícita de la recepción de la práctica, los alumnos se deberán poner en contacto con el profesor de la asignatura lo más pronto posible.\nSe deberá adjuntar un fichero comprimido con el nombre Práctica_YY_XXX.zip, donde YY es el número de práctica y XXX es el nombre y apellidos de uno de los autores de la práctica. El fichero contendrá la siguiente información:\nFichero “autores.txt” con los nombres y apellidos, y número de matrícula, de cada uno de los alumnos.\nFichero “memoria.pdf”, con la memoria de la práctica, que no debe exceder 5 páginas, donde se deberán incluir las principales decisiones tomadas\nFichero “recursos.rdf” con la implementación de la ontología, los datos en RDF o los enlaces, según proceda.\nSoftware a utilizar y documentación adicional\n\nPara la implementación de la red semántica se puede utilizar cualquier software que permita la edición de ficheros de texto o la gestión de datos en el formato RDF, tanto desde una interfaz de usuario (por ejemplo, la herramienta RDF Gravity [6]) como a través de una interfaz de programación (por ejemplo, Jena [7]). También se pueden utilizar herramientas de transformación de recursos disponibles en hojas de cálculo a RDF, como la librería NOR2O [8], que está integrada en herramientas como NeOn Toolkit [9].\nEn las horas de tutoría de práctica no se atenderán dudas básicas relacionadas con estos sistemas, pues los alumnos deben ser capaces de leer la documentación asociada a los mismos, sino sólo dudas que pueden estar relacionadas con el diseño de la ontología y el proceso de transformación.\n[1]\nhttp://www.w3.org/RDF/\n[2] W3C RDB2RDF Working Group - Current Status\nhttp://www.w3.org/2001/sw/rdb2rdf/status/2010/\n[3] La información relativa a la versión actual de la LOD Cloud diagram\nhttp://richard.cyganiak.de/2007/10/lod/\n[4] La información de los datasets\nhttp://ckan.net/\n[5] Lista de Datasets en la LOD Cloud\nhttp://www4.wiwiss.fu-berlin.de/lodcloud/\n[6]\nhttp://www.mma.es/portal/secciones/biodiversidad/montes_politica_forestal/estadisticas_forestal/indice_estadisticas_forestales_2007.htm\n[7]\nhttp://dbpedia.org/\n[8]\nhttp://geo.linkeddata.es/\n[9]\nhttp://www.geonames.org/\n[10]\nhttp://sig.ma/\n[11]\nhttp://purl.org/NET/scovo#\n[12]\nhttp://semweb.salzburgresearch.at/apps/rdf-gravity/\n[13]\nhttp://jena.sourceforge.net/\n[14]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[15]\nhttp://www.neon-toolkit.org/\nEvaluation\n\nLa evaluación se realizará en base a: trabajo semanal y participación (10%), práctica de RDF(S)y SPARQL (10%) Construcción de la ontología(15%), Enlazado de datos(15%) y trabajo final realizado (50%)\nLos trabajos parciales serán entregados en las fechas indicadas. Estos trabajos permitirán se integrarán y mejorarán en un trabajo final que se presentará oralmente el día correspondiente al examen de la asignatura.\nEnvía tus trabajos al siguiente email\nmasterTI10@delicias.dia.fi.upm.es\nOfertas de trabajo relacionadas",
  "speaker": "SYSTEM",
  "uuid": "4afc4db9-147d-45f1-941e-aec251b9466f"
}