{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 13\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 13 of 124\nChapter 2\nState of the Art\nDuring the last years, the research community has been very active in the ontology engineering ﬁeld, and\nmore recently, in reusing and re-engineering knowledge-aware resources for building ontologies rather than\nbuilding them from scratch. In this document knowledge-aware resources include classiﬁcation schemes,\nthesauri, lexica, and folksonomies. The aim of this deliverable is to look for new methods, techniques, and\ntools for reusing and re-engineering the terminology contained in the available knowledge-aware resources.\nIn this chapter we present a comparative study of the most outstanding methods and tools for re-engineering\nnon-ontological resources into ontologies. To carry out this study we have established a common framework\nwith which to compare the main characteristics of the different methods and tools. This chapter is partially\nbased on the D2.2.1 [SAd+07], and includes additional research works not considered in D2.2.1.\nThe chapter is organized as follows: ﬁrst we present the non-ontological resource typology. In section 2.2,\nwe introduce a framework for evaluating the methods and tools employed for re-engineering non-ontological\nresources. Section 2.3 describes the methods for re-engineering non-ontological resources. Section 2.4\ndeals with the tools available for re-engineering non-ontological resources. Finally, section 2.5 presents the\nresults and conclusions of the methods and tools evaluated.\n2.1\nTypes of Non-Ontological Resources\nNon-ontological resources (NORs), which were deﬁned in D5.4.1 [SFdCB+08], are knowledge-aware re-\nsources whose semantics have not been formalized yet by an ontology. There is a big amount of non-\nontological resources that embody knowledge about some particular domains and that represent some de-\ngree of consensus for a user community. These resources are present the form of textual corpora, classiﬁca-\ntions, thesauri, lexicons and folksonomies, among others. Non-ontological resources have related semantics\nthat allows interpreting the knowledge they contain. Regardless of whether the semantics is explicit or not,\nthe main problem is that the semantics of non-ontological resources is not always formalized, and this lack of\nformalization prevents them from being used as ontologies. Using the non-ontological resources as ontolo-\ngies can have several beneﬁts, e.g. interoperability, browsing/searching, and reuse among others.\nThe analysis of the literature has revealed that there are different ways of categorizing non-ontological re-\nsources [MS01, SAd+07, GPS98, Hod00]. Thus Maedche et al. [MS01] and Sabou et al. [SAd+07] clas-\nsify non-ontological resources into unstructured (e.g. free text), semi-structured (e.g. folksonomies) and\nstructured (e.g. databases) resources; whereas Gangemi et al. [GPS98] distinguish catalogues of normal-\nized terms, glossed catalogues, and taxonomies; ﬁnally, Hodge [Hod00] proposes characteristics such as\nstructure, complexity, relationships among terms, and historical functions for classifying them. However, an\naccepted and agreed on typology of non-ontological resources does not exist yet.\nIn this deliverable we have updated the previous typology presented in D5.4.1 [SFdCB+08], included dictio-\nnaries within the lexicon category. The categorization of non-ontological resources is presented according to\nthree different features: (1) the type of non-ontological resource, which refers to the type of inner organiza-\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "4c03dc72-aff8-46b1-b23c-a7b15b2ac6c2"
}