{
  "message": "SYSTEM: Wiki: Presentación de GeoBuddies en el congreso sobre turismo en Galicia\n\nhttp://www.conselleriaiei.org/dxt/turismoetic/programa.html\nEl objetivo de esta reunión será presentar el primer prototipo de GeoBuddies para darlo a conocer entre clientes potenciales (que podrían servir para hacer las pruebas de usuarios) y para estudiar la posibilidad de conseguir proyectos de continuación/alternativos con esta tecnología.\nEl prototipo 1 que se mostrará contendrá las siguientes funcionalidades: interfaz de usuario, también en ausencia de conexión, búsquedas geoespaciales (zona de influencia), mostrar mapas y fotos.\nSería interesante analizar zonas de Galicia que se puedan mostrar y que tengan información variada e interesante para la audiencia, así como incluir fuentes de datos de hoteles y hostales, para que sea más fácil “enganchar” al público.\nEl prototipo no incluirá (aunque se dirá que está en proceso de desarrollo y en algunos casos ya hecho) las siguientes funcionalidades: recomendaciones, tagging inteligente, conexión a las bases de datos del IGN, envío de vídeos y fotos, y mostrar rutas.\nAcciones:\nOscar: inscribirse al congreso\nOscar: crear un primer script de la demo a preparar (21/11/2008)\nManuel: crear una primera presentación (21/11/2008)\nManuel y Asun: contactar con sus OTRIs respectivas para analizar cómo realizar el proceso de protección de software.\nVíctor y Roi: probar todos los servicios e integrar con el proxy.\nOtros temas\n\nInterfaces adicionales (iPhone, Android, Web)\n: se acordó que esto no estaba presupuestado, y que por tanto iba a ser difícil hacerlo en el contexto del proyecto, pero que podía ser parte de lo que se incluyera en proyectos de explotación adicionales. UPM buscará a algún alumno para hacer una interfaz Web más o menos tradicional (si es bueno, se podría financiar una Web más estilo 2.0), y Roi mandará una hoja de descripción de por qué es mejor trabajar con Nokias que con iPhones o Android, por si es necesario justificarlo cuando se hable frente al Ministerio. En el momento en que tuviéramos un interfaz iPhone se podría poner disponible en iTunes para que la gente lo descargara pagando una cantidad pequeña.\nUso de linked data\n: claramente sí, se incluirán todos los datos que se pueda.\nUso de Amazon S3 y similares\n. Oscar comentó que es una tendencia cada vez más común en Inglaterra y otros países, y que es la mejor manera de escalar rápidamente si es necesario a un bajo coste. No se tomó ninguna decisión sobre su utilidad para GeoBuddies.\nSiguiente reunión (enero)\n: hay que preparar una agenda rápidamente con una parte pública de unas dos horas, donde esté presente el IGN, y luego reuniones paralelas si es necesario, en las que en algunas podría trabajar el IGN también.\nComentarios adicionales\n: Asun comentó la importancia de entender claramente qué significa tener una foto georeferenciada: ¿es donde la foto se hizo o lo que representa la foto? Ejemplo: una foto de Santiago desde el Monte do Gozo. Quizás sea interesante guardar también dirección y distancia.",
  "speaker": "SYSTEM",
  "uuid": "4c06c5ef-ce1f-4e87-82a8-4122f808ca7c"
}