{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 13\nvery, very bad for a long while; it was a very desperate struggle as you well know. And our success, I think,\n\u0005\ngave us courage and self confidence; that's why you see, beginning in the late forties through the fifties, a\n\u0017\ntremendous productivity at the labs which was stimulated from the earlier times. Because many of us were\n\f\nearlier forced to learn other things - we were forced to learn the things we didn't want to learn, we were\n\b\nforced to have an open door - and then we could exploit those things we learned. It is true, and I can't do\nanything about it; I cannot blame the present generation either. It's just a fact.\n\t\nQuestion: Is there something management could or should do?\nHamming: Management can do very little. If you want to talk about managing research, that's a totally\ndifferent talk. I'd take another hour doing that. This talk is about how the individual gets very successful\n \nresearch done in spite of anything the management does or in spite of any other opposition. And how do\n\u0018\nyou do it? Just as I observe people doing it. It's just that simple and that hard!\n!\nQuestion: Is brainstorming a daily process?\nHamming: Once that was a very popular thing, but it seems not to have paid off. For myself I find it\ndesirable to talk to other people; but a session of brainstorming is seldom worthwhile. I do go in to strictly\n \ntalk to somebody and say, ``Look, I think there has to be something here. Here's what I think I see ...'' and\n\f\nthen begin talking back and forth. But you want to pick capable people. To use another analogy, you know\n\f\nthe idea called the `critical mass.' If you have enough stuff you have critical mass. There is also the idea I\n\f\nused to call `sound absorbers'. When you get too many sound absorbers, you give out an idea and they\n-\nmerely say, ``Yes, yes, yes.'' What you want to do is get that critical mass in action; ``Yes, that reminds me\nof so and so,'' or, ``Have you thought about that or this?'' When you talk to other people, you want to get rid\n\u000e\nof those sound absorbers who are nice people but merely say, ``Oh yes,'' and to find those who will\n\u000e\nstimulate you right back.\n\u0006\nFor example, you couldn't talk to John Pierce without being stimulated very quickly. There were a group of\n/\nother people I used to talk with. For example there was Ed Gilbert; I used to go down to his office regularly\n\u000e\nand ask him questions and listen and come back stimulated. I picked my people carefully with whom I did\n\t\nor whom I didn't brainstorm because the sound absorbers are a curse. They are just nice guys; they fill the\n\u000e\nwhole space and they contribute nothing except they absorb ideas and the new ideas just die away instead\n\nof echoing on. Yes, I find it necessary to talk to people. I think people with closed doors fail to do this so\n\u000e\nthey fail to get their ideas sharpened, such as ``Did you ever notice something over here?'' I never knew\n\f\nanything about it - I can go over and look. Somebody points the way. On my visit here, I have already\n\t\nfound several books that I must read when I get home. I talk to people and ask questions when I think they\ncan answer me and give me clues that I do not know about. I go out and look!\n\u0007\nQuestion: What kind of tradeoffs did you make in allocating your time for reading and writing and actually\ndoing research?\n \nHamming:\n2\n I believed, in my early days, that you should spend at least as much time in the polish and\npresentation as you did in the original research. Now at least 50% of the time must go for the presentation.\n\u000f\nIt's a big, big number.\nQuestion: How much effort should go into library work?\nHamming:\n2\n It depends upon the field. I will say this about it. There was a fellow at Bell Labs, a very, very,\nsmart guy. He was always in the library; he read everything. If you wanted references, you went to him and\n\u0006\nhe gave you all kinds of references. But in the middle of forming these theories, I formed a proposition:\n\u001a\nthere would be no effect named after him in the long run. He is now retired from Bell Labs and is an\n\f\nAdjunct Professor. He was very valuable; I'm not questioning that. He wrote some very good Physical\nReview articles; but there's no effect named after him because he read too much. If you read all the time\nwhat other people have done you will think the way they thought. If you want to think new thoughts that\n\nare different, then do what a lot of creative people do - get the problem reasonably clear and then refuse to\n\t\nlook at any answers until you've thought the problem through carefully how you would do it, how you\n%\ncould slightly change the problem to be the correct one. So yes, you need to keep up. You need to keep up\n\u0007\nmore to find out what the problems are than to read to find the solutions. The reading is necessary to know\nwhat is going on and what is possible. But reading to get the solutions does not seem to be the way to do\n\n",
  "speaker": "SYSTEM",
  "uuid": "4c2539ac-1a23-45b5-b587-e140e525b035"
}