{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 24\n24\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\nProof. Let D′ be the database obtained from D by adding a fact neq(c1,c2), for each\npair of distinct constants c1 and c2 that appear in dom(D), where neq is an auxiliary\npredicate symbol not occurring in R. The union of Boolean CQs Q is constructed as\nfollows: for every KD key(r) = [m] ∈ΣK, where r/n ∈R (without loss of generality\nwe assume the ﬁrst m < n attributes to form the key), and for each j ∈{m+1,...,n},\nwe add to Q the Boolean CQ p ←r(X,Ym+1,...,Yn),r(X,Zm+1,...,Zn),neq(Yj,Zj),\nwhere X = X1,...,Xm.\nIn the case where both R and Σ are arbitrary, then D′ and Q can be constructed\nin polynomial time. In particular, the number of atoms that we add in D is less than\n(|dom(D)|)2, while the number of Boolean CQs that we construct is |ΣK|. Now,\nin the case where both R and Σ are ﬁxed, the required atoms can be obtained by\nevaluating the ﬁrst-order query\nconst(Xi) ←W\nr/n∈R\nW\ni∈[n] ∃X1 ...∃Xi−1∃Xi+1 ...∃Xn r(X1,...,Xn),\nneq(X,Y) ←const(X)∧const(Y)∧X ̸= Y,\nover the database D, which is feasible in AC0 in data complexity [33]. The above\nﬁrst-order query depends only on the schema R, and thus can be constructed in\nconstant time. Obviously Q can be constructed in constant time. It is not difﬁcult to\nshow that chase(D,Σ) fails if and only if ⟨⟩∈Q(chase(D′,ΣT)).\nNotice that in the proof of the above result the fact that the TGDs and the KDs\nare part of a set of CDs is not needed. This implies that the above lemma holds\nfor arbitrary TGDs and KDs. By exploiting Lemma 1.2 and Theorems 1.4, 1.6, 1.7\nand 1.8, it is not difﬁcult to establish the exact data and combined complexity of CQ\nanswering.\nCorollary 1.2. CQ-Ans under non-conﬂicting CDs is in AC0 in data complexity,\nand PSPACE-complete in combined complexity. Also, CQ-Ans under non-conﬂicting\nIPCDs and BACDs is NP-complete in combined complexity.\n1.6 Adding Negative Constraints\nNegative constraints (NCs) of the form ϕ(X) →⊥(see Subsection 1.2.3) can be\nused in order to express several relevant constructs in ER+ schemata, e.g., disjoint-\nness between entities and relationships, and non-participation of entities to relation-\nships, but also more general ones. The new conceptual model which arises is called\nER+\n⊥. In fact, an ER+\n⊥schema C is an ER+ schema with an additional set Σ⊥of\nNCs over R, where R is the relational schema associated to C .\nExample 1.8. Consider the ER+ schema C obtained from the one in Example\n1.2 (see Figure 1.1) by adding the entity Pension scheme and a relationship En-\nrolled among Member and Pension scheme, without any cardinality constraints.\nThe fact that students and professors are disjoint sets can be represented with the\n",
  "speaker": "SYSTEM",
  "uuid": "4c2e797e-a203-404f-909b-f5ff21d92a0e"
}