{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 22\nPage 22 of 124\nNeOn Integrated Project EU-IST-027595\n– Bottom-up learning of association links (A-links). In this step WordNet glosses (natural language\ndeﬁnitions) are analysed and A-links, between a synset and the synsets in its gloss, are created.\nFor each gloss the following tasks are performed: (1) POS-tagging of glosses with the ARIOSTO\nNatural Language processor, and extraction of relevant words; (2) disambiguation of glosses by\nan algorithm; and (3) creation of explicit association links (A-links) from synsets.\n– Top-down learning. In this step the foundational top ontology DOLCE is used to interpret A-links\n(i.e. association links) in terms of axiomatic conceptual relations. This is a technique partly\nautomatic that involves generating solutions on the basis of the available axioms and creating a\nspecialized partition of the axioms in order to capture more domain-speciﬁc knowledge. In this\nstep a description-logic classiﬁer, e.g. LOOM14, is used.\nThe method manages one single ontology. The generated ontology components are classes, at-\ntributes, and relations and the ontology is implemented in DAML+OIL.\nMethods for Transforming Thesauri into Ontologies\nThe six main methods for transforming thesauri are presented in [Hah03, HS03, vAMSW04, vAMMS06,\nWSWS01, HVTS08, SLL+04, LS06]. They are described next.\n• Hahn et al. in [Hah03, HS03] present a method that extracts conceptual knowledge from an informal\nmedical thesaurus, UMLS15, and semi-automatically converts this conceptual knowledge into a for-\nmal description logics, LOOM16. It is an interesting to note that this method join the massive coverage\noffered by informal medical terminologies with the high level of expressiveness and reasoning capabil-\nities supported by rigid knowledge representation systems in order to develop formally solid medical\nknowledge bases on a larger scale. The authors formalize a model of partonomic reasoning that does\nnot exceed the expressiveness of the well-understood concept language ALC17. Hahn et al. aim to\nextract conceptual knowledge from two major subdomains of the UMLS, anatomy and pathology, in\norder to construct a formally sound knowledge base based on ALC-type description logic language.\nHahn et al.’s method follows the approach used for transforming resource content into an ontology\nschema, and employs an ad-hoc wrapper for the transformation. In the whole transformation process\nthe ontology engineer has to take decisions relating to the syntax and semantics of the resulting\nrepresentation. This method contemplates how symbols are structured in the non-ontological re-\nsource and ontology formats, and the semantic interpretation of the resource elements when deﬁning\ntransformations to ontology elements. It also contemplates the internal data model of the thesaurus.\nThe method provides a description of how the resource data is represented and accessed for the trans-\nformation; however, it does not provide the resource provenance information, so the resultant ontology\ndoes not keep the reference to the thesaurus. This method consists of the following steps:\n– Automatic generation of terminological expressions. Terminological axioms at the level of de-\nscription logics are generated from the relational table structures (MS Access) imported from\nUMLS (ASCII ﬁles). In this step relations such as partOf/hasPart, isA or hasLocation are taken\ninto account. For partonomic modelling, Ontology Design Patterns are used.\n– Automatic consistency checking by the LOOM classiﬁer. The raw knowledge base is then im-\nmediately checked by the description logic classiﬁer to see whether it contains deﬁnitional cycles\nand inconsistencies.\n14http://www.isi.edu/isd/LOOM/\n15http://www.nlm.nih.gov/research/umls/\n16http://www.isi.edu/isd/LOOM/\n17ALC allows for the construction of concept hierarchies.\n",
  "speaker": "SYSTEM",
  "uuid": "4c6c807f-5ff7-4450-a600-2f8d9755e115"
}