{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 5\n \n \nTítulo del proyecto: \"OntoWeb: Ontology-based information exchange for knowledge management and electronic commerce\" \n \nEntidad financiadora: Unión Europea \nEntidades participantes: Vrije Universiteit Amsterdam, Netherlands (co-ordinator), Universidad Politecnica de Madrid; AIFB, \nUniversity of Karlsruhe (Germany); University of Manchester (UK); Open University (UK);   Vrije Universiteit Bruessel  \n(Belgium); LADSEB-CNR  (Italy) ; INRIA (France) FT R&D : The R&D Centre of France Télécom, (France); DFKI, Deutsches \nForschungszentrum \nFuer \nKuenstliche \nIntelligenz \nGmbH, \nLanguage \nTechnology \nLab, \n(Germany); \nPricewaterhouseCoopers,(Luxembourg), etc. \nDuración,  desde: 2002 \n \nhasta: 2005 \nInvestigador responsable: del proyecto: Dieter Fensel; de la UPM: A. Gomez-Perez \nNúmero de investigadores participantes:     \n \n \nTítulo del proyecto: \"Content:Web: Plataforma tecnológica para la Web Semántica: Ontologías, Análisis de Lenguaje Natural \ny Comercio electrónico\" \n \nEntidad financiadora: Ministerio de Ciencia y Tecnología \nEntidades participantes: Universidad Politécnica de Madrid \nDuración,  desde: 2002 \n \nhasta: 2005 \nInvestigador responsable: del proyecto: A. Gomez-Perez \nNúmero de investigadores participantes:     \n \n \n \nTítulo del proyecto: “Multilingual Knowledge Based European Electronic Marketplace”. IST-1999-10589 \n \nEntidad financiadora: Unión Europea \nEntidades participantes: France Telecom - FT R&D; Sema Group sae; Universidad Politecnica de Madrid – UPM; National \nTechnical University of Athens – NTUA; Centre National de la Recherche Scientifique – CNRS; Tradezone International Ltd \nTechnical Research Centre of Finland – VTT; Ellos Postimyynti Oy; Société Nationale des Chemins de Fer Français – SNCF; \nFiduciaire Juridique et Fiscal de France - FIDAL \nDuración,  desde: 02/2000 hasta: 08/2002 \nInvestigador responsable: Alain Leger \nNúmero de investigadores participantes:     \n \n \n \nTítulo del proyecto: \"Usos de Ontologías en la Gestión de Conocimientos\" (Using Ontologies for Knowledge Management). \nHA 1.998-0002. \n \nEntidad financiadora: Ministerio de Educación y Cultura \nEntidades participantes:  Universidad Politécnica de Madrid y AIFB de Kalsruhe (Alemania). \nDuración,  desde: 1/01/1999  \nhasta: 31/12/2000 \nInvestigador responsable: Asunción Gómez Pérez y Rudi Studer \nNúmero de investigadores participantes: 6 \n \nTítulo del proyecto: \"Prototipos de Ontologías para el Medio ambiente\". Ref. AM9819 \n \nEntidad financiadora: Universidad Politécnica de Madrid. Proyecto Multidisciplinar de Investigación y Desarrollo \n \nEntidades participantes: Universidad Politécnica de Madrid y Universidad Autónoma de Madrid \nDuración,  desde: 01/1999  \nhasta: 5/2000 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:     \n",
  "speaker": "SYSTEM",
  "uuid": "4cecb677-9a59-4c0d-a109-20436ad9a177"
}