{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 13\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n13 \n \n \nEjercicio 10: Dentista \n \nSupóngase un experto odontólogo diagnosticando a un paciente. Las heurísticas que utiliza para elaborar \ndiagnósticos son: \n \n• \nSi un diente tiene caries grandes, y el paciente tienen un dolor agudo desde hace siete días, el \nodontólogo establece como diagnóstico que al paciente hay que hacerle una endodoncia. \n• \nSi a un paciente al que hay que hacerle una endodoncia, presenta los siguientes síntomas: no tiene \ndolor a la percusión vertical, no tiene dolor a la percusión horizontal, no tienen dolor a la palpación \napical y sí tiene dolor al poner aire frío en el diente, el odontólogo establece como diagnóstico que \ntiene dañada la pulpa y que está viva de manera reversible y no de manera irreversible. \n• \nSi a un paciente al que hay que hacerle una endodoncia, presenta los siguientes síntomas: no tiene \ndolor a la percusión vertical, sí tiene dolor a la percusión horizontal, no tiene dolor a la palpación \napical y sí tiene dolor al poner aire frío en el diente, el odontólogo establece como diagnóstico que \ntiene dañada la pulpa, y que la pulpa está viva de manera irreversible. \n• \nSi a un paciente al que hay que hacerle una endodoncia, presenta los siguientes síntomas: sí tiene \ndolor a la percusión vertical, sí tiene dolor a la percusión horizontal, sí tiene dolor a la palpación \napical y no tiene dolor al poner aire frío en el diente, el diagnóstico es que la pulpa está muerta. \n• \nSi el diente del paciente no tiene caries grandes, si su encía no está irritada, si no le duele a la \npalpación aplical, si el diente se mueve, si no le duele al aplicar aire frío, y se observa pérdida de \nmasa ósea en el diente, el diagnóstico es una periodontitis. \n• \nSi el odontólogo observa que el diente tiene fisuras, el diagnóstico es que diente está fracturado. \n• \nSi el odontólogo observa que el diente está fracturado en horizontal y que la pulpa del diente no está \nexpuesta, entonces el diagnóstico que establece es de fractura horizontal sin pulpa implicada. Pero si \nla pulpa estuviera expuesta, el diagnóstico es de fractura horizontal con pulpa implicada. \n• \nSi el odontólogo observa que el diente está fracturado oblicuamente y que la pulpa del diente no está \nexpuesta, entonces el diagnóstico que establece es de fractura oblicua sin pulpa implicada. Pero si la \npulpa estuviera expuesta, el diagnóstico es de fractura oblicua con pulpa implicada. \n \nSe pide: \na) Construir la base de reglas que modelice dichos conocimientos.   \n",
  "speaker": "SYSTEM",
  "uuid": "4d2773f6-30b6-4dac-a34b-6dda425acaf1"
}