{
  "message": "SYSTEM: MasterUPM_O%26SW-english.pdf: Página 2\n \n \nIn order to reach these objectives, motivate students and promote a favourable attitude towards the \nsemantic web, emphasis will be put on the following aspects:  \n1. Students can understand the core of basic concepts and fundamental theories, complemented with a \nwide range of problems that illustrate the theoretical aspects.  \n2. Students can master the two most important pillars in the course: ontologies and annotation (systems, \nlanguages, etc) \n3. Students can get used to handling real world problems extracted from national and European projects, \nthough adapted for the classes, rather than handling “toy” problems.  \n4. Students can understand the relationship between the different components of a semantic-based \nsystem and how they can be integrated with other computer systems (hardware and software).  \n5. Students can establish relations between some fundamental aspects in this domain such as: \nenvironment interactions, high degree of autonomy and system adaptability. \n \nCourse contents  \n \nThis course is organized in four sections. Each section is composed of several units.  \n \nSection 1: Introduction to the Semantic Web  \nUnit 1. General overview of the semantic web with special emphasis on ontologies and resource \nannotation (documents, texts, web pages, web services, DBs, etc). Description of the types of problems \nthis technology can be applied to.  \n \nSection 2: Computational linguistics \nUnit 2. Introduction to some computational linguistics concepts useful in building ontologies \n(terminological aspects: concepts, terms, relations between them, definitions, etc). Types of \nterminological resources (lexicons, thesauri, mono-, multilingual dictionaries, controlled-language \nvocabularies, terminological DBs) that can be used as a starting point in ontology building.  \nUnit 3. Multilingual representation in ontologies.  \n \nSection 3. Ontologies.   \nUnit 4. Theoretical aspects: definition, scope, types of ontologies, ontology repositories.  \nUnit 5. Languages used in ontology implementation: (RDF(S) and OWL) as well as query languages: \nSPARQL. \nUnit 6. Tools used in building and storing ontologies (Sesame, Jena, Protégé, NeOn toolkit) as well as in \nontology reasoning (RACER).  \nUnit 7. Life cycles and development methodologies used in building ontologies from scratch. Ontology \nnetworks used in building ontologies through collaborative work  \nUnit 8. Activities to be performed when preparing the ontology specification requirements  \nUnit 9. Ontology reusing and reengineering and resource learning (ontological and non-ontological \nresources) as a way of speeding up the process of building ontologies by using knowledge that has \nbeen already agreed upon.  \nUnit 10. \nMethods, techniques and tools used to carry out alignments  and mappings between \nontologies and between ontologies and other resources.  \n \nSection 4. The Semantic Web  \nUnit 11. \nMethods, techniques and tools used in (semi)-automatic annotation of texts and \nmultimedia documentation.   \n",
  "speaker": "SYSTEM",
  "uuid": "4da0d0c3-b9da-4e9c-9f76-07693e8056f4"
}