{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/RevistasWebNmasUno \n\nNombre\nDescripción\nImpacto\nInformation Sciences\nThe journal is designed to serve researchers, developers, managers, strategic planners, graduate students and others interested in state-of-the art research activities in information, knowledge engineering and intelligent systems.\n3,095\nJournal of Web Semantics\nThe Journal of Web Semantics is an interdisciplinary journal based on research and applications of various subject areas that contribute to the development of a knowledge-intensive and intelligent service Web.\n3,023\nIEEE Transactions on Knowledge and Data Engineering\nFocused onwell-defined theoretical results and empirical studies that have potential impact on the acquisition, management, storage, and graceful degeneration of knowledge and data, as well as in provision of knowledge and data services.\n2,236\nJournal of the American Society for Information Science and Technology\nThe Journal of the American Society for Information Science and Technology (JASIST) is a leading international forum for peer-reviewed research in information science. For more than half a century, JASIST has provided intellectual leadership by publishing original research that focuses on the production, discovery, recording, storage, representation, retrieval, presentation, manipulation, dissemination, use, and evaluation of information and on the tools and techniques associated with these processes.\n1,954\nInternational Journal on Semantic Web and Information Systems\nCovers all aspects of the Semantic Web with relevance for Computer Science and Information Systems communities. Papers describing original research, encompassing new algorithms, languages, computing techniques, architectures, frameworks, modeling, methodology, system development and evaluation, and path-breaking applications, are invited.\n1,893\nAdvanced Engineering Informatics\nAdvanced Engineering Informatics is an international journal containing original papers that: Report progress in the engineering discipline of applying computer science; Have engineering relevance and help provide the scientific base to make engineering decision-making more reliable, spontaneous and creative; Contain novel research that demonstrates the science supporting knowledge-intensive engineering tasks; Validate the generality, power and scalability of new methods through vigorous evaluation, preferably both qualitatively and quantitatively.\n1,848\nKnowledge and Information Systems\nThe journal focuses on knowledge systems and advanced information systems, including their theoretical foundations, infrastructure, enabling technologies and emerging applications.The journal also publishes significant on-going research in the form of Short Papers (limited to 5000  words), and very short papers on \"visions and directions\" (no more than 3000  words, excluding bibliography).\n1,733\nInformation Systems\nThe Information Systems Journal (ISJ) is an international journal promoting the study of, and interest in, information systems. Articles are welcome on research, practice, experience, current issues and debates. The ISJ encourages submissions that reflect the wide and interdisciplinary nature of the subject and articles that integrate technological disciplines with social, contextual and management issues, based on research using appropriate research methods.\n1,66\nData & Knowledge Engineering\nTechnical advances and news items concerning data engineering, knowledge engineering, and the interface of these two fields.\n1,48\nACM Transactions on Information Systems\nACM Transactions on Information Systems (TOIS) is a scholarly journal that publishes the highest quality papers about the design and evaluation of computer software that helps people find, organize, analyze, and use information in a variety of media.  TOIS is published quarterly.\n1,472\nEuropean Journal of Information Systems\nProvides a distinctive European perspective on the theory and practice of information systems for a global audience.\n1,202\nJournal of Intelligent Information Systems\nThe Journal of Intelligent Information Systems: Integrating Artificial Intelligence and Database Technologies (JIIS) fosters and presents research and development results focused on the integration of artificial intelligence and database technologies to create next generation information systems - Intelligent Information Systems.\n1,075\nWorld Wide Web\nWorld Wide Web: Internet and Web Information Systems (WWW) is an international, archival, peer-reviewed journal that covers all aspects of the Web, including issues related to architectures, applications, Internet and Web information systems, and communities. It provides in-depth coverage of the most recent developments in the Web, enabling readers to keep up-to-date with this dynamically changing technology. The journal also focuses on all database- and information-system topics that relate to the Internet and the Web, particularly on ways to model, design, develop, integrate, and manage these systems.\n1",
  "speaker": "SYSTEM",
  "uuid": "4ee86417-8da7-4185-8bbd-bcf321992f2d"
}