{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 233\nMINISTERIO DE ECONOMÍA Y HACIENDA\n239\n357.- Consulta de datos consolidados de los presupuestos\nde las Comunidades Autónomas\nDirección Web: http://serviciosweb.meh.es/apps/CCAApresupuestos/\nOrganismo editor: Dirección General de Coordinación Financiera con las Comunidades\nAutónomas. Ministerio de Economía y Hacienda.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nHoja de cálculo\nTipo de información: \nTipos de consulta: \nTexto completo\nSimple\nMateria: Presupuestos.\nDescripción y comentarios: Consulta de datos consolidados de los presupuestos de las\nComunidades Autónomas. La consulta ofrece información por desglose de gastos, clasifi-\ncación económica, desglose de ingresos, funcional, funcional por capítulos, detalle de\ntransferencias internas y por organismos y entidades incluidos en consolidación. \n358.- Doctrina tributaria. Consultas sobre regímenes forales\nDirección Web: http://petete.meh.es/Scripts/know3.exe/SGPF/CONPVYN/consulta.htm\nOrganismo editor: Dirección General de Coordinación Financiera con las Comunidades\nAutónomas. Ministerio de Economía y Hacienda.\nClase de información:\nFormato de presentación:\nInformes\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Impuestos. Doctrina tributaria. Fiscalidad.\nDescripción y comentarios: Comprende los siguientes campos: num-consulta, en él se re-\ncoge el número de la consulta en el formato Vxxxx-aa; fecha-salida, en este campo se reco-\nge la fecha en que fue evacuada por la Dirección General de Tributos la consulta en el for-\nmato de dd/mm/aaaa. También se pueden realizar búsquedas de fecha a fecha; normativa,\neste campo recoge la normativa empleada en la resolución de la consulta. Las voces que re-\ncoge este campo son las siguientes: ley, RD (Real Decreto), RDL (Real Decreto Ley), DL\n(Decreto Ley), D (Decreto), OM (Orden Ministerial), CDI (Convenio de Doble Imposi-\nción); cuestión planteada, recoge la cuestión sobre la que el contribuyente presentó consul-\nta a la Dirección General de Tributos; descripción, recoge los antecedentes y situación de\nlos hechos sobre los que versa la consulta; texto libre, en él se puede buscar por cualquier\npalabra o serie de palabras, números, fechas, etc. El ámbito de la búsqueda será todos los\ncampos de la base de datos, incluyendo la contestación completa. \nBASES DE DATOS  1/1/04  03:39  Página 239\n",
  "speaker": "SYSTEM",
  "uuid": "4f4478ed-fd8c-4934-825d-b6cb4c6076a2"
}