{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 15\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11164\n2.  Ningún director de tesis podrá actuar como tal en más de dos ayudas de esta \nconvocatoria.\n3.  Los períodos de disfrute de otras ayudas homologables por su análoga naturaleza, \natendiendo al objeto, la cuantía, el proceso de selección u otros, según el criterio de la \nComisión de Selección del artículo 33, podrán ser descontados del cómputo total de esta \nayuda, inicialmente del periodo de beca, y si es necesario del de contrato.\n4.  Quienes accedan a la condición de beneficiarios como consecuencia de las \nrenuncias previstas en el artículo 38, disfrutarán igualmente de 48 meses de ayuda desde \nla fecha de su incorporación al Centro de I+D, con independencia de los meses que \nhubiesen disfrutado el anterior o anteriores beneficiarios, siempre que las disponibilidades \npresupuestarias lo permitan.\nArtículo 31.  Presentación de solicitudes.\n1.  La relación de proyectos de investigación de los Centros de I+D, susceptibles de \nasignación de ayudas, de acuerdo con su petición de inclusión en este programa a través \nde las solicitudes presentadas a las convocatorias de ayudas para la realización de \nproyectos de investigación fundamental no orientada, será publicada en la fecha de \napertura del plazo de presentación de solicitudes, en la página de internet del Ministerio de \nCiencia e Innovación (http://www.micinn.es).\n2.  Las solicitudes de participación en este subprograma podrán ser presentadas por \nlos candidatos que cumplan los requisitos establecidos en el artículo 17, o que estén en \ndisposición de cumplirlos, como norma general, en la fecha de incorporación a su centro \nde adscripción, con las salvedades recogidas en los artículos 29.1 y 38.4, y de conformidad \ncon el procedimiento que se describe en este y los siguientes artículos.\n3.  El plazo de presentación de las solicitudes de participación en el subprograma \nserá del 8 al 22 de febrero de 2010, ambos inclusive.\n4.  El formulario de solicitud para los candidatos estará disponible en la dirección \nelectrónica http://www.micinn.es. El formulario deberá cumplimentarse a través de los \nmedios telemáticos habilitados para ello en la citada página web. En caso contrario no \nserá considerado válido y se entenderá como no presentado. En la instancia de solicitud \nse incluirá la dirección de correo electrónico designada a los efectos de comunicaciones \ny/o requerimientos que se puedan realizar, que será considerada en este caso como válida \na efectos de notificaciones.\nUna vez cumplimentado el formulario, se imprimirá y será firmado y presentado, en los \nlugares indicados en el apartado siguiente.\n5.  La solicitud y documentación correspondiente podrá presentarse en el Registro \ndel Ministerio de Ciencia e Innovación de la calle Ramírez de Arellano, 29, 28071, Madrid, \no en cualquiera de los lugares señalados en el artículo 38.4 de la Ley 30/1992, de 26 de \nnoviembre, de Régimen Jurídico de las Administraciones Públicas y del Procedimiento \nAdministrativo Común.\nEn el caso de que los solicitantes optaran por presentar su solicitud en una oficina de \nCorreos de España, lo harán en sobre abierto para que cada solicitud sea fechada y \nsellada por separado por el personal de Correos antes de ser certificada. En el caso de \nque los solicitantes presenten su solicitud en el extranjero, podrán hacerlo en las \nrepresentaciones diplomáticas u oficinas consulares de España en el extranjero. Los \nservicios de correos en el extranjero, públicos o privados, no son registros válidos a efectos \nde la Ley 30/1992. En el caso de presentar la solicitud ante uno de estos servicios, la fecha \nde registro de la misma será cuando sea recibida en un registro válido.\n6.  Cada solicitante podrá presentar hasta un máximo de dos solicitudes, que deberá \npriorizar, e indicar en cada una de ellas el proyecto de I+D al que quiere ser adscrito.\n7.  Asimismo, deberá adjuntar a la solicitud siguiendo los medios telemáticos \nhabilitados al efecto, la siguiente documentación:\na)  Copia del pasaporte en vigor, únicamente en el caso de los ciudadanos extranjeros \nno residentes en territorio español.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "503661b7-303f-41d5-8406-2177142455c0"
}