{
  "message": "SYSTEM: D5.3.2.pdf: Página 22\nPage 22 of 48 \nNeOn Integrated Project EU-IST-027595 \n \n \nFigure 6. Tasks in the Reuse of Ontology Design Patterns \n3.2. Collection of Ontology Network Life Cycle Models \nIn deliverable D5.3.1 [ 10] we defined ontology network life cycle model as a model to define \nhow to develop an ontology network project (that is, how to develop and maintain an ontology \nnetwork); in other words, how to organize the activities of the NeOn Glossary of Activities into \nphases or stages.  \nIn general, life cycle models can be seen as abstractions of the phases or stages through which a \nproduct passes along its life; in our case the product is an ontology network. Life cycle models are \nused to represent the entire life of a product from concept to disposal and they could determine the \norder of the phases and establish the transition criteria between different phases. Each phase or \nstage should be described with a statement of purpose and outcomes.  \nAs we have already mentioned there is not a unique life cycle model valid for all ontology \ndevelopment projects and each life cycle model is appropriate for a concrete project, depending on \nseveral features. Therefore, to propose a unique life cycle model for all ontology network \ndevelopments is not very realistic. For this reason, we proposed in deliverable D5.3.1 [ 10] a \ncollection of ontology network life cycle models (version 1), based on the life cycle models \ndescribed and used in Software Engineering, taking into account the specific features of the \nontology network development.  \nIn deliverable D5.3.1 [ 10], the proposed collection of models included the following ontology \nnetwork life cycle models (ONLCMs):  \n\u0001 Waterfall model. Its main characteristic is that it represents the stages of an ontology network \nas sequential phases. Thus, a concrete stage must be completed before the following stage \nbegins.  \n",
  "speaker": "SYSTEM",
  "uuid": "508eba32-19da-4414-8edf-30a7e9275342"
}