{
  "message": "SYSTEM: QRVocabulary.pdf: Página 7\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n89 / 103 \nExamples: \n1. The magnitude of the number of predators is greater than the magnitude of the \nnumber of prey. \n2. The value max of the height of the water container is equal to the value max of \nthe height of the other water container. \n3. The magnitude of the population natality minus the magnitude of the population \nnatality is smaller than the difference between the magnitude of immigration and \nemigration. \n4. The magnitude of the amount of fluid in the container is greater than zero. \n5. The difference between the pressure in the left water container and the pressure \nin the right water container is equal to the flow. \n6. No example given. \n7. No example given. \n8. No example given. \n9. No example given. \n10. No example given. \n11. No example given. \nA.5.2 Plus/Min relations \nUsing plus/min relations more complex expressions can be created than is possible with \nonly inequalities. They are used to calculate the sum of difference between two items.  \nPlus/min relations can be the target or source of an inequality relation. There are nine \ndifferent ways plus/min relations can be used, depending on the type of the two items \nrelated by it. Table 3 shows the possible uses of plus/min relations between magnitude \nitems, while Table 4 shows the possibilities between derivative items. Note that the type \nof a plus/min relation from A to B is considered the same type (i.e. has the same \nnumber) as an inequality from B to A. \n \n1. From a magnitude to another magnitude. \n2. From a point belonging to the quantity space of a magnitude, to a point belonging \nto the quantity space of another magnitude. \n3. From a plus/min relation between magnitude items, to another plus/min relation \nbetween magnitude items. \n4. From a magnitude to a point belonging to the quantity space of a magnitude.  \n5. Between a magnitude and a plus/min relation between magnitude items. \n6. Between a point belonging to the quantity space of a magnitude and a plus/min \nrelation between magnitude items. \n7. From a derivative to another derivative. \n8. Between a plus/min relation between derivative items and another plus/min \nrelation between derivative items. \n9. Between a derivative and a plus/min relation between derivative items. \n \nTable 3: The possible plus/min relations between magnitude items \nTo \nFrom \nMagnitude \nPoint (Magnitude) \nPlus/Min \n(Magnitude) \nMagnitude \n1 \n4 \n5 \nPoint (Magnitude) \n4 \n2 \n6 \nPlus/Min \n(Magnitude) \n5 \n6 \n3 \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "50f28265-633d-4a33-a2f3-9cf31305a2b4"
}