{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 43\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 43 of 124\n• According to the list of employed techniques. Four methods employ mapping rules for the transforma-\ntion, one method employs transformation rules, other one method employs lexico syntactic patterns,\none employs natural language techniques, one method employs ontology design patterns. The re-\nmaining nine methods do not provide information about this criteria.\n• According to the support tool for the transformation. Eight methods have a tool that provides tech-\nnological support to the transformation, six methods have an ad-hoc tool for the transformation. The\nremaining four methods do not provide information about a tool.\nTools\n• According to the transformation process, i.e. one-step transformation or incremental transformation.\nThe twelve tools perform one-step transformation of the non-ontological resource.\n• According to the transformation approach. One tool follows the approach to transforming the resource\nschema into an ontology schema and the resource content into ontology instances, other tool follows\nthe approach for transforming the resource content into an ontology schema, other tool follows two\napproaches (i) to transforming the resource schema into an ontology schema and the resource content\ninto ontology instances and (ii) to transforming the resource content into an ontology schema. The\nremaining nine tools follow the approach to transforming the resource content into instances of an\nexisting ontology.\n• According to whether the transformation process is automatic, semi-automatic, or manual. Three tools\nperform an automatic transformation, and nine perform a semi-automatic transformation.\n• According to how the transformation process is carried out, i.e. using an ad-hoc wrapper or using\na formal speciﬁcation of the conversions. Four tools perform the transformation by using an ad-hoc\nwrapper, and eight perform the transformation by using a formal speciﬁcation of the conversions.\n• According to the transformation aspects contemplated, i.e. syntactic or semantic. Eight tools take con-\ntemplate syntactic and semantic transformation aspects, since they tackle how symbols are structured\nin the resource and ontology formats, as well the semantic interpretation of the resource elements\nwhen deﬁning transformations to ontology elements. Four tools contemplate only the syntactic trans-\nformation aspects.\n• According to the semantics of the non-ontological resource relationships. One tool deals with sub-\nClassOf and ad-hoc relations, ten deal with ad-hoc relations and the remaining tool does not provide\ninformation about this criteria.\n• According to whether the tool performs a full transformation or not. Six tools perform a full conversion\nof the resource, and six do not provide information about this criteria.\n• According to whether the method uses additional resources for the transformation or not. One tool uses\nadditional resources, such as, Swoogle, and Google for the transformation. The remaining eleven tools\ndo not use any addtional resource for the transformation.\n• According to the list of employed techniques. Four tools employ mapping rules for the transforma-\ntion, one tool employs lexico syntactic patterns, and seven tools do not provide information about this\ncriteria.\nAfter having analyzed the characteristics related to the transformation process, we can conclude that re-\nsearch efforts have been mostly centered on using ad-hoc wrappers for the transformation. Only a few\ntake into account the semantics of the non-ontological resource relationships. Also a few rely on additional\nresources for performing the transformation.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "512b115f-cfe6-4dbe-929e-bdeff1c1c9ff"
}