{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 7\nSemantic Grounding of Cross-Lingual Folksonomies\n7\nvector is calculated using TF-IDF12[22] for the corresponding i-th term in the\nordered set.\nSimilarly, we create a vector for the tag and its context. In this case, wi takes\nas value 1 if the i-th term in the ordered set appears in the tag context, and 0\nif not. We compare the tag vector and each one of the sense vectors using as\nsimilarity measure the cosine function. Thus, we select the sense vector with the\nhighest similarity value with respect to the tag vector. The retrieved information\nfrom MSR for the sense contains the DBpedia resource associated to this sense.\nTherefore, we return this resource as the semantic entity to associate to the tag.\n3.5\nMultilingual Sense Repository\nMSR is a multilingual sense repository, where each sense corresponds to a Wikipedia\narticle, and where the most frequent terms in the article are stored along with\ntheir frequency values. MSR has been built taking advantage of: 1) Wikipedia ar-\nticle13 URLs as sense identiﬁers, and article words along with their frequency as\nkeywords associated with the sense, 2) articles listed in disambiguation pages14\nas possible senses for ambiguous words, and 3) the explicit translations among\narticles15 to link senses in languages diﬀerent from English to English senses.\nWe want to note that MSR can be easily extended to other languages due to the\nfact that it relies mostly on Wikipedia information, and hence its coverage will\nbe highly related to the coverage of Wikipedia in the corresponding language.\nOther \nlanguage\nEnglish Language\nWikipedia\nEnglish and Spanish\nAnalyze\n Disambiguation Page\nExtract Sense \nInformation\nGet \nTranslation\nAssociate \nSemantic Entity\nWordNet \nOpenThesauri\nEuroWordNet\nLabelTranslator\nsynonyms\nTranslation \nlinks\nAutomatic \ntranslation\nDBpedia \nresource\nNormalized\nTag,\nLanguage\nUnambiguous tag\nSemantic \nResources\nArticle title \nand content\nDisambiguation\npage\nAmbiguous\ntag\nFig. 2. Creation process of the Multilingual sense repository [9].\nMSR is populated incrementally (See Figure 2). Each time a tag is presented\nto Sem4Tags its normalized version is queried in MSR. If there is no information\nin the sense repository for this tag, then the population process starts. First, the\nlist of candidate senses is created. We look for a disambiguation page related to\nthe tag. If this page exists then we extract the possible meanings of the tag using\nsynonyms extracted from lexical resources like EuroWordNet [21]. Otherwise, we\nlook for a content page related to the tag. Then, for each candidate sense we\n12 TF-IDF stands for Term Frequency and Inverse Document Frequency\n13 Content pages describe subjects related to concepts, instances and named entities.\n14 Disambiguation pages list articles representing the possible uses of a word.\n15 Articles have explicit translation links into other languages.\n",
  "speaker": "SYSTEM",
  "uuid": "51476905-457e-4d93-85a6-58c8db81904a"
}