{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 13\nTable 6. Pitfall “P10. Missing disjointness” \nName \nP10. Missing disjointness \nDescription \nThe pitfall consists in missing disjoint axioms between classes or properties that should be defined as \ndisjoint. \nRecommendation \nIt is recommended to apply the following action:  \n \nFor each two classes in the same level of granularity in a hierarchy, to check if it is possible that a \nparticular instance belongs to both classes at the same time. If not, then such classes should be defined \nas disjoint. \nBy defining classes that can not share instances as disjoints we could detect inconsistent definitions that \nwould go unnoticed otherwise. Moreover, we obtain a more complete and better defined ontology. \nExample \nIn the non recommended scenario, we can observe a hierarchy of three classes; the class “NaturalNumber” \nthat has as subclasses “PrimeNumber” and “CompositeNumber”. However, these subclasses have not been \ndefined as disjoint. Therefore, the number “7” could be both prime and composite. \nIn the recommended scenario, the subclasses “PrimeNumber” and “CompositeNumber” have been defined \nas disjoint. Thus, the fact that a natural number cannot be at the same time prime and composite is defined \nexplicitly in the ontology. \nNot Recommended \nRecommended \n \n(properties of “PrimeNumber”) \n \n \n(properties of “PrimeNumber”) \n \nTable 7. Pitfall “P11. Missing domain or range in properties” \nName \nP11. Missing domain or range in properties \nDescription \nThis pitfall entails defining relationships and/or attributes without domain or range (or both) in the \nontology. \nRecommendation \nIt is recommended to specify, if possible, the domains and/or ranges in the properties and/or attributes. In \nthis way, we could improve both the definitions of such properties and the ontology understandability. \nAlso, by defining domains and ranges, we could take advantage of the reasoning power of those axioms. \nAdditionally, annotations in the “comment” field should be added. These annotations should describe what \nit is intended to be represented with the property and/or attribute (for instance, if the property or attribute is \npart of an N-ary pattern). \nExample \n",
  "speaker": "SYSTEM",
  "uuid": "527dafb7-912d-449b-b896-5cf76112c44e"
}