{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 138\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n144\n172.- REBECA. Registros bibliográficos para bibliotecas públicas españolas\nDirección Web: http://www.mcu.es/bibliotecas/MC/Rebeca/index.html\nWeb adicional:\nhttp://www.mcu.es/rebeca/cargarFiltro.do?cache=init&layout=rebeca&language=es\nOrganismo editor: Subdirección General de Coordinación Bibliotecaria. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Bibliotecas. Bibliografía. Edición.\nDescripción y comentarios: REBECA es una base de datos que contiene registros biblio-\ngráficos en formato Ibermarc. Está concebida como una fuente de recursos para la cataloga-\nción automatizada principalmente dirigida a las bibliotecas públicas. Se actualiza a diario por\ncolaboración entre el Ministerio de Cultura y las Comunidades Autónomas. Es una experien-\ncia de catalogación cooperativa en la que actualmente participan diecinueve Bibliotecas\nPúblicas del Estado, ocho Bibliotecas Centrales de Comunidades Autónomas y dos Redes de\nBibliotecas Públicas de CC. AA. Permite descargar registros para su posterior integración en\ncatálogos automatizados que posibilitan esa operación. Utiliza el protocolo Z39.50.\n173.- Base de datos de fundaciones culturales\nDirección Web:\nhttp://www.mcu.es/fundacionesculturales/cargarFiltro.do?layout=fundacionesCulturales\n&cache=init&language=es\nOrganismo editor: Subdirección General de Fundaciones y Mecenazgo. Ministerio de Cultura.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nSimple\nMateria: Cultura.\nDescripción y comentarios: Base de datos sobre las actividades de las Fundaciones\nCulturales. \nBASES DE DATOS  1/1/04  03:39  Página 144\n",
  "speaker": "SYSTEM",
  "uuid": "52daf4d3-404a-4383-9d55-f0748324b611"
}