{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 121\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 121 of 124\n[HGS75]\nL. Hirschman, R. Grishman, and N. Sager. Grammatically based automatic word class\nformation. Information Processing and Retrieval, 11:39–57, 1975.\n[HHST06]\nS. Hakkarainen, L. Hella, D. Strasunskas, and S. Tuxen. A Semantic Transformation Ap-\nproach for ISO 15926. In Proceedings of the OIS 2006 First International Workshop on\nOntologizing Industrial Standards, 2006.\n[Hir04]\nG. Hirst. Ontology and the lexicon. In Handbook on Ontologies in Information Systems,\npages 209–230. Springer, 2004.\n[Hod00]\nG. Hodge. Systems of Knowledge Organization for Digital Libraries: Beyond Traditional\nAuthority Files. http://www.clir.org/pubs/reports/pub91/contents.html, 2000.\n[HS03]\nU. Hahn and S. Schulz. Towards a broad-coverage biomedical ontology based on descrip-\ntion logics. pac symp biocomput. pages 577–588, 2003.\n[HVTS08]\nE. Hyvönen, K. Viljanen, J. Tuominen, and K. Seppälä. Building a national semantic web\nontology and ontology service infrastructure -the ﬁnnonto approach. In ESWC, pages 95–\n109, 2008.\n[IK02]\nH. Isozaki and H. Kazawa. Efﬁcient Support Vector Classiﬁers for Named Entity Recog-\nnition. In Proceedings of the 19th International Conference on Computational Linguistics\n(COLING’02), pages 390–396, Taipei, Taiwan, 2002.\n[ISO85]\nInternational Standard Organization (ISO). Documentation – Guidelines for the establish-\nment and development of multilingual thesauri, 1985. Report ISO 5964.\n[ISO86]\nInternational Standard Organization (ISO). Documentation – Guidelines for the establish-\nment and development of monolingual thesaurus, 1986. Report ISO 2788.\n[ISO04]\nInternational Standard Organization (ISO). Information technology - Metadata registries -\nPart 1: Framework, 2004. Report ISO/IEC FDIS 11179-1.\n[KBH+97]\nT. Koch, A. Bummer, D. Hiom, M. Peereboom, A. Poulter, and E. Worsfold. Speciﬁcation for\nresource description methods Part 3. the role of classiﬁcation schemes in Internet resource\ndescription and discovery. Technical report, DESIRE project deliverable D3.2, 1997.\n[Lab07]\nLawrence Berkeley National Laboratory.\neXtended MetaData Registry (XMDR) Project.\nhttp://www.xmdr.org/standards/cmaps/Thesaurus Standards Relationships.html, 2007.\n[LS06]\nB. Lauser and M. Sini. From agrovoc to the agricultural ontology service/concept server: an\nowl model for creating ontologies in the agricultural domain. In DCMI ’06: Proceedings of\nthe 2006 international conference on Dublin Core and Metadata Applications, pages 76–88.\nDublin Core Metadata Initiative, 2006.\n[M. 07]\nM. d Aquin and M. Sabou and M. Dzbor and C. Baldassarre and L. Gridinoc and S. An-\ngeletou and E. Motta. Watson: A gateway for the semantic web. In 4th European Semantic\nWeb Conference, Innsbruck, Austria, 2007.\n[May00]\nD. G. Maynard.\nTerm Recognition Using Combined Knowledge Sources.\nPhD thesis,\nManchester Metropolitan University, UK, 2000.\n[May03]\nD. Maynard. Multi-source and multilingual information extraction. Expert Update, 2003.\n[MB05]\nA. Miles and D. Brickley. SKOS Core Vocabulary Speciﬁcation. Technical report, World\nWide Web Consortium (W3C), November 2005.\nhttp://www.w3.org/TR/2005/WD-swbp-\nskos-core-spec-20051102/.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "533fc4c4-a827-4bdf-8037-ec07040d34b1"
}