{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 15\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13923\nANEXO I\nMemoria para la verificación de los programas de doctorado a que se refiere el \nartículo 10.2 de este real decreto\n[1]  Descripción del programa de doctorado, que contendrá los datos básicos: \ndenominación, instituciones participantes (siempre al menos una universidad coordinadora) \ny colaboradoras, si el programa se integra o no en una escuela doctoral, la existencia de \nredes o convenios internacionales, etc.\n[2]  Competencias.\nDescripción de las competencias a adquirir por los estudiantes al finalizar el programa \nde doctorado.\n[3]  Acceso y admisión de estudiantes.\nVías y requisitos de acceso y admisión de los estudiantes, así como los sistemas para \nhacer accesible dicha información a los estudiantes antes de su matriculación.\nSistemas y procedimientos de admisión adaptados a estudiantes con necesidades \neducativas especiales derivadas de la discapacidad.\nDescripción de los complementos de formación específicos adaptados a los diversos \nperfiles de ingreso, en el caso de que existan.\nEn el caso de que el programa de doctorado provenga de un programa existente, \nnúmero de estudiantes admitidos en los últimos 5 años identificando aquellos que \nprovengan de otros países. En el caso de nuevos programas, se facilitará la estimación de \nmatrícula y previsión de estudiantes extranjeros.\n[4]  Actividades formativas.\nDetalle de las actividades de formación transversal y específica del ámbito del \nprograma.\nPlanificación de las mismas.\nProcedimientos de control.\nActuaciones y criterios de movilidad.\n[5]  Organización del programa.\n5.1  Supervisión de tesis.\nRelación de actividades previstas para fomentar la dirección de tesis doctorales y \nexistencia de una guía de buenas prácticas para su dirección.\nRelación de actividades previstas que fomenten la supervisión múltiple en casos \njustificados académicamente (co-dirección de tesis por parte de un director experimentado \ny un director novel, co-tutela de tesis interdisciplinares, en colaboración, internacional, \netc.) y presencia de expertos internacionales en las comisiones de seguimiento, informes \nprevios y en los tribunales de tesis.\n5.2  Seguimiento del doctorando.\nDescripción del procedimiento utilizado por la correspondiente comisión académica \npara la asignación del tutor y director de tesis del doctorando.\nDescripción del procedimiento para el control del documento de actividades de cada \ndoctorando y la certificación de sus datos.\nDescripción del procedimiento para la valoración anual del Plan de investigación y el \ndocumento de actividades del doctorando.\nNormativa para la presentación y lectura de tesis doctorales.\nPrevisión de las estancias de los doctorandos en otros centros de formación nacionales \ne internacionales, co-tutelas y menciones europeas.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "53e5e25e-5228-4c41-a6b0-cda8cb99cba4"
}