{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Munichdec2010 \n\nThe E-Business and Web Science Research Group (Prof. Hepp) at Universitaet der Bundeswehr in Munich, Germany invites applications for several fully funded PhD positions and one Post-doc position in the field of Semantic Web, Web Science, and E-Business Research.\nWe are a young team of researchers with backgrounds in information systems, conceptual modeling, economics, computer science, and related disciplines. Our main goal is to find practically relevant and scientifically significant results that help coordinate human activity over the Web. A flagship example of our recent work is the GoodRelations technology for e-commerce, adopted by major Web companies like Google, Yahoo, BestBuy, Overstock.com, and many others.\nResearch topics for the positions:\nLinked Data and the Semantic Web\nRecommender Systems\nData Quality\nOntology Engineering\nEconomics of Semantic Technology\nSocial Commerce\nMicropayment\nWe offer...\na stimulating research environment with people who are working on leading edge problems of the future World Wide Web and novel E- Business scenarios,\na „small think-tank“ atmosphere, in which experienced seniors are still deeply involved in actual research,\nexcellent ties to the international research community,\nguidance on how to publish your best findings in good conference proceedings and peer-reviewed journals , and last but not least\nthe supervision and continuous, timely feedback that you need to achieve great results and complete your PhD in a 3 – 3.5 years time- frame.\nThe salary will be according to the German TVOED E13 scheme for the PhD positions (75 ...100%, depending on profile and experience) and E14 for the post-doc position (100%).\nWe expect...\na sincere interest in the technical, socia, or economic aspects of the World Wide Web, ideally related to E-Business,\nthe willingness to contribute the „99% perspiration“ (Thomas Alva Edison) that is needed to carry a great idea forward until it yields a validated result: a prototype, a statistically significant improvement, or similar,\nexcellent English skills in speaking and writing, and\na master’s degree or equivalent in business management, computer science, information systems, economics, or a related subject.\nA plus would be any of the following skills:\nConceptual modeling (in particular in UML, ER, ORM, or BPMN)\nGood knowledge of the current WWW technology stack (Web architecture, XML and related technologies, Web protocols, etc.)\nRDF, OWL, SPARQL expertise\nProgramming skills in Java, PHP, or Python, ideally with RDF APIs\nEconomics and Business Management\nDatabases\nStatistics\nWe very much appreciate if you develop prototypes or supervise the development of prototypes of your work, unless that is not applicable to your type of research question.\nIf you have a deep interest in driving forward the World Wide Web both as a technology and tool and as a social environment, we would be happy hear from you.\nPlease submit your application in English by e-mail (mandatory) with all documents as PDF attachments (mandatory) to martin.hepp@unibw.de, no later than December 15, 2010.\nYour application should include the following documents:\n1. Cover letter\n2. CV\n3. Academic credentials\n4. Title and abstract of your Master's thesis\n5. List of publications (if any)\nFor further information, see also our following Web pages:\nGoodRelations research project:\n-\nhttp://purl.org/goodrelations/\n-\nhttp://www.ebusiness-unibw.org/wiki/GoodRelations\nRecent publications:\n-\nhttp://www.heppnetz.de/publications/\nResearch vision:\n-\nhttp://www.unibw.de/ebusiness/research/",
  "speaker": "SYSTEM",
  "uuid": "53ebc34b-c6af-4d36-84c6-1993bd074125"
}