{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 75\n73\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Hybrid translation engines. These providers combine rules based and statistical translation technology\nto develop adapted systems. Systran is a good example of this type of provider.\n• Human/machine translation engines. These typically use machine translation for a first pass, and then\nhave human translators review the proposed translations and edit or replace them as needed. SDL\nBeGlobal is a good example of this type of engine. Microsoft Bing Translator also enables this type of\nworkflow, although they use a more ad hoc approach that’s designed for crowd translation.\nBusiness Models\nMachine translation is typically offered as Software‐as‐a‐Service, although a few vendors like Systran also\noffer licensed products designed for standalone use. Machine translation is a memory and CPU intensive\napplication, and generally requires fairly high‐end hardware to perform well. Some systems, like Moses, are\nalso difficult to administer. SaaS offerings enable customers to offload upfront capital costs and system\nadministration to their service provider. \nThese services are generally priced based on the volume of material being translated. Pricing models may be\nper word or character, or split into tiers that correlate fairly directly to word count. For custom or hybrid sys‐\ntems, there is typically a baseline monthly or annual fee that accounts for the cost of hardware dedicated to\neach customer. \nChannels and Platforms\nMachine translation services for consumers (e.g. web translation) are generally marketed direct to end users\nvia sites such as Google Translate and Babelfish. While Google Translate has a dominant position in this mar‐\nket, there is plenty of room for companies that specialize in other language pairs to enter this space. This is\nparticularly true of countries that have a different ecosystem of service providers, for example Yandex in\nRussia or Baidu in China both of whom are dominant search and services providers in those countries.\nCorporate translation services are typically offered to customers via a combination of direct, stand‐alone\nofferings, and integrated solutions that are part of a larger translation toolset. Direct offerings include serv‐\nices like Systran or PangeaMT, which can be used as an independent service, with or without a translation\nmanagement system. SDL, on the other hand, promotes its BeGlobal product as part of a translation supply\nchain management system, and have done a lot of work to integrate it into other tools such as their trans‐\nlation management system. This allows them to sell machine translation as an option in a larger suite of serv‐\nices. Both approaches require the vendor to have an outbound sales capability since these clients take a long\ntime to cultivate, and also often need time to transition off of legacy systems. \nDemand for Machine Translation\nLanguage Service Providers\nLanguage service providers are increasingly using machine translation as part of their process. Though ini‐\ntially resistant to using it at all, they need it to serve customers who need to translate a lot of material very\ncheaply and very quickly. Machine translation can be offered as part of a tiered service where the customer\ncan decide on a per request basis, what level of quality they need for a particular item.\nTokyo based Gengo, for example, offers a highly automated translation service for software developers.\nTheir service is accessed via a web services API, so the process of requesting and retrieving translations can\nbe completely automated, even if the translations are done behind the scenes by humans. They offer sever‐\nal different levels of translation, including a free machine translation option (powered by Microsoft Bing\nTranslator). We expect to see offerings like this become fairly standard, as they allow the client to decide on\na case‐by‐case basis how much they are willing to spend on a given task. \n",
  "speaker": "SYSTEM",
  "uuid": "54e09114-e6da-4af9-912d-f4a9c4418824"
}