{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 8\nresultant Compensation Ontology has 2 concepts: Currency and Salary. For \nevery currency element specified in the ISO 4217 a different instance of the \nCurrency concept is defined. So, the Currency concept has 254 instances.  \nAn example instance of the Currency concept is UNITED STATES - US \nDollar. The ad hoc relations defined in this ontology are has currency between \nthe Salary and Currency concepts, and its inverse one.  \n• Driving License Ontology. This ontology models knowledge of Driving License \ndomain. It is based on the levels recognized by the European Legislation5. This \nclassification is expressed in HTML format and it is a list of 12 kinds of driving \nlicenses. The resultant Driving License Ontology just has the Driving \nLicense concept; and for every kind of driving license specified in the \nEuropean Legislation a different instance of the Driving License concept is \ndefined. An example instance of the Driving License concept is A1 - \nLight weight motorcycle. The Driving License concept has \ntwo relations: ‘Driving License is associated with Job Vacancy’ (with \nthe Job Vacancy concept from the Job Offer Ontology) and ‘Driving \nLicense is driving license of  Job Seeker’ (with the Job Seeker concept \nfrom the Job Seeker Ontology).  \n• Economic Activity Ontology. This ontology models knowledge of economic \nactivities and sectors. It is based on the NACE Rev. 1.16. This standard is \nexpressed in MS Access database format and it is a classification of 849 \neconomic activities. The resultant Economic Activity Ontology has 849 concepts. \nIn this case we have defined a concept for every element of the NACE taxonomy \nin order to preserve the hierarchy. In the Economic Activity Ontology, the most \ngeneral concept is the Activity concept. This concept is organized in the \ntaxonomy based on the NACE. The Activity concept has four relations: \n‘Activity is associated with Objective’ (with the Objective concept \nfrom Job Seeker Ontology), ‘Activity is associated with Offered Work \nExperience’ (with the Offered Work Experience concept from Job \nSeeker Ontology), ‘Activity is associated with Job Vacancy’ (with the \nJob Vacancy concept from Job Offer Ontology) and ‘Activity is \nassociated with Requested Work Experience’ (with the Requested \nWork Experience concept from Job Offer Ontology). \n• Occupation Ontology. This ontology models knowledge of occupations and job \ncategories. It is based on the ISCO-88 (COM)8, ONET7 and European Dynamics \nclassification of occupations. ISCO-88 (COM) and ONET are expressed in MS \nAccess database format; European Dynamics classification of occupations is \nstored in an ORACLE database table. ISCO-88 (COM) is a classification of 520 \noccupations; ONET is a classification of 1167 occupations and the European \nDynamics classification has 84 occupations. The resultant Occupation Ontology \nhas 609 concepts.  For this ontology we have extended manually the ISCO-88 \n(COM) classification with European Dynamics and ONET classifications for ICT \n                                                           \n5 http://ec.europa.eu/transport/home/drivinglicence/ \n6 Available through RAMON Eurostat's Classifications Server at http://ec.europa.eu/comm/eurostat/ramon/ \n7 http://online.onetcenter.org/ \n",
  "speaker": "SYSTEM",
  "uuid": "5541332c-aba3-4c48-90fe-5321a05d2614"
}