{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 11\nBarney Oliver was a good man. He wrote a letter one time to the IEEE. At that time the official shelf space\nat Bell Labs was so much and the height of the IEEE Proceedings at that time was larger; and since you\n\t\ncouldn't change the size of the official shelf space he wrote this letter to the IEEE Publication person\n\u0007\nsaying, ``Since so many IEEE members were at Bell Labs and since the official space was so high the\n\u0006\njournal size should be changed.'' He sent it for his boss's signature. Back came a carbon with his signature,\n\u0003\nbut he still doesn't know whether the original was sent or not. I am not saying you shouldn't make gestures\n\u001d\nof reform. I am saying that my study of able people is that they don't get themselves \n\u000e\ncommitted\n0\n to that kind\nof warfare. They play it a little bit and drop it and get on with their work.\n\u000e\nMany a second-rate fellow gets caught up in some little twitting of the system, and carries it through to\nwarfare. He expends his energy in a foolish project. Now you are going to tell me that somebody has to\n\nchange the system. I agree; somebody's has to. Which do you want to be? The person who changes the\n\u0007\nsystem or the person who does first-class science? Which person is it that you want to be? Be clear, when\n\u0006\nyou fight the system and struggle with it, what you are doing, how far to go out of amusement, and how\n!\nmuch to waste your effort fighting the system. My advice is to let somebody else do it and you get on with\nbecoming a first-class scientist. Very few of you have the ability to both reform the system \n\u001d\nand\n.\n become a\nfirst-class scientist.\n+\nOn the other hand, we can't always give in. There are times when a certain amount of rebellion is sensible. I\n\u001c\nhave observed almost all scientists enjoy a certain amount of twitting the system for the sheer love of it.\n\u001a\nWhat it comes down to basically is that you cannot be original in one area without having originality in\n\u0019\nothers. Originality is being different. You can't be an original scientist without having some other original\n\u000e\ncharacteristics. But many a scientist has let his quirks in other places make him pay a far higher price than\n\u0007\nis necessary for the ego satisfaction he or she gets. I'm not against all ego assertion; I'm against some.\n\u001e\nAnother fault is anger. Often a scientist becomes angry, and this is no way to handle things. Amusement,\n\u0004\nyes, anger, no. Anger is misdirected. You should follow and cooperate rather than struggle against the\n!\nsystem all the time.\n\u0006\nAnother thing you should look for is the positive side of things instead of the negative. I have already given\nyou several examples, and there are many, many more; how, given the situation, by changing the way I\n!\nlooked at it, I converted what was apparently a defect to an asset. I'll give you another example. I am an\n%\negotistical person; there is no doubt about it. I knew that most people who took a sabbatical to write a book,\n\b\ndidn't finish it on time. So before I left, I told all my friends that when I come back, that book was going to\n \nbe done! Yes, I would have it done - I'd have been ashamed to come back without it! I used my ego to\n\u001d\nmake myself behave the way I wanted to. I bragged about something so I'd have to perform. I found out\nmany times, like a cornered rat in a real trap, I was surprisingly capable. I have found that it paid to say,\n``Oh yes, I'll get the answer for you Tuesday,'' not having any idea how to do it. By Sunday night I was\nreally hard thinking on how I was going to deliver by Tuesday. I often put my pride on the line and\n\u0018\nsometimes I failed, but as I said, like a cornered rat I'm surprised how often I did a good job. I think you\n\u0006\nneed to learn to use yourself. I think you need to know how to convert a situation from one view to another\nwhich would increase the chance of success.\n\nNow self-delusion in humans is very, very common. There are enumerable ways of you changing a thing\n\u0011\nand kidding yourself and making it look some other way. When you ask, ``Why didn't you do such and\n\t\nsuch,'' the person has a thousand alibis. If you look at the history of science, usually these days there are 10\n\u0006\npeople right there ready, and we pay off for the person who is there first. The other nine fellows say,\n\u000f\n``Well, I had the idea but I didn't do it and so on and so on.'' There are so many alibis. Why weren't you\nfirst? Why didn't you do it right? Don't try an alibi. Don't try and kid yourself. You can tell other people all\nthe alibis you want. I don't mind. But to yourself try to be honest.\n\f\nIf you really want to be a first-class scientist you need to know yourself, your weaknesses, your strengths,\n\u000b\nand your bad faults, like my egotism. How can you convert a fault to an asset? How can you convert a\n\t\nsituation where you haven't got enough manpower to move into a direction when that's exactly what you\n\u0006\nneed to do? I say again that I have seen, as I studied the history, the successful scientist changed the\nviewpoint and what was a defect became an asset.\n\u0005\nIn summary, I claim that some of the reasons why so many people who have greatness within their grasp\n\u000b\ndon't succeed are: they don't work on important problems, they don't become emotionally involved, they\n \n",
  "speaker": "SYSTEM",
  "uuid": "558b9bb8-a1e3-483d-8793-99e4698f8344"
}