{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 40\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 40 de 42 \nSuitable for the Semantic Web. Codirectores: Guadalupe Aguado de Cea, Asunción \nGómez Pérez. Facultad de Informática. Universidad Politécnica de Madrid. Julio 2012. \nMención europea \n23. Rafael González Cabero. A Description Framework and Event-Driven Architecture for \nthe Semantic Web and Semantic Grid. Codirectores: María de los Santos Pérez \nHernández, Asunción Gómez Pérez. Facultad de Informática. Universidad Politécnica de \nMadrid. Julio 2012. Mención europea. Premio extraordinario. \n24. Luis Manuel Vilches Blázquez. Metodología para la integración basada en ontologías \nde información de bases de datos heterogéneas en el dominio hidrográfico. \nCodirectores: Miguel Ángel Bernabé Poveda, Óscar Corcho García. Escuela Técnica \nSuperior de Ingenieros de Topografía, Geodesia y Cartografía (UPM). Mayo 2011. Mención \neuropea. Premio extraordinario. \n25. Boris Marcelo Villazón Terrazas. Method for Reusing and Re-engineering Non-\nontological Resources for Building Ontologies. Directora: Asunción Gómez-Pérez. \nFacultad de Informática. Universidad Politécnica de Madrid. Abril 2011. Mención europea. \nPremio extraordinario. \n26. Elena Montiel Ponsoda. Multilingualism in Ontologies: Multilingual Léxico-Syntactic \nPatterns for Ontologiy Modeling and Linguistic Information Repositiory for Ontology \nLocalization. Codirectores: Asunción Gómez-Pérez, Guadalupe Aguado de Cea. Escuela \nTécnica Superior de Ingenieros de Montes. Universidad Politécnica de Madrid. Enero 2011. \nMención europea. \n27. Ángel López Cima. Modelado basado en navegación y composición de vistas para el \ndesarrollo de  aplicaciones web semánticas. Codirectores: Asunción Gómez-Pérez, \nÓscar Corcho. Facultad de Informática. Universidad Politécnica de Madrid. Octubre 2010. \n28. María del Carmen Suárez de Figueroa Baonza. NeOn Methodology for Building \nOntology Networks: Specification, Scheduling and Reuse. Codirectores: Asunción \nGómez-Pérez, Mariano Fernández López. Facultad de Informática. Universidad Politécnica \nde Madrid. Junio 2010. Mención europea. Premio extraordinario. \n2.5 \nPatentes y modelos de utilidad de los últimos años \n1. Barrasa Rodríguez J, Gómez Pérez A. ODEMapster. Nº Solicitud: M-005056/2008. \n2. Gómez Pérez A, Corcho García O, López Cima A, Siles Rodríguez A, Villazón Terrazas \nBM. ecReport. Nº Solicitud M-008803/2009. \n3. García Castro R, Gómez Pérez A. IBSE (Registro de software). Nº Solicitud: M-\n004546/2009. \n4. López Cima A, Corcho García O, Gómez Pérez A. ODESeW. Nº Solicitud: M-\n001192/2009. \n5. Corcho García O, Gómez Pérez A, Saquicela Galarza VH, Lago Manteiga R, Lama \nPenín M, Sánchez Vila EM. GeoBuddies-Camino de Santiago. Nº Solicitud: M-\n000413/2009. \n6. Villazón Terrazas BM, Ramírez Rodríguez J, Gómez Pérez A. Ontología de currículos \ny ofertas de empleo. Nº Solicitud: M-000404/2009. \n7. Corcho O, Gómez-Pérez A, Siles A, Jimenez-Martin A, Riera R., Montes A. DocenDIA. \nNº Solicitud: Nº Solicitud: M-2801/2011. \n8. Ramos G, Perez-Hernandez M. GEO-DSI. Nº Solicitud: M-2069/2011. \n9. Gómez-Pérez A, Suárez-Figueroa MC, Muñoz-García O, Vigo M. gOntt. Nº Solicitud: \nM-6071/2011. \n10. Saquicela V, Vilchez-Blázquez LM, García-Delgado MA, Corcho O, Villazón-Terrazas \nB, Gómez Pérez A, de León A. Map4RDF. Nº Solicitud: M-002493/2012. \n11. Gómez-Pérez A, Vila D, Villazón-Terrazas M. MARiMba. Nº Solicitud: M-002489/2012. \n12. Gómez-Pérez A, Villazón-Terrazas M. NOR2O. Nº Solicitud: M-001914/2012. \n13. Saquicela V, Vilchez-Blázquez LM, García-Delgado MA, Corcho O, Villazón-Terrazas \nB, Gómez Pérez A, de León A. Geometry2RDF. Nº Solicitud: M-002491/2012. \n14. Poveda Villalón M, Suárez de Figueroa Baonza MC, Gómez Pérez A. OOPS! Ontology \nPitfall Scanner. Nº solicitud: M-009445/2012. \n15. Gómez-Pérez A, Vila Suero, Corcho O. MARiMba v1.0.0. Nº Solicitud: M-7312/2014. \n16. Gómez-Pérez A, Corcho O, Rodríguez-Doncel V. Conditional Linked data. Nº \nSolicitud: M-8815/2014. \n17. Radulovic F, García-Castro R, Gómez-Pérez A. RIDER. Nº Solicitud: M-002699/2016. \n",
  "speaker": "SYSTEM",
  "uuid": "55bec921-d7d7-4daf-b897-13cd1a01bd9d"
}