{
  "message": "SYSTEM: CV-Cicyt_EMP_Enero2010.pdf: Página 4\nParticipación en Proyectos de I+D financiados en Convocatorias públicas. \n \n \n(nacionales y/o internacionales)  \n \nTítulo del proyecto: NeOn - Lifecycle Support for Networked Ontologies (FP6-027595) \nEntidad financiadora: Unión Europea \nEntidades participantes: The Open University,   Universitaet Karlsruhe, Universidad Politécnica de Madrid, Software AG, \nIntelligent Software Components, S.A., Institut Jozef Stefan, Institut Nacional de Recherche en Informatique et en \nAutomatique INRIA, The University of Sheffield, Universitaet Koblenz-Landau, Consiglio Nazionale delle Ricerche, \nONTOPRISE GMBH, Laboratorios KIN, S.A. (KIN), Food and Agriculture Organisation of the United Nations FAO, Atos \nOrigin S.A \nDuración, desde: 01-03-2006 hasta: 28-02-2010 \nInvestigador responsable: Enrico Motta \nNúmero de investigadores participantes: 60 \n \n \nTítulo del proyecto: Monnet – Multilingual Ontologies for Networked Knowledge (FP7-248458) \nEntidad financiadora: Unión Europea \nEntidades participantes: National University of Ireland, Deutsches Forschungszentrum für Künstliche Intelligenz GmbH DFKI, \nUniversität  Bielefeld, Universidad Politécnica de Madrid, SAP AG, XBRL Europe, Be Informed. \nDuración, desde: 01-03-2010 hasta: 28-02-2013 \nInvestigador responsable: Paul Buitelaar \nNúmero de investigadores participantes: 30 \n \n \nTítulo del proyecto: BUSCAMEDIA - Hacia una Adaptación Semántica de Medios Digitales Multirred-Multiterminal \n(CEN-20091026) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: TOS Origin, Activa Multimedia, GFI, Indra, CCMA, Bilbomática, Fractalia, BMAT, ISID, iSOCO, \nDaedalus, Universidad Politécnica de Madrid, Universidad Nacional de Educación a Distancia, Robotiker Tecnalia, \nUniversitat Pompeu Fabra, Universitat Politécnica de Catalunya, Universidad Carlos III de Madrid, Fundació Barcelona \nMedia, Fundación CTIC \nDuración, desde: 01/10/2009  \nhasta: 31/12/2012 \nInvestigador responsable: John Paul Moore Olmstead (proyecto), Oscar Corcho García (UPM) \nNúmero de investigadores participantes: +100 \n \n \nTítulo del proyecto:  \nEntidad financiadora:  \nEntidades participantes:  \nDuración, desde:  hasta:  \nInvestigador responsable:  \nNúmero de investigadores participantes:  \n \n \nTítulo del proyecto:  \nEntidad financiadora:  \nDuración, desde: hasta:  \nInvestigador responsable:  \nNúmero de investigadores participantes: \n \n",
  "speaker": "SYSTEM",
  "uuid": "56256910-3620-4f98-bd9c-40e0e9dd2205"
}