{
  "message": "SYSTEM: Resoluci%C3%B3n_de_3_de_junio_de_1991%2C_de_la_UPM_por_la_que_se_acuerda_la_publicaci%C3%B3n_del_Reglamento_de_Becarios_de_dicha_Universidad.pdf: Página 1\n22520\nViernes 5 julio 1991\nBOE núm. 160\n17476\nTelevisión y video:\no\nCertificado reproducción de imagen (base 3.<1.).\nO Certificado Director emisora (base 2.a).\ne\nAutorización emisión progrnma (base 4.:1).\nFatograji'a:\no Certificado Director de la Empresa editora (base 3.:1).\nCertificado reproducción de imagen.\nlnrestigación y ayudas técnicas:\no\nAutorización para su publicación (base 4.a).\nILMO. SR. DIRECTOR GENERAL DEL INSTITUTO NACIONAL\nDE SERVICIOS SOCIALES\nUNIVERSIDADES\nRESOLUCION de 3 de junio de /991, de la Universidad\nPolitécnica de Madrid. por la que se acuerda la publicadón\ndel Reglamento de Becarios de dicha Unúwsidad.\nLa Junta de Gobierno de la Universidad Politécnica de Madrid, en\nsu sesión celebrada el dia 25 de abril de 1991, aprobó el Reglamento de\nBecarios que ha de regir en la Universidad. Este Rectorado viene a\nacordar su publicación.\nMadrid, 3 de junio de 1991.-EI Rector, Rafael Portaencasa Baeza.\nREGLAMENTO\nSOBRE\nBECARIOS\nDE\nLA\nUNIVERSIDAD\nPOUTECNICA DE MADRID\nPREAMBULO\nEl articulo 26.3 de la Ley Orgánica 11/1983, de 25 de agosto, de\nReforma Universitaria, habilitó a las Universidades para quc instru-\nmentasen una política general de becas y ayudas a los estudiantes, en\ncuya virtud. el· articulo 146.1 de los Estatutos de la Universidad\n~ Politecnica de Madrid, aprobados por Real Decreto 2536/1985, de 27 de\ndiciembre (((BolcHn Oficial del EstJdo» de 22 de enero de 1986), señaló\nen sus artículos 136 y 146.1 que los contratos y convenios que celebrasen\nlos Departamentos o Institutos podrían incluir propuestas de asignación\nde fondos destinados a conceder complementos. o becas a quienes\ncolaborasen en su ejecución para tomentar su lnlclación a los meta-\ndos y técnicas de investigaCión: senaJandose a continuación, en el\narticulo 147.1, b). que parte de los recursos procedente. de los l..'ontratos v\nconvenios para la realización de trabajos cientíilcos. técnicos o artisti'-\ncos, o cursos de especialización desarrollados por fos Departamentos,\nInstitutos Universitarios o por fos Profesores, podía estar· destinada ;]\nsufragar complementos, bec::lS o indemnizaciones por viajes y dietas:\nlimitando la posibilidad de imponer responsabilidades frente a terceros\nen los contratos que suscribiesen los Profesores de la Universidad a\ntítulo particular. determinando que a dicho titulo corresponden igual-\nmente las responsabilidades. pero sm que ello impida que entre los\nrecursos de este tipo de contratos puedan determinarse consignaciones\neSp{'dficas para los becarios, siempre y cuando se garantice que. en\nnmgún caso, tales responsabilidades hayan de ser asumidas por la\nUniversidad. Entre los derechos de los estudiantcs, el articulo 197, e),\nrcconoce el de beneficiarse de ayudas al estudio que eviten la discrimina-\nción, por razones económicas,\nPor otra parte la Orden de 27 de m¡¡rzo de J 986 ((BoJe!in\nOfil'i~\\l dd\nEstadm) de 30 de abril), establece'la pOSibilidad de que las Univcrsidades\np'ucdan conceder con cargo a los contratos y proyectos de investigación\nclentifica y !ecnica, becas para estudIantes de tercer CIclo, en las\nmodalidades y cuantías que se establezcan, senalanda limitaciones.\nsolamente en el caso de proyectos subvencionados por el\nFondo\nNacional de Investigación Cícntifíca y Tccnica.\nEl Real Decreto 1497/1981. de 19 de junio ((Boletin Oficial del\nEstad@ de 23. de julio), estabkcía los programas de coopt'ración\neducativa para el reforzamiento de fórmaClón de los alumnos umversita·\nrios y las -áreas operativas dc las Empresas a fin de aproximar la\nenseñanza universitaria a aquéllas, con una visión real de Jos problemas\ny sus interrelaciones, preparando su incorporación futura al trabajo,\nEs conveniente tambien contemplar en toda su extensión el espectro\npcrsonul de los becarios comprendiendo a la totalidad del alumnado\nuniversitario. para dotar a los estudios de un copJemento de practlcldad.\nque también se articula, con sus peculiaridades, para los cursos de\nespecialización. y que tienen la finalidad de aproximar la Universidad\na la Empresa. y empezar a captar vocaciones uOlversitarias desde el\ncomienzo de los estudios. Igualmente. se incorpora el reconocimiento\nintrauniversitario de los becarios con cargo a programas de instituciones\nsupranacionales. por racionalidad administrativa,\nEn base a todo lo expuesto la Junta de Gobierno de la Universidad\nPolitécnica de Madrid aprueba el presente Reglamento, que sintetiza las\nmodalidades a que hemos hecho referencia. y articula una norma que\nconfigura la política general de becas y ayudas de la Universidad\nPolitécnica de Madrid, sin perjuicio de otros ámbitos ajenos a la\nUniversidad en los que se reglamente dicha materia. Tal política\nuniversitaria cumple con dos objetivos claves. siendo el primero el de\natender a una finalidad academica y de investigación Que contribuya a\nla mejor formación científica, técnica o artística de los estudiantes,\nmientras que, la segunda. atiende a una finalidad social de dotación. de\nauxilios económicos al alumnado de modo que. además, pueda servlrle\npara aumentar su campo de relaciones con otros sectores.\nEntre los derechos que los Estatutos de la Universidad reconocen a\nsu profesorado se encuentra el de asistencia a cursos de cspecialización,\nperfeccionamiento y doctorado (artículo 158.1, g)], con el que puede\ncumplimentarse el deber de desarrollo, actualización y mejora de sus\nactividades docentes e investigadoras [art 158.2. b)J. Hay un derecho-\ndeber a la formación del profesorado de la Universidad. Que a ésta\ncorresponde estimular y facilitar. para quc redunde en la calidad de la\ndocencia e investigación institucional. A tal efecto se sienta el marco\njurídico especifico de la Universidad, para mejor cumplir su competen·\ncia orgánica de atención a la formación promoción de su personal\ndocente. que contempla el articulo 3.2, e), de la Ley de Reforma\nUniversitaria, complementando otras acciones estatales al respecto.\nTodo ello se enmarca en el desarrollo de la autonomia específica de\nla Universidad Politécnica de Madrid, para lo cual, segun ha reconocido\nel Tribunal Constitucional, cuenta esta institución con la facultad de\ndotarse de un ordenamiento que atienda a la más perfecta consecución\nde la mencionada autonomía. El presente Reglamento viene a sustituir\nal publicad.... por Resolución de II de septiembre d<: 1989 ((Boletín\nOficial del EstadO) de 9 de octubre). perfeccionando los instrumentos\nque en el mismo se contenían a partir de la experiencia de su aplicación.\nPor todo ello la Junta de Gobierno de la Universidad ha aprobado\nel presente Reglamento, y, en su virtud, dispone:\nCAPITULO PRIMERO\nDisposiciones generales\nArtículo 1.0\nSe entiende por beca, bolsa o ayuda al estudio y a la\ninvestigación toda cantidad o beneficio que la Universidad Politécnica\nde Madrid conceda a quienes vayan a realizar. se encuentren realizando\no ha'.,an terminado estudios, para su promoción educativa. cultural,\nprofc'sional, científica y artística en la Universidad.\nArt. 2.°\nl.\nJlodafidadcs.-las becas, bolsas y ayudas que conccda\nla Uníversidad Politécnica de t\\Iadrid. adoptarán las siguientes modali-\ndades:\na)\nBecas para la formación del personal docente.\nb)\nBecas de colaboración en los Convenios. contratos o proyectos\nde lnvestig¡¡ción cientillca y técníca.\nc)\nBolsas y ayudas al eslUdio.\nd)\nBolsas y ayudas al estudio para programas de cooperación\nedurativ<\\,\ne)\nBecas de colaboración con cargo a programas financiados por\nOrgilnismos supranacionaJes.\n_.\nA las anteriores modalidades resultará de aplicación el Régimen\nde Derccho ·Administrativo esp:cíal que en estc Reglamento se esta-\nblece, \\. respectivamente,\npara cada\nuna de las\nmodalidades.\nla\nNnrmaii\\a para contratar. con entidades públicas o privadas, la realiza-\nción de trabajos de carácter científico, tecnlco o artístico y cursos de\nespecializaCIón. el Reglamento de indemnizaciones por causa de conVe-\nnios. contratos y proyectos, a que se refiere el artículo. 11 _de la ley\nOrgjnica 11/1983. de 25 de agosto, de, Reforma Unl\\crsltarl<l. aproba-\ndos por la Junta de Gobierno de la CnIH.'rsidad Politécnica de Madrid.\nla Orden de 27 de marzo de 1986 (((BoJetin Oficial del EstadO)) de 30 de\nabril), el Real Decreto 2298/1983. de 28 de julio («Boletín Olkial del\nEstadO)) de 17 de agosto). y el Rl'al Dccreto 1497/198 J. de 19 de junio\n({(Boletín Ofióal del Estado» del 23). en lo que no resulte atCctauo por\ncste\nRl.'glaml'n~o.\n3.\nSe excluvcn de la presente norma y de las relaciones que de ella\nse deriven, los contratos en prácticas y para la formación a que hace\nr\",fcrl'nl'ia el Real Decreto 1992/1984. de 3l de octubre (<<Boletín Oficial\nud EstadO» de 9 de noviembre). al igual que los restantes preceptos del\n",
  "speaker": "SYSTEM",
  "uuid": "5650e49e-d411-4fc9-b5ef-d5999e56ee64"
}