{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 4\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11153\nArtículo 5.  Plazos de presentación de solicitudes.\n1.  Los plazos de presentación de las solicitudes de participación en cada subprograma \nserán los siguientes:\na)  Subprograma FPI-MICINN:\n1.º  Ayudas para la formación de personal investigador: del 8 al 22 de febrero de \n2010, ambos inclusive.\n2.º  Ayudas para la realización de estancias breves en otros Centros de I+D: del 16 al \n30 de septiembre de 2010, ambos inclusive.\n3.º  Ayudas para los precios públicos por matrícula en el máster o doctorado: del 16 \nal 30 de septiembre de 2010, ambos inclusive.\nb)  Subprograma FPI-INIA: del 9 al 23 de marzo de 2010, ambos inclusive.\n2.  De acuerdo con el artículo octavo.1 de la Orden ECI/266/2008, de 6 de febrero, se \nestablece que la cumplimentación de las solicitudes se realizará por medios telemáticos. \nPara acceder a los medios telemáticos de cumplimentación de solicitudes será necesario \nestar previa y correctamente registrado en los diferentes sistemas de registro e identificación \nde solicitantes que disponen los órganos o departamentos convocantes. En los casos en \nque así se especifique en los respectivos subprogramas, se podrá establecer un plazo \npara aquellos solicitantes que deban acceder a alguno de dichos registros, previo a la \nfinalización del plazo de presentación de solicitudes recogido en este artículo, con el fin de \npoder completar a tiempo el envío telemático de sus solicitudes.\nArtículo 6.  Subsanación de las solicitudes.\nDe conformidad con lo previsto en el artículo 23.5 de la Ley 38/2003, de 17 de \nnoviembre, si la documentación aportada durante el periodo de presentación de solicitudes \nfuera incompleta o contuviese errores subsanables, se requerirá al solicitante, para que en \nel plazo de 10 días hábiles subsane la falta o acompañe los documentos preceptivos, con \nadvertencia de que si no lo hiciese, se le tendrá por desistido de su solicitud, previa \nresolución que deberá ser dictada en los términos previstos en el artículo 71 de la Ley \n30/1992 de 26 de noviembre, de Régimen Jurídico de las Administraciones Públicas y del \nProcedimiento Administrativo Común.\nArtículo 7.  Trámite de audiencia.\nDe conformidad con lo previsto en el artículo 24.4 de la Ley 38/2003, de 17 de \nnoviembre, el órgano competente para la instrucción, pondrá de manifiesto a los interesados \nla propuesta de resolución provisional, concediendo a todos los solicitantes un plazo de 10 \ndías hábiles para que puedan formular las alegaciones que estimen oportunas.\nNo obstante, se podrá prescindir del trámite de audiencia cuando no figuren en el \nprocedimiento ni sean tenidos en cuenta otros hechos ni otras alegaciones y pruebas que \nlas aducidas por los interesados.\nArtículo 8.  Resolución y notificación.\n1.  El órgano instructor, recogido en el artículo 3.1, elevará al órgano competente para \nresolver la concesión de las ayudas la correspondiente propuesta de resolución definitiva.\n2.  De conformidad con lo previsto en los artículos 25 y 26 de la Ley 38/2003, de 17 \nde noviembre, el órgano competente para la resolución dictará y publicará en su página \nweb la correspondiente Resolución en el plazo máximo de seis meses a contar desde el \ndía siguiente al de la finalización del periodo de presentación de solicitudes de cada \nsubprograma. En virtud de lo establecido en el artículo 25.5 de dicho texto legal, si \ntranscurrido dicho plazo no se hubiera publicado resolución, los interesados estarán \nlegitimados para entender desestimadas sus solicitudes. La publicación de la resolución \nen la página web servirá de notificación a los interesados.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "570de363-333d-4c02-be19-cb488b7db05b"
}