{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Meeting_El_Viajero_-_iSOCO_9_Marzo_2011 \n\nMinutes\n\nPresentación caso de uso PRISACOM\nVanesa\nSi no se ve algun componente decirlo ahora.\nSe han cambiado algunas cosas: caja el buscador, etc.\nComenzado con la doc. del caso de uso anterior.\nUsers:\nfacebook connect?\nDani: usuarios del viajero\nPor motivos técnicos integrado con fb\nse puede cambiar, lo analizarán, o alguna alternativa basada en omnitur, o integrar en el registro.\nse puede solicitar que los usuarios participen en la demo/aplicación\npantalla inicial con login ... registro usuario de login del viajero, en principio si lo meteran\nModelo:\nBasado en dos partes:\nen areas, o tabset por componente?\nbuscador, hacen question answering para que en la pantalla de resultados poner los componentes\nsugerencias de amigos conectados, etc.\na partir de n preguntas aparece un buscador\nmejor dar las dos opciones\n- Cristina: pregutnas con respecto al slide 5\nfaltan datos para responder preguntas\nsites externos, o ayudar a identificar el viaje\n(ejemplo del NY Times para el viaje)\no que sea recomendación\nno se etiquetan mucho los contenidos, sólo con personas y geolocalizacion\nse presentan dos alternativas\nnote: yahoo game/google  ... misma imagen a varios usuarios ....\nde momento: buscador, recomendador, ... q queries entran o no.\nbase de datos la ficha entre la noticia, precios de restaurante y hotel, no está en el xml, pero seria sencillo.\nse puede unir a la noticia con el trabajo de dani\nno hay base de datos de entidades turísticas\nasociar a pais/region info asociada, buscarlo en LD? o sacar precio medio del directorio.\nKayack, iberia, búsqueda sobre precio\no buscar algo en indice de consumo\nnote: preguntar por site de consumo\ngeolocalizacion, html5? eso lo harán los de prisacom,\npreguntas del slide 5, tipo de destino\nTener por cada noticia, el tipo de viaje, Dani, lo puede hacer. Lo confirma ellos y DAni lo parsea y se lo pasa a Cristina.\nenfasis en la definción del viaje\nincluir contenido de otros viajes, comentarios de otros viajes\nmodulo de ingreso Cristina se encarga y Dani le pasa el xml rest a ella\nque se guarda en el viaje.\nreferencias para construir el viaje\nlos articulos del viajero no tiene valoracion, sólo hay me gusta de facebook\nsi se puede pasa datos de las recomendaciones ...\npaginas de resultados añadir las guias en ciudad y contenidos\nnote: discusion con posibilidad de extender el visualizador (discutirlo con Alex et al., amend del TA? ... )\nexente, interfaz gráfica, no es posible lo del mapa, si el paso de pintar contenidos\nexente, interfaz gráfica, multidispositivo, navegador ...\nreunion para ver este tema\nparte final, crear viaje, lo de los tags, editar viaje,\nlistado de puntos que componen el viaje\nsubir vivencias de viajes:\nsubir fotos a cada punto del viaje\ncomentario a cada punto del viaje\nque el contenido editorial tuviera más peso\nno solo consultar el viaje sino extenderlo también, reutilizar uno creado\nPresentacion Dani\ncampo de publicacion del articulo: por lo general madrid\nparsing errors: envio de ficheros de fallaban\nel viajero empieza 2008, los que pueden fallar son de antes\nerrores de febrero:\nurls ... lo hablaran entre ellos\nnota: que avisen antes de hacer cambios\nviajes\ncomentarios de las guias, no los tenemos\nhoteles y restaurantes, tienen los mapas asociados, punto geográfico exacto\nmandar ejemplo de un articulo con mapa\n.PES, tener un pdf asociado, para asociar la página impresa\nincluir en la relevancia la fecha de publicacion de la noticia\ncambiar los emails .... prisadigital.com\ncompra de viaje\nañadir el metadata al pubby para poner los datos\nCristina\nftp, sección - noticia con sección web\nIES, fotos ... alguna manera de accededer. en el IES se incluye el nombre del fichero.\nruta de los archivos para las imagenes, enviar un mail con las peticiones concretas\nvicomtech guardara los viajes.\nmunimadrid nos pondrán contacto con ellos para tener los datos, escribirles un email.\nmodulo de ingreso upm y cristina para llamar a lo de dani\nboris: publicar linkeddata en nuestro server: linkeddata.es . cristinano tiene problema\nComentarios\nCerrar el caso de uso\nmeeting con iñaki, cristina, upm y prisa\ncalendario\na partir del proyecto cerrado\nproyecto acaba en marzo de 2012\ncerrado en diciembre 2011\nprimera iteración antes del verano, a final de junio\nenviar a guillermo un calendario general por mail",
  "speaker": "SYSTEM",
  "uuid": "5713004e-d8e3-44e8-8a61-462db07837b6"
}