{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle MP1: \"Semantic modelling for the touristic sector: the Tourist Apartments use case \".\n- Description MP!: En los últimos años las viviendas turísticas se han vuelto más y más populares frente a los alojamientos tradicionales. Además de la información proporcionada en los distintos portales ofertando viviendas turísticas, los colegios registradores siguen su propia estructura. El objetivo de esta línea de acción es construir un modelo común para armonizar e integrar la información compartida para los usuarios en los portales como la generada y mantenida en los colegios registradores.\n- Funding schema: not funded\n- Asignado a: Esther Gómez\nMaria S. Perez\n\nTitle MSP1: “Escalabilidad de modelos híbridos de Deep Learning para la mejora de la predicción”.\n- Description MSP1:  El objetivo global del proyecto es la integración de los paradigmas de HPC (High Performance Computing) y Big Data.  Se pretende partir de la investigación de modelos híbridos de Deep Learning (Redes Neuronales Recurrentes, que permiten incorporar información temporal, y Redes Neuronales Convolucionales, que son apropiadas para variables espaciales) para la mejora de la predicción de determinadas variables de diferentes casos de uso, que se caracterizan por ser modelos robustos, flexibles, extensibles, integrables y portables. El objetivo del TFM es la mejora de la característica de escalabilidad de dichos modelos.\n- Funding schema: Proyecto CABAHLA\n- Asignado a: Persona contratada por el proyecto (si es del máster de IA)\nAna Iglesias\n\nTitle AI1: “Translating between mapping languages for Knowledge Graph construction”.\n- Description AI1: The increasing use of RDF-based Knowledge Graphs (KG) in the last decades has lead the community to come up with a wide variety of ways to transform data and generate KGs. One way is based on the use of mapping languages, that represent the rules to transform data into RDF. Nowadays, there are many different languages available, but not interoperability among them. The objective of this thesis consists of developing a solution that enable translations between mapping languages, to increase interoperability and potentiate the use of this technologies to generate KGs.\n[ONGOING] Title AI2: “Generating and enriching the Drugs4Covid Knowledge Graph”.\n- Description AI2: In this work, the student will build a Knowledge Graph with relevant concepts mentioned papers related to COVID-19 (the CORD-19 dataset): chemicals, genes, proteins and diseases, associations among them and the evidence that they are based on. This work will not only serve to be a biomedical knowledge base, but for promoting evidence-based research and the discovery of novel associations, such as potential drug repurposing or genetic predisposition to diseases.\nJulián Arenas-Guerrero\n\nTitle JAG1: ”Fine-grained Analysis of SQL Queries Generated by Virtual Knowledge Graph Systems”.\n- Description JAG1: Virtual Knowledge Graph systems allow to query relational databases as if they were a knowledge graphs. This involves the translation of SPARQL queries to their equivalents in SQL. However, the resulting SQL queries in this process are often inneficient, for instance they contain unnecesary cross joins, DISTINCT clauses, correlated subqueries, etc. This work consists in performing a fine-grained analysis that could be used as a reference to optimize Virtual Knowledge Graph systems.\nTitle JAG2: ”Inference in Knowledge Graph Materialization with RML”.\n- Description JAG2: RML is used to map heterogeneous data sources to RDF knowledge graphs. In the presence of an ontology, it is possible to do reasoning. To achieve this in materialization (instantiation of the entire RDF), there are two options: saturating the RML mappings with additional rules that generate the inferred triples, or afterwards with mechanical forward chaining. This work consists in developing a simple module in Python to saturate RML mappings (that can then be used by tools such as Morph-KGC) and comparing it to mechanical forward chaining (e.g. owlrl library).\nPablo Calleja\n\nTitle: Language Model adaptation measuring the impact of NER, coreference and sentence transformation in small corpora available scenarios.\n- Description: The generation of language models such as BERT and GPT-3 requires a huge amount of corpus and a huge amount of hardware requisites. However, language models can be adapted to particular scenarios with enough data. Moreover, this data is usually comprised of sentences (e.g, extracted from books) and representative of the language. The objective of this work is to adapt language models in those scenarios in which the available data is low and in which the presence of named entities and bad sentence constructions can degenerate the adapting process of the model through processes that could clean and generalize the available data.\n- No funding available\nCourse 20/21\n\nOscar Corcho\n\nTitle OC1: \"An analysis and proposal of metrics for Explainable AI\"\n- Description OC1: Recent literature on Explanaible AI (XAI) proposes different dimensions that need to be explored when analysing the explainability capabilities of machine learning models. The objective of this MSc thesis is to make a systematic analysis of the current state of the art in this area, identifying the metrics that are being used in different papers related to this topic, and make a proposal of the metrics to be used, and the types of evaluations to be made, for different types of machine learning models\"\nTitle OC2: \"Combining ontologies and machine learning models for Explainable AI\"\n- Description: Some initial papers have started appearing on the last two years on the usage of ontologies for providing explanations of machine learning models that have been generated with different types of algorithms. Some of them focus on using classes and properties, as general as possible and as specific as needed, identified in ontologies in order to explain these models. The work done in this MSc thesis will be focused on understanding the current state of the art in this area, and propose alternative ways to use ontologies for such explanation.\nTitle OC3: \"Using ontologies and description logics to represent and reason around probabilistic graphical models\"\n- Description: Several works have been proposed in the past for the representation of probabilistic graphical models using ontology languages like OWL, or extending them, with the corresponding definition of the semantics of the proposed language and of reasoning procedures. This MSc thesis will focus on advancing the state of the art in this area by testing and providing new tools that implement those reasoning procedures, and applying them in the context of autonomous networks.\nTitle OC4: \"Creating a network of ontologies and declarative mappings to generate a knowledge graph for Open Data for universities\"\n- Description: In this work we will create a network of ontologies that allow describing some of the core datasets that are being considered for the publication of open data for universities across Spain (and applicable elsewhere as well), together with the corresponding declarative mappings for the generation of a knowledge graph. This work will have a lot of impact in a real use case.\nMariano Rico",
  "speaker": "SYSTEM",
  "uuid": "57e0253d-e5d6-4e8a-b7de-db41c14e967c"
}