{
  "message": "SYSTEM: IntegratorDesignDocument.pdf: Página 6\nWindows\nWindows can be applied to a stream, using the following syntax:\nFROM NAMED STREAM <IRI> [start TO end SLIDE literal]\nwhere start and end are of the form NOW or NOW – literal, and literal represents some number of \ntime unit from {DAYS,HOURS,MINUTES,SECONDS}.\nStored Data Scans\nFor continuous queries, a mechanism must be introduced to coherently join streaming and \nstored data. The assumption of non-changing stored data is not realistic. We use the notion \nof scanning stored data, with an interval parameter that dictates the frequency with which the \nstored data will be scanned. The scan interval is expressed as:\nFROM <IRI> [SCAN literal]\nwhere literal represents some time unit. The result is a window that can be evaluated just like \nthe window produced from streams.The stored data has a time associated with it, which it the \ntime when it was read. \nExample Queries\nSimple Query\nReturn the wave heights, locations and times where the wave height has exceeded the storm \nthreshold for the last 10 hours. Update the result every 10 minutes, and check the storm \nthresholds every day.\nPREFIX wave: <http://...>\nSELECT ?loc ?hs ?time\nFROM STREAM <virtualWaveStream> [NOW - 10 HOURS TO NOW SLIDE 10 MINUTES]\nFROM GRAPH <virtualStormThreshold> [SCAN 1 DAY]\nWHERE {\n?w a wave:WaveHeightMeasurement ;\n    wave:hasValue ?hs ;\n    wave:hasLocation ?loc ;\n    wave:measuredAt ?time .\n?loc a wave:Location ;\n    wave:hasStormThreshold ?limit .\nFILTER (?hs > ?limit) .\n}\nComplex Example\nCalculate the fire risk rating according to the method given by (Sharplesa et al, 2009). The \ndanger rating is computed as\n \nwhere U is the wind-speed (km/h), T is the temperature (ºC), and H is the relative humidity (%). \nThis index uses the fact that certain climatic conditions, i.e. higher temperature, higher wind \nspeed, and lower humidity, lead to increased risk of fire and destructive potential of a fire. The \naverage for each of the temperature, humidity and wind speed variables is first obtained using \nsub-queries, and then the formula is applied.\n \nPREFIX fire: <http://www.semsorgrid4env.eu#> \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \n",
  "speaker": "SYSTEM",
  "uuid": "580ef3ef-ca7e-4170-becf-0c69e1558e5e"
}