{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 4\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 4 de 42 \n1.2.1 \nProyectos con empresas  \nEl  personal docente e investigador del Grupo de Ingeniería Ontológica ha participado en 46 \ncontratos de investigación y transferencia tecnológica con entidades nacionales e \ninternacionales, públicas y privadas, en el ámbito no competitivo, en las áreas de \nconocimiento relacionadas con semántica, Web semántica y Datos Enlazados.   \nEstas empresas, de gran relevancia y peso socioeconómico a nivel nacional e internacional, \nson: AENOR, Asociación Centro de Tecnologías de Interacción Visual y Comunicaciones-\nVICOMTECH, Agencia Española del Medicamento, Asociación Española de Comercio \nElectrónico, Atos Origin S.A., Banco Santander, Biblioteca Nacional de España, Centro \nNacional de Información Geográfica-Ministerio de Fomento, Consorcio Regional de Transportes \nde Madrid, Deimos Space S.L., Escuela de Organización Industrial, Food and Agriculture \nOrganisation of the United Nations (FAO) (Italia),  Fujitsu Laboratories of Europe Limited (Reino \nUnido), IBM, Indra Sistemas, S.A., Intelligent Software Components, Microsoft, MPG, Real \nAcademia Española, Red.es, Safe Creative S.L., Telefónica I+D, S.A.U. World Health \nOrganization (OMS). \nEntre todos estos proyectos, merece señalar el portal de datos enlazados de la Biblioteca \nNacional de España (datos.bne.es), en el que hemos aplicado las estrategias de los datos \nenlazados para optimizar las consultas y acercar la Biblioteca a la ciudadanía.   \n1.2.2 \nProyectos del Plan Nacional \nEl personal docente e investigador del Grupo de Ingeniería Ontológica, desde el año 2002, ha \nparticipado en 54 contratos de investigación financiados por el Plan Nacional. Además de los \nproyectos del Plan Nacional de investigación básica y fundamental, a continuación se \nenumeran algunos de los proyectos obtenidos en convocatorias relacionadas con transferencia \ntecnológica. Cabe destacar los recursos obtenidos en el marco del Programa CENIT \n(Consorcios Estratégicos Nacionales en Investigación Científica). En este contexto, se ha \ndesarrollado la iniciativa geo.linkeddata.es, en colaboración con el CNIG, en la que se han \ntransformado a Datos Enlazados recursos geoespaciales del Instituto Geográfico Nacional a la \nvez que se han enlazado con fuentes externas. Asimismo, ha sido también de relevancia la \nfinanciación recibida del Plan Nacional a través de las convocatorias PROFIT (Programa de \nFomento de la Investigación Tecnológica) en el Área de Tecnologías de la Sociedad de la \nInformación, así como la obtenida en el marco de la Acción Estratégica de Telecomunicaciones \ny Sociedad de la Información, dentro del Plan Nacional de I+D+I, con el subprograma Avanza. \nEn los cinco últimos años se ha participado en los siguientes proyectos nacionales: 4V \n(TIN2013-46238), LPS-BIGGER (IDI-20141259), Red de Recursos para Tecnologías de la \nLengua (TIN2015-68955-REDT), Red Española Red Temática Española de Datos Abiertos en \nlas Ciudades Inteligentes (TIN2014-53161-REDT), BabeLData (TIN2010-17550), myBigData \n(TIN2010-17060), Red Temática Española de Linked Data (TIN2010-10811-E), España Virtual \n(CENIT 2008-1030), mIO! (CENIT 2008-1019), BuscaMedia (CENIT 2009-1026), Ciudad 2020 \n(TPT-20111006). \n1.2.3 \nProyectos europeos \nEs de reseñar que en el marco de las convocatorias públicas competitivas a nivel internacional \n(financiación de la Comisión Europea a través de diferentes programas marco), que recogen \nlas inquietudes/necesidades/demandas socioeconómicas y científicas a nivel internacional, el \npersonal docente del Grupo, en los últimos 15 años, ha obtenido financiación a través de 40 \nproyectos de investigación (coordinando 9 de ellos). \nEl Grupo ha participado o está participando en los siguientes proyectos europeos. En negrita se \nseñalan los proyectos europeos en los que se ha participado como coordinador. MKBEEM \n(IST-1999-10589), OntoWeb (IST-2000-25056), Esperonto (IST-2001-34373), OntoGrid (FP6-\n511513), NeOn (FP6-027595), SEEMP (FP6-027347), Knowledge Web (FP6-507482), \nSemsorGrid4Env (FP6-223913), ADMIRE (FP7-215024), DynaLearn (FP7-231526), SEALS \n(FP7-238975), SCALUS (FP7-238808), MONNET (FP7-248458), PlanetData (FP7-257641), \n",
  "speaker": "SYSTEM",
  "uuid": "59d79eb7-d64b-4538-9dff-390e970f0214"
}