{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 33\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n38\n3. CREACIÓN Y PUBLICACIÓN DEL DIRECTORIO DE BASES\nDE DATOS, UNA VEZ VALORADOS E INTERPRETADOS\nLOS RESULTADOS DERIVADOS DEL ANÁLISIS\nComo resultado de la descripción de las bases de datos a la que hemos hecho referen-\ncia en el apartado anterior, se ha generado un directorio con los registros o asientos de las\nbases de datos analizadas. \nLos registros o asientos de descripción de las bases de datos siguen un criterio de orde-\nnación por ministerios y, dentro de cada ministerio, por organismos editores.\nComo se ha explicado anteriormente, de la totalidad de campos analizados en la fase\nanterior, el equipo de investigación hizo una selección. Así pues, la estructura de los regis-\ntros se atiene a los siguientes campos seleccionados para su publicación: \nOTROS (cont.)\nPosibles causas\no criterios de\nexclusión:\nEn relación con el campo anterior, se trataba, adicionalmente, de tipificar\nlas razones de exclusión, a la luz de los criterios establecidos en la\nDirectiva.\nLas categorías de los criterios de exclusión son las siguientes:\na) Derechos de propiedad intelectual de terceros. Casos en lo que figure\nalguna autoría en la base de datos, salvo que sea el propio organismo\npúblico editor. En caso de encontrar alguna anotación dudosa, consignar-\nlo en el apartado d) Otras causas de exclusión. \nb) Documentos conservados por instituciones de educación e investigación\n(bibliotecas, archivos, centros de investigación). A estos efectos, se\ndeben considerar los catálogos de estos centros como documentos, por lo\ncual quedarían excluidos del régimen de reutilización y también todos los\ndocumentos similares a los del apartado siguiente.\nc) Documentos conservados por instituciones culturales (museos, bibliote-\ncas, archivos, teatros). Afecta a todas las colecciones de documentos y\ncolecciones digitales puestos en línea por estas instituciones. \nd) Otras causas de exclusión. Debían consignarse los casos en que la base\nde datos contuviera información sobre defensa nacional, seguridad, etc.\nSe debían anotar aquí también las incidencias o singularidades de los tres\napartados anteriores.\nNúmero de registro:\nBase de datos:\nDirección Web:\nNúmero correlativo asignado a cada base de datos descrita.\nQue se corresponde con el campo “Título” del formulario de descripción\nde bases de datos explicado en el apartado anterior. \nURL de acceso a la base de datos desde el ministerio de referencia.\nEjemplo: \nhttp://www.mapa.es/es/ministerio/pags/biblioteca/plagas/consulta.asp\nBASES DE DATOS  1/1/04  03:39  Página 38\n",
  "speaker": "SYSTEM",
  "uuid": "5a1bf886-245f-43f2-8a18-708cd970c547"
}