{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 13\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11162\námbito estatal y se crea el Registro de tales centros, así como los Centros de Innovación \ny Tecnología constituidos al amparo del Real Decreto 2609/1996, de 20 de diciembre, que \nhayan solicitado la inscripción provisional como centros tecnológicos de ámbito estatal en \nel registro creado por el Real Decreto 2093/2008.\nArtículo 27.  Dotación de las ayudas.\n1.  Las ayudas a las que se refiere este subprograma comenzarán a contar su plazo \ndesde la fecha de incorporación del investigador al Centro de I+D, de acuerdo con lo \nestablecido en el artículo 29.\n2.  Durante el período de beca la cuantía de las ayudas incluirá el importe de la beca \ny el coste de la cuota patronal a aportar a la Seguridad Social, que correspondan para \ncada año. La cuantía de las becas será de 1.142 euros mensuales brutos.\nDurante el periodo de beca, de acuerdo con el Real Decreto 63/2006, de 27 de enero, \npor el que se aprueba el Estatuto del personal investigador en formación, los becarios \nquedarán asimilados a trabajadores por cuenta ajena, a efectos de su inclusión en el \nRégimen General de la Seguridad Social. La solicitud del alta en el Régimen General de la \nSeguridad Social será efectuada por el Ministerio de Ciencia e Innovación con efectos del \ndía de incorporación del investigador beneficiario al Centro de I+D, de acuerdo a lo indicado \nen el artículo 29.1.\n3.  Durante el período de contrato, la ayuda anual para cada uno de los contratos que \nse formalicen al amparo de este subprograma será la correspondiente a 14 mensualidades \nde 1.173 euros brutos mensuales. La retribución mínima anual que deberán recibir el \ninvestigador en formación, y que figurará en su contrato, será de 16.422 euros brutos \nanuales.\nAdicionalmente, el coste de las aportaciones a la cuota patronal a la Seguridad Social \nde los investigadores contratados será igualmente financiada por el MICINN, de acuerdo \na los tipos y bases de cotización que correspondan para cada año.\n4.  Las cuantías anteriores podrán ser actualizadas en las posteriores resoluciones \nde convocatoria, en las resoluciones de concesión de este subprograma, o por resolución \nexpresa del Secretario de Estado de Investigación, con la fecha de efectos que se indique \nen las mismas, y siempre que ello no resulte lesivo para los interesados.\n5.  Los beneficiarios de ayudas vigentes, concedidas al amparo de convocatorias \nanteriores de este subprograma, tanto bajo la relación jurídica de beca como de contrato, \ntendrán derecho a la percepción de las dotaciones recogidas en esta resolución y, en su \ncaso, a las actualizaciones de las mismas, en los mismos términos indicados en el apartado \nanterior.\nArtículo 28.  Obligaciones de los Centros de I+D.\n1.  Adicionalmente a las obligaciones establecidas en el artículo 24, los Centros \nde I+D tendrán las siguientes obligaciones:\na)  Designar un director de tesis y, en su caso, un tutor, para la coordinación y \norientación de la actividad del personal investigador en formación, de acuerdo con lo \nindicado en el artículo 30.1 y 30.2.\nb)  Comunicar a la Dirección General de Investigación y Gestión del Plan Nacional de \nI+D+i la formalización del contrato en prácticas con el personal investigador en formación, \npara lo cual se remitirá una copia del mismo en el plazo máximo de 10 días hábiles desde \nla fecha de su firma. En caso de que el proyecto en el que el personal investigador en \nformación esté desarrollando su investigación disponga de un Ente Promotor Observador \n(EPO), interesado o involucrado en el proyecto, se remitirá junto con la copia del contrato, \nuna declaración del EPO que acredite su interés en el proyecto. En el caso de que se \nproduzca un cambio de Centro de I+D de adscripción de la ayuda en la fase de contrato, \nel nuevo centro beneficiario remitirá igualmente una copia del nuevo contrato en el mismo \nplazo de 10 días hábiles desde la fecha de su firma.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "5b5bb0af-6c8c-46ad-b9d6-11847d09f551"
}