{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: P치gina 40\nPage 40 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nFigure 10. METHONTOLOGY Ontology Life Cycle \nRelated to the support activities, Figure 10 also shows that the knowledge acquisition, integration \nand evaluation is greater during the ontology conceptualization, and that it decreases during \nformalization and implementation. The reasons for this greater effort are: \n출 Most of the knowledge is acquired at the beginning of the ontology construction. \n출 The integration of other ontologies into the one we are building is not postponed to the \nimplementation activity. Before the integration at the implementation level, the integration at the \nknowledge level should be carried out. \n출 The ontology conceptualization must be evaluated accurately to avoid propagating errors in \nfurther stages of the ontology life cycle. \nThe relationships between the activities carried out during ontology development are called intra-\ndependencies, or what is the same, they define the ontology life cycle. \nMETHONTOLOGY also considers that the activities performed during the development of an \nontology may involve performing other activities in other ontologies already built or under \nconstruction [25]. Therefore, METHONTOLOGY considers not only intra-dependencies, but also \ninter-dependencies. Inter-dependencies are defined as the relationships between activities carried \nout when building different ontologies. Instead of talking about the life cycle of an ontology, we \nshould talk about crossed life cycles of ontologies. The reason is that, most of the times and before \nintegrating an ontology in a new one, the ontology to be reused is modified or merged with other \nontologies of the same domain. \n2.7.2. Ontology life cycle model in On-To-Knowledge \nThe On-To-Knowledge methodology proposes an incremental and cyclic ontology life cycle, \nbased on evolving prototypes [32]. This ontology life cycle is shown in Figure 11.  \n \n",
  "speaker": "SYSTEM",
  "uuid": "5ba2377a-2cc3-4df7-a5b5-07e3463c8083"
}