{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 3\nDynaLearn exercises  \n3 \n \n• Add the quantity Shade attached to the entity Tree to the model fragment as a \nconsequence. \n• Add a positive proportionality from Size to Shade to the model fragment. \n \nStep 5: Process Model Fragment with Knowledge about Tree Growth \nIn this step the relationship between the Growth rate and the Size will be modelled. The \nGrowth rate is assumed to be positive and stable and constantly causing the Size of the \nTree to increase. This relation is represented using a positive influence between Growth \nrate and Size. \nDo the following: \n• Define a new process model fragment: ‘Growth of tree’. \n• Open the model fragment in the model fragment editor. \n• Add the entity Tree as a condition. \n• Add the quantity Size as a consequence associated to the Tree. \n• Add the quantity Growth rate as a consequence. \n• Set the value (as a consequence) of the Growth rate to Plus (to indicate that a \nsmall, medium or large tree always grows). \n• Set the value of the derivative of the Growth rate to stable (to indicate that the \ngrowth does not change). \n• Create a positive influence from the Growth rate to the Size. \n \nStep 6: Running and Inspecting the Model \nWhen running the model, the goal is to have the simulator predict (simulate) the \nchanges of the Size and the Shade of the Tree as time passes. Ideally, the resulting \nsimulation consists of 3 states: a first state in which both Size and Shade are Small, a \nsecond state in which both Size and Shade are Medium, and a third state in which both \nSize and Shade are Large. \nDo the following: \n• Start the simulation of the model using the previously created scenario: 'A small \ngrowing tree'. \n• \nRun a full simulation. \n• Select a path from the start state to the end state (mind the order in which the \nstates are selected). \n• Look at the value history view. \n• Do the previous two steps for each of the possible paths (if multiple paths exist). \n \nStep 7: Debugging Suggestions \nDebugging questions: \n• Are the values in the first state in accordance with what has been defined in the \ninitial scenario? \n• Does the Growth rate have a value? \n• Do both the Size and the Shade have a value? \n• Do Size and the Shade have the same qualitative value? \n",
  "speaker": "SYSTEM",
  "uuid": "5ce88f4a-4408-41b7-b9d8-0dbbe4c64f0c"
}