{
  "message": "SYSTEM: Wiki: Here we include information for the students of the \"Máster Universitario en Inteligencia Artificial\".\nContents\n[\nhide\n]\n1\nObjectives\n2\nLectures structure\n3\nEvaluation\n4\nSchedule and Material\n5\nHands on activities\n6\nResearch topics\nObjectives\n\nThe aim of this module is to provide the theoretical and practical scientific,\nmethodological and technology basis involved in building ontologies, which will be\nused in building applications that integrate, combine and deduce distributed and\nheterogeneous information. In particular, we will present:\nthe concepts of ontology and annotation in the context of Semantic Web, Web of Data and corporate semantics,\nthe fundamental theory and best-known ontologies;\nlanguages RDF(S) and OWL,\nthe methodologies, methods and techniques used in its building that include guidelines for identifying the life-cycle, specification, planning, conceptualisation, correspondences, reuse, reengineering, etc.;\nmethods and techniques for the annotation of resources and significant applications.\nThroughout the entire module open research problems will be set that allow students to provide innovative solutions.\nSome initial reading to reflect on the objectives:\nhttp://iospress.metapress.com/content/p063121l16757521/fulltext.html\nLectures structure\n\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation\n\nEvaluation will be done on the basis of: weekly work and participation in discussion (10%), ontology building assignment (30%), Linked Data assignment (30%) and research work (30%)\nPartial assignments that will be done throughout the academic year, and which are specified in the schedule section, will allow creating the aforementioned ontology building and Linked Data assignments, which will be presented orally on the last session of the course. The optional research work will have to be submitted in January 2012 (31/01/2012).\nThose students that present their works in\nJuly\n, they should present, individually (gropus are NOT allowed):\nan ontology(33%)\na linked data application(33%)\na research study (34%)\nDelivery date: 2nd July, 12:00\nOral presentation: 3rd July at 17:00. Students should present during 20 minutes the ontology and the linked data application.\nSend your hands-on to the following email\nontologies@delicias.dia.fi.upm.es\nSchedule and Material\n\nLectures will be held every\nTuesday in lecture room 3202, from 17:00 to 19:00\n.\nWeek 1. 13/9/2011. Introduction (Oscar)\nRecomended reading: Tim Bernes Lee articles\nSlides: [\nIntro Sweb\n]\nAssignment (deadline: 21/09/2011 9pm): discuss and summarise the following reading/watching list in approximately three pages (in groups of three):\nArticles written by TBL in 1996 (\nhttp://www.w3.org/People/Berners-Lee/1996/ppf.html\n) and 2001 (\nhttp://www.scientificamerican.com/article.cfm?id=the-semantic-web\n)\nTED 2009 talk by TBL (\nhttp://www.ted.com/talks/tim_berners_lee_on_the_next_web.html\n)\nWeb and Linked Data design issues technical reports (\nhttp://www.w3.org/DesignIssues/\n,\nhttp://www.w3.org/DesignIssues/LinkedData.html\n)\nLinked Data Vision paper from Bizer et al., 2009 (\nhttp://tomheath.com/papers/bizer-heath-berners-lee-ijswis-linked-data.pdf\n)\nWeeks 2 and 3. 20/09/2011 and 27/09/2011. Ontology languages I - RDF(S) and SPARQL (Oscar)\nRecommended reading:\nChapter 4 of the book \"Ontological Engineering\", W3C documents on RDF, RDF Schema and SPARQL\nJ. Perez, M. Arenas, C. Gutierrez, The Semantics and Complexity of SPARQL. 5th International Semantic Web Conference, ISWC 2006, Athens, Georgia, USA, November 2006.\nhttp://www.dcc.uchile.cl/~cgutierr/papers/sparql.pdf\nSlides:\nRDF(S)\nSPARQL\nAdditional RDF(S) examples:\nEjemplos RDF(S)\nAssignment: Generate five queries in SPARQL1.1 that use data from several SPARQL endpoints. For example, the following endpoints can be used:\nhttp://geo.linkeddata.es/\n(this one contains several datasets),\nhttp://webenemasuno.linkeddata.es/\n,\nhttp://cultura.linkeddata.es/\nand\nhttp://aemet.linkeddata.es/\n. You can try these queries at\nhttp://db.ing.puc.cl:8890/SparqlDQPWebApp/\n. This is a federated SPARQL query engine in beta mode, so it may not be very brittle yet when errors appear. Besides, there may be electricity cutoffs in Chile, where the server is.\nWeek 4. 4/10/2011. Theoretical Foundations of Ontologies  (Asun)\nRecommended reading: Chapter 1 and 2 of the book \"Ontological Engineering\"\nSlides: [\nFoundations of ontologies\n]\nAssignment: (deadline: 11/10/2011 9pm): discuss and summarise one of the following reading/watching list in approximately three pages (in groups of three):\nRead and comment the following paper that includes several definitions of ontologies: Guarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nSearch papers on the topic of Ontological Commitments.  Read, comment and compare at least the following two papers:\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nChoose a domain and find  ontological and non ontological available resources consensuated by a community. Classify them in the continuous line identified by Lassila and McGuiness. Justify why they are important and how do you know that they represent consesuated knowledge.\nIdentify a set of criteria to be used to compare technologies used for searching ontologies. Classify existing technologies according to the criteria.\nWeek 5. 11/10/2011. Methodology I  (Asun)\nThe objective of this lecture is to show scenarios for the construction of ontologies, and provide methods and tools to create the ontology requirements specification document, to perform the search of potential resources to be reused, to select the ontology life cycle model and to plan and schedule the ontology development.\nRecommended reading and resources:\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[1]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nNeOn Glossary of Processes and Activities\nOntology Requirements Specification:\n[2]\nRecommended reading: Chapter 3 of the book \"Ontological Engineering\" and NeOn methodology (\nhttp://www.neon-project.org/nw/NeOn_Book\n)\nSlides: [\nMethodology\n]\nAssignment: At the end of the methodology lectures you should deliver an ontology in a particular domain.\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[3]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nWeek 6. 18/10/2011. Methodologies II (Asun)\nRecommended Readings:\nNeOn Book. NeOn Methodology in a Nutshell:\nhttp://www.neon-project.org/nw/NeOn_Book\nA Pattern-Based Method for Re-engineering Non-Ontological Resources into Ontologies\ngOntt paper\nPhD Thesis:\nNeOn Methodology for Building Ontology Networks: Specification, Scheduling and Reuse\nPhD Thesis:\nMethod for Reusing and Re-engineering Non-ontological Resources for Building Ontologies\nOther interesting links:\nNeOn Toolkit:\nhttp://neon-toolkit.org/wiki/Download\nSlides:\n[4]\nAssignment: At the end of the methodology lectures you should deliver an ontology in a particular domain.\nSchedule the ontology network development using the gOntt plugin included in the NeOn toolkit.\nWeek 7. 25/10/2011. Invited talk: General Ontologies (Mariano Fernández López) + ODPs (Mari Carmen Suárez-Figueroa)\nThe goal of this lecture is to present guidelines for reusing general or common ontologies.\nRecommended readings:\nHandbook on Ontologies (2nd edition):\nOntology Design Patterns (ODPs) Chapter\nNeOn Book:\nChapter on ODPs\nLinks:\nODP Portal:\nhttp://ontologydesignpatterns.org/wiki/Main_Page\nSlides:\nGeneral Ontologies\nODPs\nAssignment:\nWording\nQuestionnaire\nWeek 8. 01/11/2011. The school is closed.\nWeek  9.   8/11/2011. OWL (Mikel Egaña Aranguren)\nThe goal of this lecture is to present the Web Ontology Language (OWL). By the end of the lecture the students should be fluent enough in OWL so as to be able to create an ontology and apply reasoning on it.\nRecommended reading:\nProtégé OWL tutorial\nOWL Reasoning Examples and Hands-On Session\nOWL Pizzas: Common errors & common patterns\nUsing OWL to model biological knowledge\nMarkus Krötzsch, Frantisek Simancik, Ian Horrocks: A Description Logic Primer. CoRR abs/1201.4089, 2012.\nhttp://arxiv.org/abs/1201.4089\nLinks:\nOWL at W3C\nProtégé Ontology Editor\nOWL API\nPellet\nSlides:\n[5]\nAssignment:\n[6]\nWeek 10. 15/11/2011. Linked Data Generation (Boris)\nRecommended reading:\nHandschuh S, Staab S (2003). Annotation for the Semantic Web. IOS Press\nCorcho, O. Ontology-based document annotation: trends and open research problems. International Journal of Metadata, Semantics and Ontologies 1(1):47-57. 2006.\n[7]\nSix challenges for the Semantic Web. Benjamins VR, Contreras J, Corcho O, Gómez-Pérez A. KR2002 Workshop on Semantic Web. Toulouse, France. April 2002\nRequirements and Services for Metadata Management. Missier P, Alper P, Corcho O, Dunlop I, Goble C. IEEE Internet Computing 11(5): 16-24\nToward a New Generation of Semantic Web Applications. d'Aquin M, Motta E, Sabou M, Angeletou S, Gridinoc L, Lopez V, Guidi D. IEEE Intelligent Systems, June 2008\nRDFa tools (\nhttp://www.w3.org/2001/sw/wiki/RDFa\n)\nWYMeditor -\nhttp://wymeditor.org/\n- which integrates with Drupal, Rails, Django, or WordPress. Prototype:\nhttp://files.wymeditor.org/wymeditor/trunk/src/examples/15-rdfa-editor.html\nAloha editor with a RDFa prototype at\nhttp://aloha-editor.com/wiki/index.php/Semantic_Annotation\nRDFa Documents:\nhttp://www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1759526\n. Only supports RDFa 1.0.\nRDFa Square:\nhttp://demos.inf.ed.ac.uk:8836/rdfasquare\nSome links:\nhttp://www.ebusiness-unibw.org/wiki/RDFaAuthoring\nDocumentación disponible en\nhttp://www.geolinkeddata.es\nA Survey of Current Approaches for Mapping of Relational Databases to RDF (PDF), Satya S. Sahoo, Wolfgang Halb, Sebastian Hellmann, Kingsley Idehen, Ted Thibodeau Jr, Sören Auer, Juan Sequeda, Ahmed Ezzat, 2009-01-31. Available at\nhttp://www.w3.org/2005/Incubator/rdb2rdf/RDB2RDF_SurveyReport.pdf\nCheck\nhttp://code.google.com/p/google-refine/\nfor some of the issues that we were talking about as well.\nSlides:\n[8]\nIntro LD\nMethodological Guidelines for Publishing Linked Data\nPublishing Linked Data From DB\nWeek 11. 22/11/2011. Description of the Linked Data Hands-on activity (Oscar)\nAssignment: Generate Linked Data in a domain like the one proposed in hands-on 1\nDeadline: 6/12/2011 9pm\nWeek 12. 29/11/2011. Research topic: Semantic Sensor Web (Oscar)\nhttp://www.slideshare.net/ocorcho/ingredients-for-semantic-sensor-networks\nWeek 13. 6/12/2011.  (School is closed)\nWeek 14. 13/12/2011. Applications (Asun, Daniel Garijo)\n[9]\n[10]\n[11]\nWeek 15. 20/12/2011. Applications (José Manuel Gómez Pérez - iSOCO's R&D director)\nWeek 16. 10/01/2012. Presentation of work made by Students\nNote\n: all the students will need to submit their final ontology and Linked Data assignments on 09/01/2012 9am.\nHands on activities\n\nAll hands-on activities must be submitted by e-mail to ontologies@delicias.dia.fi.upm.es\nThe objective of this hands-on activity will be the design and implementation of a lightweight ontology network to be used for linked data generation, taking into account open and public data in Spanish, the transformation of some of the selected data sources into RDF according to such ontology network, and the linkage of these data sources with resources from the Web of Data (e.g., DBPedia [1], GeoLinkedData [2], GeoNames [3], etc.).\nEach team has to select one of the data sources made available in the following list (those are coming from\nhttps://datospublicos.jottit.com/\n,\nhttp://alarcos.esi.uclm.es/per/fruiz/pobesp/\n,\nhttp://datos.gob.es/\nand\nhttp://eufunds.ftdata.co.uk/\n):\nCenso Nacional de Instalaciones deportivas\n. Students must select at least 10 cities from there, which can be discussed with us, whose data should be transformed.\nOpen data\navailable at this site. Students can select the tables that they want to transform (Muncipios, Islas, Provincias, Population, etc.). At least 5 tables should be transformed by students, who have to discuss this with us, so that we can avoid overlaps between them.\nIncidencias de tráfico\n(traffic issues) in Spain. Students should select 5 tables, which can be discussed with us, so that we can avoid overlaps between them.\nFinancial Times EU Funds Database\n. Students can select one or several cities, companies, organisations, etc., from Spain, and obtain data from this online database. Once taken, as this data can be downloaded in CSV format, it has to be transformed.\nWe will value more those solutions that are more general and that allow regenerating the data without any manual intervention if there is a change in the data sources.\nThe ontology can be implemented with any of the following tools: Jena [4], NOR2O [5] and the NeOn Toolkit [6].\nFinally, once that you have selected the data sources that you want to publish, you must notify them by e-mail to us, so that we record your decision and can avoid overlaps with others.\n[1]\nhttp://dbpedia.org/\n[2]\nhttp://geo.linkeddata.es/\n[3]\nhttp://www.geonames.org/\n[4]\nhttp://jena.sourceforge.net/\n[5]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[6]\nhttp://www.neon-toolkit.org/\nResearch topics\n\nLinked Data lifecycle\nDistributed SPARQL querying\nSemantic sensor networks\nOWL Debugging\nOntology Design Patterns\nOntology Reuse\nTransformation of Knowledge-aware Resources\nRecommended reading (Ontology Matching):\nJ.Euzenat \"Tutorial on Ontology Matching\" (at least the section titled \"Matching problem\").\n[12]\nJorge Gracia begin_of_the_skype_highlighting     end_of_the_skype_highlighting begin_of_the_skype_highlighting     end_of_the_skype_highlighting and Eduardo Mena, \"Web-based Measure of Semantic Relatedness\", Proc. of 9th International Conference on Web Information Systems Engineering (WISE 2008), Auckland (New Zealand), Springer Verlag LNCS, volume 5175, pp. 136-150, September 2008.\n[13]\nSlides: 2.\nSemantic Measures and Ontology Matching: an Overview and some Examples",
  "speaker": "SYSTEM",
  "uuid": "5cfcbf14-59a3-4e2d-8dec-b80ed389b4bf"
}