{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 1\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11150\nIII.  OTRAS DISPOSICIONES\nMINISTERIO DE CIENCIA E INNOVACIÓN\n1944\nResolución de 4 de febrero de 2010, de la Secretaría de Estado de Investigación, \npor la que se aprueba la convocatoria correspondiente al año 2010 del \nprocedimiento de concesión de ayudas del Programa Nacional de Formación \nde Recursos Humanos de Investigación, en el marco del Plan Nacional de \nInvestigación Científica, Desarrollo e Innovación Tecnológica 2008-2011.\nEn la Orden ECI/266/2008, de 6 de febrero (publicada en el Boletín Oficial del Estado \nnúmero 35, de 9 de febrero de 2008), se establecieron las bases reguladoras de la \nconcesión de subvenciones públicas en el marco de la Línea Instrumental de Actuación en \nRecursos Humanos del Plan Nacional de Investigación Científica, Desarrollo e Innovación \nTecnológica (I+D+i) 2008-2011, que fija los objetivos y principios de gestión básicos de \nesta Línea Instrumental.\nDentro la Línea instrumental de Recursos Humanos, el Programa Nacional de \nFormación de Recursos Humanos tiene el objetivo de garantizar el aumento de la oferta \nde recursos humanos altamente cualificados, en todos los niveles educativos, tanto para \nasegurar la disponibilidad de investigadores, tecnólogos, personal técnico de apoyo, y \ngestores para la I+D e innovación, necesarios para hacer frente a los ambiciosos objetivos \nde crecimiento del sistema, como para garantizar la más eficaz formación de recursos \nhumanos para las actividades de investigación, desarrollo tecnológico e innovación, en \ncantidad y calidad, así como promover la formación permanente y continua en la sociedad \ndel conocimiento.\nMediante la presente resolución se hace pública la convocatoria, para el año 2010, de \nayudas para la formación de personal investigador a través de los programas del Ministerio \nde Ciencia e Innovación y del Instituto Nacional de Investigación y Tecnología Agraria y \nAlimentaria, respectivamente. Esta convocatoria pretende incrementar la cantidad y la \ncalidad de los nuevos doctores, por lo que las universidades, organismos públicos de \ninvestigación y centros de investigación, y particularmente sus grupos de formación e \ninvestigación con solvencia científica y académica, deben concentrar sus esfuerzos y \natraer a los mejores candidatos para formarlos al más alto nivel. Además estos programas \ncontemplan otras beneficios complementarios (ayudas para estancias fuera del centro \nreceptor, ayudas para el pago de los precios públicos de las matrículas de los programas \nde doctorado y ayudas para asistencias a congresos, reuniones, etc.) que permiten reforzar \nla formación científica, adquirir nuevas técnicas, compartir conocimientos, así como rebajar \nlos costes del proceso formativo con el objeto de incrementar el nivel educativo de los \nciudadanos y mejorar la equidad social.\nEsta convocatoria responde al compromiso de mantener y mejorar la situación de los \nrecursos humanos dedicados a la I+D, por lo que las ayudas que han crecido \nconsiderablemente en los últimos años se mantienen e incluso aumentan en esta \nconvocatoria, conscientes de que la base del sistema de ciencia debe recaer sobre un \ncapital humano altamente cualificado.\nIgualmente responde esta convocatoria a la Recomendación de 11 de marzo de 2005 \nde la Comisión relativa a la Carta Europea del Investigador y al Código de conducta para \nla contratación de investigadores (2005/251/CE). En dicho documento se hace referencia \na la formación de los investigadores en el Espacio Europeo de Investigación, desde el \ninicio de la misma como estudiantes de posgrado.\nLos subprogramas objeto de la presente convocatoria se enmarcan en el ámbito de \naplicación del Real Decreto 63/2006, de 27 de enero, por el que se aprueba el Estatuto del \npersonal investigador en formación.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "5df735a0-95a0-4461-b14d-62709ef7e0ab"
}