{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 8\n8\nGraeme Hirst\n1.4 Lexicons are not (really) ontologies\nThe obvious parallel between the hypernymy relation in a lexicon and the subsump-\ntion relation in an ontology suggests that lexicons are very similar to ontologies. It\neven suggests that perhaps a lexicon, together with the lexical relations deﬁned on it,\nis an ontology (or is a kind of ontology in the ontology of ontologies). In this view,\nwe identify word senses with ontological categories and lexical relations with onto-\nlogical relations. The motivation for this identiﬁcation is clear from the preceding\ndiscussion (section 1.3.2).\nNonetheless, a lexicon, especially one that is not speciﬁc to a technical domain\n(see section 1.5.1 below), is not a very good ontology. An ontology, after all, is a\nset of categories of objects or ideas in the world, along with certain relationships\namong them; it is not a linguistic object. A lexicon, on the other hand, depends, by\ndeﬁnition, on a natural language and the word senses in it. These give, at best, an\nersatz ontology, as the following sections will show.\n1.4.1 Overlapping word senses and near-synonymy\nIt is usually assumed in a genus–differentia ontology that subcategories of a cat-\negory are mutually exclusive. For example, if the category domesticated-mammal\nsubsumes the categories dog and cat, among others, then dog\n\\ cat is empty: noth-\ning is both a dog and a cat. This is not always so for the hyponymy relation in\nlexicons, however; rather, two words with a common hypernym will often overlap\nin sense—that is, they will be near-synonyms.\nConsider, for example, the English words error and mistake, and some words\nthat denote kinds of mistakes or errors: blunder, slip, lapse, faux pas, bull, howler,\nand boner. How can we arrange these in a hierarchy? First we need to know the\nprecise meaning of each and what distinguishes one from another. Fortunately, lex-\nicographers take on such tasks, and the data for this group of words is given in\nWebster’s New Dictionary of Synonyms (Gove 1973); an excerpt appears in Fig. 1.1;\nit lists both denotative and connotative distinctions, but here we need consider only\nthe former. At ﬁrst, we can see some structure: faux pas is said to be a hyponym\nof mistake; bull, howler, and boner are apparently true synonyms—they map to the\nsame word sense, which is a hyponym of blunder. However, careful consideration\nof the data shows that a strict hierarchy is not possible. Neither error nor mistake\nis the more-general term; rather, they overlap. Neither is a hypernym of the other,\nand both, really, are hypernyms of the more-speciﬁc terms. Similarly, slip and lapse\noverlap, differing only in small components of their meaning. And a faux pas, as a\nmistake in etiquette, is not really a type of mistake or error distinct from the others;\na faux pas could also be a lapse, a blunder, or a howler.\nThis example is in no way unusual. On the contrary, this kind of cluster of near-\nsynonyms is very common, as can be seen in Webster’s New Dictionary of Synonyms\nand similar dictionaries in English and other languages. Moreover, the differences\nbetween the members of the near-synonym clusters for the same broad concepts\nare different in different languages. The members of the clusters of near-synonyms\n",
  "speaker": "SYSTEM",
  "uuid": "5df8766f-f464-436b-84ed-7b8da0e6e543"
}