{
  "message": "SYSTEM: Wiki: Based on the report\n\"Discovery & Identification Technologies for the Next Generation Internet\"\n, let's analyse how we position ourselves in relation to this topic.\nTo do so, researchers should include in the contributions section of this page how they think their research can contribute to this topic.\nThe proposed template is the following:\nContents\n[\nhide\n]\n1\nMy name\n2\nContributions\n2.1\nMariano Rico\n2.2\nMaría Navas\n2.3\nMaría Poveda\n2.4\nFernando Serena\n2.5\nEsteban Gonzalez\n2.6\nPedro del Pozo\n2.7\nVíctor Rodríguez\nMy name\n\nCurrent research: My current research deals with...\nRelationship with NGI: What I'm doing is very relevant for the NGI because... in this and that topic... and ...\nContributions\n\nMariano Rico\n\nResearch: NL-guided query systems.\nRelationship with NGI: In the envision of NGI about the future of querying the Internet (search experience) there are chat-bots (conversational systems) like the one I created in my Juan de la Cierva researcher period.\nMaría Navas\n\nResearch: Temporal NLP.\nRelationship with NGI: In the section \"Understanding Users and The World Around Them\", a relevant aspect of the context of an user is temporal information (both to process temporal requests in the query to retrieve relevant time-related information and also the \"when is the query done\" info to allow time-dependent access to restricted information).\nMaría Poveda\n\nResearch: Ontology development\nRelationship with NGI: In the section \"Re-engineering the Physical Web\", it is mentioned the need for developing open semantics at all ayers and associated eco-system in the field of IoT solutions. This need is in line with the work I've been doing in VICINITY project and in the WoT Working Group.\nFernando Serena\n\nResearch: Linked Data, Data Integration and the Web of Things\nRelationship with NGI:\nThe following excerpt from section \"Envisioned User Experiencies\" describes exactly what my motivation has been over the past few years: \"Imagine, what if you can search the real world around and far from you in an engaging way. Imagine evolving in a purely digital world where you automatically discover sensors and services based on your credential, capabilities, etc\". Currently, I already have some proofs of concept that show that \"what if\" is achievable. These PoCs build on Agora, a framework in which I have been working intensively and exclusively for almost 3 years. The current barries of interoperability in the Internet of Things, which we are trying to break down in the VICINITY H2020 project, have been the launcher to expand Agora's scope and be much closer to providing the aforementioned user experience.\nRegarding research challenges, Agora is pretty much related to most of them: \"Re-engineering The Physical Web\", \"Processing Distributed and Real Time Streams\", \"Understanding Users and the World Around Them\" and \"Data Ownership and Access\".\n\"Re-engineering The Physical Web\": One of the main goals of Agora is to create Virtual Webs of Data from heterogeneous and distributed data sources that can be accessed through the Web. We consider any resource in the Web as a \"thing whose Web interface can be described in such a way we can interpret its data the way we want\". Ultimately, given a thing, consumers need to know \"what\" it is, \"where\" its Web resources are located, and \"how\" to interpret the data they provide. Thus, both physical devices and Web APIs can be considered in the same way and informedly consumed, as if they were part of a Web of Data. In VICINITY, we are proposing a description frame for these things and the ecosystems they make up.\n\"Processing Distributed and Real Time Streams\": The W3C Web of Things WG has identified three main patterns covering the most typical ways of interacting with a thing: Property, Action and Event. So far, the VICINITY project and Agora are covering the two of them that are based on synchronous communication: properties and actions. However, it is in our requirements to cover events (live streams) as well.\n\"Understanding Users and the World Around Them\" and \"Data Ownership and Access\": When it comes to create a Virtual Web of Data with Agora, it first needs to know the following: 1) the (custom) semantics of the underlying data ecosystem, 2) the description of the ecosystem itself, including the set of things that are part of it and the required answers to the aforementioned \"what\", \"where\" and \"how\". Virtually every aspect in 1) and 2) can be defined in such a way that consumer's understanding, credentials, capabilities and preferences are taken into account. Therefore, consumers of these Virtual Webs of Data are provided with a their own particular view of the data ecosystem. This functionality relies on the ability of the different data sources to deal with user authentication and other security and privacy aspects. Thus, even though different consumers may access the same data sources, they are enabled to interpret and consume their resources differently.\nEsteban Gonzalez\n\nResearch: Citizen Science\nRelationship with NGI: Is STARS4ALL we have experience with IoT and social communities. One of our initiatives expect to combine, in the field of the light pollution, data acquiered by sensores with observations made by persons. Furthermore, STARS4ALL is part of the CAPS (Collective Awareness Platforms) community, led by Fabrizio Sestini, one of the main supporters of NGI as you can see in the following slides:\n[1]\nPedro del Pozo\n\nResearch: Data Mining\nRelationship with NGI: \"Understanding Users and The World Around Them\". Most of tradicional Data Mining workflows are based on ad-hoc solutions for several project stages as data cleaning, data preparation or machine leargning data modeling. To deal with new data characteristics at Next Generation Internet, is mandatory to research, design and develop new methodologies and alternatives to provide new machine learning paradigms capable of set aside old ad-hoc implementations.\nMy most relevant background at OEG are related with Servicios Sociales de la Junta de Castilla y León project and my Master's Final Project as examples of person oriented methodologies and solutions for population segmentation and personal characteristic prediction.\nVíctor Rodríguez\n\nResearch: Semantic Web and Law\nRelationship with NGI: \"Data Ownership and Access\"\nNo estamos pero debereríamos en \"Algorithmic Systems Transparency\"\n.\nEdit by ralcazar to test notifications (ignore it)",
  "speaker": "SYSTEM",
  "uuid": "5f003410-1ca8-44b8-a09b-dea4ac47bb2e"
}