{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/STIJun2010 \n\nPhD Researcher in EU FP7 project RENDER\nSTI Innsbruck is a research institute at the University of Innsbruck and established itself as one of the key players in the area of semantic technologies, with excellent ties to other relevant public and corporate research institutions worldwide.\nWe offer:\n- The stimulating environment of a leading research group in the fields of Semantic Web, Semantic Web Services, Service-Oriented Architectures and formal languages and reasoning.\n- Long-term collaboration to well-known academic institutions and major companies around the world.\n- A multicultural working place with state-of-the-art infrastructure and resources including funding for attending international conferences, PhD symposia, summer schools, etc.\nWe expect:\n- A researcher (PhD student) with a strong background in Computer Science or Information Technologies and focused research interest and expertise in at least one of the following areas: knowledge representation, information retrieval methods, reasoning, formal languages, data mining, visualization algorithms.\n- Interest in working for the EU FP7 project RENDER.\nThe RENDER project addresses the challenges arising when analyzing the dynamics of online information. An amazing diversity of opinions, viewpoints, mind sets and backgrounds can be extracted from Web content. Large scale data management calls upon fundamental challenges with respect to the purposeful access, processing and management of the Web’s dynamic information avalanche, in particular when leveraging the diversity that inherently unfolding through world wide scale collaboration.\nRENDER project will engage with these challenges by developing methods, techniques, software and data sets that will leverage diversity as a crucial source of innovation and creativity, whilst providing enhanced support for feasibly managing data at very large scale, and for designing novel algorithms that reflect diversity in the ways information is selected, ranked, aggregated, presented and used in popular communication and collaboration platforms such as MediaWiki, Twitter, WordPress and Google Wave.\nRENDER will help to realize a world where information is acquired and shared in a fundamentally different manner than the consensual approach promoted by movements such as Web 2.0, and where communication and collaboration across the borders of social, cultural or professional communities are truly enabled via advanced Web technology, supporting one of the credos of European society: “United in diversity”.\nThe project consortium is an interdisciplinary team of engineers and researchers in Computing Science, Web Science and Knowledge Management from all over Europe. The contribution of STI Innsbruck is on semantic technologies for knowledge/diversity representation, lightweight reasoning and information retrieval methods. The aim is to develop representation paradigms and algorithms to make diversity-rich information cognitively accessible by taking novel approaches to data analysis and visualization into account. This will help end users to understand and access diversity features, and to effectively process complex data sets.\nThe project will run for 36 months starting in October 2010.\nFor further information regarding our organization, research and projects, please see\nhttp://www.sti-innsbruck.at\n.\nWe kindly invite you to submit your application to hr@sti2.at. Please include a current resume, a list of publications (if applicable), and digital versions of your most relevant works (such as graduation thesis or latest publications).\nIn case of any further questions regarding this position please contact Reto Krummenacher.",
  "speaker": "SYSTEM",
  "uuid": "5f3cb6bc-93f4-4203-a65f-52fe0afae737"
}