{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD09-10 \n\nHomework 5\nNote about the software to be used:\nSoftware Homework 5\nDeadline: Friday 11/12/2009\n9/12/2009. Ontology design patterns (invited lecturer: Eva Blomqvist, STLab, ISTC-CNR)\nThe information of this class is available at\nEva Blomqvist class\nNeOn Toolkit with XD plugin to be downloaded:\nDownload\nRecommended reading:\nSlides:\nAssignment:\n16/12/2009. Ontology (metadata) evolution (PhD thesis viva: Raúl Palma)\n. Instead of a lecture, we propose students to attend the PhD viva of Raúl Palma, which will take place from 12:00 till 14:00 approximately. Location: \"Sala de Grados\" in Bloque I.\n13/1/2010. Annotation (Oscar)\nRecommended reading:\nHandschuh S, Staab S (2003). Annotation for the Semantic Web. IOS Press\nCorcho, O. Ontology-based document annotation: trends and open research problems. International Journal of Metadata, Semantics and Ontologies 1(1):47-57. 2006\nSix challenges for the Semantic Web. Benjamins VR, Contreras J, Corcho O, Gómez-Pérez A. KR2002 Workshop on Semantic Web. Toulouse, France. April 2002\nRequirements and Services for Metadata Management. Missier P, Alper P, Corcho O, Dunlop I, Goble C. IEEE Internet Computing 11(5): 16-24\nToward a New Generation of Semantic Web Applications. d'Aquin M, Motta E, Sabou M, Angeletou S, Gridinoc L, Lopez V, Guidi D. IEEE Intelligent Systems, June 2008\nSlides:\nSlides\nAssignment: Taking into account the domain ontologies generated in th previous assignments, select a set of Web pages, wikis, databases or any other resources and make ontology-based annotations about them, publishing them in a suitable form.\nDeadline: 26/1/2010 9pm\n20/1/2010. Methodologies IV (Asun)\nThe goal of this lecture is to present guideliness for reusing top level ontologies and building the conceptual model taking into account the developments done in previous activities.\nRecommended reading:\nSlides:\nTop level ontologies\n,\nthe whole process\nAssignment:\nThe hands on is described here\n.\n27/1/2010. Ontology extraction from folksonomies (invited lecturer: Andrés García)\n11/2/2010. Exam\nNote\n: Please all the students should fill the following\nquestionnaire\nabout the methodological part of the course. Filled questionnaiers should be sent via email to\nmasterr09@delicias.dia.fi.upm.es\nbefore the exam date.\nResearch topics",
  "speaker": "SYSTEM",
  "uuid": "5f985759-1837-4159-b189-f577027c901a"
}