{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 11\nla Directiva en Europa) ha lanzado la posibilidad de evaluación de la adopción de la\nDirectiva a través de una consulta pública por Internet, intentando obtener información de\ndiferentes fuentes, como las instituciones que tienen información pública, los reutilizado-\nres con carácter comercial o no comercial (universidades, ONGs). Los resultados se deba-\ntirán a posteriori. Tal y como explica el texto lanzado por la Dirección General de la\nSociedad de la Información de la Comisión Europea, la encuesta va a tener tres secciones:\nimplementación e impacto de la Directiva; Objetivo de la Directiva; Perspectivas10. \nUna de las principales tareas de esta red es la de mantener contacto con los sectores\nimplicados para evaluar el éxito de la implantación de la Directiva. En el marco de esta\ntarea tuvo lugar en Bruselas, el 13 de junio de 2008, la conferencia “PSI Re-use – Who\nTakes Action Next?”11, que se centró en proporcionar recomendaciones a la Comisión\nEuropea de cara a la revisión de la Directiva.\nComo se sabe, la Directiva se adoptó mucho más tarde de la fecha prevista (julio de\n2005) en muchos países, por lo que una de las primeras conclusiones a extraer es que el\nproceso de revisión fue mucho menos útil de lo deseado para varios países, entre ellos\nEspaña. Dado que la transposición de la Directiva se ha llevado a cabo hace menos de un\naño en varios Estados miembros, es todavía muy pronto para evaluar los efectos de su\nimplantación.\nEsto se ve acentuado por el desconocimiento existente en estos países de la legislación\ny las obligaciones o las oportunidades que brinda, tanto desde la parte del sector de los pro-\nveedores de información como desde el sector de los reutilizadores. \n3. LEY DE REUTILIZACIÓN - ESPAÑA\nComo la Ley 37/2007 de 16 de noviembre, de reutilización de la información del sec-\ntor público, es una transposición fiel de la Directiva 2003/98/CE, abarca todo lo que la\nDirectiva explica en líneas generales, matizando las particularidades administrativas de\nEspaña como marco para la reutilización de la información del sector público en España\ny, además, refleja todas las ventajas y las desventajas de la Directiva. \nLa Ley 37/2007 hace referencia, por ejemplo, a la Ley 30/1992, de 26 de noviembre,\nde Régimen Jurídico de las Administraciones Públicas y del Procedimiento Administrativo\nComún; a la Ley Orgánica 15/1999, de 13 de diciembre, de protección de datos de carác-\nter personal; a la Ley 51/2003, de 2 de diciembre, de igualdad de oportunidades, no dis-\ncriminación y accesibilidad universal de las personas con discapacidad; a la Ley 8/1989,\nde 13 de abril, de Tasas y Precios Públicos; a la Constitución Española, etc.\n4. CONCLUSIONES\nMuchos de los organismos públicos y empresas dedicadas a la reutilización la conside-\nran el punto de partida de un entorno más abierto en el área. Pero no hay que olvidar que\nASPECTOS DE LA DIRECTIVA DE 2003/98/CE DEL PARLAMENTO EUROPEO Y DEL CONSEJO…\n15\n10 Public Consultation, Review of the PSI Directive/ European Commission, Information Society Directorate-General\nEn: http://ec.europa.eu/information_society/policy/psi/docs/pdfs/online_consultation/consultation_review_psi_2008.pdf\n(última consulta: 29 de junio de 2008).\n11 PSI Re-use – Who Takes Action Next / ePSIplus Conference, Bruselas, 13 de junio de 2008. En: http://www.epsi-\nplus.net/events/epsiplus_conference_psi_re_use_who_takes_action_next (última consulta: 04 de julio de 2008).\nBASES DE DATOS  1/1/04  03:39  Página 15\n",
  "speaker": "SYSTEM",
  "uuid": "5fe8b456-491e-4fb4-9e3a-f9feb7976714"
}