{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD11-12 \n\nLectures will be held every\nTuesday in lecture room 3202, from 17:00 to 19:00\n.\nWeek 1. 13/9/2011. Introduction (Oscar)\nRecomended reading: Tim Bernes Lee articles\nSlides: [\nIntro Sweb\n]\nAssignment (deadline: 21/09/2011 9pm): discuss and summarise the following reading/watching list in approximately three pages (in groups of three):\nArticles written by TBL in 1996 (\nhttp://www.w3.org/People/Berners-Lee/1996/ppf.html\n) and 2001 (\nhttp://www.scientificamerican.com/article.cfm?id=the-semantic-web\n)\nTED 2009 talk by TBL (\nhttp://www.ted.com/talks/tim_berners_lee_on_the_next_web.html\n)\nWeb and Linked Data design issues technical reports (\nhttp://www.w3.org/DesignIssues/\n,\nhttp://www.w3.org/DesignIssues/LinkedData.html\n)\nLinked Data Vision paper from Bizer et al., 2009 (\nhttp://tomheath.com/papers/bizer-heath-berners-lee-ijswis-linked-data.pdf\n)\nWeeks 2 and 3. 20/09/2011 and 27/09/2011. Ontology languages I - RDF(S) and SPARQL (Oscar)\nRecommended reading:\nChapter 4 of the book \"Ontological Engineering\", W3C documents on RDF, RDF Schema and SPARQL\nJ. Perez, M. Arenas, C. Gutierrez, The Semantics and Complexity of SPARQL. 5th International Semantic Web Conference, ISWC 2006, Athens, Georgia, USA, November 2006.\nhttp://www.dcc.uchile.cl/~cgutierr/papers/sparql.pdf\nSlides:\nRDF(S)\nSPARQL\nAdditional RDF(S) examples:\nEjemplos RDF(S)\nAssignment: Generate five queries in SPARQL1.1 that use data from several SPARQL endpoints. For example, the following endpoints can be used:\nhttp://geo.linkeddata.es/\n(this one contains several datasets),\nhttp://webenemasuno.linkeddata.es/\n,\nhttp://cultura.linkeddata.es/\nand\nhttp://aemet.linkeddata.es/\n. You can try these queries at\nhttp://db.ing.puc.cl:8890/SparqlDQPWebApp/\n. This is a federated SPARQL query engine in beta mode, so it may not be very brittle yet when errors appear. Besides, there may be electricity cutoffs in Chile, where the server is.\nWeek 4. 4/10/2011. Theoretical Foundations of Ontologies  (Asun)\nRecommended reading: Chapter 1 and 2 of the book \"Ontological Engineering\"\nSlides: [\nFoundations of ontologies\n]\nAssignment: (deadline: 11/10/2011 9pm): discuss and summarise one of the following reading/watching list in approximately three pages (in groups of three):\nRead and comment the following paper that includes several definitions of ontologies: Guarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nSearch papers on the topic of Ontological Commitments.  Read, comment and compare at least the following two papers:\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nChoose a domain and find  ontological and non ontological available resources consensuated by a community. Classify them in the continuous line identified by Lassila and McGuiness. Justify why they are important and how do you know that they represent consesuated knowledge.\nIdentify a set of criteria to be used to compare technologies used for searching ontologies. Classify existing technologies according to the criteria.\nWeek 5. 11/10/2011. Methodology I  (Asun)\nThe objective of this lecture is to show scenarios for the construction of ontologies, and provide methods and tools to create the ontology requirements specification document, to perform the search of potential resources to be reused, to select the ontology life cycle model and to plan and schedule the ontology development.\nRecommended reading and resources:\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[1]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nNeOn Glossary of Processes and Activities\nOntology Requirements Specification:\n[2]\nRecommended reading: Chapter 3 of the book \"Ontological Engineering\" and NeOn methodology (\nhttp://www.neon-project.org/nw/NeOn_Book\n)\nSlides: [\nMethodology\n]\nAssignment: At the end of the methodology lectures you should deliver an ontology in a particular domain.\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[3]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nWeek 6. 18/10/2011. Methodologies II (Asun)\nRecommended Readings:\nNeOn Book. NeOn Methodology in a Nutshell:\nhttp://www.neon-project.org/nw/NeOn_Book\nA Pattern-Based Method for Re-engineering Non-Ontological Resources into Ontologies\ngOntt paper\nPhD Thesis:\nNeOn Methodology for Building Ontology Networks: Specification, Scheduling and Reuse\nPhD Thesis:\nMethod for Reusing and Re-engineering Non-ontological Resources for Building Ontologies\nOther interesting links:\nNeOn Toolkit:\nhttp://neon-toolkit.org/wiki/Download\nSlides:\n[4]\nAssignment: At the end of the methodology lectures you should deliver an ontology in a particular domain.\nSchedule the ontology network development using the gOntt plugin included in the NeOn toolkit.\nWeek 7. 25/10/2011. Invited talk: General Ontologies (Mariano Fernández López) + ODPs (Mari Carmen Suárez-Figueroa)\nThe goal of this lecture is to present guidelines for reusing general or common ontologies.\nRecommended readings:\nHandbook on Ontologies (2nd edition):\nOntology Design Patterns (ODPs) Chapter\nNeOn Book:\nChapter on ODPs\nLinks:\nODP Portal:\nhttp://ontologydesignpatterns.org/wiki/Main_Page\nSlides:\nGeneral Ontologies\nODPs\nAssignment:\nWording\nQuestionnaire\nWeek 8. 01/11/2011. The school is closed.\nWeek  9.   8/11/2011. OWL (Mikel Egaña Aranguren)\nThe goal of this lecture is to present the Web Ontology Language (OWL). By the end of the lecture the students should be fluent enough in OWL so as to be able to create an ontology and apply reasoning on it.\nRecommended reading:\nProtégé OWL tutorial\nOWL Reasoning Examples and Hands-On Session\nOWL Pizzas: Common errors & common patterns\nUsing OWL to model biological knowledge\nMarkus Krötzsch, Frantisek Simancik, Ian Horrocks: A Description Logic Primer. CoRR abs/1201.4089, 2012.\nhttp://arxiv.org/abs/1201.4089\nLinks:\nOWL at W3C\nProtégé Ontology Editor\nOWL API\nPellet\nSlides:\n[5]\nAssignment:\n[6]\nWeek 10. 15/11/2011. Linked Data Generation (Boris)\nRecommended reading:\nHandschuh S, Staab S (2003). Annotation for the Semantic Web. IOS Press\nCorcho, O. Ontology-based document annotation: trends and open research problems. International Journal of Metadata, Semantics and Ontologies 1(1):47-57. 2006.\n[7]\nSix challenges for the Semantic Web. Benjamins VR, Contreras J, Corcho O, Gómez-Pérez A. KR2002 Workshop on Semantic Web. Toulouse, France. April 2002\nRequirements and Services for Metadata Management. Missier P, Alper P, Corcho O, Dunlop I, Goble C. IEEE Internet Computing 11(5): 16-24\nToward a New Generation of Semantic Web Applications. d'Aquin M, Motta E, Sabou M, Angeletou S, Gridinoc L, Lopez V, Guidi D. IEEE Intelligent Systems, June 2008\nRDFa tools (\nhttp://www.w3.org/2001/sw/wiki/RDFa\n)\nWYMeditor -\nhttp://wymeditor.org/\n- which integrates with Drupal, Rails, Django, or WordPress. Prototype:",
  "speaker": "SYSTEM",
  "uuid": "60076b15-5367-41c3-bd58-21dbd1566238"
}