{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 7\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97732\nA este respecto y en cuanto a los derechos de propiedad industrial así como los \nderechos de carácter patrimonial que integran la propiedad intelectual que puedan \ngenerarse durante todo el período como beneficiario de la ayuda, ya sea en fase de beca \no de contrato, se entenderá que es de aplicación el artículo 15 de la Ley 11/1986, de 20 de \nmarzo, de Patentes, por lo que los mismos pertenecerán única y exclusivamente a la \nuniversidad o centro de adscripción del beneficiario de la ayuda, sin perjuicio de lo dispuesto \nen la normativa de los centros de adscripción sobre la participación en los beneficios \nderivados de los mencionados derechos. Dichos extremos serán recogidos en el documento \nde toma de posesión del beneficiario de la ayuda.\nArtículo 10.  Obligaciones de los centros de adscripción de los beneficiarios de las \nayudas.\n1.  De acuerdo con lo dispuesto en la Ley 38/2003, de 17 de noviembre, General de \nSubvenciones, los centros a los que se adscriban beneficiarios de ayudas de la presente \nconvocatoria, asumirán la condición de entidad colaboradora, tanto para la fase de beca a \nla que se refiere el artículo 4.1.a) de la Disposición Adicional sexta del Real Decreto \n63/2006 como de la de contrato en prácticas a la que se refiere el artículo 4.1.b) del mismo \nartículo.\n2.  La formalización del convenio de colaboración entre el Ministerio de Educación y \nlas entidades de adscripción de los beneficiarios de ayudas del programa FPU, no supondrá \nla alteración de la titularidad de la competencia, afectando únicamente a los elementos de \nsu ejercicio que se prevean en él y como consecuencia de la aplicación práctica de las \ntareas que requiera la aplicación de los procedimientos de las respectivas convocatorias.\n3.  De manera general, tendrán las siguientes obligaciones:\na)  Proporcionar a los beneficiarios de las ayudas, el apoyo necesario y facilitarle la \nutilización de los medios, instrumentos o equipos que resulten precisos para el normal \ndesarrollo de su actividad.\nb)  Designar un director de tesis y, en su caso, un tutor o codirector, que tendrán la \nresponsabilidad general de coordinación y orientación, tanto académica como investigadora \ny en particular sobre el seguimiento de las obligaciones de los beneficiarios de las ayudas \ny cumplimiento del objeto de la misma.\nc)  Velar por el desarrollo adecuado del programa de formación, sin que pueda \nexigírsele la realización de cualquier otra actividad que no esté relacionada con el desarrollo \nde su investigación o de la formación específica requerida para ésta durante su \ntranscurso.\nd)  Comunicar a la Dirección General de Política Universitaria la obtención del DEA, \ntítulo de Máster, certificado acreditativo del inicio del período de investigación que expidan \nlas universidades de conformidad con el apartado 4 del Artículo 20 del Real Decreto \n1393/2007, o del grado de doctor por los beneficiarios de ayudas de FPU adscritos al \ncentro, en el plazo máximo de 15 días hábiles desde la fecha de su obtención.\ne)  Comunicar a la Dirección General de Política Universitaria, la realización de los \ncontratos en prácticas, remitiendo fotocopia del mismo en el plazo de 15 días naturales \ndesde la fecha de su firma.\nf)  Comunicar a la Dirección General de Política Universitaria las renuncias, \ninterrupciones o modificaciones de la situación inicial de concesión de la ayuda y demás \nincidencias en el plazo máximo de 15 días hábiles desde la fecha en que se produzcan.\ng)  Cumplimentar los informes, formularios y demás documentos que, en relación con \nel disfrute de la beca, le sean remitidos por la Dirección General de Política Universitaria o \nlas entidades que colaboran en la gestión del Programa,\nh)  Cumplir los requisitos recogidos en el artículo 13 de la Ley 38/2003, de 17 de \nnoviembre, General de Subvenciones, y las obligaciones que para los preceptores de \nayudas y subvenciones establece el artículo 14 de la citada Ley y las instrucciones \nespecíficas del Ministerio de Educación.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "602445f6-fdb9-470b-9699-e36b8b0c948a"
}