{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 37\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 37 of 124\nJava BibTeX-To-RDF Converter contemplates syntactic transformation aspects, and how symbols\nare structured in the ﬁle and ontology formats.\nThis tool generates one single ontology. The resultant ontology instances are expressed in RDF.\nTools for Transforming Spreadsheet Files into Ontologies\nThe three main tools for transforming spreadsheet ﬁles are TopBraid Composer, described at the beginning\nof this section, Excel2rdf, and RDF123. Next we describe the remaining two.\n• Excel2rdf48 is a Microsoft Windows program that converts Excel ﬁles into valid RDF.\nThe input resource is an Excel spreadsheet. This tool supports the approach to transforming re-\nsource content into instances of an existing ontology and performs a semi-automatic conversion\nwith an ad-hoc wrapper. This tool contemplates syntactic transformation aspects, and how sym-\nbols are structured in the spreadsheet and ontology formats.\nThe tool generates one single ontology. The resultant ontology instances are expressed in RDF.\n• RDF123 is a highly ﬂexible open source tool for transforming semi-automatically spreadsheet data\nto RDF that works on CSV ﬁles and also Google spreadsheets. This tool was presented by Han et\nal. in [HFP+06] and it was motivated by the fact that spreadsheets are easy to understand and use,\noffer intuitive interfaces and have representational power adequate for most purposes. Also the liberty\nthat people take with spreadsheets will sometimes require different rows to be translated with differing\nschemas. This tool works on CSV ﬁles and also Google spreadsheets.\nThis tool follows the approach used to transforming resource content into instances of an exist-\ning ontology. RDF123 deﬁnes a formal speciﬁcation of the conversions between entities of the\nresource and more than one ontology. It intends to create instances of existing ontologies. Every row\nof a spreadsheet will generate a row graph, and the RDF graph produced for the whole spreadsheet is\nthe merge of all row graphs, eliminating duplicated resources and triples.\nRDF123 consists of the following two components:\n– RDF123 application, is component whose main purpose is to give users an interactive and easy-\nto-use graphical interface for creating the map graph and outputting the map graph in RDF syntax.\nIt also supports a full work cycle of translating a spreadsheet into RDF and importing a CSV ﬁle\ninto a graphical spreadsheet editor and translating the spreadsheet into RDF by applying the map\ngraph. This application is composed of three internal frames: (1) the preﬁx deﬁnition frame which\nworks as a preﬁx library; (2) the spreadsheet editor which enable users to open a CSV ﬁle, edit\nthe ﬁle in a similar way to Excel, and save the ﬁle; and (3) the interactive graph editor that allows\nusers to create and remove a vertex/edge, drag a vertex, and change properties of a vertex/edge.\n– RDF123 Web Service, which aims to provide a public service that translates online spreadsheets\ninto RDF. This component also functions as the host of RDF documents URIs coming from online\nspreadsheets.\nThe tool enables to keep data in its original format, which provides two beneﬁts (1) same data can be\navailable in different domains just by associating it with different map ﬁles; and (2) when the ontology\nor the spreadsheet evolves and changes, to make the data adapt to that change it is only necessary to\nmodify the map ﬁle instead of regenerating the hard coded RDF document.\nIt should be added that this tool produces more than one ontology and that the resultant ontology\ninstances are expressed in RDF.\n48http://www.mindswap.org/~Erreck/excel2rdf.shtml\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "60a95127-7b91-48f5-b20d-ae57e8f8cf1f"
}