{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 25\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97750\nextranjero, en función del país de destino. En el caso de períodos de duración inferiores a \nun mes se asignará la parte proporcional.\n3.  El importe de la ayuda para el viaje será:\na)  Desplazamientos en España: Hasta un máximo de 90 € dentro de la Península; \nhasta un máximo de120 € a o desde Ceuta, Melilla y las Islas Baleares; hasta un máximo \nde 150 € a o desde las Islas Canarias.\nb)  Desplazamientos en el extranjero: Hasta un máximo de 600 €, cuando el lugar de \ndestino sea un país de Europa; hasta un máximo de 1.200 €, cuando el lugar de destino \nsea un país del resto del mundo.\n4.  Los beneficiarios de ayudas para estancias breves en centros en el extranjero, \ndisfrutarán, sin perjuicio de la cobertura de la Seguridad Social, de un seguro de accidentes \ny de asistencia médica en los desplazamientos al extranjero autorizados por la Dirección \nGeneral de Política Universitaria, cuando se trate de países sin concierto con la Seguridad \nSocial española o cuando las coberturas de este concierto fueran insuficientes. La cobertura \nde este seguro alcanzará única y exclusivamente hasta el límite de la póliza contratada por \nel Ministerio de Educación y para el período para el que fuera concedida la estancia \nbreve.\n5.  Las estancias se realizarán a partir de 1 de mayo de 2010 al 31 de marzo de 2011, \ny deberán disfrutarse siempre dentro del período de vigencia de la ayuda.\n6.  Una vez concedidas las ayudas y en casos debidamente justificados, el órgano \ninstructor podrá autorizar cambios en el objeto de la estancia, sin que ello suponga \nincremento del gasto aprobado.\nArtículo 40.  Requisitos de los solicitantes.\nLas estancias breves podrán solicitarlas:\na)  Por los beneficiarios de ayudas que se hayan incorporado en el ejercicio anterior \ny hayan presentado la memoria de seguimiento anual, a la que se refiere el capítulo IV de \nla presenta convocatoria.\nb)  Excepcionalmente podrán solicitarla, aquellos beneficiarios activos que no \nreuniendo el requisito anterior, se encuentren en posesión del Diploma de Estudios \nAvanzados, certificado de inicio del período de investigación o que hayan completado un \nperíodo igual o superior a doce meses en becas o ayudas anteriores de análoga naturaleza \na la de FPU en cuanto a sus objetivos y su cuantía, y cuyo período disfrutado haya sido \ndescontado del cómputo del período de duración máxima de la ayuda de FPU.\nArtículo 41.  Presentación de solicitudes.\n1.  El plazo de presentación de solicitudes irá del 11 al 31 de enero de 2009.\n2.  El formulario de solicitud se cumplimentará en la aplicación informática disponible \nen la página http://web.educación.\n3.  Cumplimentado el formulario en todos sus apartados, se deberá confirmar y enviar \nlos siguientes archivos en formato electrónico:\na)  Memoria justificativa (con una extensión máxima de 1.000 palabras), que contenga: \nobjeto de la estancia, plan de trabajo, estimación del gasto, información sobre el centro \nreceptor con relación al objeto de la estancia e idoneidad del mismo, duración de la estancia \ncon el objeto de trabajo durante la misma y el período de formación o para la presentación \nde la tesis. La memoria deberá contar con un informe y VºBº del Director de la tesis sobre \nla conveniencia de la estancia para la formación del becario, idoneidad del centro de \ndestino seleccionado y del plan de trabajo a realizar.\nb)  Acreditación de la aceptación del centro receptor en todos los casos.\n4.  Una vez confirmado el envío telemático de la solicitud y de los dos archivos de los \ndocumentos electrónicos señalados en el punto anterior, se deberá imprimir la solicitud y \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "614988bc-d789-4259-b2c2-d3788c49f89c"
}