{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 8\nSector público\nSegún la Directiva 2003/98/CE, “el sector público recoge, produce, reproduce y difunde una\namplia gama de información relativa a numerosos ámbitos; por ejemplo, información social,\neconómica, geográfica, meteorológica o turística y sobre empresas, patentes y educación”.\nComo se sabe, el sector público es el conjunto de organismos administrativos median-\nte los cuales el Estado cumple o hace cumplir lo expresado en el conjunto de leyes esen-\nciales del país.\nAcceso\nEl acceso a la información del sector público es un derecho fundamental del ciudada-\nno en una democracia, basado en principios de transparencia e interacción democrática.\nEste derecho está protegido y fomentado a través de la Directiva de Reutilización de la\ninformación pública y a través de la Ley 37/2007 sobre la reutilización de la información\ndel sector público. \n1.2. Antecedentes \nTal y como afirma Viviane Reding, comisaria responsable de la Dirección General\n(DG) Sociedad de la Información y Medios de Comunicación de la Comisión Europea, “la\ninformación del sector público es un recurso muy valioso para la industria emergente de\ncontenidos digitales”3. La Comisión Europea presentó el 5 de junio de 2002 una propues-\nta de Directiva, destinada a facilitar la reutilización de la información del sector público\nen Europa. Se trataba de tomar las riendas en el asunto de la reutilización de un recurso\nmuy valioso para la economía de la UE, reduciendo la brecha existente entre las empresas\neuropeas y las americanas competentes en el área, que estaban actuando en un mercado ya\ndesarrollado en torno a la reutilización de la información pública. Con ello se quería dar\nun empuje a la industria europea de contenidos digitales, a través de PYMEs y al desarro-\nllo de nuevos servicios de información y productos con valor añadido basados en la reuti-\nlización de la información del sector público. Ello conllevaría la creación de nuevos\nempleos y mayores posibilidades de acceso a la información que a veces el mismo sector\npúblico no puede proporcionar. Esta propuesta de Directiva fue un desafío para la indus-\ntria europea de contenidos que tenía que aprovechar la oportunidad y explotar el potencial\nde la información del sector público en condiciones de igualdad, accediendo incluso a\nficheros de datos públicos a nivel paneuropeo, hecho casi imposible antes, debido a las tra-\nbas jurídicas o prácticas existentes en cada país.\nLos orígenes de esta iniciativa descansan en el programa Impact sobre la creación\nde un mercado comunitario de la información, desarrollado en los años ochenta por la\nComisión Europea y en cuyo marco se intentó poner en contacto el sector público y el\nprivado del mercado de la información, pero sin mucho éxito en los países miembros\nde la UE. \nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n12\n3 La Comisión denuncia cinco países ante el Tribunal de Justicia por incumplimiento de las normas de la UE sobre\nreutilización de la información del sector público, un recurso cuyo valor puede alcanzar los 48.000 millones de euros /\nComisión Europea, Press Releases. Rapid. Bruselas, 22 de diciembre de 2006. IP/06/1891 En: http://europa.eu/rapid/\npressReleasesAction.do?reference=IP/06/1891&format=HTML&aged=1&language=ES&guiLanguage=en (última\nconsulta: 25 de junio de 2008).\nBASES DE DATOS  1/1/04  03:39  Página 12\n",
  "speaker": "SYSTEM",
  "uuid": "61d4dfbf-9be7-464f-abeb-5a2a70b259ba"
}