{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 70\nPage 70 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nactivity, and then they should integrate the result of such activity (code, conceptualization, \nspecification, or scope) in the corresponding activity of scenario 1 presented in Section 4.1. \nTaking into account the levels shown in Figure 24, we can propose a general ontology \nreengineering model, shown in Figure 25. This model suggests that, normally, the ontology \nreengineering activity begins with an ontology code and produces another ontology code. The \nmodel also suggests different possible paths from an existing ontology to the new ontology. \nThe choice of a concrete path depends on the ontology characteristics that have to be \nchanged. \nWe \ndistinguish \nthe \nfollowing \ntypes \nof \nchanges: \nre-implementation, \nre-\nconceptualization, re-specification, and re-think. This general ontology reengineering model \ntogether with the different types of changes and ways of carrying out the ontology \nreengineering activity will be explained in detail in deliverable D5.4.1. \n \nFigure 25. General Ontology Reengineering Model \n Outcomes: The principal outcome is an ontology network that represents the expected domain \nimplemented in an ontology language (OWL, F-Logic, etc.). Additionally, a broad range of \ndocuments including the requirements specification, the ontology documentation, the ontology \nevaluation, etc. will be generated as output of different activities. \nFurthermore, new ontologies or ontology modules from those selected for reusing them are \ngenerated by means of the ontology reengineering activity. \n4.5. Scenario 5: Building Ontology Networks by Reusing and Merging Ontology or \nOntology Modules \n Assumptions: It is supposed that software developers and ontology practitioners “want” to use \nexisting ontologies or ontology modules by merging them before their reuse in the development \nof the ontology network.  \n Prerequisite resources: Knowledge of the domain (general or specific) of the ontology \nnetwork to be developed should be available for building the ontology network. \nFurthermore, ontologies or ontology modules related to the domain to be covered by the \nontology network to be developed should be available. \n Sequence of activities: The sequence of activities in this scenario is the same as the \nsequence presented in scenario 3 (Section 4.3); however, when software developers and \nontology practitioners need to decide the reuse mode (that is, activity 5 in Section 4.3), they \nthink that the selected ontologies or modules are useful for the ontology network development, \n",
  "speaker": "SYSTEM",
  "uuid": "6209439d-1c1d-410f-8f85-a89448513160"
}