{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 17\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11166\nhábiles subsane la falta o acompañe los documentos preceptivos. En dicha notificación se \nincluirá la advertencia de que, si no lo hiciese, se le tendrá por desistido de su solicitud. \nAdicionalmente, también podrá comunicarse dicha incidencia por correo electrónico de \nacuerdo con lo indicado en el artículo 31.\nDurante el periodo de subsanación, no se podrán reformular las solicitudes \npresentadas.\nArtículo 33.  Evaluación y selección de las solicitudes.\n1.  Una vez finalizada la revisión administrativa de las solicitudes, la Subdirección \nGeneral de Formación e Incorporación de Investigadores comunicarán a los Investigadores \nPrincipales de los proyectos de I+D susceptibles de asignación de las ayudas las \ninstrucciones de acceso a la base de datos donde se encuentra la información de todos \naquellos candidatos que han solicitado la adscripción a sus respectivos proyectos.\n2.  En el plazo de 15 días naturales desde la fecha de notificación, los Investigadores \nPrincipales de los proyectos de I+D deberán remitir a la Subdirección General de Formación \ne Incorporación de Investigadores, siguiendo las instrucciones establecidas al efecto, una \nrelación priorizada de las solicitudes vinculadas a sus respectivos proyectos justificada \nmediante un breve informe. La elaboración de la relación priorizada deberá basarse en los \nsiguientes criterios:\na)  Expediente académico del candidato (hasta un máximo de 2 puntos).\nb)  Adecuación del candidato al proyecto de I+D y otros méritos (hasta un máximo de \n8 puntos).\nSi alguno o todos los solicitantes se considerara inadecuado, se hará constar en el \ninforme.\n3.  Junto con la relación priorizada, el Investigador Principal incluirá la memoria del \ntrabajo de investigación a desarrollar por el candidato o candidatos propuestos.\n4.  La selección de los candidatos se realizará por una Comisión de Selección, \npresidida por el Subdirector General de Formación e Incorporación de Investigadores, \nintegrada por los expertos que designe la Subdirección General de Formación e \nIncorporación de Investigadores, y un representante de la Subdirección General de \nFormación e Incorporación de Investigadores que actuará como secretario, procurándose \nen su composición la paridad entre hombres y mujeres. La Comisión de Selección elevará \nal Subdirector General de Formación e Incorporación de Investigadores la relación de \ncandidatos seleccionados y de reserva.\n5.  La Comisión de Selección seleccionará las solicitudes en función de los Informes \nde los Investigadores Principales de los proyectos de I+D y de los Currículum Vítae de los \ncandidatos, así como de otros criterios que se determinen en el seno de la misma.\nArtículo 34.  Trámite de audiencia y propuesta de resolución.\n1.  De acuerdo con lo expuesto en el artículo 7, el órgano competente para la instrucción \npublicará en la página web del Ministerio de Ciencia e Innovación (http://www.micinn.es) la \npropuesta de resolución provisional, que contendrá la relación de los candidatos seleccionados \ny de reserva, así como los proyectos y los Centros de I+D de adscripción, concediendo a los \ninteresados, un plazo de 10 días hábiles desde la fecha de publicación en la página web para \nque puedan formular las alegaciones que estimen oportunas.\nDurante el periodo del trámite de audiencia, no se podrán reformular las solicitudes \npresentadas.\nDe no contestar en dicho plazo los interesados incluidos en la relación de candidatos \nseleccionados, se entenderá que aceptan las condiciones y términos de la propuesta de \nconcesión de la ayuda.\n2.  Examinadas las alegaciones presentadas por los interesados, se formulará la \npropuesta de resolución definitiva, que incluirá la relación de candidatos seleccionados y \nde reserva.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "622f20f0-0764-4e3d-8a23-c067d95b5fa9"
}