{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual11032010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Desambiguación usando Dbpedia local en Español e Inglés\nSe ha dividido el proyecto de desarrollo en tres componentes principales:\nEl API\n,\nla aplicación Web de demostración\n, y\nla aplicación Web del servicio web\n. Esta división se realizo para minimizar las interrupciones de servicio debido a cambios en alguno de los componentes. Por ejemplo, si se quería realizar un cambio en la aplicación web de demostración, el servicio web dejaba de funcionar.\nSe ha adicionado una nueva funcionalidad llamada\nEtiquetas Compuestas\n. De lo que se trata es de relacionar otras etiquetas presentes en el contexto con la etiqueta a la que se está asociando semánticamente y  la entidad semántica. Por ejemplo, dada la etiqueta\nunited\ny el contexto\nLondon,City, Hall, England, UK, United, Kingdom, GB, Great, Britain\n, el sistema retorna como entidad semántica a\nhttp://dbpedia.org/resource/United_Kingdom\ny utilizando métricas de comparación de cadenas de caracteres entre las etiquetas del contexto y el titulo del recurso DBpedia establece que las etiquetas\nunited\nand\nkingdom\nson una composición de etiquetas asociadas a dicho recurso semántico.\nSe ha desarrollado una nueva interfaz de demostración que puede utilizarse en la siguiente dirección:\nhttp://robinson.dia.fi.upm.es:8080/SemanticTagsWebApp/index.jsp\nTrabajo futuro inmediato:\n1.\tInstalación del servicio en un servidor. \n2.\tIncorporación de la herramienta de traducción para los casos donde la página Wikipedia en español no haya sido relacionada directamente con la correspondiente página en inglés y por tanto no se tenga una relación con el recurso DBpedia.\nActividad: Artículo del Knowledge engineer review\nEl artículo ha sido aceptado para la publicación en la revista. Queda pendiente la versión camera-ready y su posterior envío. Cuando se reciba información de cuándo y en qué edición se va a publicar se informará oportunamente.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Preparación del test bed para ejecutar el algoritmo de inducción de fuentes de datos.\n- Correcciones del entregable EV\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nLa memoria que se utiliza en cada una de las peticiones al servicio, debería ser liberada al finalizar el proceso. Sin embargo, se no se libera. Se está buscando el porqué de la acumulación de memoria. Una vez localizado el problema se podrá dar una solución u otra.\nModificaciones sobre el entregable de EV PT 7.2.\nTrabajo sobre OWLIM, processing resource de GATE, que trabaja sobre ontologías y su API.\nInterfaz Anotación Híbrida\n\nMejora de la Interfaz\n- Se ha agregado un menu contextual en el resultado de la anotacion que permite agregar en texto, de mejor manera que la forma anterior de apretar en un boton del widget mi cajita.\n- El resultado es draggable y resizable, lo que permite al usuario agrandar y mover el widget con el resultado.\n- Se sigue trabajando en conseguir procesamiento de RDF.\n- Se ha agregado un widget de folksonomias que muestra etiquetas ordenadas por tamañano, de acuerdo a las veces que aparecen mas en los resultados, se intenta generar el highlight a la hora de hacer click en cada etiqueta.\n- Se empezara a trabajar en el procesamiento de RDFa.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con la implementación del adaptador Fura.Se ha desarrollado la función de la API capaz de aceptar un fichero JSDL en el que se especifiquen los datos de tareas y módulos y enviarlos a ejecutar en el recurso deseado.\n- Se ha añadido la función encargada de recibir un identificador de tarea y eliminarla del grid.\nTarea 1.4\n\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nConstrucción manual de conjuntos de referencia para la medición del valor de exhaustividad en la evaluación del descubrimiento de mappings.\nLos cunjuntos abordados son:\nPhenomenOntology 3.6 - Nomenclátor Conciso\nPhenomenOntology 3.6 - Nomenclátor Geográfico Nacional\nPhenomenOntology 3.6 - Lexicón de BCN200\nPhenomenOntology 3.6 - Lexicón de BCN25\nTarea 7.1\n\n- RDF. Continuación de generación de mappings (Problemas con la codificación R2O)\n- Entregable Hito 5. Supervisión de documentos",
  "speaker": "SYSTEM",
  "uuid": "62b79a90-e774-45cc-bde5-155daf794d9c"
}