{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 11\n9\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\ntechnology, managing Big Data with analytics, new paradigms for linking users and information with seman‐\ntics, and crossing the boundaries of language to do all these things, LT is baked into the future of ICT in the\nmobile/social/global world of computing.\nThe new ecosystem is centred on platforms, applications, and data as the maturing Internet makes the hard‐\nware/packaged‐software ecosystem obsolete. Platforms are frameworks from which applications are devel‐\noped and launched, with well‐defined access points and rules and on which other players can build applica‐\ntions and services. Hardware Operating Systems created market dominance in the old ecosystem; cloud‐\nbased software platforms will have a similar weight in the new ecosystem.\nAs of 2012, the rising ecosystem platforms are social (e.g. Facebook, Twitter, LinkedIn), mobile (e.g. iPhone,\nAndroid phones) and increasingly imbued with services that make them global (e.g. Google and Bing\nTranslate) to use the most dominant examples in the West. In China, similar social media platforms Sina\nWeibo, Renren, Douban, and many others, have hundreds of millions of users. The US‐centric ecosystem is\ncertainly powerful, even in Europe, but it does not control the global internet. Mobile operating systems do\ncontrol the delivery of mobile apps (and the software platforms for selling them) at least for now, and an\nindustry of Enterprise mobile app‐development platforms has grown up around the explosion of mobility at\nwork (not to mention the 1.5 million apps in the “long tail”). But new Web standards may return the centre\nof gravity to the more neutral Web, with apps that have the graphical and multimodal features needed on\nthe new platforms.\nSupport for the global aspects of the new ecosystem, as a network of human engagement rather than pure\ninformation, includes platforms for language translation, and a vastly increased interest in such products in\nFigure 1:New ICT Ecosystem affecting Europe’s ability to compete\n",
  "speaker": "SYSTEM",
  "uuid": "64313216-0dd1-41fc-bef0-a1cbecd35531"
}