{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 11\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97736\n8.  Salvo lo regulado en la presente convocatoria para las ayudas en el período de \ncontrato en prácticas, la concesión y disfrute de una ayuda en régimen de beca no implica \nrelación contractual o estatutaria con el centro al que quede adscrito el beneficiario; para \nel organismo receptor, la ayuda tampoco supone un compromiso de incorporación posterior \ndel beneficiario a su plantilla, salvo lo referido a la aplicación del Estatuto del personal \ninvestigador al término del período de beca.\nArtículo 15.  Interrupción de las ayudas.\n1.  La Dirección General de Política Universitaria podrá conceder la interrupción \nvoluntaria del disfrute de la ayuda durante el período de beca, a petición razonada del \ninteresado, previo informe del director de la tesis doctoral, con la conformidad del \nresponsable orgánico competente del centro de adscripción de la ayuda.. Dichas \ninterrupciones se ajustarán a lo siguiente:\na)  No podrán ser superiores a seis meses a lo largo de la duración de la ayuda.\nb)  Sólo en aquellos casos en que se aprecie la existencia de fuerza mayor se podrá \nrecuperar el período interrumpido.\nc)  Se producirán con los efectos económicos y administrativos establecidos en el \npunto 6 de este mismo artículo.\nd)  Durante el período de interrupción de la ayuda se causará baja en la Seguridad \nSocial.\ne)  La no incorporación a la ayuda una vez transcurrido el período de interrupción, se \nconsiderará como renuncia y causará baja automática.\n2.  Durante el período de beca los beneficiarios de la ayuda tendrán derecho a la \ninterrupción temporal de la misma en los supuestos de baja por incapacidad temporal \n(enfermedad o accidente), riesgo durante el embarazo y descanso por maternidad o \npaternidad. Durante todo el tiempo de permanencia en dicha situación, el Ministerio de \nEducación complementará la prestación económica de la Seguridad Social hasta alcanzar \nel 100 % de la cuantía mensual de la ayuda. En este caso, el tiempo interrumpido podrá \nrecuperarse siempre que este sea por períodos de, al menos, 30 días y que las \ndisponibilidades presupuestarias lo permitan.\nLas bajas por incapacidad temporal serán debidamente acreditadas ante la Dirección \nGeneral de Política Universitaria. Los beneficiarios deben proceder a realizar los trámites \ny gestiones conforme a las normas de la Seguridad Social.\nPara el restante tipo de bajas y solo en aquellos casos en que se aprecie la existencia \nde causa mayor, se podrá recuperar el período interrumpido siempre que las disponibilidades \npresupuestarias lo permitan.\n3.  Durante el período de contrato en prácticas, la suspensión del mismo en virtud de \nlas causas previstas en los artículos 45 y 46 del Estatuto de los Trabajadores no comportará \nla ampliación de la duración de la ayuda, salvo las situaciones de incapacidad temporal, \nmaternidad y adopción o acogimiento durante el período de duración del contrato que \ninterrumpirán su cómputo, de conformidad con lo establecido en la Disposición final tercera \nde la Ley Orgánica 4/2007, de 12 de abril, por la que se modifica la Ley Orgánica 6/2002, \nde 21 de diciembre, de Universidades. En este caso, el tiempo interrumpido podrá \nrecuperarse siempre que este sea por períodos de, al menos, 30 días y que las \ndisponibilidades presupuestarias lo permitan.\nArtículo 16.  Régimen de incompatibilidades.\n1.  La percepción de una ayuda al amparo de esta convocatoria es incompatible con \notras becas o ayudas financiadas con fondos públicos o privados que tengan una finalidad \nanáloga, así como con sueldo o salarios de similar naturaleza con horarios coincidentes \ncon los estudios y, con carácter general, con la percepción de cualquier cuantía que tenga \nnaturaleza salarial, siempre que ello afecte a la finalidad formativa e investigadora de la \nayuda o que se produzca en su mismo horario.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "661c6e0c-c709-43c2-8761-bcb537ddcb26"
}