{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 20\n20\nGraeme Hirst\n1.38 Lenci, Alessandro (2001): Building an ontology for the lexicon: Semantic types and\nword meaning. In Jensen, Per Anker and Skadhauge, Peter (eds.), Ontology-based In-\nterpretation of Noun Phrases: Proceedings of the First International OntoQuery Work-\nshop, University of Southern Denmark, 103–120.\nwww.ontoquery.dk/publications/\n1.39 Lenci, Alessandro et al. (2000). SIMPLE: A general framework for the development of\nmultilingual lexicons. International Journal of Lexicography, 13(4), 249–263.\n1.40 Levin, Beth (1993): English Verb Classes and Alternations: A preliminary investiga-\ntion. The University of Chicago Press, Chicago.\n1.41 Lindberg, Donald A.B.; Humphreys, Betsy L.; and McCray, Alexa T. (1993): The Uni-\nﬁed Medical Language System. Methods of Information in Medicine, 32(4), 281–289.\n1.42 Markowitz, Judith; Ahlswede, Thomas; and Evens, Martha (1986): Semantically sig-\nniﬁcant patterns in dictionary deﬁnitions. Proceedings of the 24th Annual Meeting of\nthe Association for Computational Linguistics, New York, 112–119.\nwww.aclweb.org/anthology/P86-1018\n1.43 Mel’ˇcuk, Igor (1984): Dictionnaire explicatif et combinatoire du franc¸ais contempo-\nrain. Les Presses de l’Universit´e de Montr´eal.\n1.44 Mel’ˇcuk, Igor and Zholkovsky, Alexander (1988): The explanatory combinatorial dic-\ntionary. In Evens 1988, 41–74.\n1.45 The Merriam-Webster Pocket Dictionary. G.&C. Merriam Company, Springﬁeld, MA.\n1.46 Murphy, Gregory L. and Lassaline, Mary E. (1997): Hierarchical structure in concepts\nand the basic level of categorization. In Lamberts, Koen and Shanks, David (eds.),\nKnowledge, Concepts, and Categories, The MIT Press, Cambridge, MA, 93–131.\n1.47 Noy, Natalya F. (2003): Tools for mapping and merging ontologies. This volume, XXX–\nXXX.\n1.48 Pinker, Steven (1994): The Language Instinct. William Morrow and Company, New\nYork.\n1.49 Pribbenow, Simone (2002): Meronymic relationships: From classical merology to com-\nplex part–whole relationships. In Green, Bean, and Myaeng (2002), 35–50.\n1.50 Pustejovsky, James (1995): The Generative Lexicon. The MIT Press, Cambridge, MA.\n1.51 Quine, Willard Van Orman (1960): Word and Object. The MIT Press, Cambridge, MA.\n1.52 Richardson, Stephen D.; Dolan, William B.; and Vanderwende, Lucy (1998): MindNet:\nAcquiring and structuring semantic information from text. Proceedings, 36th Annual\nMeeting of the Association for Computational Linguistics and the 17th International\nConference on Computational Linguistics (COLING-98), Montreal, 1098–1104.\nwww.aclweb.org/anthology/P98-2180\n1.53 Roget, Peter Mark. Roget’s Thesaurus. Many editions and variant titles.\n1.54 Ruhl, Charles (1989): On Monosemy: A study in linguistic semantics. State University\nof New York Press, Albany, NY.\n1.55 Sapir, Edward (1929/1964): The status of linguistics as a science. Language, 5, 207–\n214. Reprinted in Mandelbaum, David G. (ed.), Culture, Language, and Personality:\nSelected essays of Edward Sapir, University of California Press, Berkeley.\n1.56 Sowa, John F. (2003): Conceptual graphs. This volume, XXX–XXX.\n1.57 Steele, James (1990): The vocable hope: A family of lexical entries for an explana-\ntory combinatorial dictionary of English. In Steele, James (ed.), Meaning–Text Theory:\nLinguistics, lexicography, and implications, University of Ottawa Press, 131–158.\n1.58 Talmy, Leonard (2000a): The relation of grammar to cognition. In Talmy 2000b, I-21–\n96.\n1.59 Talmy, Leonard (2000b): Toward a Cognitive Semantics, two volumes. The MIT Press,\nCambridge, MA.\n1.60 Viegas, Evelyn; Onyshkevych, Boyan; Raskin, Victor: Nirenburg, Sergei (1996): From\nsubmit to submitted via submission: On lexical rules in large-scale lexicon acquisition.\nProceedings, 34th Annual Meeting of the Association for Computational Linguistics,\n",
  "speaker": "SYSTEM",
  "uuid": "669b4874-a0d2-43e9-8205-3c27c2cb5415"
}