{
  "message": "SYSTEM: Enunciado_new.pdf: Página 3\nDevelopment of an event ontology reusing general ontologies \nInvited teacher: Mariano Fernández López                                                                                                   3 \n \n1 Competences to be acquired (or strengthened) \nThe students should acquire the following competencies: \n1) Methodological ontology development. \n2) General ontology reuse. \n2 Task to carry out \nEach student must develop a cultural event ontology that answers, at least, the \nfollowing competency questions (CQs): \n• \nWhen is the cultural event concert1 celebrating? \n• \nIs celebrated the cultural event concert1 before the cultural event concert2? \n• \nHave the cultural events concert1 and concert2 the same duration? \n• \nAre the cultural events concert1 and concert2 celebrated at the same time? \n• \nIs the musical work concert1 part of the cycle of concerts concertCycle1? \n• \nDoes the musical piece musicalPiece11 belong to the musical work \nmusicalWork1? \n• \nIs the musical piece musicalPiece11 interpreted in the cycle of concerts \nconcertCycle1? \n• \nWhat music pieces are interpreted in the cycle of concerts concertCycle1? \n3 The required products \nThe students must deliver a report and the resulting ontology in OWL. The report must \nbe delivered in paper and e-mail to the addresses: mfernandez.eps@ceu.es and \nmasterr09@delicias.dia.fi.upm.es. It is preferable Word format, although PDF will be \nalso accepted. Concerning the resulting ontology, it must be sent by e-mail to the \naforementioned addresses. \nThe report must have, at least, the following parts: \n• \nTitle page. It will contain, at least, the name and the e-mail address of the \nstudent. \n• \nOutline. \n• \nIntroduction. \n• \nJustification of the types of general ontology to be reused (activity 1). \n• \nThe list of the found ontologies with their URL, language and implemented \ntheories (activity 3). \n• \nThe comparative study of general ontologies (activity 4). \n• \nCQs transformed according to the vocabulary used in the reused general \nontologies (task 5.1). \n• \nTables of general ontologies versus features (task 5.2). \n• \nJustified selection of general ontologies (task 5.3). \n",
  "speaker": "SYSTEM",
  "uuid": "66b3a688-97e7-4548-8b5d-b605b08b91ce"
}