{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Procedimiento_viajes \n\nContents\n[\nhide\n]\n1\nAntes del viaje\n2\nDurante el viaje\n3\nDespués del viaje\n4\nDietas\nEsta página describe el procedimiento a seguir cada vez que un miembro del Grupo deba realizar un viaje con cargo al mismo.\nAntes del viaje\n\nEntregar a José\n, debidamente cumplimentada,\nla hoja previaje, tan pronto como se tenga conocimiento de la realización del viaje\no, en su defecto, tan pronto como sea posible. Cuando hablamos de la hoja-previaje nos referimos a la primera hoja del documento que podeis descargar aquí: [\n[1]\n]\nRealizar las reservas, tan pronto como se tenga conocimiento de la realización del viaje\n, tanto del medio de desplazamiento, como del alojamiento, para evitar el incremento del precio de las reservas de última hora.\nAquellos billetes que se compren durante los 15 días que preceden a la salida del mismo necesitan confirmación explícita de Asun o de Oscar.\nCuando sean varios los miembros de Grupo que tengan que viajar, compartirán habitación, en la medida de lo posible, para minimizar los gastos de alojamiento.\nComo novedad,\nes imprescindible que, cuando se asista a una conferencia para presentar un artículo, se entregue\n, junto con la hoja previaje,\nel artículo que se vaya a presentar en formato físico\ny, además, sería de agredecer que lo mandárais en formato digital a la siguiente dirección de correo: jasala@delicias.dia.fi.upm.es\nSólo podrá solicitarse el anticipo de cantidades que sean conocidas en el momento de la entrega del previaje\n.  Es decir, podrá solicitarse el anticipo de cantidades para hacer frente a gastos de viaje y/o de alojamiento, pero nunca para hacer frente a gastos de manutención, ya que los mismos no se pueden determinar de antemano.\nDurante el viaje\n\nDurante el viaje\nhabrá que conservar todas las facturas, tickets y demás documentos acreditativos de los distintos gastos\n. En el caso de los billetes de avión, es imprescindible que junto con la factura o reserva (que refleja el coste de los mismos), se conserven las tarjetas de embarque (que permiten acreditar que la persona ha tomado efectivamente los vuelos).\nSe utilizará transporte público en todos aquellos desplazamientos en que sea posible, minimizando las facturas de taxi. No se reflejará como gasto de viaje el kilometraje realizado con el vehículo particular del domicilio al aeropuerto o estación, ni viceversa.\nEs muy importante que las facturas vayan a nombre de la persona a la que se haya autorizado el gasto en la hoja previaje o, en su defecto, que en las mismas se haga referencia a esa persona (en el caso de que, por ejemplo, dos miembros del Grupo hayan compartido habitación en el hotel).\nDespués del viaje\n\nHabrá que\nentregar\n, debidamente cumplimentada,\nla hoja postviaje acompañada de los documentos que acrediten los distintos gastos.\nCuando hablamos de hoja postviaje nos referimos a la segunda hoja del documento anteriormente descargado: [\n[2]\n]\nLas distintas cantidades deberán reflejarse en euros, adjuntando el tipo de cambio aplicado en tickets o facturas pagadas en divisa extranjera\n. Para acreditar el cambio se adjuntará el cargo en el banco (en caso de ser un pago por este medio) o una web impresa con el cambio oficial en la fecha del gasto.\nLos gastos de manutención, deberán consignarse en forma de múltiplos de dietas\n, por lo que habrá que calcular el total de gastos por ese concepto y aproximarlo a dietas (entras o medias), en función del país de destino.\nDietas\n\nPaís\nManutención\nPaís\nManutención\nEspaña\n37,40\nIrlanda\n48,08\nResto del Mundo\n40,87\nIsrael\n56,50\nAlemania\n59,50\nItalia\n63,11\nAndorra\n37,86\nJamaica\n46,28\nAngola\n59,50\nJapón\n96,76\nArabia Saudita\n54,09\nJordania\n42,67\nArgelia\n44,47\nKenia\n39,67\nArgentina\n55,29\nKuwait\n44,47\nAustralia\n51,09\nLíbano\n34,86\nAustria\n58,90\nLibia\n54,69\nBélgica\n82,94\nLuxemburgo\n55,89\nBolivia\n36,66\nMalasia\n34,26\nBosnia-Herzegovina\n49,88\nMalta\n31,85\nBrasil\n79,33\nMarruecos\n39,67\nBulgaria\n37,86\nMauritania\n39,07\nCamerún\n48,68\nMéjico\n43,27\nCanadá\n51,69\nMozambique\n42,67\nChile\n50,49\nNicaragua\n52,89\nChina\n46,28\nNigeria\n46,88\nColombia\n78,13\nNoruega\n80,54\nCorea\n55,29\nNueva Zelanda\n40,27\nCosta de Marfil\n49,28\nHolanda\n64,31\nCosta Rica\n44,47\nPakistán\n37,26\nCroacia\n49,88\nPanamá\n36,66\nCuba\n33,06\nParaguay\n33,06\nDinamarca\n64,91\nPerú\n43,27\nRepública dominicana\n36,66\nPolonia\n42,67\nEcuador\n43,27\nPortugal\n43,87\nEgipto\n39,07\nReino Unido\n82,94\nEl Salvador\n43,27\nRepública Checa\n43,27\nEmiratos Árabes Unidos\n56,50\nRumanía\n38,46\nEslovaquia\n43,27\nRusia\n73,32\nEstados Unidos\n69,72\nSenegal\n45,08\nEtiopía\n37,86\nSingapur\n48,08\nFilipinas\n39,67\nSiria\n46,28\nFinlandia\n65,51\nSudáfrica\n48,08\nFrancia\n65,51\nSuecia\n75,13\nGabón\n52,89\nSuiza\n61,30\nGhana\n37,26\nTailandia\n39,07\nGrecia\n39,07\nTaiwán\n48,68\nGuatemala\n42,67\nTanzania\n30,05\nGuinea ecuatorial\n50,49\nTúnez\n46,28\nHaití\n37,86\nTurquía\n39,07\nHonduras\n42,07\nUruguay\n41,47\nHong Kong\n51,69\nVenezuela\n36,06\nHungría\n46,28\nYemen\n43,27\nIndia\n38,46\nYugoslavia\n49,88\nIndonesia\n42,67\nZaire/Congo\n54,09\nIrak\n39,07\nZimbawe\n39,07\nIrán\n44,47\nAsí, si por ejemplo hemos realizado un viaje al Reino Unido, y los gastos de manutención han supuesto 300 libras, es decir 330,537 € (de acuerdo al cambio vigente en el día de hoy: 1 GBP = 1.10179 EUR), deberíamos dividir 330,537/82,94 = 3,98 dietas. Y dado que se ha de aproximar a dietas medias o enteras, en este caso deberíamos reflejar en la hoja posviaje como gastos de manutención 4 dietas = 331,76 €.",
  "speaker": "SYSTEM",
  "uuid": "66bdfe7c-d75f-44ea-95a0-76f2cef30ce5"
}