{
  "message": "SYSTEM: Semantic_Integration_Sensor_Networks_%28short_overview%29.pdf: Página 18\n18\nRed de Ontologías para el Camino de Santiago\nReferences\n•Arasu, A., Babcock, B., Babu, S., Cieslewicz, J., Datar, M., Ito, K., Motwani, R., Srivastava, U., Widom, J.: Stream: The stanford data stream \nmanagement system. In Garofalakis, M., Gehrke, J., Rastogi, R., eds.: Data Stream Management. (2006)\n•Sahoo, S.S., Halb, W., Hellmann, S., Idehen, K., Jr, T.T., Auer, S., Sequeda, J., Ezzat, A.: A survey of current approaches for mapping of \nrelational databases to RDF. W3C (January 2009)\n•Arasu, A., Babu, S., Widom, J.: The cql continuous query language: semantic foundations and query execution. The VLDB Journal 15(2) \n(June 2006) 121-142\n•Brenninkmeijer, C.Y., Galpin, I., Fernandes, A.A., Paton, N.W.: A semantics for a query language over sensors, streams and relations. In: \nBNCOD '08. (2008) 87-99\n•Barrasa, J.,  Oscar Corcho, Gomez-Perez, A.: R2O, an extensible and semantically based database-to-ontology mapping language. In: \nSWDB2004. (2004) 1069-1070\n•Lenzerini, M.: Data integration: a theoretical perspective. In: PODS '02. (2002) 233-246\n•Barrasa Rodriguez, J., Gomez-Perez, A.: Upgrading relational legacy data to the semantic web. In: WWW '06. (2006) 1069-1070\n•Barbieri, D.F., Braga, D., Ceri, S., Della Valle, E., Grossniklaus, M.: C-sparql: A continuous query language for rdf data streams (to appear). \nIn: (IJSC). (2010)\n•Bolles, A., Grawunder, M., Jacobi, J.: Streaming SPARQL - extending SPARQL to process data streams. In: ESWC 08. (2008) 448-462\n•Kossmann, D.: The state of the art in distributed query processing. ACM Comput. Surv. 32(4) (2000) 422-469\n•Perez, J., Arenas, M., Gutierrez, C.: Semantics and complexity of sparql. ACM Trans. Database Syst. 34(3) (2009) 1-45\n•Calvanese, D., De Giacomo, G., Lembo, D., Lenzerini, M., Rosati, R.: DL-Lite: Tractable description logics for ontologies. In: AAAI 2005. \n(2005) 602-607\n•Poggi, A., Lembo, D., Calvanese, D., Giacomo, G.D., Lenzerini, M., Rosati, R.: Linking data to ontologies. J. Data Semantics 10 (2008) 133-\n173\n•Perez-Urbina, H., Horrocks, I., Motik, B.: Ecient query answering for owl 2. In: ISWC 2009. (2009) 489-504\n",
  "speaker": "SYSTEM",
  "uuid": "674afb43-106c-4cb2-8d7e-f6a9f1630af0"
}