{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 77\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 77 of 124\n• ScopeNote, which is a note following a term explaining its coverage, specialized usage, or rules for\nassigning it. The ScopeNote has a lexicalValue element.\n• HierarchicalRelationship, which is a relationship between or among terms in the thesaurus that depicts\nbroader (generic) to narrower (speciﬁc) or whole-part relationships.\n• AssociativeRelationship, which is a relationship between or among terms in the thesaurus that leads\nfrom one term to other terms that are related to or associated with it.\n• Equivalence, which is a relationship between or among terms in the thesaurus that leads to one or\nmore terms that are to be used instead of the term from which the cross-reference is made.\nFigure 5.2: UML representation of the term-based thesaurus components [ISO86]\n5.4.2\nConcept-based Thesaurus\nThe concept-based thesaurus consists of two types of entity, concepts and terms. A concept is deﬁned as a\nunit of thought, something which exists in the mind of a person. Relationships such as ’broader’ ’narrower’\nand ’related’ are considered to be concept-to-concept relationships, because they convey information about\nthe structure of the concept-space being described. That is, they convey information about meaning. The BS\n8723-2:2005 [BS 05b] standard proposes a thesaurus structure that allows for a clear separation of concept\ninformation and term information, i.e. a concept-based thesaurus. Based on BS 8723-5:2005 [BS 05c] we\nidentify the following thesaurus components (see Figure 5.3):\n• ThesaurusConcept, which represents the individual concept within the thesaurus. It has the following\nelements: (1) identiﬁer, and (2) notation. Additionally, a ThesaurusConcept has the following compo-\nnents: (1) SimpleNonPreferredTerm, (2) PreferredTerm and (3) ScopeNote.\n• ThesaurusTerm, which represents an individual term whithin the thesaurus. It has the following ele-\nments: (1) LexicalValue, and (2) identiﬁer. A ThesaurusTerm can be a SimpleNonPreferredTerm or a\nPreferredTerm.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "6839a9ad-3256-4a08-b808-8039afb51797"
}