{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual03062010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Evaluación Definitiva del proceso de asociación de semántica a etiquetas Sem4Tags\n1) Se ha iniciado la campaña de evaluación con invitación a participar a alrededor de 40 usuarios.\n2) Se ha aceptado un poster en la conferencia EKAW2010 que describa a Sem4Tags y que será presentado en Octubre de este año. \n3) Se ha enviado un paper a the 19th ACM conference on Information and knowledge Management, que describe a Sem4Tags.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Implementación de un proceso automatico de verificación de una fuente de datos. Es decir, verificar si las anotaciones que se realiza son correctas, para esto se invoca a la fuente con los ejemplos encontrados en DBpedia y se compara el RESULT con los datos de DBpedia.\nTarea 3. Modelo de anotación híbrido\n.\nTarea Integración y patrones de reconocimiento avanzado 2.\nAmpliación de la estructura de datos de salida: lingúísticas y semánticas. \nLa estructura lingüística se basa en la devolución de un modelo RDF, por ahora, como un fichero. Se ha estado trabajando en la incorporación de datos procedentes de la Web Semántica. Para ello, se ha recurrido a la API de Sindice. Los datos obtenidos de los nombres propios del recurso se devuelven en un fichero.\nInterfaz Anotación Híbrida\n\n- Se sigue trabajando en Yii, para implementar la persistencia de las anotaciones creadas e integración de módulos. El lunes, se espere poder tener el servidor desbloqueado por usuarios o evaluaciones, para realizar la instalación de la nueva versión.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha reinstalado el servidor y los clientes Fura, así como el portal.\n- Se esta procediendo a desplegar los servicios web de metaplanificación y adaptadores.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nRedefinición del formato de escritura manual de los conjuntos de referencia para poder realizar su transcripción automática al formato OEGMappings.\nRediseño del conversor automático de conjuntos de referencia en formato manual a\nformato OEGMapping.\nTarea 7.1\n\n- RDF.\n· Continuación del desarrollo de ontologías para nuevos dominios \n      · Continuación de la generación de RDF para otros dominios\n      · Tratamiento de la geometría (bases de datos) para incorporación al RDF\n- Website\n· Actualización de web",
  "speaker": "SYSTEM",
  "uuid": "686b2d59-96fd-4000-b884-835aac73d525"
}