{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 59\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 59 of 124\nPR-NOR-CLTX-02. Pattern for re-engineering a classiﬁcation scheme which follows the adjacency list\ndata model\nThe pattern for re-engineering non-ontological resource shown in Table 4.2 suggests a guide to transform a\nclassiﬁcation scheme into an ontology. The classiﬁcation scheme is modeled/represented with an adjacency\nlist data model. This pattern aims at creating a taxonomy from the classiﬁcation scheme, being the semantics\nof the relations between classiﬁcation scheme items the subClassOf relationship.\nTable 4.2: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nadjacency list data model\nSlot\nValue\nGeneral Information\nName\nClassiﬁcation scheme to Taxonomy (adjacency list model)\nIdentiﬁer\nPR-NOR-CLTX-02\nType of Component\nPattern for Re-engineering Non-Ontological Resource (PR-NOR)\nUse Case\nGeneral\nRe-engineering a classiﬁcation scheme which follows the adjacency list model to design a\ntaxonomy.\nExample\nSuppose that someone wants to build an ontology based on the water areas classiﬁcation\npublished by FAO. This classiﬁcation scheme follows the adjacency list data model.\nPattern for Re-engineering Non-Ontological Resource\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a classiﬁcation scheme which follows the adjacency list\nmodel.\nA classiﬁcation scheme is a rooted tree of concepts, in which each concept groups entities\nby some particular degree of similarity.\nThe semantics of the hierarchical relation between parents and children concepts may vary\ndepending of the context.\nThe adjacency list data model [Bra05] for hierarchical classiﬁcations proposes to create an\nentity which holds a list of items with a linking column associated to their parent items.\nExample\nThe FAO classiﬁcation for water areas groups them according to some different criteria as\nenvironment, statistics, and jurisdiction, among others.\nThis classiﬁcation scheme is available at\nhttp://www.fao.org/figis/servlet/RefServlet\nGraphical Representation\nGeneral\nExample\nOUTPUT: Designed Ontology\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "68875a90-c799-4189-ab49-b5c56b646774"
}