{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 22\n \n \nPág. 24 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nMedidas \n5\n \nA continuación, se exponen todas las medidas que componen el Plan organizadas en función de \nejes y líneas de actuación específicas. Dichas medidas serán planificadas por medio de planes \noperativos y se establecerán indicadores para conocer su progreso. Se estudiará de forma \nperiódica el impacto y el estado del sector así como la adopción de las tecnologías del lenguaje \nen las Administraciones Públicas. \nEje 0: GOBERNANZA DEL PLAN \nMotivo: \nLa realización del Plan exige el concurso de numerosos actores y comprende medidas de diversa \níndole. Por ello es necesario establecer un mecanismo de coordinación, control y seguimiento del \nPlan que asegure la actuación concertada de los actores y la sinergia entre las actuaciones del \nPlan para el logro de sus objetivos. \nObjetivos: \nLos objetivos de este Eje son los siguientes: \n \nIdentificar las Administraciones y Órganos competentes, y unidades operativas que van a \nparticipar en la realización del Plan. \n \nIdentificar las cadenas de mando y definir los procedimientos de toma de decisiones. \nAsegurar el compromiso de los actores y dar cauce a su participación. \n \nCrear un órgano de coordinación de los Órganos competentes y dotarlo de la \ninfraestructura necesaria. Asegurar la actuación concertada de los actores y la sinergia \nentre las actuaciones del Plan, evitando redundancias, sincronizando actuaciones y \ncompartiendo recursos. \n \nRealizar la planificación operativa del Plan y de los planes operativos de cada Eje del Plan. \nRealizar la evaluación de la situación inicial y de los resultados de las sucesivas fases del \nPlan. \n \nDotar de flexibilidad a la implementación del Plan que permita una buena adaptación a la \nevolución de las circunstancias y el aprovechamiento de la experiencia adquirida. Asegurar \nla transparencia de las actuaciones. \n \nCrear un órgano de interlocución con los agentes implicados en las tecnologías del \nprocesamiento de lenguaje natural y la traducción automática. \nMedidas: \nEl Ministerio de Industria, Turismo y Comercio, a través de la Secretaría de Estado de \nTelecomunicaciones y para la Sociedad de la Información, será el órgano de la Administración \nGeneral del Estado que ejercerá la coordinación de la realización del Plan de Impulso de las \n",
  "speaker": "SYSTEM",
  "uuid": "690cacff-5d12-4076-8b0e-0ef34f4f8235"
}