{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 13\n \n \n13\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n14.2. La lista de beneficiarios seleccionados se expondrá en el tablón de anuncios del \nRectorado y en la página web de la UPM. El Rector dictará una Resolución \nindividualizada comunicándose ésta a los candidatos seleccionados. \n14.3. Los candidatos seleccionados dispondrán de un tiempo máximo de un mes para la \naceptación de la beca y su incorporación al grupo de trabajo. \n14.4. El Rectorado establecerá una lista de reserva de candidatos, manteniendo la validez \nde la misma por un período de seis meses. \nLas renuncias o bajas que se produzcan entre los beneficiarios de nueva concesión \ndentro de los seis primeros meses de la primera anualidad, podrán ser cubiertas por \nlos candidatos de la citada lista de reserva.  \n \n \nDECIMOQUINTO.-  RECURSOS \n \n15.1. La presente convocatoria, que pone fin a la vía administrativa, podrá ser recurrida \npotestativamente en reposición en el plazo de un mes, al amparo los art. 116 y 117 \nde la Ley 30/92, modificada por la Ley 4/99, por quien ostente un interés  directo, \npersonal y legítimo, entendiéndose, en caso contrario, aceptada a todos los efectos la \nconvocatoria por quienes, en su razón presenten instancias para adjudicación de \nbecas.   \n            \n15.2. Contra la resolución del procedimiento de concesión, revocación y rescisión, cabe \ninterponer recurso ante el Juzgado de lo Contencioso-administrativo de Madrid, en el \nplazo de dos meses a contar desde el día siguiente a la fecha de su publicación por \nlos medios indicados en el art. 14.2 de esta Resolución. \n \nDECIMOSEXTA .-  DISPOSICIÓN ADICIONAL \n \n         La UPM, con objeto de asegurar la inscripción de este Programa de ayudas para becas \ny contratos para el personal investigador en formación en el Registro general de programas \nde ayudas a la investigación del Ministerio de Ciencia e Innovación, podrá realizar las \nadaptaciones necesarias a las que se vea obligada, por modificación de las condiciones \nestablecidas por el citado Ministerio en las relaciones que liguen los beneficiarios a la UPM. \n \n \n \nMadrid, 26 de octubre de 2009 \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "6b4c0850-4c86-4c91-9330-a548463283c3"
}