{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SETSI \n\nResponsables: Asun, María Poveda, Soco\nURL interna:\nContents\n[\nhide\n]\n1\nimplementación detalles\n2\nOntologies\n3\nRecursos y enlaces de interes\n4\nGuías para extensión\n5\nA tener en cuenta\n6\nque no se olvide\nimplementación detalles\n\nDeicisiones modeado:\n.- Para relacionar las empresas con los códigos mejor usar org:classification mejor que gr:category, por comparación de los rangos con nuestro caso de uso. org es mas precisa y encaja mejor con lo que buscamos, pero se podrían duplicar modelados.\nGrafos en virtuoso:\nhttp://minetur.linkeddata.es/categoriasinteco/\npara la clasificación de inteco\nhttp://minetur.linkeddata.es/mappings/clasificacionA-clasificacionB/\nOntologies\n\nOntologies\nCPV\nmirar\nhttp://cpv.data.ac.uk/\npues en el de cz y moldeas se utilizan las relaciones transitivas. Incluir esto en guias para lineas futuras.\nhttp://linked.opendata.cz/resource/concept-scheme/cpv-2008\nhttp://opendata.cz/en/linked-data\nUNSPSC\nhttp://onki.fi/en/browser/\nOrganization\norg:\nhttp://www.w3.org/TR/2014/REC-vocab-org-20140116/\nrov:\nhttp://www.w3.org/ns/regorg#\ny documentación en\nhttp://www.w3.org/TR/vocab-regorg/\nContratos publicos\npc:\nhttp://purl.org/procurement/public-contracts#\ncontsem:\nhttp://contsem.unizar.es/def/sector-publico/ContSem/\n--> de momento yo no la voy a utilizar pero incluir en el entregable con vistas a futuro.\ngood relations and product ontology (PO)\nClasificaciones\nson las de weso, no estan disponibles:\nhttp://datahub.io/organization/product-scheme-classifications\nutilizan CPV como central. ¿perdidas?\nsolo string matching?\nRecursos y enlaces de interes\n\nhttps://joinup.ec.europa.eu/community/open_standards_ict/description\nGuías para extensión\n\nAhora hemos generado el SKOS \"plano\" solo instancias con relaciones skos. Se puede hacer también siguiendo un modelo como en MOLDES. figura \"Fig. 2. A partial view of the data model for PSCs in SKOS\" del paper: Empowering the access to public procurement opportunities by means of linking controlled vocabularies. A case study of Product Scheme Classifications in the European e-Procurement sector\"\nEn el mismo paper para hacer mappings automáticos: Firstly a target PSC is\nselected and their descriptors (in English) are indexed\nusing Apache Lucene. After that the mappings between\nelements in a source PSC are automatically discovered\nand generated through the execution of queries against\nthe indexed PSC. Basically the creation of a mapping lies\nin a string comparison between the source descriptor\nand the target descriptor. Nevertheless the personalization\nof Apache Lucene and Solr allowed us the creation\nof more accurate mappings. Finally an important issue\nlies in the mapping confidence, in this case a pairwise\nhuman-validation has been carried out to ensure a 80–\n90% of correct mappings.\nGuias para hacer mappings manuales\nLas relaciones que se van a buscar son las definidas en skos para relacionar distinos esquemas de conocimiento. Les asignamos las siguientes siglas:\n(bm) broadMatch\n(cm) closeMatch\n(em) exactMatch\n(nm) narrowMatch\n(rm) relatedMatch\nVamos asignando colores que nos orienten en el dominio. En azul ponemos los propios de seguridad. En naraja, están los que podrían que ver con seguridad.\nSobre el documento cpv_2008_ver_2013SoloES+Inteco_v0.xlsx\nEn rosita (en la etiqueta) estan marcados los títulos que tienen que ver con seguridad.\nEn naranja y morado (en el código) los que no habían mencionado ellos.\nEn azul estan los que nos dieron dados.\nen principio solo enlazamos servicios de cpv con servicios inteco e igual para productos.Podrían darse relaciones de \"related\" entre servicios y productos pero esta relación no es muy fuerte y podría alargarse la generación de datos y links si nos perdemos en relaciones poco fuertes. Las obviamos de momento pero se tendrían que tener en cuenta en el futuro.\nOrden en el que buscamos los mappings.\ngeneramos mappings con una matriz, una clasificación en la X y la otra en la Y. Luego para transformarlo, mirar transformaciones para que nos resulte mas facil con clasificaciones grandes. (para nosotras)\nPreferencias para asignar relaciones de skos.\ntopología:\na priori malla nos parece mas factible.\nse busca la topología en estrella, buscar como hacerla:\nsolución ili-eurowordnet: hay una central que una de referencia \"duplicada\" en la que se va a añadiendo lo necesario de las otras taxnomias de manera que el nucleo central permita interconectarlas. Es decir, si la base carece de un concepto se le añade de alguna manera.\nA tener en cuenta",
  "speaker": "SYSTEM",
  "uuid": "6b63777a-c50d-4956-a891-d397c8343730"
}