{
  "message": "SYSTEM: Wiki: Sort-term Research Assistants in Semantic Web / Music Informatics\nThe Centre for Digital Music (C4DM) at Queen Mary University of London  seeks two research assistants to work on the project Linked Music  Metadata (LinkedBrainz.c4dmpresents.org), funded by JISC and involving  the MetaBrainz Foundation (musicbrainz.org) as partner. The objectives  of the project are to:\n(1) Publish the MusicBrainz metadatabase directly as a Linked Data  resource on the semantic web;\n(2) Link it to other music metadata on the semantic web;\n(3) Create a semantic web query facility (SPARQL endpoint) for the  MusicBrainz data;\n(4) Develop tutorial materials to explain and illustrate how the  content can be used;\n(5) Engage the academic music and music informatics communities, and  the broader semantic web community, in the development and use of the  exposed content; and\n(6) Investigate and report on scalability, provenance and  sustainability of the resource.\nThe roles involve software development, ontology design, documentation  and presentation of project outputs. The ideal applicant will have a strong background of research and/or development for the semantic web, knowledge of Music Informatics and in particularly the Music Ontology, and a good command of written and oral English. For more details please see the full ad and job profile at  www.eecs.qmul.ac.uk/~simond/RA-LinkedBrainz.pdf\nThe project is based in the Centre for Digital Music (C4DM) which is a  world-leading multidisciplinary research group in the field of Music & Audio Technology. Details about the C4DM can be found at  www.elec.qmul.ac.uk/digitalmusic\nThe posts are full time (part time might be possible) for 3-6 months,  starting as soon as possible. Salary will be in the range £29552 - £33794 per annum inclusive of London Allowance. Candidates must be able  to demonstrate their eligibility to work in the UK in accordance with the Immigration, Asylum and Nationality Act 2006. Where required this may include entry clearance or continued leave to remain under the Points Based Immigration Scheme.",
  "speaker": "SYSTEM",
  "uuid": "6bed18c8-ca07-4b1a-ad89-3b445760d8c2"
}