{
  "message": "SYSTEM: Wiki: Volver a Sistemas y Equipos\nStatus\nTarea\ninfo\n100%\nBackup de bases de datos, resin y portales web del cluster a otro equipo\nHecho backup de seals.\n100%\nBackup del equipo de Ana y todos los datos, solo se hace backup de secretariado pero no del mail y otros docs. Programarle backup automatico del correo al cluster.\n*\n100%\nTerminar imagen del nodo 2 del cluster\n*\n100%\nServer para dynalearn (hay que reinstalarlo,errores hardware solucionados)\n*\n100%\nInstalar registro de ADMIRE (lo miro con Carlos este miércoles). Ponerlo en una maquina de alta disponibilidad (si funciona bajo Windows moverlo al cluster o al server del grupo)\n*\n100%\nResolver problemas menores de NeoOn. Lo gordo ya esta solucionado\n*\n100%\nactualizacion cluster. actualizacion backups\n*\n100%\nInstalar equipos nuevas incorporaciones\n*\n100%\ncaida de seals y resin del cluster\n*\n100%\nErrores servidores web parla y salamanca\n*\n100%\nErrores en cluster y carpetas de usuarios\n*\n100%\nEquipo de emontiel roto\n*\n90%\nTerminar instalación del servidor de dominio. Habilitar servicios para el grupo. Hacer estudio de carga soportada de servicios + VM + dominio + fileserver (esto va a llevar tiempo). Integrar servicios de otros portales\ninstalado. pruebas integracion con mi equipo. virtualizaciones\n100%\nRevision a fondo de los backups tras errores de permisos del cluster. pruebas de restore\n*\n100%\nHacer imagen del servidor elnath. programar backup DynaLearn\n*\n100%\nMover al nuevo server VM que sean importantes (como la del ICPS)\nno necesario.backup de la VM\n10%\nreinstalar y virtualizar delicias en oeg-lia3\nongoing.\n100%\ninstalar nuevo servidor de seals con W2K8\nrecibido 01/02/10\nPRIOTARIO\n50%\nArreglar Fuencarral\npruebas Dspace\n100%\nArreglar babage\n*\n100%\nMantenimiento completo de delicias\nend 18/12\n100%\nIntegrar GIT con SVN (en delicias o en el de dynalearn. Hablarlo con Jorge tras instalación)\ninstalado en elnath\n20%\nImplantar bugzilla, redmine o mantis para los proyectos\nPRIOTARIO\n100%\nCambiar discos de mi maquina defectuosos. cambiar fan roto. clone disk\n12/09\n50%\nActualizar imágenes de servidores existentes (requere parada de 1 dia)\nhecho: elnath, granvia, droz\nPRIOTARIO\n100%\nErrores de copia de algiedi (copias manuales hechas y pruebas en curso)\n*\n*\nEl bioportal. Ver si se puede integrar o no en maquina que ya exista. No hay mas sitio (potencia de procesamiento) de momento para poner maquinas virtuales hasta que se instale el server de dominio del grupo\ninstalandose en regulo por raziel\n100%\nreinstalar hamal bajo linux. integrar portal liferay (ver con saquicela)\n08/01/10\n100%\nEstudio del futuro server de dynalearn (mas adelante)\npresupuesto pedido\n100%\npruebas de rendimiento del server PE2900 para Seals\n*\n*\nPrueba de integracion de sharepoint\nbaja prioridad\n10%\nPruebas uso de webdav con archivos de backup\nbaja prioridad\n*\nPruebas de integracion de la extension google wave en media wiki\nno hay version estable.\n10%\ninstalar servidor de EV/linkeddata\ninstalando\n10%\ninfraestructura SEALS\npedir presupuestos. config+analisis\nTrabajo D2D no incluido:\n- revision semanal de backup. buscar sistema que busque errores automaticamente\n- incidencias usuario\n- incidencias servers\n- Mantenimiento HW\n- Mantenimiento SW\n- peticiones de proyectos\n- proveedores\n- to be added.....\nupdated by\nRalcazar",
  "speaker": "SYSTEM",
  "uuid": "6bedc68b-4545-4561-b898-afcac1f92d67"
}