{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 13\n5.3  Approach followed by SEEMP \nIn SEEMP project we adopt a different option depending on the part of the local \nontology to be built. On one hand, we select option 1 (building local ontologies from \nthe RO) for Job Seeker and Job Offer ontologies and other general purpose ontologies \nlike, for example, the Time Ontology. On the other hand, we select option 2 (building \nlocal ontologies as a reverse engineering process from ES schema resources) for \nOccupation, Education, Economic Activity, Language, Compensation, Labour \nRegulatory, Skill and Driving License ontologies. \nThe reason of selecting option 1 for Job Seeker and Job Offer ontologies is because \nthere are not significant differences between these ontologies and the way how each \nES structures job seeker and job offer information. Consequently mappings between \nlocal ontologies and RO will be simple, but mappings between local ontologies and \nES schema sources will be complex. Furthermore, for the job seeker and job offer \ninformation local ontologies will share the same vocabulary (see [16]).   \nThe reason of selecting option 2 for the ontologies mentioned above is because \neach ES may have its own classification systems for the related information. \nNevertheless, it may happen that the local ontology shares some classification with \nthe RO (as there will happen in the European scope with the driving license \nclassification). In that case, the reverse engineering process for that classification will \nbe skipped, and that part of the RO will be reused. By using option 2, mappings \nbetween local ontologies and RO will be complex, but mappings between local \nontologies and ES schema sources will be simple. \n6 Conclusions and Future Work \nIn this paper we have presented the methodological approach we followed for reusing \nexisting human resources management standards/classifications in the SEEMP \nProject. We also described the resultant RO which acts as a common “language” in \nthe form of a set of controlled vocabularies to describe the details of a job posting and \nthe CV of a job seeker. The RO was developed with the proposed methodology and \nwith the ontology engineering tool WebODE. Finally we have provided some \nguidelines for the building process of the local ontologies, and we conclude that the \nbest option for building the local ontologies is building them following a hybrid \napproach that employs the best option for each part of the RO. \nAn important conclusion of the work that we have carried out is that we can reuse \nhuman resource management standards in new applications following a systematic \napproach. Moreover, it is clear such a reuse can save time during the development of \nthe whole system. However, it is not always possible to reuse a standard in a \nstraightforward way, because sometimes the ideal standard does not exist for different \nreasons (different scope, outdated, etc.), and it is necessary to extend some \n“imperfect” standard with additional terminology coming from other standards or ad \nhoc classifications. As future work, we will complete the development of the local \nontologies for the SEEMP project. This work allows us to confirm that proposed \nsystematic \napproach \nnot \nonly \nsupports \nthe \ncreation \nof \na \nRO \nfrom \n",
  "speaker": "SYSTEM",
  "uuid": "6c9b9f17-3b41-4362-bd14-ee15d4dddcb1"
}