{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual14102010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nSolución de bugs encontrados en Sem4Tags por usuarios externos. El procesamiento de las palabras compuestas y errores de ortografía no estaba funcionando correctamente. Además, se corrigió un problema que se presentaba cuando en una página de desambiguación existía una url duplicada que definía el mismo significado.\nInicio modificación del artículo rechazado en el ISWC 2010 para enviarlo a la conferencia WWW 2011.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Mejora del proceso de registro de fuentes REST, ahora ademas de registrar con los inputs, se intenta recuperar mas instancias de la fuetne. Esto se realiza invocando a la fuente sin parametros, si retorna resultados se registra como invocaciones validas y se procede a detectar valores de entrada para estas invocaciones.\n- Registro de fuentes para realizar pruebas de anotaciones.\nTarea 3. Modelo de anotación híbrido\n.\n- Locuciones.\nSe continuado la revisión del estado del arte en recomposición de frases mediante el análisis del contexto. En particular, se ha revisado el trabajo de Barzilay R & Lee L (HLT-NAACL, 2004).\nTarea 2.3\n\n- Finalizado el H7.\n- Edición del video para el AEI.\nTarea 1.4\n\nConfección de conjuntos de referencia (\ngold-standard\n) para los siguientes alineamientos de recursos:\nNC_VdC - Phe4.0_VdC\nNGN_VdC - Phe4.0_VdC\nBCN200_VdC - Phe4.0_VdC\nBCN25_VdC - Phe4.0_VdC\nSiendo todos los subconjuntos de lexicones u ontologías para el subárbol de Vías de comunicación (códigos 06).\nTarea 7.1\n\n-RDF\n· Generación y publicación de RDF proveniente de shapefile\n      · Generación de RDF con URI asociada a la fuente (\nhttp://geo.linkeddata.es/resource/Dataset/tipo/nombre\n)\n- Heurísticas\n· Inicio pruebas detección duplicados vía geometría\n      · Revisión del gold standard\n- Visualizador\n· Generación de Export to KML/GML",
  "speaker": "SYSTEM",
  "uuid": "6cfdf68a-bc90-4d51-b20d-18a5fd893746"
}