{
  "message": "SYSTEM: OEG_submission_SSN2014.pdf: Página 3\nprocessing engine capable of adapting to changing conditions while serving com-\nplex continuous queries. Some sources already generate Linked Data streams\n[12,2]. Otherwise, we provide a layer serving an ontology-based access to non\nLinked Data stream sources. Adapters for various input formats, such as CSV\nor REST APIs, are used to convert heterogeneous streams to RDF. The steps\ndescribed in this paper deal with the dataset preparation.\nTo reach an eﬃcient query processing over data streams we will apply ad-\nhoc query execution planning. Traditional databases include a query optimizer\nthat designs an execution plan based on the registered query and data statistics.\nIn a distributed stream processing environment, there are several aspects to\ncontemplate: changing rates of the input data, failure of processing nodes, and\ndistribution of workload, among others. Adaptive Query Processing (AQP) [1,8]\nallows adjusting the query execution plan to varying conditions of the data input,\nthe incoming queries, and the system. Additionally, it is used to correct query\noptimizer mistakes and cope with unknown statistics [1].\n4\nEarthquakes in Castell´on in 2013\nThe Castor Project aims at increasing the gas storage capacity in Spain. With\nthat purpose, a former oil deposit located 21 kilometres oﬀshore Vinaroz (in\nCastell´on, Spain) is being used as underground gas storage facility. In Septem-\nber 2013, the project activities were stopped because of several earthquake events\nreported by the Instituto Geogr´aﬁco Nacional (IGN)6, see ﬁgure 2, and the con-\nsequent protests of citizens. Earthquakes are not common in Castell´on. Although\nsome of the seismic movements were not perceivable in the coastal towns, there\nwere some noteworthy earthquakes above 4 in the Richter scale that caused the\nﬁnal decision of stopping the gas injection tasks.\nWe investigate in this use case how to simulate past events using historical\ndata in a streaming fashion. At long term, this will serve to design an adaptive\nstream processing approach that accounts for unexpected situations.\n4.1\nHistorical Dataset\nThe original dataset contains earthquake records in Spain during 2013.7 It was\nobtained as a text ﬁle from the IGN website.8 IGN also provides an RSS feed with\ninformation of earthquakes in the last ten days in Spain. However, we preferred\nto create a streaming simulation with a higher data volume.\nEach earthquake record is a row labeled with an event identiﬁer. The observed\nproperties include the depth of the earthquake in kilometres, its magnitude and\nthe scale type, and its intensity (in the European Macroseismic Scale, EMS-98).\nAdditionally, the dataset contains for each earthquake the date and time at which\n6 http://www.ign.es/\n7 https://www.dropbox.com/s/2y61thcrq85nke0/earthquakesSpain 2013.txt\n8 At http://www.ign.es/ign/layoutIn/sismoFormularioCatalogo.do?locale=en, all pa-\nrameters left as default, except the date ﬁelds: from 2013/01/01 to 2013/31/12.\n",
  "speaker": "SYSTEM",
  "uuid": "6d59581d-325c-44b5-809d-cd9f22060ae1"
}