{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 43\nBÚSQUEDA \n \n43 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nLos nodos de igual profundidad se ordenan arbitrariamente. En realidad, en el \nalgoritmo precedente, ese orden arbitrario es directamente heredado del que exista \nentre los operadores del sistema de producción (en el bucle 'para cada operador O \nhacer'). \nMediante esta estrategia, el árbol de búsqueda se va generando por niveles de \nprofundidad. Hasta que todos los nodos de un nivel no han sido revisados no se \nrevisa ninguno del siguiente nivel. \nPara facilitar la comprensión del proceso de búsqueda vamos a introducir algunos \nespacios de estados artificiales (que no provienen de ningún sistema de producción \nreal), que serán árboles o grafos etiquetados por letras. Las letras representan los \nestados. Por ejemplo, en la figura 1 aparece un árbol de estados, con estado inicial I \ny con un único estado objetivo O. \nI \nA \nB \nC \nD \nO \nE \nF \nG  \nFigura 1 \nIntroduciremos ahora una notación para describir el árbol de búsqueda. En el árbol \nde búsqueda no se dibujarán los nodos (cuya estructura, en general, puede ser \ncompleja) sino tan solo los estados (letras, en los ejemplos artificiales) y junto a ellos \nla información relevante sobre los nodos (en el caso de la búsqueda en anchura, \nninguna). La información relativa a la adyacencia entre los nodos queda recogida en \nel gráfico por las flechas dirigidas. En el árbol de búsqueda aparecerán vértices \ncorrespondientes a todos los nodos que van siendo generados (es decir, todos \naquellos que en algún momento del proceso hayan estado en la lista de ABIERTOS) \ny se numerarán secuencialmente (con números subrayados) los nodos conforme \nson examinados. \nEl árbol de búsqueda correspondiente a la búsqueda en anchura en el espacio de \nestados de la figura 1 ha sido recogido en la figura 2. Puesto que los nodos de igual \n",
  "speaker": "SYSTEM",
  "uuid": "6e1e6996-eddb-4ca8-83de-3cc17f001913"
}