{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 60\nBÚSQUEDA \n \n60 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEl esquema genérico que permite realizar búsquedas seguras y no redundantes en \nespacios de estados que sean grafos (dirigidos o no, acíclicos o no) aparece más \nabajo. \nVemos que las únicas diferencias con el esquema que hemos denominado \nbúsqueda en árbol son: \n• En la línea 1' se inicializa CERRADOS con la lista vacía. \n• En la línea 5' se añade el estado que ya ha sido examinado a CERRADOS. \n• En las líneas 7' y 7'' se comprueba si el estado generado es nuevo. \nPRINCIPIO \n1 \nABIERTOS := (nodo-inicial) \n1' \nCERRADOS := () \n \nRESUELTO := FALSO \n2 \nmientras que ABIERTOS no es vacía Y NO RESUELTO hacer \n3 \n N := quitar primer elemento de ABIERTOS; E := estado asociado a N \n4 \n si E es un estado objetivo \n5 \n  \nentonces RESUELTO := verdad \n5' \n  \nsi no Añadir E a CERRADOS \n \n  \n \n \npara cada operador O hacer \n6 \n  \n \n \nsi O se puede aplicar a E \n7 \n  \n \n \n \nentonces crear un nodo correspondiente al estado E'  \n \n  \n \n \n \n \nobtenido por aplicación de O a E siempre que: \n7' \n  \n \n \n \n \n– E' no aparezca en ABIERTOS \n7''   \n \n \n \n \n– E' no esté en CERRADOS \n \n  \n \n \n \n \ny añadir ese nodo a ABIERTOS \n \nsi RESUELTO \n8 \n entonces devuelve el estado objetivo (y si se requiere una explicación, el  \n \n  \n \n \ncamino por el que hemos llegado a él) \n9 \n si no \ninforma de que el objetivo no puede ser alcanzado \nFIN \nSe podrían considerar variantes en las que las líneas 7' o 7'' no son incluidas. \nParticularizando a la búsqueda en anchura las consecuencias serían las que siguen. \nSi no incluimos la línea 7'' tendremos una versión que no cometerá cierto tipo de \nredundancias (en concreto, nunca re-examinará dos estados que aparerecieran en \nla versión anterior simultáneamente en ABIERTOS), pero no tiene en cuenta otras \n",
  "speaker": "SYSTEM",
  "uuid": "6e768369-11e3-4474-a909-3072b46d7873"
}