{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 1\nA Semantically Enhanced UPnP Control Point to\nEnhance Multimedia Home Sharing Networks\nMariano Rico1, Víctor Méndez3, Oscar Corcho1, Víctor García2,\nJosé Manuel Palacios2, and José Manuel Gómez-Pérez3\n1 Ontology Engineering Group, Departamento de Inteligencia Arti\u001ccial,\nFacultad de Informática, Universidad Politécnica de Madrid, Spain\n{mariano.rico, ocorcho}@fi.upm.es\n2 Telefónica I+D, Madrid, Spain\nvglazaro@tcpsi.es, jmpv@tid.es\n3 iSOCO, Madrid, Spain\n{vmendez, jmgomez}@isoco.es\nAbstract. There is plenty of multimedia content available in our homes,\nstored in multimedia disk drives, personal computers or digital cameras.\nProtocols like Universal Plug and Play (UPnP) allow sharing this con-\ntent among storage devices and displaying them in multimedia renderers\nin the local area networks of our homes. In this paper we describe a\nUPnP control point intended to add semantic data to our multimedia\nresources or the ones belonging to friends in our social network (Face-\nbook in the current version). To achieve this goal, the UPnP protocol\nhas been extended to provide a uniform access to multimedia content\nbelonging to di\u001berent homes and to enable the semantic annotation of\nthis multimedia content and its linkage to the Linked Data cloud.\nKeywords: UPnP, Multimedia, Annotation, Human-Computer Inter-\naction.\n1\nIntroduction\nWe live in a multimedia-centric world where users share all types of professional\nand user-generated multimedia resources (pictures, video, audio tracks, etc.) and\nwish to render them anywhere, anytime, in a large set of heterogeneous devices\n(TV sets, mobile phones, etc.). Most of these multimedia resources are shared\nthrough Web2.0 sites (e.g., Flickr, YouTube), where users upload, annotate,\ndiscuss, \u001cnd and download all types of multimedia content, while controlling\naccess to sensitive content for trusted colleagues, friends or relatives.\nIn this context, there is an increasing user demand for better multimedia\nmanagement tools not only on these online sites, but also in home environments.\nSuch tools would allow sharing user-generated multimedia content (in many cases\nsensitive or private) with trusted colleagues, friends or relatives without the need\nto upload it on external sites, and most importantly without losing the copyright\nover those resources.\n",
  "speaker": "SYSTEM",
  "uuid": "6f0bfc49-89b6-4898-815c-f3067dd3cafd"
}