{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\n[ONGOING] Title: Relation extraction from README software documentation (with Pablo Calleja)\n- Description: Software developed as part of scientific research is increasingly important for reproducing and reusing existing work. Software documentation usually contains valuable instructions for running and reusing software, but it is heterogeneous and difficult to interpret by intelligent systems. In this work, the student will have to leverage and adapt relation extraction models to find how different named entities in software documentation are related to each other. As a result, a knowledge graph will be built with the resultant metadata.\n- Objectives:\n-Review state of the art on relation extraction using Transformer-based models (such as Bert, T5 or Pegasus)\n-Identify commonly available relationships in readme files to extract\n-Generate a relation extraction corpus for software documentation\n-Create a robust model for identifying these common relationships\n- Recommended knowledge: Python, Natural Language Processing Frameworks.\n- Funding: Beatriz Galindo (a explorar)\n[ONGOING] Title: Topic modeling for software comparison\n- Description: An increasing number of researchers develop scientific software to carry out their experiments. However, finding and comparing related software is a complex task. Authors rely on existing surveys that rely on significant manual effort, search engines and coworkers to find similar tools. In this project, the student will develop topic models for scientific software, with the purpose of detecting commonalities among different tools based on their documentation\n- Recommended knowledge: Python, unsupervised techniques for topic modeling, knowledge representation\n- Funding: Beatriz Galindo (a explorar)\n[ONGOING] Title: A framework for evaluating Research Object FAIRness (with Esteban)\n- Description: Research Objects define a framework for aggregating the resources associated with a given publication or research hypothesis. While Research Objects help preserve the context of an investigation, it is currently difficult to check whether they comply with the Findable, Accessible, Interoperable and Reusable (FAIR) principles promoted by the scientific community. In this project, the student will analyze what are the common practices for assessing the FAIRness of research artifacts (data, software, ontologies, methods, etc.); and will create a framework to create informative and explainable FAIR metrics for Research Objects.\n- Recommended knowledge: Python/Java, knowledge representation\n- Funding: Reliance?\nTitle: Knowledge extraction for research artifacts (With Esteban)\n- Description: Modern computational research often requires the analysis or integration of multiple data inputs, software components and the postprocessing of their corresponding output. Thanks to the increasing adoption of Open Science policies, authors are depositing some of these research artifacts in public repositories. However,without the author it is still challenging to determine the relationship between all these resources.  In this project, the student will analyze and assess common patterns for finding relationships between research artifacts used within the context of an investigation. In order to do so, the student will explore their metadata and their corresponding papers.\n- Python/Java, knowledge representation\n- Recommended knowledge: Python/Java, knowledge representation\n- Funding: Reliance?\nMariano Rico",
  "speaker": "SYSTEM",
  "uuid": "6f88807a-6930-41bb-a02e-4eb57a30fa3d"
}