{
  "message": "SYSTEM: RQRQR.pdf: Página 6\n3\nImprovements over the REQUIEM query rewriting\nprocess\nThe REQUIEM query rewriting process, described in section 2.2, is pruned at\ntwo speciﬁc points. First, the ontology is pruned for the inference; second, the\ndatalog program generated by the saturation process that continues with this\npruned ontology is pruned again, after its generation, so that it only contains\npredicates that can be obtained from the declared RDB2RDF mappings. The\nresulting queries generated from the datalog program are noticeably reduced\nafter both prunes. Our proposal consists on pruning the information that is\nhandled by the process at two speciﬁc points and according to two diﬀerent\nmethods that will be useful in diﬀerent situations.\nThe ﬁrst of these two points is the pruning process after the clausiﬁcation of\nthe ontology, which can be more restrictive, including only the clauses that are\nrelevant and can provide results according to the declared RDB2RDF mappings.\nThe prune at this stage can be performed according to two methods, depending\non the inference that the RDB2RDF system may perform, if the system is able\nto perform some inference the prune can be more restrictive, otherwise, this part\nof the logical path search will need to be performed by the rewriting algorithm,\nsome clauses will be required for that inference and shall not be pruned. This\nwill be further explained in section 3.1.\nThe second of these two points is immediately after the generation of the\ndatalog program. The generation of the datalog program may require the use of\nsome clauses for the inference, however, since the datalog program may serve as\nan input for other processes and algorithms, it is pruned for a better eﬃciency,\nthe prune removes the clauses that contain predicates that are not included in\nthe declared RDB2RDF mappings without losing relevant answers to the query.\nThis process is explained in more detail in section 3.2.\n3.1\nPruning the ontology\nThe parsing and clausiﬁcation processes, which deﬁne the ontology expressive-\nness that can be handled, have been reused from REQUIEM [10]. This means\nthe axioms in the KB that fall in the expressiveness of ELHIO¬ will be clausi-\nﬁed and the remainder will be discarded, which may lead to the loss of some\nanswers for the axioms that cannot be clausiﬁed.\nWe start from the assumption that our global schema will be described in\nthe ELHIO¬ DL [10]. In the usual case that our schema is described in OWL,\nwe will consider only the axioms that fall under the ELHIO¬ DL, as it is done\nin other works (e.g, [10]). It is important to note that we are aware of the fact\nthat this axiom exclusion may have some relevant implications in the results\nobtained from the query rewriting process, and this as a part of our future work\nwe will aim at providing user support tools to inform about those consequences.\nThis ELHIO¬ projection of the original ontology is clausiﬁed as described in\n[10]. Once the ontology has been clausiﬁed, ﬁnding the rewritings is analogous to\n",
  "speaker": "SYSTEM",
  "uuid": "6f976edf-7c6a-45d0-8f1c-8930dda73b5d"
}