{
  "message": "SYSTEM: QRVocabulary.pdf: Página 4\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n86 / 103 \nA.3.3 Derivative \nThe derivative indicates the current value of the first derivative of a quantity, and \nindicates whether the magnitude is increasing, decreasing or stable. \n \nExample: \n• The derivative of the temperature of the water is steady. \nA.3.4 Quantity Spaces  \nA quantity space specifies a range of qualitative values a quantity magnitude or \nderivative can have. The qualitative values in a quantity space form a total order. Each \nqualitative value is either a point or an interval, and within the quantity spaces these two \ntypes consecutively alternate. \n \nExamples: \n• The quantity space for the height of contained liquid is {zero, positive, full}. \n• The quantity space for the temperature of a material could be: {absolute zero, \nsolid phase, freezing point, liquid phase, boiling point, gas phase}. \n• The quantity space for the size of a population could be: {zero, positive} if there is \nno maximum size for a population. Otherwise, {zero, positive, maximum} could \nbe used.  \nA.3.5 Qualitative Value \nA qualitative value is either a point or interval that can become the current magnitude or \ncurrent derivative of a quantity. Qualitative values are contained by quantity spaces. \n \nExamples: \n• Zero, minimum, negative, positive, high, full, maximum, medium. \n \nRemarks:  \nQualitative values having the same name do not necessarily represent the same value. \nFor example, two contained liquids with their height quantities equal to the value \npositive do not necessarily have the same height, as one could be smaller than the \nother. The one exception is the value zero, which specifies the turning point between \npositive and negative. Zero is universally equal among quantity spaces. \nA.3.6 Current Value and Quantity Value \nThe current value refers to either the value of the magnitude or the value of the \nderivative of a quantity in a specific situation. The quantity value is the combination of \nthe current value of the magnitude and the current value of the derivative of a quantity. \nQuantity values are often written down as: <magnitude, derivative>.  \n \nExamples: \n• <full, decreasing> \n• <zero, stable> \n• <positive, increasing> \n \nRemarks: \nThe changes in quantity values are visualised in the value history. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "7037da4e-4208-485b-a409-e7aab1c10d16"
}