{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 164\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n170\n221.- ISOC- Biblioteconomía y documentación. Consejo Superior de\nInvestigaciones Científicas (CSIC)\nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do;jsessionid=\nFC72D40D9F4484F57C4446AB7B9E9E5A?tabla=docu&bd=\nBIBYDOC&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Base de datos especializada en Biblioteconomía y\nDocumentación. Fuentes: 42 títulos de revistas españolas (25 vigentes y 17 cerradas), actas\nde Congresos y otra literatura gris. Temática: Literatura científica española en el Área de\nDocumentación científica. Crecimiento: 650 referencias/año. Periodo de cobertura: desde\n1975. Volumen: 11.117 registros. \n222.- ISOC. Base de datos bibliográfica de Humanidades y Ciencias Sociales.\nConsejo Superior de Investigaciones Científicas (CSIC)\nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do;jsessionid=\nF11FD73735507452B61C895915E2658D?tabla=docu&bd=ISOC&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple y avanzada\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Base de datos referencial y bibliográfica que fundamental-\nmente recoge referencias de artículos publicados en revistas españolas del ámbito de las\nciencias sociales y humanas. Cobertura temática: Antropología, Arqueología, Bellas Artes,\nBiblioteconomía y Documentación, CC. Políticas, Derecho, Economía, Educación,\nFilosofía, Geografía, Historia, Lingüística, Literatura, Psicología, Sociología, Urbanismo\ny América Latina. Fuentes: 2.077 publicaciones periódicas editadas en España especiali-\nzadas en estas áreas, fundamentalmente revistas, además de monografías, actas de congre-\nsos, informes y tesinas. Crecimiento anual: 23.000 referencias. Aunque en alguna materia\nrecoge información desde 1960, esta base cubre desde 1975 hasta la actualidad, con una\nactualización diaria. Volumen: 497.854 registros. En algunos registros se incorpora la posi-\nbilidad de obtener el texto completo del artículo. \nBASES DE DATOS  1/1/04  03:39  Página 170\n",
  "speaker": "SYSTEM",
  "uuid": "71d686dd-bfeb-4d0d-a22e-26895dd5f2b8"
}