{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/R2O_y_ODEMapster \n\nTo be completed by Boris\nContents\n[\nhide\n]\n1\nPossible Use\n2\nTODO List\n3\nEvaluation (Geographic testbed)\n4\nEvaluation (PSSA queries)\n5\nEvaluation (FAO fishery testbed)\n6\nODEMapster 2\n7\nRelated topics\n8\nSuggestions/Improvements for ODEMapster Plugin\nPossible Use\n\nDesktop application using Neon Toolkit (current approach)\nWeb service\nweb interface with result in dropbox (dropbox public link or shared folder)\nweb interface with result in web server folder.\nFTP folder where people can upload mapping/query file and we have something like cron job that monitors that folder periodically and process the (unprocessed) mapping files.\nthe approach taken by D2R server is also nice\nTODO List\n\nMore options for instance URIs generation in the interface. Status: In Progress\nSupport for table alias in language & processor. Status: Pending\nEvaluation (Geographic testbed)\n\nAfter couple of geographic queries (mostly IGN and nomgeo), we found that ODEMapster plug-in interface was not capable to process big database. Thus, a \"paging\" feature should be a nice-to-have to be included there since users do not need to see the complete result at the same time. So far, I don't know which RDB2RDF tools that have this feature.\nODEMapster processor works like the following:\n1) generates URI with one dedicated query (evaluating query with one column result).\n2) generates data properties values in another dedicated query.\n3) generates object properties values in another query.\nThe approach used in Triplify, using the first column as URI value, \"standard\" column as data properties, and addition of special characters \"->\" for object properties works better, especially when dealing with big database.\nThere are some non-standard database columns type used in IGN, such as geometry. Current ODEMapster doesn't handle these types.\nEvaluation (PSSA queries)\n\nEvaluators: Freddy, Jean-Paul, Boris.\nArithmetic operators\n- There are some defined but not supported operators (hieq-than, loeq-than, etc)\n- No inequality operator. Can't use the combination of lo-than and hi-than to simulate this because we don't have union capability\n- Wrong translation of operators (\"<\" is translated as hi-than while \">\" is translated as lo-than)\nJoin\n- Need support for self join. This implies support for alias of table. The alias can be defined in mapping file\n- Need better support for join tables. Joins of tables requires explicit mapping element. For example, to join table Continent and Country, we need to explicitly map and query the element hasCountry of Country concept\nImplementation issues\n- Multiple conditions can't be used for the same attribute. In order to have X < 5 and X > -5,  we need to create two mappings X1 and X2 map to the same element. I guess this is related to the data structure of the mapster. In many cases, it uses Map and that doesnt allow duplicate keys. One solution is to have map of maps. Another solution is to rename the key value before put to the map.\nUnion Expressivity\n- Need support for Union of Conjuctive Queries. This is mandatory for \"OR\" operator in WHERE clauses\nComplex mapping\n- For complex expression (involving more than two elements), we need to create dummy attributes in mapping because the query language expressivity is too low.\nEvaluation (FAO fishery testbed)\n\nRegex support\nODEMapster 2\n\nInformation regarding ODEMapster 2 can be found here :\nhttp://dl.dropbox.com/u/531378/odemapster/odemapster2-report.pdf\nHow to run the example in the report\nDownload a folder containing lib and example files here :\nhttp://dl.dropbox.com/u/531378/odemapster2.zip\nExtract the file\nModify properties file. Open the file r2o.properties and modify the information there (database, r2o file, result file)\nImport the example database. The dataset of office database can be found on ddl/office.sql.\nModify mapping file. The R2O mapping is contained in file office.r2o.xml. Modify this file if you want to execute different mappings than the ones specified on the report file.\nExecute the file run.bat\nContact Freddy if you find any errors.\nRelated topics\n\nUS Patents about direct RDF triple store development with relational databases:\nhttp://www.faqs.org/patents/app/20090138498\n,\nhttp://www.faqs.org/patents/app/20090138437\nAsio Development Kit (BBN technologies):\nhttp://bbn.com/technology/knowledge/asio_sbrd\nSuggestions/Improvements for ODEMapster Plugin\n\nTBD by Sole",
  "speaker": "SYSTEM",
  "uuid": "7218e18d-f19e-4825-8884-283bbfd7275a"
}