{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nContents\n[\nhide\n]\n1\nCourse 24/25\n1.1\nMariano Rico\n2\nCourse 23/24\n2.1\nMariano Rico\n3\nCourse 22/23\n3.1\nAhmad Alobaid\n3.2\nMariano Rico\n4\nCourse 21/22\n4.1\nCarlos Badenes\n4.2\nOscar Corcho\n4.3\nDaniel Garijo\n4.4\nMariano Rico\n4.5\nMaria Poveda\n4.6\nMaria S. Perez\n4.7\nAna Iglesias\n4.8\nJulián Arenas-Guerrero\n4.9\nPablo Calleja\n5\nCourse 20/21\n5.1\nOscar Corcho\n5.2\nMariano Rico\n5.3\nMaría Poveda - Pablo Calleja\n5.4\nVíctor Rodríguez Doncel\n5.4.1\nMaría Poveda - Serge Chávez\n5.5\nCarlos Badenes-Olmedo\n6\nCourse 19/20\n6.1\nMariano Rico\n6.2\nEsteban González\n6.3\nMaría Poveda-Villalón\n6.3.1\nMaría Poveda - Pablo Calleja\n6.4\nCarlos Badenes-Olmedo\n6.5\nOscar Corcho\n6.6\nDavid Chaves\n6.7\nAhmad Alobaid\n6.8\nPablo Calleja - Patricia Martín\nCourse 24/25\n\nMariano Rico\n\nTitle: Smart Domain-oriented crawling: AI for corpora creation -\n- Description: Traditional crawlers are having serious problems retrieving web pages, among them: dynamic generation of contents, cookies dialogs, just to name a few. Additionally, we need domain-oriented crawlers because downloading without a specific criteria is nonsense in a constantly growing Web. Therefore, this proposal is focused on: (1) analyzing the state-of-the-art, (2) providing an initial prototype using head-less crawlers like Selenium with a (3) binary document classifier trained on a set of documents describing the domain.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: Text2RDF:Language generation to generate RDF from DBpedia abstracts -\n- Description: Generating triples from natural language text has recently gained momentum due to the rise of relation extraction by using generative language models (like BART or T5). The objective of this work is to use these advances to create a system that can generate DBpedia triples from a Wikipedia abstract (or even the complete page). The idea is to extend the work done in\nthis\n2022 TFM (extension of a 2021 GSOC project).\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nCourse 23/24\n\nMariano Rico\n\nTitle: \"Herramienta interactiva para consensuar expertos en terminologías\"\n- Description: En el contexto del proyecto TERESIA, centrado en la gestión y enlazado de terminologías, es necesaria una aplicación web que permita una colaboración eficiente entre los terminólogos. La aplicación aplicará métricas de consenso, así como métricas para la clasificación y ordenación de términos.\n- Funding schema: Si hay buenos resultados en los 3 primeros meses, hay posibilidad de beca por proyecto. Una buena ocasión para trabajar en un grupo de investigación (OEG) aunando ciencia y tecnología.\nTitle: \"Sistema de alerta temprana para la detección de neologismos en DBpedia del español\"\n- Description: En el contexto del proyecto TERESIA, centrado en la gestión y enlazado de terminologías, y aprovechando que la DBpedia del español se actualiza semanalmente, se propone la creación de un sistema que detecte la aparición de neologismos (potenciales elementos de una terminología) en Wikipedia, mediante un análisis inteligente de los textos y un eficiente uso de la información. Una ocasión única para conocer en detalle el funcionamiento de DBpedia.\n- Funding schema: perhaps GSoC (Google Summer of Code) proposal.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: Smart Domain-oriented crawling: AI for corpora creation -\n- Description: Traditional crawlers are having serious problems to retrieve web pages, among them: dynamic generation of contents, cookies dialogs, just to name a few. Additionally, we need domain-oriented crawlers because downloading without a specific criteria is a nonsense in a constant growing Web. Therefore, this proposal is focused on: (1) analyzing the state-of-the-art, (2) providing an initial prototype using head-less crawlers like Selenium with a (3) binary document classifier trained on a set of documents describing the domain.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: A multi-domain multi-lingual neural classifier for effective crawling -\n- Description: In the context of parallel corpora crawling, we have developed domain-oriented and domain-oriented crawlers. However, we have to use classifying models per language pairs (e.g. \"Spanish and English\") and domain (e.g. \"public administration\"). This results in a long number of classifiers. Our research hypothesis is that we can create a unique multi-domain multi-lingual classifier without sacrificing performance.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nCourse 22/23\n\nAhmad Alobaid\n\nTitle: Torrent Federated query with HDT\n- Description: The Torrent protocol allows downloading and uploading data between clients. HDT is a binary format used to compress knowledge graphs. If multiple clients want to use HDT locally, they need to download the whole HDT.  Even though it is compressed and much smaller than the typical formats (e.g., turtle), it is still large (+100GB for wikidata for example). So instead of downloading the whole HDT on the client’s machine, multiple clients can share the HDT. For example, each client can have a portion of that HDT. Also redundancy should be taken into account. Query federation can be applied utilising the torrent protocol.\nMariano Rico",
  "speaker": "SYSTEM",
  "uuid": "72426d9a-6d82-4e27-b750-d702774ec1a5"
}