{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 19\nParticipación en comités y representaciones internacionales \n \nTítulo del Comité: 1st European Semantic Web Conference (ESWC) \n \nEntidad de la que depende: Organizado por UPM, Universidad de Karlsruhe, Universidad de Saarbrücken, Universidad de \nManchester, Universidad de Liverpool, etc. \nTema: Web semántica \n \nFecha: mayo-junio 2005 \n \n \n \nTítulo del Comité: 14th International Conference on Knowledge Engineering and Knowledge Management EKAW04 in \ncooperation with the American Association for Artificial Intelligence (AAAI) \n \nEntidad de la que depende:       \nTema: Ontologías, gestión de conocimientos y adquisición de conocimientos. \n \nFecha: Septiembre 2004 \n \n \nTítulo del Comité: 13th International Conference on Knowledge Engineering and Knowledge Management EKAW02 in \ncooperation with the American Association for Artificial Intelligence (AAAI) \n \nEntidad de la que depende:       \nTema: Ontologías, gestión de conocimientos y adquisición de conocimientos. \n \nFecha: Octubre 2002 \n \n \nTítulo del Comité: \"Ontologies and modeling of complaint regulations\" \n \nEntidad de la que depende: On The Move Federated Conferences \n \nFecha: 11/2003 \n \n \nTítulo del Comité: Cuartas Jornadas Iberoamericanas de Ingeniería del Software e Ingeniería del Conocimiento \n \nEntidad de la que depende: Financiado por el Knowledge Systems Institute de Illinois, la Universidad Nacional de Santiago \ndel Estero de Argentina, Agencia Nacional de Promoción Científica y Tecnológica de Argentina. En colaboración con ACM. \nTema: Relaciones e interacciones entre ingeniería del software e ingeniería del conocimiento \n \nFecha: desde el 2001 hasta la actualidad \n \n \n \nTítulo del Comité: The second international Workshop on Regulatory Ontologies \n \nEntidad de la que depende: Organizado por diferentes centros de investigación europeos, por ejemplo, la Universidad \nAbierta de Bruselas, o la Universidad de Bolzano \n \nFecha: 10/2004 \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "731b5f99-b86a-4f6b-97d8-e260f2d207cd"
}