{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Astonnov2010 \n\nFull-time PhD studentship in Semantic Web and Linked Data Aston Business School, Aston University, Birmingham, in collaboration with Talis, UK\nThree-year CASE award PhD Studentship.\nThe PhD studentship will provide a tax-free stipend of £17,290 per annum and covers all fees. It is available to suitably qualified UK residents (minimum 3 years non-education related). Start Date: January 2011 (or by agreement).\nThe immense growth of publicly available data and the growing availability of this in semantically enriched formats has provided an unexpected opportunity to model the environmental impact of public and private actions with substantial implications for business, society, science and politics.\nFrom a technical perspective the challenge is how to combine, integrate and make sense of vast quantities of data so as to provide usable tools for end users, tools which can enable intelligent decisions to be made.\nThe particular use case we will focus on in this project is energy usage and environmental impact of the food supply chain. The PhD project will focus on novel methods of data capture, analysis and mining, or visualisation, or combinations of the above. Semantic technologies will be used throughout to model and integrate the data with the expectation that the project will produce usable decision support tools. The agriculture and food domain is very data rich, and this is growing substantially due to novel sources of data such as satellite imagery, ground sensors and the increasing use of RFID. However, data integration and inter-operability is very poor due to multiple actors along the chain, and lack of standards. This project will focus on the role that semantic technologies and linked data can play is increasing the flow of knowledge from producer to end consumer, with a particular focus on energy usage and carbon footprint.\nThe student will be supervised by Dr. Christopher Brewster at Aston University, in close collaboration with Dr. Tom Heath at Talis Systems. The student will join the Operations and Information Management Group in Aston Business School which is one of Europe's leading Business Schools, with the majority of its research rated world-class or internationally excellent in the RAE2008 and accredited by AASCB, AMBA and EQUIS.\nThe PhD student will also spend extended periods of time working closely with Talis Systems, working on site and collaborating particularly with their research team. Talis is a well established and innovative software company headquartered in Solihull, near Birmingham, UK, and recognised as world leaders in the research, development and commercial exploitation of Linked Data and Semantic Web technologies. Expanding on its position as UK market leader in provision of academic and public library solutions, Talis has developed new businesses based around the Talis Platform, an open technology platform providing robust, foundational infrastructure for rapid development of a new generation of semantically rich applications and services.\nCandidates should have a minimum 2.1 class undergraduate degree and a relevant Masters degree or equivalent experience. This may be in computer science, relevant engineering or business degrees. This is an interdisciplinary research topic but students should have strong computer programming skills (preferably in PHP, Python or Java) and a good knowledge of web technologies. Knowledge or experience of supply chains, life cycle analysis, environmental impact, or agricultural production methods are all a plus.\nPlease note that excellent programming skills are an absolute requirement for this position. Candidates will be tested on their programming skills.\nThis is an ESRC +3 CASE Award and there are academic and UK residential status eligibility criteria. (see www.esrc.ac.uk or contact us for clarification if necessary) The student will receive tuition fees and a stipend of £17,290 per annum (tax free) for the 3-year duration of the project. In addition, there will be an allowance to support research studies covering, for example, travel and subsistence for meetings and conference attendance, books and computing facilities. The funds are made available via the Erebus Project (\nhttp://Erebus-cbc.com\n). EREBUS is a West Midland-based initiative which was developed to create an enhanced capacity for undertaking business research. In an era of increasing competition, firms - and especially SMEs with limited market power and resources - need to continually transform their products, processes and ways of doing business.\nRigorous and relevant business research and effective knowledge transfer can shape and enable such transformation leading to increased employment, productivity and profitability. As a partnership between Aston, Warwick and Birmingham Universities, EREBUS will create a new group of world-class social science researchers engaged in transformative research\nInformal enquiries may be address to Dr. Christopher Brewster (C.A.Brewster@aston.ac.uk).\nFurther information on the application procedure, application forms, and programme structure are available at\nhttp://www1.aston.ac.uk/aston-business-school/programmes/research/phd-mphil-\nin-management/. Please send the completed application form to Dr Christopher Brewster (C.A.Brewster@aston.ac.uk) quoting ref no: R100275. The closing date for receipt of completed application forms is 30 November. Shortlisted candidates will be interviewed in early December 2010.",
  "speaker": "SYSTEM",
  "uuid": "7327431e-aa3a-4e13-a251-f51b22eb3f7a"
}