{
  "message": "SYSTEM: Wiki: Esta página describe el calendario de charlas de miembros del grupo. En ellas los miembros del grupo de investigación darán una charla sobre alguna parte del trabajo que estén realizando.\nLas charlas, salvo notificación contraria, se realizarán todos los\njueves de 10:00 a 11:00\n(a partir del 25 de noviembre).\nDeberán asistir\nobligatoriamente\ntodos los doctorandos y las personas implicadas con dicha charla. La asistencia es voluntaria para el resto de miembros aunque recomendable, ya que saldrán de ellas habiendo adquirido nuevos conocimientos.\nEl objetivo es conocer el trabajo de todos los miembros del grupo. Si alguien desea dar una charla, sólo tiene que escribir su nombre y el tópico de la charla en una fecha libre. En caso de no haber voluntarios para una fecha en concreto, se realizará una asignación no-voluntaria.\nUnas pequeñas reglas a tener en cuenta:\nEl ponente se encargará de enviar el lunes un correo a Ana para recordarla que tiene que reservar una sala para la reunión. Finalmente, en caso de que Ana no pueda reservar la sala a tiempo, la persona con quien hay que contactar es Mara (mara@fi.upm.es o extensión 7403) (Para este caso, es mejor también recurrir a un docente del Grupo, que ya sabemos cómo va al administración en la FI).\nEl ponente ha de estar unos minutos antes en la sala para ir abriéndola, preparando el ordenador, etc. Deberá ir con alguien al que le abran la sala, claro (cualquier docente o JARG valen).\nLas presentaciones se dividen en 30 minutos de presentación y 30 minutos de discusión. Una presentación no debería contener más de unas 30 transparencias.\nLas transparencias han de estar escritas en inglés y siguiendo el patrón del grupo. La charla se impartirá en inglés salvo causas de fuerza mayor.\nCharlas 2007\nCharlas 2008\nCharlas 2009\nCharlas 2010\nCharlas 2011\nCharlas 2012\nCalendar 2011\n\nDate\nPlace\nSpeaker\nTopic\nJanuary 20\nlaboratorio de idiomas\nAndrés\nVisit to the Web-based Systems Group\nJanuary 27\nH-1005\nRafita\nBackground\nFebruary 3\nH1005\nSabino (15 minutos) y Nimrod (15 minutos)\nPresentaciones de los objetivos de sus estancias\nFebruary 10\nFebruary 17\nSala de grados\nMikel Egaña Aranguren\nTrayectoria anterior y objetivos preliminares para post-doc Marie Curie\nFebruary 24\nÓscar Corcho\n¿Cómo obtener indicadores de calidad de artículos y conferencias?\nMarch 3\nMarch 10\nH-1005\nBoris\n1. sitemap4rdf\nFile:Sitemap4rdf(v2-boris).pdf\n2. Dataset Dynamics Compendium: A Comparative Study\nMarch 17\nAndrés (45 min);  y Asun y Esther Núñez Vidal(15 min)\nMultipedia: Enriching DBpedia with multimedia information; y Licencias y Registros.\nslides_lic_reg\nMarch 21-25\n6206\nBernardo Cuenca de la Universidad de Oxford\nOntology BAsed reasoning. Semana del 21 al 25 de 17:30 a 19:30.\nslides\nMarch 24\nH-1005\nAngel López\n¿Cómo usar Maven?\nslides\nMarch 31\nApril 7\nH-1002\nGeoLinkedData Team /\nEsther Núñez Vidal\n1. geometry2rdf 2. map4rdf 3. geometry model\nslides\n/\nMejoras de Web of Knowledge 5.2 (10 min)\nApril 14\nBoris\nDefensa de la TEsis doctoral a las 12 en la sala de grados\nApril 21\n------\nJueves Santo\nApril 28\nCarlos Buil / Esther Núñez Vidal\nHow to create OGSA-DAI resources, activities and some from DISPEL / Mejoras de Web of Knowledge 5.2 (10 min)\nJune 9\nFilip\nQuality Models for Semantic Technologies\nJuly 7\nLaboratorio de Idiomas\nJean-Paul\nSensors, mappings and query translation\nJuly 14\nJuly 21\nJuly 28\nAugust 4\nAugust 11\nAugust 18\nAugust 25\nSeptember 1\nH-1002\nMichel Dumontier\nThe Trouble with Tribbles\nSeptember 8\nSeptember 15\nJorge Gracia, Elena Montiel\nRepresentation of translations on the Semantic Web\nSeptember 22\nH-1002\nMaría Poveda\nThesis proposal and short term working plan\nSeptember 29\nIrlán Grangel\nConformance Test Data Generation using Ontology Design Patterns\nOctober 6\nOctober 13\nH-1002\nDaniel Garijo: Work done on ISI, relation with wf4Ever and next working steps.\nOctober 20\nH-1002\nAsun\nBrainstorming sobre propuestas en la temática \"From data to Knowledge\". (Solo para profesores, doctores, Fran, Rafa,  Esther Lozano y Garijo\nOctober 27\nH-1005\nMariano Rico\nMapeos para la versión en español de DBpedia\nNovember 3\nNovember 10\nNovember 17\nH-1005\nMikel Egaña Aranguren\nOPPL-Galaxy: Enhancing ontology exploitation in Galaxy with OPPL. Talk to be given at SWAT4LS, London, dec 7-8\nNovember 24\nDecember 1\nFran y Raul G.\nSEALS Overview and Design of Evaluations\nDecember 8\nDecember 15\nBoris\n1. Dataset Dynamics Compendium: A Comparative Study 2. Data Shapes: On How to Arrange and Transform Data 3. county-rank.data-gov.ie\nDecember 22\n3203\nLucia Morais\nInnovation and knowledge management\nDecember 29",
  "speaker": "SYSTEM",
  "uuid": "73586f05-d07b-42cd-a104-760f73b4a0e8"
}