{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 11\n4 Experimental results \nIn order to make an evaluation of our approach in the geospatial domain we have used \n45 different RESTful services found in http://www.programmableweb.com/, which \nwe have selected randomly from those that were available and could be characterized \nto contain geospatial information by a manual lookup. The list of these services can \nbe found in our experiment website7. The syntactic registration of all these services in \nthe system, by means of introducing the list of their URLs, has produced a complete \nlist of 226 different parameters (considering both inputs and outputs), without \nduplications. \nThis analysis follows the three steps described in our semantic annotation process. \nFirst, our system identifies correctly 54 of 226 parameters by calling directly the \nDBpedia and GeoNames ontologies. Second, the system uses initial parameters plus \nthe suggestion service and calls the DBpedia and GeoNames ontologies. In this case, \nit identifies 75 correspondences and adds 76 parameters to the initial ones. Third, the \nsystem uses the initial parameters plus the synonyms service, and calls the DBpedia \nand GeoNames ontologies. It identifies 161 correspondences and incorporates 848 \nadditional parameters into the system. Finally, the system combines all the resources \nthat result of the enrichment process and calls again the DBpedia and GeoNames \nontologies. Here it identifies 193 correspondences and adds 886 more parameters. A \ndetailed view of these results is shown in Table 4.  \n \nAttributes \nTotal \nAdditional \nparameters \nMatches \n(DBpedia \nand \nGeoNames \nontologies) \nInitial parameters \n226 \n- \n54 \nParameters + Suggestions \n302 \n76 \n75 \nParameters + Synonyms \n1074 \n848 \n161 \nParameters + Suggestions + Synonyms \n1112 \n886 \n193 \nTable 4. Enriching initial parameters with external resources \n \nWith respect to the validation of input parameters (see Table 5), our system \nrecognizes 120 inputs of the initial list, of which 80 parameters can be annotated \nautomatically.  Some of the parameters are not considered for this validation, \nconcretely 28 parameters, since they are related to service identifiers (for instance, \nuserID, api_key, etc.) and our system takes them out automatically from the \nservice registration process8. \nOne aspect of our system is that we cannot always guarantee the success of the \nsystem, because in some cases the system cannot find any correspondence between \nthe service parameters and the concepts or properties of the DBpedia or GeoNames \nontologies. This is common, for instance, when parameter names are described by \n                                                           \n7 http://castor.dia.fi.upm.es/ev/RESTfulservice.html \n8 This was not described in the process described in section 3 since we did not consider it \nrelevant for the description of the whole process. \n",
  "speaker": "SYSTEM",
  "uuid": "73b2ffbe-a777-4cc9-9ccd-d5bb11107818"
}