{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 228\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n234\n347.- Revisión Jurisdiccional de las Resoluciones de la Comisión Nacional\nde la Competencia (CNC)\nDirección Web: http://www.cncompetencia.es/revision.asp?m=16&p=\nWeb adicional: http://www.cncompetencia.es/\nOrganismo editor: Comisión Nacional de la Competencia.\nClase de información:\nFormato de presentación:\nNormas y jurisprudencia\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Defensa de la competencia.\nDescripción y comentarios: La Comisión Nacional de la Competencia revisa en vía\nadministrativa las resoluciones dictadas en materia de defensa de la competencia. Sus\nresoluciones pueden ser recurridas y acudir a la vía contenciosa. En esta base de datos se\nobtiene información completa de las revisiones judiciales. La consulta puede realizarse por\nnúmero de expediente y tipo de expediente.\n348.- Búsqueda y comparación de fondos de inversión\nDirección Web: http://www.cnmv.es/buscadordefondos/bf_busqueda.aspx\nOrganismo editor: Comisión Nacional del Mercado de Valores (CNMV).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Fondos de inversión.\nDescripción y comentarios: Facilita la consulta y comparación de fondos de inversión. Con\nel buscador / comparador de fondos de inversión, la CNMV pone a disposición del público\nun acceso sencillo a la información pública relevante para los inversores. Esta iniciativa\nconstituye la primera plasmación práctica del plan para la mejora de la protección y forma-\nción del inversor que busca una mayor interactividad entre los ciudadanos y el organismo\nsupervisor. Si bien esta herramienta ofrece información de interés general, el diseño ha evo-\nlucionado (desde una primera versión lanzada en 2005 en formato Excel), para facilitar su\nuso por parte de los inversores no profesionales. La herramienta permite la búsqueda alfabé-\ntica de un fondo concreto y además hace posible la identificación de aquellos fondos que,\nentre toda la gama de fondos españoles disponibles, se ajustan mejor a las necesidades y pre-\nferencias de cada usuario. Por otra parte, la denominación de cada fondo sirve como enlace\na la información oficial disponible en los registros de la CNMV. Se incluye además un for-\nmulario de opinión, con el fin de facilitar a los usuarios el envío de comentarios y sugeren-\ncias que permitan continuar mejorando la herramienta en el futuro. El buscador / compara-\ndor de fondos es accesible desde la página de inicio de la CNMV (Rincón del Inversor). \nBASES DE DATOS  1/1/04  03:39  Página 234\n",
  "speaker": "SYSTEM",
  "uuid": "74dd64a6-fc6d-44f6-b641-46f35f65db71"
}