{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 28\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11177\nb)  Comunicar al órgano instructor la formalización del contrato en prácticas con el \npersonal investigador en formación, para lo cual se remitirá una copia del mismo a la \nDirección General del INIA en el plazo máximo de 10 días hábiles desde la fecha de su \nfirma. No obstante, mensualmente los centros darán preaviso al órgano instructor de los \ncontratos que han de formalizarse al mes siguiente.\n3.  Durante los dos últimos años de la ayuda, los Centros de I+D tendrán la obligación \nde contratar laboralmente, de acuerdo con la legislación laboral vigente y con la duración, \nretribución y demás requisitos que se indiquen en la Resolución de convocatoria, al \npersonal investigador en formación que tras haber finalizado los dos primeros años de \nbeca haya obtenido el Diploma de Estudios Avanzados o documento equivalente.\nArtículo 57.  Obligaciones del personal investigador en formación.\n1.  El personal investigador en formación deberá incorporarse a su Centro de I+D en \nel primer día hábil de cualquiera de los tres meses siguientes al de la publicación de la \nResolución de concesión de las ayudas de este Subprograma, a la que se refiere el \nartículo  8, debiendo comunicarlo al órgano instructor, y remitir a dicho órgano los \ndocumentos correspondientes a la incorporación, que se encuentran disponibles en la \npágina web del INIA. Esta documentación deberá ser enviada dentro de los diez días \nhábiles siguientes al de la fecha de incorporación. Se entenderá la no incorporación en \neste plazo como renuncia a la ayuda\nLos beneficiarios extranjeros deberán aportar además, una fotocopia del Número de \nIdentidad de Extranjero (NIE).\nEn casos excepcionales y debidamente justificados el órgano concedente, previa \nsolicitud dentro del periodo de incorporación indicado en este apartado, podrá ampliar el \nplazo de incorporación. No obstante lo anterior, la fecha de cumplimiento de los requisitos \nrecogidos en el artículo 17 no podrá ser aplazada y, en caso de aplazamiento de la \nincorporación, se deberá acreditar el cumplimiento de tales requisitos en el último día hábil \nprimeramente establecido para la incorporación según lo indicado en el párrafo primero.\n2.  El personal investigador en formación deberá realizar su labor en el Centro de I+D \nen el que se encuentre incorporado, siendo necesario para cualquier cambio de Centro y \nde tutor, que el Centro de I+D inicialmente receptor obtenga autorización expresa del \nórgano concedente, así como la aceptación del cambio por parte del investigador y, en su \ncaso, del nuevo Centro de I+D receptor. No obstante, el órgano concedente podrá, en \ncasos excepcionales y debidamente justificados, autorizar cambios que no cumplan los \nrequisitos indicados anteriormente.\nArtículo 58.  Características específicas del desarrollo de la ayuda.\n1.  Los beneficiarios de las ayudas podrán realizar «estancias en el extranjero», previa \nautorización del INIA, por un periodo máximo de tres meses anuales, con el fin de ampliar \nconocimientos en técnicas y metodologías de equipos pioneros, porque el desarrollo de la \nbeca así lo aconseje y el informe del tutor sea favorable. Los tutores deberán solicitar \nautorización previa al INIA, con vistas a la planificación económica y administrativa, de \nestas estancias en formación. Estas actividades en el extranjero estarán dotadas con la \ncantidad de 1.500 euros mensuales o 50 euros por día. Esta ayuda podrá ser actualizada \nen cuanto a su duración y dotación económica mediante Resolución de la Dirección \nGeneral del INIA anual de renovación de las ayudas y si la disponibilidad presupuestaria lo \npermite.\n2.  Asimismo, los beneficiarios podrán asistir a congresos y reuniones científicas de \ncorta duración, cursos de perfeccionamiento y realizar estancias no superiores a un mes \nen centros nacionales. El INIA mediante la «Ayuda paralela», colaborará con la cantidad \nmáxima de 1.400 euros por becario y año o la parte proporcional a los meses de duración \nde la beca. Esta ayuda podrá ser actualizada, tanto económicamente como por la \nincorporación de nuevas actividades, mediante la Resolución de la Dirección General del \nINIA anual de renovación de las becas y si la disponibilidad presupuestaria lo permite.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "75255011-2747-4541-ade8-adad31254593"
}