{
  "message": "SYSTEM: Ontoterminology_a_new_paradigm_for_terminology.pdf: Página 2\nKEOD-International Conference on Knowledge Engineering and Ontology Development. Madeira October 5-8 2009 \n \n \n(e.g. conceptual graph) language. These definitions \nare objective since their interpretation is ruled by a \nformal system. \n \nThe main contribution of this article is to claim \nthat in terminology (especially for technical \ndomains), terms i.e. the “verbal definition of a \nconcept” [ISO 1087] need to be separated from \nconcept names since they belong to two different \nsemiotic systems. The first is a linguistic system \nwhile the second is conceptual. Similarly, term \ndefinitions written in natural language need to be \nseparated from concept definitions written in a \nformal language. The former are viewed as linguistic \nexplanations while the latter are considered logical \nspecifications of concept.  The result is a new kind \nof terminology called ontoterminology (since the \nmeaning of terms relies on a formal ontology) which \nbrings these two non-isomorphic systems together \ninto a coherent, global one. \n2 ONTOTERMINOLOGY \nSeparating \nthe \nlinguistic \ndimension \nof \nterminology from its conceptual dimension has led \nus to introducing a new paradigm for terminology \ncalled ontoterminology. This implies that terms \nshould be separated from concepts as well as term \ndefinitions from concept definitions.  \n \nAlthough in the General Theory of Terminology \nthe meaning of a term is a concept, the main goal of \nterminology is not to represent concepts in order to \nmanipulate them (as in artificial intelligence) but to \ndefine a common vocabulary we hope is consensual. \nThe concept in terminology does not exist in itself. It \nexists through the definition of the term written in \nnatural language. \n \nOn the other hand, conceptualisation is the \ncentral issue in specialised domains. It is built \naccording to a given theory using a formal (or semi-\nformal) language following the epistemological \nprinciples of   formal language. This means that \nconceptualisation does not belong to natural \nlanguage. The logical specification of the concept is \nidentified to the concept itself on which experts \nagree and to which they refer when ambiguities \noccur. From this point of view, one could say that \nthe definition of the term paraphrases the formal \ndefinition of the concept denoted by the term. The \ndefinition of the term written in natural language is \nthen a linguistic explanation of the concept which \nalso describes the linguistic usage of the term. \n \nConceptualisation is the concern of knowledge \nengineering. It is for this reason that we claim that \nontology [Staab et al. 2004], [Gomez-Perez et al. \n2004], [Roche 2003] represents one of the most \npromising ways forward for terminology. In point of \nfact, ontology and terminology share the same goal: \n“An [explicit] ontology may take a variety of forms, \nbut necessarily it will include a vocabulary of terms \nand some specification of their meaning (i.e. \ndefinitions)” [Ushold et al. 1996]. Nevertheless, we \nhave to bear in mind that an ontology, defined as a \n“specification of a conceptualisation”, is primarily \n“a description (like a formal specification of a \nprogram) of the concepts and relationships that can \nexist” [Gruber et al. 1993]. Therefore, an ontology is \nnot a terminology. The linguistic dimension of \nterminology, sometimes confused with the LSP \n(language for special purpose) lexicon, has to be \ntaken into account. Terms can not be reduced to \narbitrary words or labels stuck onto concepts. Terms \nof usage, normalised terms, lexical forms (including \nterminological variations and reductions, rhetorical \nfigures like ellipsis, etc.) as well as linguistic \nrelationships are central features in terminology.  \n2.1 \nSaying is not modelling \nTerminology relies on two kinds of related but \nseparate systems. The linguistic system is directly \nlinked to specialised speech and text while the \nconceptual system is the concern of domain \nmodelling. Writing specialised text is different from \nconceptualisation. Even if one can extract some \nuseful information from text [Buitelaar et al. 2005], \n[Daille et al. 2004], saying is not modelling [Roche \n2007]. The lexical structure (the network of terms \nlinked by linguistic relationships such as hyponymy \nor synonymy) is not isomorphic with the conceptual \nstructure (the network of concepts linked by \nconceptual relationships such as ‘a kind of’ or ‘part \nof’) as illustrated by the following simple example \n(figures 1 and 2). \n \n \nFigure 1. The lexical structure of terms \n \n",
  "speaker": "SYSTEM",
  "uuid": "752fea83-58c0-4568-949a-8428327ae849"
}