{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 123\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 123 of 124\n[PEK03]\nA. Popescu, O. Etzioni, and H. Kautz. Towards a theory of natural language interfaces to\ndatabases. In Proceedings of the International Conference on Intelligent User Interfaces\n(IUI’03), 2003.\n[PGD+08]\nV. Presutti, A. Gangemi, S. David, G. Aguado de Cea, M. C. Suárez-Figueroa, E. Montiel-\nPonsoda, and M. Poveda. NeOn Deliverable D2.5.1. A Library of Ontology Design Pat-\nterns: reusable solutions for collaborative design of networked ontologies. In NeOn Project.\nhttp://www.neon-project.org, 2008.\n[PMC+02]\nK. Pastra,\nD. Maynard,\nH. Cunningham,\nO. Hamza,\nand Y. Wilks.\nHow fea-\nsible\nis\nthe\nreuse\nof\ngrammars\nfor\nnamed\nentity\nrecognition?\nIn\nPro-\nceedings\nof\nthe\n3rd\nLanguage\nResources\nand\nEvaluation\nConference,\n2002.\nhttp://gate.ac.uk/sale/lrec2002/reusability.ps.\n[PS98]\nR. Pooley and P. Stevens. Software reengineering patterns. Technical report, 1998.\n[SAd+07]\nM. Sabou, S. Angeletou, M. dAquin, J. Barrasa, K. Dellschaft, A. Gangemi, J. Lehman,\nH. Lewen, D. Maynard, D. Mladenic, M. Nissim, W. Peters, V. Presutti, and B. Villazón.\nSelection and integration of reusable components from formal or informal speciﬁcations.\nTechnical report, NeOn project deliverable D2.2.1, 2007.\n[Sch05]\nKarin Kipper Schuler. VerbNet: A broad-coverage, comprehensive verb lexicon. PhD thesis,\nUniversity of Pennsylvania, 2005.\n[SFBG+07]\nM. C. Suárez-Figueroa, S. Brockmans, A. Gangemi, A. Gómez-Pérez, J. Lehmann,\nH. Lewen, V. Presutti, and M. Sabou.\nNeon modelling components.\nTechnical report,\nNeOn project deliverable D5.1.1, 2007.\n[SFdCB+08]\nM.C. Suárez-Figueroa, G. Aguado de Cea, C. Buil, K. Dellschaft, M. Fernández-López,\nA. García-Silva, A. Gómez-Pérez, G. Herrero, E. Montiel-Ponsoda, M. Sabou, B. Villazón-\nTerrazas, and Z. Yufei. NeOn Methodology for Building Contextualized Ontology Networks.\nTechnical report, NeOn project deliverable D5.4.1, 2008.\n[SFGP08]\nM.C. Suárez-Figueroa and A. Gómez-Pérez. Towards a Glossary of Activities in the On-\ntology Engineering Field. In Proceedings of the 6th Language Resources and Evaluation\nConference (LREC 2008), 2008.\n[SLL+04]\nD. Soergel, B. Lauser, A. Liang, F. Fisseha, J. Keizer, and S. Katz. Reengineering thesauri\nfor new applications: The agrovoc example. J. Digit. Inf., 4(4), 2004.\n[SM07]\nL. Specia and E. Motta. Integrating folksonomies with the semantic web. In 4th European\nSemantic Web Conference, pages 624–639, Innsbruck, Austria, 2007.\n[Soe95]\nD. Soergel. Data models for an integrated thesaurus database. Comatibility and Integration\nof Order Systems, 24(3):47–57, 1995.\n[SSV02]\nL. Stojanovic, N. Stojanovic, and R. Volz. A Reverse Engineering Approach for Migrating\nData-intensive Web Sites to the Semantic Web.\nIn Proceedings of the Conference on\nIntelligent Information Processing, 2002.\n[TGEM07]\nR. Trillo, J. Gracia, M. Espinoza, and E. Mena. Discovering the semantics of user keywords.\nJournal of Universal Computer Science, 13(12):1908–1935, 2007.\n[vAGS06]\nM. van Assem, A. Gangemi, and G. Schreiber.\nConversion of WordNet to a standard\nRDF/OWL representation. In Proceedings of the Fifth International Conference on Lan-\nguage Resources and Evaluation (LREC’06), Genoa, Italy, May 2006.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "7575ffa3-81df-4f27-b888-32c912493545"
}