{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master09-10 \n\nEsta página incluye información para alumnos del máster de tecnologías de la información.\nContents\n[\nhide\n]\n1\nObjetivos de la asignatura\n2\nClases de Inteligencia Artificial sobre Representación de Conocimientos\n3\nProgramación docente y materiales\n3.1\nDocumentación de Metodologías\n4\nPrácticas\n4.1\nPráctica 1 (se incluye en la práctica 3)\n4.2\nPráctica 2 (11/11/2009)\n4.3\nPráctica 3. Entrega 1 (Miércoles 25 de Noviembre)\n4.4\nPráctica 3. Entrega 2 (Miércoles 2 de Diciembre)\n4.5\nPráctica 3. Entrega 3 (A determinar la fecha)\n4.6\nPráctica 4 (Miércoles 13/01/2010)\n4.7\nTrabajo Final Recopilatorio (entrega: día del examen)\n5\nOfertas de trabajo relacionadas\nObjetivos de la asignatura\n\n[\nDescripción\n]\nClases de Inteligencia Artificial sobre Representación de Conocimientos\n\nSe recomienda asistir del 5 al 26 de Noviembre a las clases de Inteligencia Artificial en el aula 5102\nHorario de mañana: Miércoles de 9 a 11 y jueves de 12 a 13 horas.\nHorario de tarde: Miércoles de 15 a 17 y jueves de 17 a 18 horas.\nProgramación docente y materiales\n\nEl aula en el que se impartirán las clases es el 6206, y el horario será de 19:15 a 21:00.\n1/10/2009. Normas e Introducción (Asun y Oscar)\n[1]\n8/10/2009. Terminología en lingüística computacional (Lupe)\n[2]\n15/10/2009. Fundamentos sobre ontologías (Asun)\n[3]\n22/10/2009. Lenguajes de Ontologías. RDF(S) (Oscar)\n[4]\nEjemplos RDF(S)\n29/10/2009. Lenguajes de Ontologías. SPARQL (Raúl)\n[5]\nDBPedia SPARQL Endpoint\nSoftware a instalar: Este\nfichero\ncontiene los materiales necesarios para la clase con instrucciones de cómo instalarlos.\n5/11/2009. Metodologías (I): Introducción y especificación (Asun)\n[6]\n12/11/2009. Metodologías (II): Ciclo de Vida y planificación (Asun)\nMetodologías (II)\n.\n19/11/2009. Metodologías (III): Reutilización de recursos ontológicos y no ontológicos (Asun)\n[7]\n( Old ones\n[8]\n[9]\n)\n26/11/2009 y 3/12/2009. Lenguajes de Ontologías: OWL (Oscar)\nOntology languages (OWL)\nEjemplo1\nEjemplo 2\nResolución parcial de clase del ejemplo 2\nEjemplo 3\n10/12/2009. Anotación lingüística y semántica (Andrés y Elena)\n[10]\n17/12/2009. Ejemplo completo de desarrollo de una ontología y dudas sobre la práctica a realizar (Asun)\n[11]\nLa clase comenzará a las 7:45\n14/1/2010.  Anotación de recursos y acceso basado en ontologías a bases de datos de legado (Oscar)\n[12]\n21/1/2010. Aplicaciones de ontologías y Dudas sobre la práctica a realizar (Asun)\n28/1/2010. No hay clase porque es la fiesta de Santo Tomás de Aquino.\n11/2/2010. Examen de la asignatura. Aula 3202. 10:00-11:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\n7/9/2010. Examen de la asignatura. Aula por confirmar. 17:00-20:00. Cada grupo tiene que entregar una memoria completa de la práctica realizada y presentar transparencias sobre el trabajo realizado durante 10 minutos, con 5 minutos adicionales para resolver preguntas realizadas por los profesores de la asignatura. El orden de presentación se realizará por sorteo ese mismo día.\nDocumentación de Metodologías\n\nD5.3.1 NeOn Development Process and Ontology Life Cycle\nNeOn Glossary of Activities\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[13]\nPrácticas\n\nTodas las prácticas se deben entregar por correo electrónico a masterTI09@delicias.dia.fi.upm.es.\nPráctica 1 (se incluye en la práctica 3)\n\nTrabajo de recopilación de fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido.\nPráctica 2 (11/11/2009)\n\nDesarrollo de taxonomías de conceptos y relaciones entre ellos en RDF Schema, con algunos individuos de ejemplo para poder mostrar cómo éstos se representan en RDF. Se puede hacer el desarrollo de manera manual (con un editor de texto, no recomendado) o con herramientas de edición de RDF(S). Asimismo, se deberán escribir 10 consultas en SPARQL teniendo en cuenta las taxonomías y relaciones implementadas, e intentando explotar las posibilidades expresivas de este lenguaje de consultas, junto con un análisis de cómo se abordarían estas consultas en una base de datos relacional.\nSe puede utilizar cualquier herramienta para la generación de RDF(S): editores de textos, herramientas específicas (por ejemplo, Altova SemanticWorks) o APIs de gestión de ontologías (por ejemplo, Jena, Sesame, etc.).\nPráctica 3. Entrega 1 (Miércoles 25 de Noviembre)\n\nEl objeto de esta práctica es realizar la especificación de requisitos de la ontología, la busqueda de recursos (veáse la práctica 1) y la planificación del desarrollo de la ontología.\nGuías Metodológicas:\nEspecificación de Requisitos\n;\nPlanificación (Scheduling)\nCapitulos 3 y 4\nVersión del NeOn Toolkit y plugins asociados:\nDescargar\nNueva versión del NeOn Toolkit y plugins asociados:\nDescargar\nTemplate para escribir el ORSD (documento de especificación de requisitos de la ontología):\nORSD Template\nFreeMind Software\n[14]\nDocumentar en detalle cómo se han realizado la actividad de\nEspecificación de Requisitos\ny elaborar el Documento de Especificación de Requisitos de la Ontología.\nDocumentar en detalle cómo se han realizado la actividad de\nBúsqueda de Recursos\n. Dado que la práctica 1 se ha anulado, en esta entrega se incluirán las fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido. Para la búsqueda de ontologías se utilizará Watson\n[15]\n.\nDocumentar en detalle cómo se han realizado la actividad de\nPlanificación\n. La Planificación del desarrollo de la ontología se debe realizar de las siguientes dos formas:\nPlanificacion\nsin gOntt plug-in\n, usando por ejemplo Excell.\nPlanificacion\ncon gOntt plug-in\n; en este caso se ha de completar la planificación inicial que proporciona gOntt con los procesos y actividades necesarios y no incluidos en dicho plan inicial.\nEn ambos casos y cada uno por separado, se debe indicar en la entrega de la práctica:\nEl conjunto de actividades necesarias para el desarrollo de la ontología.\nEl modelo de ciclo de vida a utilizar para el desarrollo de la ontología y justificar por qué se usa.\nEl conjunto de posibles escenarios en la construcción de la ontología.\nEl ciclo de vida concreto a seguir para desarrollar la ontología --> construir un diagrama Gantt para el desarrollo de la ontología.\nTiempo empleado en cada una de las dos formas; y comentarios relacionados con el uso del gOntt plug-in.\nRellenar el\ncuestionario\nsobre la utilidad y usabilidad de las guías metodológicas para la especificación de requisitos.\nRellenar el\ncuestionario\nsobre el gOntt plug-in.\nPráctica 3. Entrega 2 (Miércoles 2 de Diciembre)",
  "speaker": "SYSTEM",
  "uuid": "758e341c-8ef8-451c-bb37-4d50c9007ae1"
}