{
  "message": "SYSTEM: 2016.04.CV-Victor-CICYT.pdf: Página 10\nContribuciones a Congresos \n \n \nAutores: V. Rodríguez-Doncel, C. Santos, P. Casanovas and A. Gómez-Pérez \nTítulo: A Linked Term Bank of Copyright-Related Terms \nCongreso: 28th Int. Conf. on Legal Knowledge and Information System \nPublicación: Proc. of JURIX, R. Hoekstra (Ed.), ISBN 978-1-61499-467-1, pp.91-100, IOS Press \nLugar celebración: Herstmonceux, UK \nFecha: 2015 \n \n \nAutores: P. Cimiano, J. McCrae, V. Rodriguez-Doncel, T. Gornostay, A. Gomez-Perez and B. Simoneit \nTítulo: Linked Terminology: Applying Linked Data Principles to Terminological Resources \nCongreso: 4th Biennial Conference on Electronic Lexicography \nPublicación: Electronic Lexicography. pp. 504-517. I. Kozem et al. (Eds.). ISBN: 978-961-93594-3-3 \nLugar celebración: Herstmonceux, UK \nFecha: 2015 \n \n \nAutores: V. Rodríguez-Doncel, A. A. Krisnadhi, P. Hitzler, M. Cheatham, N. Karima and R. Amini \nTítulo: Pattern-Based Linked Data Publication: The Linked Chess Dataset Case \nCongreso: 6th Int. W. on Consuming Linked Data \nPublicación: Consuming Linked Data, ISSN: 1613-0073, CEUR Vol. 1426, O. Hartig et al. (Eds.) \nLugar celebración: Betlehem, USA \nFecha: 2015 \n \n \nAutores: A. Krisnadhi, V. Rodríguez Doncel, P. Hitzler, M. Cheatham, N. Karima, R. Amini \nTítulo: An Ontology Design Pattern for Chess Games \nCongreso: 6th Int. W. on Ontology Patterns \nPublicación: Ontology Patterns ISSN 1613-0073, CEUR Vol. 1461, E. Blomqvist et al. (Eds.). \nLugar celebración: Betlehem, USA \nFecha: 2015 \n \n \nAutores: V. Rodriguez-Doncel, P. Labropoulou \nTítulo: Digital Representation of Rights for Language Resources \nCongreso: Workshop on Linked Data in Linguistics \nPublicación: Proc. of the 4th W. on Linked Data in Linguistics: Resources and Applications  \nLugar celebración: Beijing, China \nFecha: 2015 \n \n \nAutores: J. McCrae, P. Cimiano, L. Matteis, R. Navigli, V. Rodriguez-Doncel, D. Vila-Suero, J. Gracia, A. Abele, \nG. Vulcu and P. Buitelaar \nTítulo: Reconciling Heterogeneous Descriptions of Language Resources \nCongreso: Workshop on Linked Data in Linguistics  \nPublicación: Proc. of the 4th W. on Linked Data in Linguistics: Resources and Applications pp. 39-48. \nLugar celebración: Beijing, China \nFecha: 2015 \n \n \nAutores: J. McCrae, P. Labropoulou, J. Gracia, M. Villegas, V. Rodriguez-Doncel and P. Cimiano \nTítulo: One ontology to bind them all: The META-SHARE OWL ontology for the interoperability of linguistic \ndatasets on the Web \nCongreso: ESWC 2015 Satellite Events,  \nPublicación: Gandon, F. et al. (Eds.), ESWC 2015 Satellite Events, LNCS9341, ISBN 978-3-319-25639-9 \nLugar celebración: Portoroz, Eslovenia \nFecha: 2015 \n",
  "speaker": "SYSTEM",
  "uuid": "75da2bee-317e-407f-a24d-b226d3d6a81c"
}