{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 304\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n310\n497.- Sábado: base de datos de CESyA (Centro Español de Subtitulado\ny Audiodescripción) sobre fondos subtitulados y/o audiodescritos\nDirección Web: http://www.cesya.es/es/bd\nOrganismo editor: Centro Español de Subtitulado y Audiodescripción (CESyA).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Cine.\nDescripción y comentarios: Fondos audiovisuales subtitulados y audiodescritos;\nAccesibilidad. Contiene reseñas de las obras audiovisuales subtituladas y audiodescritas,\npermanentemente actualizada y a disposición de los agentes vinculados con el escenario\naudiovisual y la accesibilidad. La última versión de la base de datos presenta las siguien-\ntes novedades: Nuevos fondos subtitulados y audiodescritos procedentes de diversas\nempresas; Persistencia en los datos; Accesibilidad; Mejora de la funcionalidad de las con-\nsultas y actualizaciones; Procedimientos de seguridad. \n498.- Catálogo del Centro Estatal de Autonomía Personal y Ayudas Técnicas\nDirección Web: http://www.catalogo-ceapat.org/\nOrganismo editor: Centro Estatal de Autonomía Personal y Ayudas Técnicas (CEAPAT). \nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nTexto completo\nSimple\nMateria: Discapacidad.\nDescripción y comentarios: El Catálogo de Ayudas Técnicas ha sido elaborado por el CEA-\nPAT a partir de la información sobre ayudas técnicas contenida en su base de datos. Permite\nlocalizar ayudas técnicas por medio de un directorio clasificado funcionalmente según una\nnorma de la Organización Internacional de Estándares, o mediante el glosario de términos.\nLa información incluye características técnicas, fotografías, datos sobre fabricantes, distri-\nbuidores, etc. También incorpora la posibilidad de generar informes sobre una ayuda deter-\nminada y enviarlos por correo electrónico. Los documentos no están accesibles directamen-\nte, sino que hay que solicitar la carga de ventanas sucesivas. La herramienta de búsqueda\nmás destacada de la base de datos es la clasificación de la propia institución que muestra los\ndocumentos pertenecientes a las distintas jerarquías sin utilizar casillas de búsqueda.\nBASES DE DATOS  1/1/04  03:39  Página 310\n",
  "speaker": "SYSTEM",
  "uuid": "75f5d197-f6d3-4930-bb25-4b7f8d223652"
}