{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 70\nPage 70 of 124\nNeOn Integrated Project EU-IST-027595\nTable 4.6: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nﬂattened model(continued)\nSlot\nValue\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a classiﬁcation scheme which follows the ﬂattened model.\nA classiﬁcation scheme is a rooted tree of concepts, in which each concept groups entities\nby some particular degree of similarity. The semantics of the hierarchical relation between\nparents and children concepts may vary depending on the context.\nA ﬂattened data model [MZ06] is a denormalized structure for hierarchy representations. In\nthis case, each hierarchy level is represented on a different column. There are as many\ncolumns as levels the classiﬁcation scheme has.\nExample\nThe ISTAT standard, Codes and names of geographical areas, provinces and regions,\nprovides codes and names of Italian geographical areas, provinces and regions and it\nfollows a ﬂattened data model in a single denormalized table with six attributes (geography\narea, province and region codes and names).\nGraphical Representation\nGeneral\nExample\nOUTPUT: Designed Ontology\nGeneral\nThe generated ontology will be based on the lightweight ontology architectural pattern\n(AP-LW-01)[SFBG+07]. Each ﬂattened model level is mapped to a class. If there is a\nsuperclass related to the new entity classes it has to be created as the root and the\nsubClassOf relation has to be set between the entity classes and the root class. Optionally\nan ad-hoc binary relation is deﬁned between the new classes according to the semantics of\nthe relationship between super-ordinate and subordinate categories. Each data related to a\nclassiﬁcation scheme item level is mapped to an instance of the classiﬁcation scheme item\nlevel class. Because of the denormalized nature of the model, it is necessary to avoid the\ninstance duplicity. The semantics of the relationship between subordinate and\nsuper-ordinate instances is mapped to an ad-hoc binary relation instance.\nGraphical Representation\n(UML) General Solution\nOntology\n",
  "speaker": "SYSTEM",
  "uuid": "7664c6ee-502c-4c24-b7bf-2340fdbf1141"
}