{
  "message": "SYSTEM: Wiki: List of tools:\nhttp://office.microsoft.com/en-us/projectserver/FX100739841033.aspx\nhttp://www.attask.com/\nList of requirements:\nActivity Plan\nTrack activities on the Web and cover the full project life cycle by managing\nwork that follows the completion of a project.\nVisual Reports\nUse Microsoft Office Excel 2007 and Microsoft Office Visio 2007 Professional\nto produce charts, graphs, and diagrams based on Project data. Define custom\nreport templates to share with other Project users. These templates and\nreports can be previewed from a dialog box in Office Project.\nTask status\nDisplay task details and enable comments to be exchanged between a team\nmember and project manager. Supports export to timesheets.\nGantt charts, calendars, and task sheets\nManage and present project information in versatile views that communicate\nplans clearly.\nFlexible tracking methods\nUse the status date to view progress and track actuals by Percent of Work\nComplete, Actual Work Done, and Work Remaining.\nTask linking\nSet up dependencies among tasks so that a change rapidly displays the impact\non the overall project.\nRisks tracking\nAssociate risks with tasks and projects, specify probability and impact,\nassign ownership, and track progress to manage projects more efficiently.\nMicrosoft Office Outlook 2007 integration\nTeam members can display tasks from their Office Outlook 2007 To-Do Bar or\ncalendar, along with project tasks, in one convenient location.\nWeb-based Project portal\nImproved layout helps team members and stakeholders easily navigate through\nthe portal. Group, apply colors to groups, display splits in the Gantt views,\nand employ additional AutoFilters.\nAutomated e-mail notifications\nMake sure project information stays current by using automated e-mail\nnotifications that are triggered by events such as project updates, upcoming\nmilestones, issues, and more.\nTask creation and delegation\nDelegate tasks from leads to team members or peer-to-peer as needed through a\nWeb-based portal. Team members can also create and reject tasks.\nOffice Excel 2007 integration\nEasily import and export Office Excel 2007 data\nIssue tracking\nAssociate issues with tasks or projects, assign ownership, track progress,\nand record resolutions to manage projects more efficiently.\nDeliverables\nAccess to deliverables repository and associate deliverable list with project\ndependencies.\nCVS Integration\nNot in MS Project Server. Associate project dependencies with software\ncomponents.\nTask updates\nUse Web Access to get task-update approvals with preview, (no\nround trip required).\nMultiple managers\nProvide multiple project managers with permissions to track specified tasks\nand resources in a project.\nReschedule uncompleted work\nMaintain constraints when uncompleted work is rescheduled and select any\nreschedule date.\nCheck-in and check-out\nHelp protect the project portfolio by preventing multiple users from\nsimultaneously editing the same enterprise project at the same time.",
  "speaker": "SYSTEM",
  "uuid": "7676eaf8-4acb-41b9-ac51-a512ac898849"
}