{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual03122009 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.4\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción semántica a partir de anotaciones\n.\n1. Obtención de paginas Wikipedia a partir de las páginas de desambiguación para una etiqueta en español.\nProblema 1: La Dbpedia en español no provee tripletas con la información de las páginas de desambiguación. Por tanto ha sido necesario analizar el html de la página de desambiguación wikipedia para extraer los links a las diferentes páginas relacionadas con la etiqueta. Para realizar esto, he tenido que analizar varios\nhtml parsers\nque permitan recuperar la información de la pagina wikipedia como un XML y de ahí extraer los\nlinks\n. Esta actividad está en ejecución.\nProblema 2: Se analizó la posibilidad de consultar la base de datos de wikipedia directamente para evitar procesar las páginas htmls. Sin embargo, estas consultas solo se pueden realizar vía trabajos\nbatchs\ny por tanto no son útiles en nuestra aplicación.\nOtra opción que se tuvo en cuenta fue la instalación local de la wikipedia con el objetivo de disminuir la dependencia de servicios externos. Las páginas wikipedia actualmente ocupan unos 50Gb. Sin embargo, esta idea se desecho debido a que se debería implementar un mecanismo de actualización para mantener al día los datos de la Wikipedia local con respecto a la versión online.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\n- Búsqueda de sistemas NER fundamentalmente en español, por ejemplo NERUA. Realización de comparativa. EL problema principal es la obtención de los programas para ejecutar y probar su comportamiento. Prácticamente todos son \"propietarios\".\n- El equipo en el que trabajo no funciona correctamente. Esto ha influido en la velocidad de trabajo.\nTarea 2.4\n\nInstalación de la plataforma Fura en entornos Windows y Linux. Se ha instalado correctamente el servidor en Windows, tras instalar la versión correcta de la JVM. Queda pendiente instalar el agente y el portal. En Linux no ha sido posible completar el proceso, debido a un error no documentado, relativo a la instalación que lleva a cabo el propio Fura del servidor Tomcat. Queda por tanto pendiente la instalación del servidor, el agente y el portal.\nTarea 1.4\n\n- Ampliación de IGNMapDiscover 1.0: Implementación de IGNMapDiscover 2.0 para ontologías OWL no necesariamente PhenomenOntology. Ejecución de pruebas PhenomenOntology 3.5 y nomenclátores e hydrOntology y nomenclátores.\nTarea 7.1\n\nGeneración de RDF.",
  "speaker": "SYSTEM",
  "uuid": "77c091d1-a00d-4e4d-874a-d681f7ad3a66"
}