{
  "message": "SYSTEM: Ejercicios.pdf: Página 5\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n5 \nEjercicio 2: Vendedores \nSe desea construir un Sistema Basado en Marcos para una empresa dedicada a la \nventa de equipos informáticos. En esta empresa, el sueldo bruto mensual de cada comercial se \ncalcula sumando al sueldo base unos incentivos y, en ningún momento, el sueldo bruto debe \nser inferior al sueldo base. \n \n \nLa empresa, dependiendo de lo introducido que esté cada producto en el mercado, \naplica la siguiente política de incentivos basada en el número de unidades que cada comercial \nha vendido en el último mes. \n \na) Si el producto está en fase de lanzamiento, el comercial recibe incentivos por cada \nunidad vendida. Los incentivos unitarios se calculan multiplicando una cuota de \nlanzamiento por el precio de venta al público del producto. La tabla 1 proporciona las \nCuotas de Lanzamiento (CL) y Precio de Venta al público (PVP) de productos en fase \nde lanzamiento. \n \nPRODUCTO \nCL \nPVP \nModem \n10% \n10.000 pts \nMáq. Unix \n5% \n1.000.000 pts \nTabla 1. Productos en fase de Lanzamiento \n \nb) Si el producto ha superado la fase de lanzamiento, es decir, está ya introducido en el \nmercado, cada comercial recibe incentivos si ha alcanzado un objetivo de ventas. En \neste caso, los incentivos se calculan en función del número de unidades vendidas el \núltimo mes de la etapa de lanzamiento y el número de unidades que se han vendido en \nel último mes. La formula que utiliza esta empresa es la siguiente: \n \nIncentivos = \nCrecimiento * PVP * \n \n \n(Nº._Unidades_Vendidas_mes \n \n \nNo._Unidades_Vendidas_ Etapa_Lanzamiento) \n \n \nLa tabla 2 proporciona el crecimiento y Precio de Venta al público (PVP) de productos \n            en esta fase de permanencia. \n \nPRODUCTO \nCRECIMIENTO \nPVP \nPentium \n20% \n400.000 pts \nMácintosh \n10% \n300.000 pts \nTabla 2. Productos en fase de Permanencia \n \n \nLa empresa posee cuatro comerciales y la siguiente información para comercial: \nCOMERCIAL \nSUELDO \nBASE \nTIPO \nPRODUCTO \nUNIDADES VENDIDAS \nEN ESTE MES \nUNIDADES VENDIDAS \nETAPA LANZAMIENTO \nJuan \n150.000 \nModem \n200 \n---- \nCarlos \n200.000 \nMáq. Uníx \n5 \n---- \nMaría \n200.000 \nPentium \n40 \n35 \nCarmen \n150.000 \nMacintosh \n35 \n40 \n \nNOTA: Esta empresa no tiene previsto ampliar el número de comerciales, ni los productos que \nvende, ni cambiar la asignación de comerciales a productos. \n \n \nSe pide construir un Sistema Basado en Marcos \n \na) Construir la(s) jerarquía(s) de Marcos. \n \nb) Especificar para todos los marcos clase sus facetas. \n \nc) Indique detalladamente que técnicas de inferencia utilizará el sistema para \ncalcular el sueldo bruto de María. \n \nd) Ídem pero para el sueldo bruto de Felipe. \n",
  "speaker": "SYSTEM",
  "uuid": "78050b45-e385-4da0-bc8d-62428fac7102"
}