{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master08-09 \n\nEn el ORSD, se incluyen las CQs para cada caso particular, pero faltaría incluir tambien las posibles respuestas a dichas preguntas de competencia.\nEn el ORSD, habría que revisar si realmente lo que se incluye en el apartado de objetos son objetos extraidos de las CQs y/o sus respuestas o no.\nEn el tema del ciclo de vida, recordad que hay que justificar todas las decisiones tomadas (elección de actividades, de escenarios, etc.).\nEn el tema de la conceptualización, recordad que hay que incluir la piramide de ontologías reutilizadas, asi como el diagrama de alto nivel (que relaciona todas las ontologías en general).\nComentarios particulares\n\nLeandro Fumega y José Edward Ortiz\n.\nEn el ORSD, el nivel de formalidad que se solicita es el de la ontologia como producto (ed. en que lenguaje estara implementada)c.\nEn el ORSD, si la ontologia se centra en las imagenes, ¿no deberiais tener mas CQs relacionadas con ellas?\nEn el ORSD, los objetos deben ser los que nos aparecen en las CQs y en sus respuestas, y no una captura del Protege.\nSebastián Ortega\n.\nEn el ORSD, en la tarea 1 deberia aparecer más claro y más concreto el objetivo de la ontología. Además, deberías pensar la diferencia entre fotos e imagenes. Y en los objetos, comprueba si realmente foto, dibujo, etc. son objetos en tu ontología.\nEn la parte del ciclo de vida, explicas que el escenario no es ninguno de los 8, sino uno especifico que comparte características de varios. Esto es correcto, aunque deberías explicarlo de otro modo puesto que en la teoría de este tema se menciona que el desarrollo de ontologías puede involucrar varios escenarios, y que para cada caso concreto se puede tener una combinación de cualquiera de los escenarios explicados.\nEn la parte de conceptualización, falta la pirámide de ontologías.\nJuan José Pérez y Josué Burgos\n. Revisar los objetos incluidos en el ORSD.\nEn el tema del ciclo de vida, faltan las justificaciones de las decisiones tomadas.\nJuan Ramírez Fernández\n.\nEn el ORSD, si las prácticas debían tratar del hogar digital y de los productos domóticos, la especificación de requisitos que se incluye en el documento no se centra en ello. Ed., faltaría aportar requisitos relativos a los productos domóticos disponibles en la web que se propone.\nAdemás, faltan las respuestas a las CQs.\nEn la parte del ciclo de vida, falta la justificación de las decisiones tomadas sobre actividades opcionales, escenarios a aplicar, y el modelo.\nEn la parte de conceptualización, los diagramas se deben incluir de forma gráfica para que se vea de un solo vistazo como están relacionadas las distintas ontologías entre sí.\nJuan Manuel Garitagoitia y Octavio López\n.\nEn general faltan justificaciones de las decisiones tomadas (actividades elegidas, etc.).\nEl documento incluye partes incompletas y sin justificar de la práctica.\nEn el ORSD, no se deberían incluir capturas de pantalla puesto que cuando se hace la especificación de requisitos no se trabaja todavía con ningún editor.\nClara Izquierdo y Adrián Siles\n. Falta el ORSD.\nEn el tema del ciclo de vida, faltan las justificaciones de las decisiones tomadas (por que esas actividades y no otras, etc.)\nJavier Díaz-Romeral\n.\nEn el ORSD, ¿estas seguro que congreso, etc. son objetos en tu modelo?\nJosé Miguel Alonso\n.\nEn el ORSD, ¿estas seguro que persona, profesor, etc. son objetos en tu modelo?\nEn el tema del ciclo de vida, faltan las justificaciones de por que se han seleccionado esas actividades y no otras.\nEn el tema de la conceptualización, falta la piramide de ontologías.\nMarta Ariza y Gema Romero de Ávila\n. Verificar si el objetivo de vuestra ontologia es incluir conocimiento acerca de las ventajas e inconvenientes del hogar digital. Ed. si se necesita modelar ese conocimiento.\nEn el ORSD, ¿seguro que los objetos son los que habeis puesto?. No se han dado prioridades a las cqs ni a los grupos, justificar si seria necesario o no en vuestro caso.\nEn la parte del ciclo de vida, faltan los escenarios y las justificaciones de los mismos; asi como las justificaciones de todas las decisiones tomadas.\nEn la parte de la conceptulización, debeis revisar el diagrama de alto nivel (segun lo que se vio en clase), e incluir la piramide de ontologias (revisar las transparencias, porque el diagrama que teneis actualmente no es el que se pide).\nComentarios sobre la práctica 4\n\nA continuación se incluyen los comentarios a las prácticas recibidas. En primer lugar se incluyen comentarios generales y más adelante se incluyen comentarios detallados por grupo de prácticas. Hemos preferido hacer estos comentarios públicos pues en el pasado han ayudado a mejorar el trabajo de todos. Si alguien prefiere que los comentarios que se hacen sobre sus prácticas sean privados en el futuro, que nos lo haga saber.\nComentarios generales\n\nComentarios particulares\n\nJuan Ramírez Fernández\n. La ontología está bien trabajada, y se puede ver que has entendido los conceptos principales sobre OWL, así como cómo explotar las posibilidades de realizar razonamiento con este lenguaje.\nClara Izquierdo y Adrián Siles\n. La división en distintas ontologías/módulos del trabajo demuestra claramente cómo se pueden reutilizar ontologías existentes. Sobre el aprovechamiento de las funciones de razonamiento, éste es mínimo y podría ser mejorado.\nMarta Ariza y Gema Romero de Ávila\n. ¿Cuál sería la diferencia entre expresar esta ontología en RDF(S) y OWL? Falta incluir restricciones en las clases relacionadas con objectproperties y datatypeproperties, no se incluyen conceptos definidos, ni individuos.\nComentarios sobre la práctica 5\n\nA continuación se incluyen los comentarios a las prácticas recibidas. En primer lugar se incluyen comentarios generales y más adelante se incluyen comentarios detallados por grupo de prácticas. Hemos preferido hacer estos comentarios públicos pues en el pasado han ayudado a mejorar el trabajo de todos. Si alguien prefiere que los comentarios que se hacen sobre sus prácticas sean privados en el futuro, que nos lo haga saber.\nComentarios generales\n\nEn general la mayoria de los grupos han confundido las preguntas sobre la evaluacion de las guias de localizacion con las guias ofrecidas para instalar LabelTranslator. El objetivo de las preguntas era evaluar las guias metodologicas y NO la guia proporcionada para instalar la herramienta.\nRespecto a la evaluacion sobre la usabilidad de LabelTranslator, estos son los resultados obtenidos.\nEficiencia (58%): grado con el cual los usuarios sienten que el software les ayuda en su trabajo.\nAfecto (51%) - la reacción emocional general del usuario hacia el software.\nUtilidad (48%) - el grado por el cual el software es auto-explicatorio. La suficiencia de documentación.\nControl (65%) - el grado por el cual los usuarios sienten el control del software.\nLearnability (40%) - la facilidad con la cual los usuarios consideran que han podido dominar con maestría el sistema.\nLa mayoria NO tuvo problemas en el proceso de localizacion de las ontologias, excepto porque el sistema tuvo un error en el proceso de exportacion de la ontologia multilingue.\nComentarios particulares\n\nMarta Ariza y Gema Romero de Ávila\n. Este grupo completó todo el proceso de localizacion incluido la exportacion de la ontologia multilingue.\nJosé Miguel Alonso\n. Uno de los mas criticos en evaluar la herramienta. Sin embargo los comentarios efectuados sobre las guias de localizacion no aportan demasiado pues hacen referencia a la herramienta.\nJuan Ramirez Fernandez\n. Indica que ha tenido varios problemas en la traduccion de la ontologia, sin embargo la evaluacion de la herramienta muestra un porcentaje alto de aceptacion.\nJuan Manuel Garitagoitia y Octavio López\n. Ofrecen algunos comentarios importantes de posibles errores en la herramienta evaluada.\nresto grupos\n. Han confundido las guias de localizacion con las guias ofrecidas para usar la herramienta.",
  "speaker": "SYSTEM",
  "uuid": "7891ffe8-76ae-4060-b058-0b154dcc4358"
}