{
  "message": "SYSTEM: FormularioCPM_asunciondemaria.gomez.pdf: Página 11\n3.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n3. Solución III\n3.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n3.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n3.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­11­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN III (marque esta casilla para habilitar los campos asociados a la solución III)\nversión 1.2.\n#\nLa iniciativa de los datos enlazados o linked data (LD) ha surgido recientemente como un \nconjunto de técnicas y buenas prácticas para exponer, publicar y conectar datos en la \nWeb. La Web de Datos enlazados (Web of Data), que emerge de la aplicación de dichas \ntécnicas, viene a ser una extensión a la Web “tradicional” pero más orientada al \nprocesamiento automático de la información por programas de ordenador, además de \npara su consumo directo por humanos. Los datos enlazados permiten un acceso \nintegrado a recursos heterogéneos y complementarios mediante estándares de la Web. Al \nextrapolar estos formatos y técnicas al mundo de los recursos lingüísticos, se abre un \nabanico de posibilidades de explotación y aprovechamiento de la información lingüística \nen tareas complejas de procesamiento de lenguaje natural o análisis de contenido, entre \notras muchas.  \n \nEl Ontology Engineering Group (OEG), grupo de referencia internacional en Ingeniería \nOntológica, con más de 20 años de experiencia en la creación y aplicación de tecnologías \nsemánticas, ha desarrollado metolodologías, modelos y técnicas para la transformación \nde recursos al formato datos enlazados, y en concreto se ha especializado en la \nconversión de recursos lexicográficos y terminológicos multilingües como datos \nlingüísticos enlazados.  \n \nEn el marco del recientemente concluido proyecto europeo LIDER \n(http://www.lider-project.eu/), coordinado por el OEG, se desarrollaron y aplicaron dichas \nguías, modelos y técnicas para la construcción de recursos lingüísticos en este formato \n(http://www.lider-project.eu/guidelines), y se dio un impulso sin precedentes a la nube de \ndatos lingüísticos enlazados (más conocida como LLOD cloud (http://linguistic-lod.org/) \nque pasó a albergar cerca de 200 recursos lingüísticos enlazados entre sí. La estructura \nde grafo que presenta la nube de datos enlazados ofrece la gran ventaja de que los \nrecursos son navegables y que cualquier nodo puede ser un punto de entrada al recurso. \nMuchos de los recursos de dicha nube proporcionan sus datos de forma abierta y \naccesible para su reutilización. \n \nEn esta propuesta de solución se propone la aplicación de las metodologías y técnicas \ndesarrolladas en LIDER para la construcción de recursos semánticos multilingües en el \nformato de los datos lingüísticos enlazados. En un primer estadio, se definen modelos de \nrepresentación de datos lingüísticos, para lo que se reutilizarán modelos ya existentes \ncomo Ontolex-lemon https://www.w3.org/2016/05/ontolex/, el estándar de facto para la \nrepresentación de datos lingüísticos en la Web de Datos, desarrollado en el contexto del \nW3C ontolex community group, en el que miembros del OEG han participado \nactivamente. Dicho modelo se ajusta a las necesidades de representación del recurso \nlingüístico en cuestión (diccionario monolingüe y/o multilingüe, terminología, lexicón, \nglosario, recurso enciclopédico, etc.). Una vez terminada la fase de diseño del modelo, se \nestablecen las correspondencias con los metadatos originales con Morph-RDB \n(https://github.com/oeg-upm/morph-rdb), una herramienta de conversión de datos \n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "78922940-c51b-494d-9b38-557a03f06dc8"
}