{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 117\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 117 of 124\nChapter 8\nConclusions and future work\nDuring performing the work that is reported in this deliverable, the involved partners have drawn the following\nmajor conclusions which will inﬂuence the further evolution of this task.\nFirst, we have updated the three level categorization of NORs, introduced in [SFdCB+08], according to three\ndifferent features: type of NOR, data model and implementation. Moreover, we presented a pattern based\napproach for re-engineering NORs into ontologies. We take advantage of the NOR data model to deﬁne\npatterns for re-engineering NORs. This approach is covered in the following Chapters: 3, 4, and 5. This\napproach will be extended to cover glossaries and lexicons, and create richer and more complex ontologies.\nWe plan to include the algorithms and implementations later on in a framework which will implement the\ntransformation process. Also we will include a section on the PR-NORs to generate ontologies following the\nLinking Open Data1 recommendations. We also need to evaluate how much effort do we save re-engineering\nNORs using patterns compared with re-engineering NORs without them.\nSecond, we presented FLOR, a tool for automatic enrichment of folksonomy tagspaces with Semantic Entities\nautomatically discovered from online ontologies. The experiments reported in Section 6.1.5 we demonstrated\nFLOR’s functionalities and performance and provided additional insights for future work on the enhancement\nof the FLOR enrichment algorithm. Finally as described in Section 6.1.3 the ﬁnal step of FLOR, which is the\nSCARLET Semantic Relation Discovery hasn’t yet been integrated with FLOR and thus is part of our future\nwork.\nFinally, the SPRAT tool described in Chapter 7 uses a method for automatically extracting entities from\nunstructured text in any domain, and generating and/or populating an ontology with the resulting information.\nThe method relies on the identiﬁcation of syntactic and semantic linguistic patterns in unstructured text, in\ncombination with methods for generic named entity recognition and term extraction. The tool is deployed\nas a plugin for the Neon Toolkit, and a domain-speciﬁc version of it, SARDINE, is used in WP8 for the\naugmentation of ﬁsheries ontologies. Currently, a number of patterns have been deployed, but ongoing work\nis investigating the incorporation of deeper semantic information and further reﬁnement of the patterns, in\norder to improve precision.\n1http://esw.w3.org/topic/SweoIG/TaskForces/CommunityProjects/LinkingOpenData\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "78c10c9b-b387-45ac-a2af-cf6c89af1c3f"
}