{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 83\nBÚSQUEDA \n \n83 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nigual que todos los métodos de escalada, se aprovecha la información heurística de \nun modo local (se dice que son métodos de visión corta). En particular, puede \nsuceder que todos los descendientes de un estado prometedor sean nefastos, con lo \nque en ABIERTOS puede haber nodos mucho mejores que los que están al \ncomienzo de la lista. Para evitar estas situaciones se introducen la siguiente familia \nde búsquedas heurísticas. \n \n4.3. Métodos \"primero el mejor\". \nLos métodos primero el mejor (o en primer lugar el mejor) mantienen la lista de \nnodos ABIERTOS ordenada de modo que se puedan considerar siempre la \nalternativa más prometedora de entre todas las que están siendo consideradas. Sus \ncaracterísticas combinan las de la búsqueda en profundidad (puede encontrar una \nsolución sin expandir todos los nodos), la búsqueda en anchura (no queda atrapada \nen caminos sin salida) y los métodos de escalada (puesto que tiene en cuenta los \nvalores heurísticos de los estados). \nConcretamente, la estrategia de control primero el mejor consiste en darle a la lista \nABIERTOS una estructura de cola de prioridad, ordenada (de menor a mayor) por \nlos valores heurísticos de los estados asociados a los nodos. Habrá versiones en \nárbol y en grafo (es decir, en ésta última se mantiene una lista de estados \nCERRADOS). \nEn el árbol de estados de la figura 2 hemos escrito entre paréntesis al lado de cada \nestado el (supuesto) valor heurístico del estado. Como viene siendo habitual, el \nestado inicial es I y el único estado objetivo es O. En las figuras 3, 4, 5 y 6 \nrecogemos, respectivamente, los árboles de búsqueda en escalada simple (con \nexpansión de izquierda a derecha), escalada por la máxima pendiente, escalada en \nprofundidad y primer lugar el mejor. \n \n",
  "speaker": "SYSTEM",
  "uuid": "78fccf36-1b3f-4b56-9150-d575be707aed"
}