{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/CSIRO2010 \n\nApplication deadline extended to November 15, 2010\nCSIRO ICT Centre is looking for a Science leader in the area of Semantic Data Management. This position provides an opportunity to:\n- Lead data management researchers across the ICT Centre\n- Shape future  technologies and collaborate with industry and government in Australia and internationally\n- Join CSIRO, Australia's premier science & technology research organization\nResearch in the data management in Australia and CSIRO is driven by the semantic web, management of scientific data, web information management, and embedded data processing in cyber-physical systems. This research provides the fundamental capabilities and technologies that are used in scientific, health, energy, business, security and social application domains. Current research and interests at the CSIRO ICT Centre that relate to the advertised position include:\n- Semantic Web and Ontologies\n- Scientific Data Management\n- Spatial, Temporal, and Geographic Data Management\n- Data Curation, Annotation and Provenance\n- Data Management in Computing Clouds\n- Data Models and Query Languages\n- Complex Event Processing\n- Data Streams and Publish-Subscribe Systems\nApplicants for a Science Leader position are expected to have a research record equivalent to that of a Full Professor in a major Australian University. Applicants with a research record similar to a Associate Professor in a major Australian University are also encouraged to apply for appointment as Senior Science Specialist (This appointment has similar responsibilities to  a Science Leader appointment and the expectation is that Senior Science Specialists will become Science Leaders in 1-3 years).\n- Location:  Canberra (preferred), Sydney or Hobart\n- Salary:  AUS $115K - $172K plus up to 15.4% superannuation\n- Application deadline: 15 Novenber 2010\nFurther details about the position and uploading applications are available at the CSIRO recruitment site:\nhttps://recruitment.csiro.au/asp/job_details.asp?RefNo=2010%2F387\nFor additional information, please contact:\nDimitrios Georgakopoulos (Research Director, CSIRO ICT Centre)\nvia email Dimitrios.Georgakopoulos@csiro.au or phone +61 2 6216 7152.",
  "speaker": "SYSTEM",
  "uuid": "791e34ac-4989-49d4-acfd-200ad8b53070"
}