{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 7\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13915\nArtículo 8.  Programas de doctorado.\n1.  La universidad, de acuerdo con lo que establezca su normativa, definirá su \nestrategia en materia de investigación y de formación doctoral que se articulará a través \nde programas de doctorado desarrollados en Escuelas de Doctorado o en sus otras \nunidades competentes en materia de investigación, de acuerdo con lo establecido en los \nestatutos de la universidad, en los respectivos convenios de colaboración y en este real \ndecreto.\n2.  La citada estrategia contará preferentemente con aliados externos para su puesta \nen marcha en virtud de complementariedades, compartición de excelencia o sinergias con \nlas estrategias de I+D+i de otras instituciones. En este sentido, los programas de doctorado \npueden llevarse a cabo de forma conjunta entre varias universidades y contar con la \ncolaboración, expresada mediante un convenio, de otros organismos, centros, instituciones \ny entidades con actividades de I+D+i, públicos o privados, nacionales o extranjeros.\n3.  En el marco de la citada estrategia, cada programa de doctorado será organizado, \ndiseñado y coordinado por una Comisión Académica responsable de las actividades de \nformación e investigación del mismo. Dicha comisión académica estará integrada por \ndoctores y será designada por la Universidad, de acuerdo con lo establecido en su \nnormativa, estatutos y convenios de colaboración, pudiendo integrarse en la misma \ninvestigadores de Organismos Públicos de Investigación así como de otras entidades e \ninstituciones implicadas en la I+D+i tanto nacional como internacional.\n4.  Cada programa de doctorado contará con un coordinador designado por el rector \nde la universidad o por acuerdo entre rectores cuando se trate de programas conjuntos o \nen el modo indicado en el convenio con otras instituciones cuando se desarrolle un \ndoctorado en colaboración. Dicha condición deberá recaer sobre un investigador relevante \ny estar avalada por la dirección previa de al menos dos tesis doctorales y la justificación de \nla posesión de al menos dos períodos de actividad investigadora reconocidos de acuerdo \ncon las previsiones del Real Decreto 1086/1989, de 28 de agosto, de retribuciones del \nprofesorado universitario. En el caso de que dicho investigador ocupe una posición en la \nque no resulte de aplicación el citado criterio de evaluación, deberá acreditar méritos \nequiparables a los señalados.\n5.  Todo el profesorado de un programa de doctorado deberá poseer el título de \ndoctor, sin perjuicio de la posible colaboración en determinadas actividades específicas de \notras personas o profesionales en virtud de su relevante cualificación en el correspondiente \námbito de conocimiento.\nArtículo 9.  Escuelas de Doctorado.\n1.  Las universidades podrán crear Escuelas de Doctorado de acuerdo con lo previsto \nen sus Estatutos, en la normativa de la respectiva Comunidad Autónoma y en el presente \nReal Decreto, con la finalidad de organizar, dentro de su ámbito de gestión, las enseñanzas \ny actividades propias del doctorado. Su creación deberá ser notificada al Ministerio de \nEducación a través de la Dirección General de Política Universitaria, a efectos de su \ninscripción en el Registro de Universidades, Centros y Títulos (RUCT), regulado mediante \nReal Decreto 1509/2008, de 12 de septiembre.\n2.  Las Escuelas de Doctorado podrán ser creadas individualmente por una \nuniversidad, o conjuntamente con otras o en colaboración de una o varias universidades \ncon otros organismos, centros, instituciones y entidades con actividades de I+D+i, públicas \no privadas, nacionales o extranjeras.\n3.  Las Escuelas de Doctorado deberán garantizar que desarrollan su propia estrategia \nligada a la estrategia de investigación de la universidad o universidades y, en su caso, de \nlos Organismos Públicos de Investigación y demás entidades e instituciones implicadas. \nTambién deben acreditar una capacidad de gestión adecuada para sus fines asegurada \npor las Universidades e instituciones promotoras.\n4.  Las Escuelas planificarán la necesaria oferta de actividades inherentes a la \nformación y desarrollo de los doctorandos, llevadas a cabo bien por colaboradores de las \ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "7944b85f-186f-4b21-aecd-160fc433bf04"
}