{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 3\n \n \n3\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n4. En todos los casos, deberá avalarse la existencia de un Director y la posibilidad de \nrealizar la tesis doctoral conforme a las normas aprobadas por el Consejo de \nGobierno de la UPM. Así mismo, el alumno deberá estar bajo la tutela de uno de \nlos profesores del programa hasta la asignación de un Director de tesis doctoral en \nel comienzo del período de investigación. \n \n2.2.   La solicitud deberá ser avalada por un profesor en activo de la Universidad Politécnica \nde Madrid, necesariamente doctor con al menos un sexenio de investigación, o un \ninvestigador con demostrable calidad científica (contratado por el Programa Ramón y \nCajal, por el Programa I3, por el Programa Isaac Peral, Programas Marie Curie, etc.), \ncon los recursos necesarios para asegurar el buen desarrollo de las actividades \nformativas de la beca y posterior contrato. En el caso de que la vinculación del Director \na la Universidad sea inferior al período de duración de la ayuda, deberá figurar un co-\ndirector con las condiciones mencionadas anteriormente.  \nTERCERO.- DURACIÓN, CARACTERÍSTICAS Y SUSPENSIÓN DE LA AYUDA \n \n3.1. La duración máxima de la ayuda concedida al amparo de la presente convocatoria \nserá de cuarenta y ocho meses contados a partir de la fecha de alta en el centro de \nadscripción y sin perjuicio del resultado de la evaluación de las memorias anuales que \ndeberán presentar los beneficiarios como acciones de seguimiento. La ayuda se \nestructura en dos etapas: \na) \nDe beca, que comprenderá los veinticuatro primeros meses desde la concesión \nde la ayuda. Al finalizar dicha etapa se deberá haber superado el período de \nformación del Programa de Doctorado. En aquellos supuestos en que el \nbeneficiario de una ayuda hubiera obtenido el DEA o documento equivalente con \nanterioridad a la finalización de los años de beca, no accederá a la contratación \nlaboral o fase de contrato hasta que complete los 24 meses. \nSi al finalizar esta fase se ha realizado la lectura de la tesis doctoral, el objetivo de \nla ayuda se ha conseguido y por lo tanto, no se podría formalizar la siguiente \netapa de contrato. \nAsí mismo, en el caso de que hubiesen transcurrido cuatro años, o seis en el caso \nde personas con discapacidad, desde la obtención o convalidación del DEA o \ndocumento administrativo que lo sustituye, tampoco se podrá formalizar el \nmencionado contrato en prácticas, tal como se refleja en el Art. 11 del Estatuto de \nlos Trabajadores  \nb) \nDe contrato, que comprenderá como máximo los veinticuatro meses siguientes. \nUna vez obtenido el DEA o certificado académico que acredita que se encuentra \nen el período de investigación del Programa de Doctorado formalizará un contrato \nlaboral en prácticas con la finalidad de elaborar su tesis doctoral. \nCon carácter excepcional, según se establece en el art. 8.2. del R.D. 63/2006, \ncuando se hayan cumplido los dos años de beca, se podrá celebrar un contrato \nen prácticas sin que el sujeto afectado haya obtenido el DEA o similar, siguiendo \nel procedimiento administrativo establecido por el Ministerio de Ciencia e \nInnovación en su Orden 2657/2008, de 18 de septiembre (BOE 22 de septiembre) \ny siempre que la Comisión Nacional de Evaluación de la Actividad Investigadora \n(CNEAI) emita un informe favorable. \n",
  "speaker": "SYSTEM",
  "uuid": "797b3d7a-fbe6-48ea-8353-9451d8e6e063"
}