{
  "message": "SYSTEM: FormularioCPM_asunciondemaria.gomez.pdf: Página 5\n1.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n1. Solución I\n1.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n1.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n1.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­5­\n(*) Campos obligatorios\nversión 1.2.\nDylan-Q es un sistema para la construcción intuitiva de consultas, en lenguaje natural \ncontrolado, sobre cualquier base de conocimiento en RDF (estándar W3C de datos \nsemánticos). El sistema proporciona un sistema de guiado basado en mostrar opciones \npara iniciar y continuar la consulta. El sistema permite la utilización de términos \n(metadatos) de la base de conocimiento (e.g. “Dime los municipios de España”), así como \nde sus sinónimos (“Dime los pueblos de España”). También permite la construcción de la \nconsulta de múltiples maneras (“¿Qué municipios tiene España?”), la creación de consultas \nen distinto idiomas (por defecto, español, inglés y alemán) y, lo más importante: el sistema \nestá orientado a datos, no sólo a metadatos, permitiendo al usuario explorar los datos \nmientras crea la consulta y crear la consulta con ellos (e.g. “Dime el alcalde de Madrid”). \nLas preguntas construidas con el sistema carecen de ambigüedades, por lo que siempre \nse proporciona una respuesta correcta y completa. Si el usuario no puede construir la \nconsulta como quiere (un porcentaje mínimo de las preguntas que suelen hacer los \nusuarios), se tratará la pregunta de forma convencional (como texto libre). El sistema tiene \nunos patrones de consultas predefinidos, basados en la experiencia proporcionada por \nnuestros estudios, pero permite añadir nuevos patrones si se identifica que los usuarios \nlos usan habitualmente. \n  \nLa Comisión Europea define los portales de datos abiertos como \"interfaces web \ndiseñadas para facilitar la búsqueda de información reutilizable\". Sin embargo, la tarea de \nencontrar información reutilizable es, precisamente, donde los portales de datos actuales \nse muestran insuficientes: se centran en permitir al usuario la búsqueda de archivos y en \nlugar de la información. Es una tarea tediosa para los usuarios, pues se les obliga a \nexcavar en los datos y a entender la información. Un estudio del portal de datos de la UE \nmuestra que el 73% de los usuarios de datos abiertos indican que la búsqueda de datos \nes difícil o muy difícil. \n  \nUna de la formas de mitigar estar deficiencia es usar sistemas “basados en lenguaje \nnatural” que permiten al usuario teclear su consulta en su propio idioma. Este tipo de \nsistemas interpretan la consulta y producen una respuesta pero, en el estado actual de las \ntécnicas de lenguaje natural, sólo responden adecuadamente consultas sencillas. \n  \nUna alternativa reciente es el uso de tecnologías basadas en “bots”. Sistemas \nconversacionales que simulan un asistente virtual con el que charla el usuario. Estos \nsistemas, pese a su inicial atractivo, adolecen de limitaciones desde el punto de vista del \nusuario: estudios recientes muestran que los usuarios prefieren evitar conversar con \nasistentes humanos y, por tanto, lo mismo sucede con sistemas que pretenden imitar a \nasistentes humanos. \n  \nNuestra propuesta es ayudar al usuario a construir la consulta, sin conversaciones, \nmediante un sistema de autocompletado. En este proyecto se pueden utilizar los datos \nintegrados de datasets de distintos organismos públicos como datos.gob.es, \n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "79bbf93c-6166-423b-9df5-808c728c7642"
}