{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 26\nCongreso: II Encuentros Complutenses en torno a la Traducción \nPublicación: Sí \nLugar celebración: UCM. Madrid  \nFecha: 1988 \n \n \nAutores: Aguado de Cea, G. \nTítulo: Tendencias de la enseñanza del inglés en el campo tecnológico. \nTipo de participación: Presidente de una Mesa Redonda. \nCongreso: XII Congreso de AEDEAN \nPublicación: No \nLugar celebración: Alicante  \nFecha: 1988 \n \n \nAutores: Aguado de Cea, G. \nTítulo: La lengua inglesa en las escuelas técnicas: situación actual. \nTipo de participación: Ponente en una Mesa Redonda \nCongreso:  VI Congreso Nacional de Lingüística Aplicada de AESLA. \nPublicación: No \nLugar celebración: Santander  \nFecha: 1988 \n \n \nAutores: Aguado de Cea, G, García Fernández, M. \nTítulo: English Language in a Computer Science Faculty: an Interdisciplinary Experiment \nTipo de participación: Co-Autora de la Ponencia \nCongreso: Conferencia Annual de la European Society for Engineering Education (SEFI) \nPublicación: Sí (ISBN: 951-754-180-5) \nLugar celebración: Helsinki, Finland \nFecha: 1987 \n \n2 \n \nAutores: Aguado de Cea, G. \nTítulo: La traducción técnica en un marco interdisciplinar en los estudios de informática. \nTipo de participación: Co-autora de la Ponencia. \nCongreso: I Congreso Nacional sobre Historia de la Traducción. \nPublicación: Sí \nLugar celebración: León  \nFecha: 1987 \n \n \nAutores: Aguado de Cea, G. \nTítulo: El lexema ware en el campo informático \nTipo de participación: Autora de la ponencia. \nCongreso: Congreso Nacional de AEDEAN. \nPublicación: Sí \nLugar celebración: Zaragoza \nFecha: 1986 \n \n \nAutores: Aguado de Cea, G. \nTítulo: Problemas terminológicos en el campo de la informática. \nTipo de participación: Autora de la ponencia. \nCongreso: III Convención Iberoamericana de Informáticos CIBI. \nPublicación: Sí \nLugar celebración: Madrid \nFecha: 1986 \n \n                                                      \nNota: Si necesita más casos, añádalos utilizando las funciones de copiar y pegar con el 2º caso. \n",
  "speaker": "SYSTEM",
  "uuid": "79c7714e-352b-4057-9c40-492ba0cd29e2"
}