{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 20\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97745\nSuplemento Europeo al Título (Diploma Supplement), en los casos de los países del \nEEES en los que esté regulada su expedición.\nLas certificaciones académicas con firma electrónica expedidas por universidades \nespañolas, deberán contener los datos identificativos para efectuar las comprobaciones \nnecesarias.\nc)  Declaración responsable de la nota media de los estudios que dan acceso al \ndoctorado, realizada en los formularios disponibles en la página Web, para cada uno de los \ncasos. La nota media tendrá en cuenta la totalidad de los créditos o asignaturas superadas \ny, en su caso, el trabajo fin de carrera, por los que el solicitante queda facultado para \nacceder a los estudios de doctorado, en un procedimiento único de cálculo que incluya \ntodas las asignaturas de primero y segundo ciclo en su caso, así como los créditos \nasignados en el plan de estudios. Los estudios de máster serán incluidos en la declaración \nde nota media cuando el candidato no tenga superados 300 créditos de grado. La \ndeclaración de nota media de los estudios realizados en el extranjero será realizada por la \nunidad gestora del procedimiento a petición de los interesados.\nLa declaración responsable de la nota media firmada por el interesado deberá \nadjuntarse al certificado del expediente académico, debiendo coincidir exactamente los \ncréditos superados y las calificaciones obtenidas en ellos con la certificación académica \nde los estudios superados que se presente al efecto. Los errores o manipulaciones que \nmodifiquen los resultados correctos de la nota media podrán dar lugar a invalidar la solicitud \npresentada por el candidato.\nd)  Los solicitantes que se acojan a cualquiera de las excepciones señaladas en el \nartículo 27.2 d), deberán presentar, además y según sea el caso: fotocopia del título de la \nEspecialidad o certificación oficial de la misma; en el caso de la especialidad realizada en \nel extranjero presentar la acreditación del reconocimiento de la misma en España, si se \ntrata de los nacionales de países de la Unión Europea o la homologación para nacionales \nde otros países. En el caso de atención a hijos menores, podrá acreditarse para uno solo \nde los progenitores mediante documento extendido por la Seguridad Social.\ne)  Acreditación de la admisión en el doctorado o en el máster que constituye la parte \nformativa del mismo en el curso académico 2009-2010. La acreditación de la matrícula \ndeberá presentarse junto a la documentación de aceptación de la beca una vez publicada \nla relación provisional de beneficiarios de las ayudas.\nf)  En el caso de los solicitantes que concurran a una de las ayudas para estudiantes \ncon una discapacidad reconocida igual o superior al 65 por ciento a 31 de diciembre \nde 2008, documentación acreditativa del grado de discapacidad.\n5.  El órgano gestor requerirá de oficio a las entidades de adscripción de los becarios, \nla aceptación del representante legal de las solicitudes presentadas y la acreditación la \nvinculación permanente del director y, en su caso, del codirector presentado por los \ncandidatos que figuren con adscripción a las mismas.\nAsimismo verificará ante las universidades la matrícula de los estudiantes en doctorados \ncon Mención de Calidad, en aquellos casos en que éstos así lo hayan declarado.\n6.  La presentación de la solicitud conllevará la autorización del solicitante para que el \nórgano concedente obtenga de forma directa, a través de certificados telemáticos, la \nacreditación de las obligaciones tributarias y con la Seguridad Social.\nArtículo 31.  Evaluación y criterios de puntuación de las solicitudes.\n1.  La evaluación de las solicitudes corresponderá a una Comisión de Evaluación, \ndesignada por el Director General de Política Universitaria, que coordinará uno de sus \nmiembros designado entre los evaluadores. La Comisión estará integrada por los expertos \nnecesarios para realizarla y organizará su trabajo por las áreas científicas de la clasificación \nde la Agencia Nacional de Evaluación y Prospectiva.\n2.  La Comisión de Evaluación aplicará los siguientes criterios y baremo:\na)  Interés científico y calidad del proyecto formativo que incluya la tesis doctoral y su \nadecuada financiación, hasta 0,5 puntos.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "7a66cbde-e98c-4902-94fa-8973b9f1df7f"
}