{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 11\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 11 of 124\nthese are reported in this deliverable, except (3), which is reported in D6.10.2 Updated NeOn Toolkit\nplugins, and (6), which is reported in D2.5.2 Library of ontology design patterns and software support\nfor pattern-based design.\n1.2\nDeliverable Main Goals and Contributions\nWhen compared with the previous version of this deliverable, it can be noted that the improvements of this\nversion are mainly centered on evolving existing methods and investigating novel ones for re-engineering\nnon-ontological resources into ontologies. Therefore, the main goal of this deliverable is to present a set of\nmethods and tools for re-engineering non-ontological resources into ontologies. Thus\n• For handling classiﬁcation schemes, and thesauri, we present methods based on a re-engineering\nmodel for non-ontological resources that we have adapted from the general model for software re-\nengineering. These methods rely on the use of Patterns for Re-engineering Non-ontological Resources\n(PR-NOR). The methods are extensions of the methods presented on D.5.4.1 [SFdCB+08].\n• With respect to folksonomies, we present a method with its respective tool that creates an ontological\nstructure for a folksonomy of a speciﬁc domain by utilising automatically selected knowledge from\nonline available ontologies.\n• For corpora we present a method and a tool that identify patterns for the extraction of entities from\nunstructured text and re-engineer these entities into concepts and instances (ontology creation and\npopulation).\n1.3\nDeliverable Structure\nThe material of this deliverable is structured as follows:\n• Chapter 2 presents a review of the state of the art of methods and tools for re-engineering non-\nontological resources into ontologies.\n• Chapter 3 introduces the general method, based on patterns, we follow in NeOn for re-engineering\nnon-ontological resources. We apply this method to classiﬁcation schemes (chapter 4), and thesauri\n(chapter 5).\n• Chapter 4 presents a method for re-engineering classiﬁcation schemes into ontologies. The method\nproposes the use of a set of patterns for re-engineering classiﬁcation schemes into ontologies.\n• Chapter 5 describes a method for re-engineering thesauri into ontologies. The method proposes the\nuse of a set of patterns for re-engineering thesauri into ontologies.\n• Chapter 6 describes a method and a tool to create an ontological structure for a folksonomy of a\nspeciﬁc domain by utilising automatically selected knowledge from online available ontologies. Since\nfolksonomies are unstructured non-ontological resources, this chapter do not follow the pattern based\nmethod.\n• Chapter 7 presents a description of the methods we use in order to identify patterns for the extraction of\nentities from unstructured text, and to re-engineer these into concepts and instances (ontology creation\nand population). Since unstructured text is unstructured non-ontological resource, this chapter do not\nfollow the pattern based method.\n• Chapter 8 describes the conclusions and future work.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "7b065064-bc10-466b-b5dd-82343d3eaf8f"
}