{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nSituación Año 1 (hasta Hito 4)\n1.1\nTareas 7.2 y 8.4\n1.2\nTarea 2.3 (DEIMOS)\n1.3\nTareas 1.4 y 4.1 (CNIG)\n1.4\nTarea 7.1 (CNIG)\n2\nPlanes de trabajo (año 2)\n2.1\nTareas 7.2\n2.2\nTarea 2.3 (DEIMOS)\n2.3\nTareas 1.4 y 4.1 (CNIG)\n2.4\nTarea 7.1 (CNIG)\n3\nInterfaz Anotador Híbrido\n4\nLecciones aprendidas\n5\nRecursos\n6\nInformes enviados a Deimos y CNIG/IGN\nSituación Año 1 (hasta Hito 4)\n\nTareas 7.2 y 8.4\n\nTarea 1 (DEIMOS). Mecanismo de extracción semántica a partir de anotaciones\n. Hemos categorizado todas las aproximaciones existentes en el estado del arte para la extracción de semántica a partir de anotaciones Web2.0 (tags), que también se puede llamar propuesta de anotación de folksonomías, y hemos propuesto un primer borrador del experimento que tenemos pensado realizar en los próximos meses en esta área. Este experimento se realizará sobre el repositorio RDF de la Universidad de Southampton donde se cruza información de varias folksonomías, así como la ontología de tagging que han definido para almacenar esta información. En esta tarea hemos terminado la escritura de un artículo de revisión que tenemos pensado enviar a una revista. Hemos implementado el primer prototipo de extracción semántica a partir de anotaciones, utilizando DBPedia como recurso semántico.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Implementación de un servicio web para permitir acceder al servicio de desambiguación de etiquetas de manera independiente al lenguaje de desarrollo del mencionado servicio.\n• Trabajo en los comentarios recibidos (primera revisión) a un artículo enviado a la revista Knowledge Engineering Review.\n• Revisión del concepto de contexto activo que va a ser integrado en el servicio de\ndesambiguación y que permitirá mejores resultados.\nTarea 2 (CNIG). Procesado de fuentes de información no semántica ya existentes\n. Hemos desarrollado servicios Web para acceder a distintas fuentes de datos (wsdl, rss, georss, rest -- con algunas restricciones de registro --), e introducimos estos datos de manera unificada utilizando el modelo SDO propuesto por IBM. Asimismo, hemos realizado una revisión del estado del arte correspondiente a la descripción automática de fuentes desconocidas, utilizando en general programación lógica inductiva.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Continuación del proceso de integración intentando comprender la definición de la fuente. Para esto se están utilizando recursos semánticos como Geonames, DBpedia para definir significados de las entradas y salidas de las fuentes.\nTarea 3 (DEIMOS). Modelo de anotación híbrido\n. Tenemos hasta ahora diseñada una base de datos que permite almacenar anotaciones procedentes de parsers lingüísticos de una manera unificada, teniendo en cuenta las características principales que la mayoría de los parsers proporcionan, y tenemos su implementación correspondiente en SQL. Esto permitirá en el futuro referirse de manera unificada a los distintos tokens que pueden aparecer en un texto introducido por el usuario, de acuerdo con la interfaz multimodal que se propone en el documento. Se han identificado distintos modelos de anotación híbrida (lingüística y semántica) y las interacciones entre ellas, aunque aún queda trabajo de refinamiento de los mismos.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Diseño de la interfaz.\n• Inicio del desarrollo de la interfaz.\n• Evolución de la funcionalidad del anotador. Se han realizado una serie de experimentaciones basadas en las anotaciones proporcionadas por la herramienta GATE y se han desarrollado las más relevantes.\n• Análisis de diferentes repositorios para el almacenamiento de los datos (Badele3000).\nTarea 2.3 (DEIMOS)\n\nInstalación y configuración del servidor Fura en un equipo Linux.\nComprobación del funcionamiento del servidor Fura.\nLectura de la documentación de programación de Fura.\nAnálisis de las características más interesantes de Fura para el desarrollo del planificador semántico.\nComienzo de la redacción del borrador sobre el planificador semántico.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Estudio de S-OGSA para adaptarlo al metaplanificador.\n• Mejora de la ontología de planificación de recursos grid.\n• Mejora del algoritmo de razonamiento.\nTareas 1.4 y 4.1 (CNIG)\n\nR2O+ y ODEMapster+\n. Este trabajo da multiplicidad a la hora de realizar alineamientos BD-Ontologías y de su ejecución (los mappings R2O y R2O+ son ejecutables al representar transformaciones). Trabajo realizado para el H3.\nSe ha pasado documentación a GridSystems para intentar gridificar este software.\nAnálisis y mejora de técnicas de descubrimiento de mappings ad hoc para el dominio geográfico\n. En una primera fase (julio 2009) se van a analizar los resultados de las técnicas que se hicieron en el Convenio bilateral OEG-IGN en 2008. En la segunda fase (octubre 2009) se van a proponer mejoras.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\nMapeo de catálogos externos\n. A petición del IGN, se prueba a mapear con PhenomenOntology 3.5 los fenómenos de fuentes de información externa a partir de consultas a servicios web de fenómenos (WFS, Web Feature Services). Se han realizado pruebas en julio de 2009. Estas pruebas sirven como base para el planteamiento de mejoras para las técnicas existentes y para el diseño e implementación de nuevas técnicas. Esta tarea forma parte de la anterior del análisis de las técnicas de descubrimiento.\nSe ha revisado el estado de los catálogos de fenómenos que los WFS permiten obtener, analizando la accesibilidad y la descriptividad de los listados de fenómenos que estos servicios contemplan. De este trabajo se ha escrito una comunicación que ha sido aceptada para su presentación dentro de las VI Jornadas Técnicas de la IDE de España (JIDEE2009) y que se celebran del 4 al 6 de noviembre, donde se presentará este trabajo.\nEvaluación de técnicas descubrimiento de\nmappings\n. Se están evaluando las técnicas existentes en el IGN MapDiscover 1.0.\nPropuesta de nuevas técnicas de descubrimiento de\nmappings\n. A partir del trabajo de mapeo con FWS se está desarrollando la técnica 10, de comparación de cadenas previa eliminación de partículas sintácticas no descriptivas del fenómeno (información de escala, de representación, etc.).\nTarea 7.1 (CNIG)\n\nEn esta tarea también teníamos progreso que realizar en filtrado colaborativo, pero aún no hemos hecho nada en este área.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Estudio de la problemática de las diversas fuentes de datos (bases de datos & RDF) para la generación de un listado exhaustivo de problemas.\n• Identificación y solución de algunos problemas en ODEMapster para la generación de información en RDF procedente de bases de datos de gran tamaño.\nPlanes de trabajo (año 2)\n\nTareas 7.2\n\nTarea 1 (DEIMOS). Mecanismo de extracción semántica a partir de anotaciones\n• Realizar una revisión del estado del arte en la evolución de ontologias a partir de información de las folksonomias.\n• Desarrollar una versión inicial de un enfoque que permita realizar tareas tales como ontology population (creación de instancias), ontology learning (adición de nuevas clases a la ontología) y ontology update (Modificaciones a la ontología incluyendo borrar o mover clases) a partir de la información de las folksonomias, reutilizando el trabajo realizado en la desambiguación de los significados de las etiquetas.\n• Incluir en este procedimiento el manejo de versiones de la ontología para poder identificar los cambios realizados en la ontología por cada cambio realizado.\n• Incluir en este procedimiento la posibilidad de manejar más de un idioma (Multilingualidad).\n• Analizar la posibilidad de enriquecer la folksonomia a partir de la información semántica de las ontologías.\nTarea 2 (CNIG). Procesado de fuentes de información no semántica ya existentes\n• Desarrollo y depuración constante del registro e invocación de fuentes.\no Revisión constante de los métodos que permiten registrar e invocar fuentes como: REST, WSDL, RSS, KML, geoRSS.\no Analizar la posibilidad de permitir el registro de fuentes semánticas que soporten consultas SPARQL.\n• Recolección de fuentes de datos del dominio geográfico.\no Para realización de pruebas acerca del registro e invocación de fuentes.\n• Mejorar la descripción de las fuentes de datos.\no Describir semánticamente los parámetros de entrada/salida de las fuentes.\no Utilizar una ontología de dominio en el registro de una fuente para especificar los tipos semántico de datos de las entradas y salidas.\no Creación de una interfaz para que el usuario registre ejemplos del tipo semántico,\no Estudio de la extracción de relaciones de la ontología de dominio.\no Estudio de la estructuración de los tipos semánticos en una jerarquía para su utilización en un algoritmo de inducción\n• Análisis de las diferentes propuestas de aprendizaje de definiciones semánticas de fuentes de datos.\no Revisión del estado de la cuestión de Inductive Logic Programming (ILP) (FOIL)\n• Adaptación de los algoritmos existentes como FOIL a la plataforma.\no Revisión del software de inducción ILP.\no Adaptación del algoritmo seleccionado a la plataforma.\no Realización de pruebas de inducción de una nueva fuente.\n• Estudio de posibles mejoras al algoritmo seleccionado de inducción.\n• Despliegue de servicios web que permita a los usuarios utilizar los algoritmos implementados.\n• Evaluación\nTarea 3 (DEIMOS). Modelo de anotación híbrido\n.\n• Continuación del desarrollo de la interfaz.\n• Continuación del estudio de herramientas que permiten anotaciones (por ejemplo, GATE).\n• Análisis y desarrollo de patrones lingüísticos aplicables a textos en inglés y español.\n• Utilización de ontologías para realizar anotaciones.\no Uso de ontologías existentes\no Desarrollo de ontologías conforme a los dominios del proyecto\n• Utilización de etiquetas para la anotación\n• Conexión de los resultados parciales de las anotaciones (solución al uso de varias anotaciones conjuntas)\n• Enriquecimiento de recursos (anotaciones) con información adicional (Linked Data)\nTarea 2.3 (DEIMOS)\n\nMaría Pérez tiene que completar el plan de trabajo\n• Implementación del primer prototipo del metaplanificador semántico.\no Implementación del adaptador semántico.\no Implementación del módulo del metaplanificador.\n• Análisis y diseño del segundo prototipo del metaplanificador semántico con mejoras sobre el uso de la metainformacion.\nTareas 1.4 y 4.1 (CNIG)\n\n• Mejora del descubrimiento de mappings: Evaluación técnicas existentes.\no Evaluación de las técnicas existentes mapeando PhenomenOntology con los WFS.\no Evaluación de las técnicas de mappings I: P/R de mappings entre HPhenom3.5 y fuentes IGN (NC y NGN).\no Evaluación de las técnicas de mappings II: P/R de mappings entre hydrOntology y fuentes IGN.\n• Mejora del descubrimiento de mappings: Propuestas de mejora.\no Técnica 10 (de evaluación con WFS).\no Mejoras en técnicas existentes (de evaluación con fuentes IGN).\no Técnicas de descubrimiento multilingüe.\n• Aumento del sistema integrado.\no Mapeo de PhenomenOntology con otras fuentes (WFS y catálogos de fenómenos de Comunidades Autónomas).\n• Explotación de los mappings.\no Resolución de consultas mediante información contenida en los mappings.\no Composición de resultados de consultas según relaciones de los mappings.\nTarea 7.1 (CNIG)\n\n• Continuación del establecimiento de correspondencias (mappings) entre ontología y diferentes bases de datos que componen el proceso de integración.\n• Depuración del RDF resultante del establecimiento de mappings\n• Detección de instancias duplicadas\no Análisis de los problemas de los conjuntos de datos en RDF.\no Abstracción de los diversos problemas (bases de datos y RDF) con el objetivo de establecer diferentes enfoques heurísticos para la detección de instancias (topónimos) duplicadas en las fuentes de información estudiadas.\no Formalización e implementación de los diversos enfoques heurísticos.\n• Evaluación de resultados\n• Publicación de Linked Data de calidad (con resultados de tareas anteriores)\no Estudio de las características requeridas para la publicación de Linked Data.\no Estudio de fuentes de información relacionadas con el dominio geoespacial.\no Publicación y conexión al cloud de Linked Data\nInterfaz Anotador Híbrido\n\nPlan de trabajo\nLecciones aprendidas\n\nGATE\nInterfaz\n, enlace a la versión 1.0 de la interfaz Web\nhttp://regulo.dia.fi.upm.es/anotador\nDescripción y pruebas de Meaningtool:\nhttp://www.meaningtool.com/\n[\n[1]\n]\nA partir del paper Automatic Web Page Annotation with Google Rich Snippets: [\n[2]\n]\n- Anotador:\nhttp://annotator.lfms.nl/\n- Rich Snippets Testing Tool Beta:\nhttp://www.google.com/webmasters/tools/richsnippets?url=&view=\nRecursos\n\n- Este es el link del video juego que reconoce voz, imágenes, etc.\nhttp://www.youtube.com/watch?v=CvjEJkZi8bw\n- Inspiraciones para la ampliación en Linked Data y referencias.\nGenerate RDFa with Epiphany\nCurrently, the underlying Linked Data model is a subset of DBpedia covering German politics.\nEpiphany runs at:\nhttp://projects.dfki.uni-kl.de/epiphany/\nOn the top right you'll find an example.\nUnder\nhttp://projects.dfki.uni-kl.de/epiphany/form\n, you can write your own text and receive RDFa content.\n- Realidad aumentada (5 mejores aplicaciones)\nhttp://alt1040.com/2010/01/las-5-mejores-aplicaciones-de-realidad-aumentada-para-celulares\n- Herramienta para generar tag clouds, hacer text mining y otros\nhttp://seasr.org/documentation/text-mining-overview/\n- The Natural Language Software Registry -\nhttp://registry.dfki.de/\n(Tienen registradas 292 herramientas para NLP).\n- tOKo -\nhttp://www.toko-sigmund.org/about.html\n-\nhttp://www.semanticsoftware.info/tools-and-resources\n- MuNPEx -\nhttp://www.semanticsoftware.info/munpex\nInformes enviados a Deimos y CNIG/IGN\n\nInformes 2009\nInformes 2010\nEspañaVirtual07012010\nEspañaVirtual14012010\nEspañaVirtual21012010\nEspañaVirtual28012010\nEspañaVirtual04022010\nEspañaVirtual11022010\nEspañaVirtual18022010\nEspañaVirtual25022010\nEspañaVirtual04032010\nEspañaVirtual11032010\nEspañaVirtual18032010\nEspañaVirtual25032010\nEspañaVirtual01042010\nEspañaVirtual08042010\nEspañaVirtual15042010\nEspañaVirtual22042010\nEspañaVirtual29042010\nEspañaVirtual06052010\nEspañaVirtual13052010\nEspañaVirtual20052010\nEspañaVirtual27052010\nEspañaVirtual03062010\nEspañaVirtual10062010\nEspañaVirtual17062010\nEspañaVirtual24062010\nEspañaVirtual01072010\nEspañaVirtual08072010\nEspañaVirtual15072010\nEspañaVirtual22072010\nEspañaVirtual29072010\nEspañaVirtual05082010\nEspañaVirtual12082010\nEspañaVirtual19082010\nEspañaVirtual26082010\nEspañaVirtual02092010\nEspañaVirtual09092010\nEspañaVirtual16092010\nEspañaVirtual23092010\nEspañaVirtual30092010\nEspañaVirtual07102010\nEspañaVirtual14102010\nEspañaVirtual21102010\nEspañaVirtual28102010\nEspañaVirtual04112010\nEspañaVirtual11112010\nEspañaVirtual18112010\nEspañaVirtual25112010\nEspañaVirtual02122010\nEspañaVirtual09122010\nEspañaVirtual16122010\nEspañaVirtual23122010\nEspañaVirtual13012011\nEspañaVirtual20012011\nEspañaVirtual27012011\nEspañaVirtual03022011\nEspañaVirtual17022011\nEspañaVirtual24022011\nEspañaVirtual03032011\nEspañaVirtual10032011\nEspañaVirtual17032011\nEspañaVirtual31032011\nEspañaVirtual07042011\nEspañaVirtual14042011\nEspañaVirtual20042011\nEspañaVirtual28042011\nEspañaVirtual05052011\nEspañaVirtual12052011\nEspañaVirtual19052011\nEspañaVirtual26052011\nEspañaVirtual02062011\nEspañaVirtual09062011\nEspañaVirtual16062011\nEspañaVirtual22062011\nEspañaVirtual30062011\nEspañaVirtual07072011\nEspañaVirtual14072011\nEspañaVirtual21072011\nEspañaVirtual28072011\nEspañaVirtual04082011\nEspañaVirtual01092011\nEspañaVirtual15092011\nEspañaVirtual22092011",
  "speaker": "SYSTEM",
  "uuid": "7ba224f2-76d5-4cba-9cd7-1100bf2367c7"
}