{
  "message": "SYSTEM: QRVocabulary.pdf: Página 11\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n93 / 103 \nState \nA state describes a particular situation of a modelled system. A state contains \ninformation about the structural organisation, the current values of quantities, \ninequalities, and the active model fragments. A state can be interpreted, terminated, \nordered, or closed. \nInterpreted State \nAn interpreted state is either a scenario, or a new state generated during the closing of \na state, and all the applicable model fragments. \nTerminated State \nA state is referred to as terminated if all the possible ways a state can end, due to \nchanges of magnitudes of derivatives of quantities, are identified. \nOrdered State \nA state is referred to as ordered, when transitions overruled by other transitions with \nhigher priority have been pruned, and terminations that occur simultaneously due to \ncorrespondences have been merged.  \nClosed State \nA state is referred to as closed when the successive states and transitions are \ngenerated from its pruned and merged terminations. \nA.8.4 The notion of State-graph and Behaviour \nBehaviour \nWithin the context of qualitative reasoning and modelling the behaviour of a system \nrefers to the changes of quantity values (and in/equality statements) as the result of \nprocesses that are active within the modelled system. \nTransition \nA transition describes the change between two different states. The transition \ninformation describes the transition conditions that are fulfilled by the source state, and \nthe results of the change (i.e. the next state).  \nState-graph \nA state-graph is a set of states, and the possible transitions between those states, \nwhich represents the behaviour of modelled system. State-graphs are generated by \nsimulating a qualitative model. \nBehaviour-graph \nSee state-graph. \nBehaviour Path \nA behaviour path is a sequence of successive states within a state-graph. The path \ndescribes the evolution of the quantity values and ordinal relations as time progresses. \n \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "7c21839d-e471-491a-b669-0242f752190b"
}