{
  "message": "SYSTEM: Wiki: Datasets\n\nEl Viajero.\nhttp://datahub.io/dataset/elviajero\nAparece una que se llama webnmasunotraveler, que era el nombre anterior a la del viajero. No entiendo por qué aparece.\nAEMET.\nhttp://datahub.io/dataset/aemet\n(María)\nNo he encontrado AEMET en el cloud, aunque tiene el tag \"lod\" y no aparece en la lista de \"non parseable\".\nAñadida etiqueta \"crossdomain\" y \"geographic\". Debería aparecer ahora. Entrada en datahub:\nhttp://datahub.io/dataset/aemet\nGeolinkeddata. Modificado el fichero robots.txt para eliminar la restricción de rastreo del dominio.\nAragoDBpedia.\nhttp://datahub.io/dataset/aragodbpedia\n(Oscar)\ndatos.bne.es. DataHub? Sí aparece\nZaragoza. Actualizar, porque lo que hay es antiguo.\nto be updated (Miguel)\nLicencias\nhttp://datahub.io/es/dataset/rdflicenses\n(Victor)\nes.dbpedia.org (Mariano)\nCiudades de Brasil (María)\nDescartados\nCRTM.\nhttp://datahub.io/dataset/crtm\n(Oscar)\nRTVE (dado que dentro de poco empezaremos a trabajar con ellos en un Linked Data en condiciones)\nStreams de datos (no tenemos el ok de la mayor parte de las organizaciones)\nLos de Ciudad2020 (transportes, energía, medio ambiente). Son prototipos\nApertium EN-ES y EN-CA (Jorge)\nTerminesp (Jorge, Dani Vila)\nTenemos en datahub el grupo\nhttp://datahub.io/organization/oeg-upm\nInstrucciones para aparecer en la siguiente LOD Cloud (antes de 8/8/2014): \n1. Enter them into the datahub.io data catalog. \n2. Tag them in the catalog with the tag ‘lod’ (\nhttp://datahub.io/dataset?tags=lod\n)\n3. Send an email to Max and Chris pointing us at the entry in the catalog.\n4. Include an example URI from your dataset into the catalog\n5. Include information about the RDF links pointing from your dataset into other datasets (field links: )\n6. Include a tag indicating the topical category of your dataset\nWe will include all datasets into the updated version of the cloud diagram, that fulfill the following requirements:\n1. Data items are accessible via dereferencable URIs.\n2. The dataset sets at least 50 RDF links pointing at other datasets or at least one other dataset is setting 50 RDF links pointing at your dataset.\nInstructions on how to describe your dataset in the catalog are found here:\nhttps://www.w3.org/wiki/TaskForces/CommunityProjects/LinkingOpenData/DataSets/CKANmetainformation\nDemos\n\nGeolinkeddata:\nVisualizador:\nhttp://geo.linkeddata.es/web/guest/visualizacion-beta\nVisualizador mapa IGN:\nhttp://geo.linkeddata.es:8282/map4rdf-openlayers\nVisualizador mapa OSM:\nhttp://oeg-dev.dia.fi.upm.es/map4rdf-0.0.3/#dashboard\nPruebas dibujando río:\nhttp://geo.linkeddata.es/browser/?uri=http://geo.linkeddata.es/resource/R%C3%ADo/R%C3%ADo%20Assa\nhttp://geo.linkeddata.es/browser/?uri=http://geo.linkeddata.es/resource/R%C3%ADo/R%C3%ADo%20Albarellos#dashboard\nCiudades danesas -\nhttp://oeg-dev.dia.fi.upm.es/map4rdf-edf/#dashboard\nBNE:\nhttp://cultura.linkeddata.es/visualizer\nTeclear cervantes\nMostrar algunas expresiones de las obras en pag. 1 (algunas no tienen)\nIr a la pag. 2 y pinchar sobre la gitanilla, eso muestra la instancia con refs al autor, expresiones, etc.\nPinchar sobre expresiones de la gitanilla y lo mismo: pinchando sobre el enlace de alguna de las expresiones sale la instancia de esa expresión y por ejemplo la vasca tiene 2 manifestaciones.\nWebN+1:\nBuscador:\nhttp://webenemasuno.linkeddata.es/searcher.html\nVisualizador:\nhttp://webenemasuno.linkeddata.es/browser.html\nGood Relations:\nhttp://oeg-dev.dia.fi.upm.es/goodrelations/#dashboard\nAEMET\nVisualizador:\nhttp://aemet.linkeddata.es/map4rdf/\nRTVE:\nhttp://rtve.linkeddata.es/\nBuscar un programa cualquiera y luego se puede navegar por cualquier cadena de televisión o radio.\nCiudades y transporte\nhttp://transporte.linkeddata.es/\nStreams de datos\nhttp://streams.linkeddata.es/\nDescripciones\n\nes.dbpedia\nThe DBpedia project\n[1]\nhas been generating semantic information from the english wikipedia\n[2]\n. From June 2011 the extraction process\n[3]\nextracts information from Wikipedia in 15 of their non-english languages\n[4]\n. One of these is the Spanish language. The DBpedia internationalization committee\n[5]\nhas assigned a web site and a SPARQL endpoint to each one of these languages.\nThe extraction process for the Spanish language has produced so far almost 100 millon RDF triples\n[6]\n. In the SPARQL endpoint the most relevant triples (~70 millions) are available. This work depends on researchers from UPM\n[7]\n: (Mariano Rico\n[8]\n, untill Nov 2013 at UAM\n[9]\n) and Oscar Corcho\n[10]\n, both of them belonging to the Spanish Thematic Network of Linked Data\n[11]\n, as well as individuals who dedicate their time and effort to this initiative. This initiative started on a mapping generation hackathon that was celebrated under the auspices of the aforementioned network Acknowledgement\n[12]\n.",
  "speaker": "SYSTEM",
  "uuid": "7c88f211-06f2-424f-b742-fd6e0c121018"
}