{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nAVISO GENERAL\n2\nNORMATIVA APLICABLE\n3\nDOCUMENTOS DESCARGABLES\n4\nPLAZOS\n5\nAGENCIA DE VIAJES\n6\nPERMISO DE VIAJE (SÓLO PDI)\n7\nPREVIAJE\n8\nDURANTE EL VIAJE\n8.1\nUtilizando la tarjeta OTT\n9\nPOSTVIAJE\n9.1\nManutención\n9.2\nCálculo del número de dietas máximas\n9.3\nDesplazamiento en vehículo particular\n9.4\nDocumentación a adjuntar\n9.5\nGastos no imputados\n9.6\nNorma general\n9.7\nGastos compartidos\n9.7.1\nManutención por invitación\n9.7.2\nMás cosas\n9.8\nEstancias financiadas por OEG\n9.8.1\nPostviaje\n10\nAnexo: Cuantía de las dietas\nAVISO GENERAL\n\nSiempre que se falta del puesto de trabajo y se está trabajando: o se tiene un permiso de teletrabajo (protocolo de vacaciones y permisos) o se tiene un previaje. Queda excluido si la ausencia es por estar en Rectorado firmando contrato, en una charla de doctorandos, etc.\nNORMATIVA APLICABLE\n\nReal Decreto 462/2002 de 24 de Mayo, sobre indemnizaciones por razón del servicio\nOrden EHA/3770/2005 de 1 de diciembre por la que se revisa el importe de la indemnización por uso de vehículo particular establecida en el Real Decreto 462/2002, de 24 de mayo, sobre indemnizaciones por razón del servicio\nNormas para estancias dependientes de cada país\n.\nDOCUMENTOS DESCARGABLES\n\nEn el Repositorio Conocimiento del Portal Investigador UPM está el formulario de gastos de viaje, en formato Excel.\n1. Formularios excel (va uno en blanco para casos especiales) Marzo 2021\nOJO: Nuevo fichero aquí:\nhttps://delicias.dia.fi.upm.es/wiki/images/3/37/Gastos_viajes_rellenable_JULIO_2023.xlsx\n2. Compromiso Tarjeta OTT\n3. Compromiso Conocimiento Protocolo\nPLAZOS\n\nDe modo genérico, hay que entregar los previajes con más de 15 días de anticipación y los postviajes hasta 15 días después de la finalización del viaje.\nAdemás, en los casos de:\nViajes realizados en julio: tienen la obligatoriedad de presentar las facturas y postviajes antes de irse de vacaciones.\nViajes de agosto: la UPM solo cierra dos semanas y, por tanto, el postviaje debe entregarse al equipo de gestión antes de que la UPM cierre o bien nada más que la UPM abra.\nEstancias superiores a un mes: consulta explícita a Gestión sobre cada caso.\nPara la compra de billetes de avión, inscripciones a congresos y pagos de hoteles, se recomienda solicitar un anticipo en el previaje por el valor exacto de lo pagado.\nComo todos sabéis, desde que cada uno entrega un postviaje hasta llega a la OTT se requiere un papeleo interno, escribir las cartas, firmas, escaneo de la documentación, traslado de papeles a la OTT, etc. Todo esto puede llevar días o semanas.\nEn aquellos casos en los que alguien reciba un anticipo para un viaje, y no se gaste dicho anticipo entero, debe devolver a la UPM las cantidades no justificadas del anticipo en un plazo también de dos semanas desde la terminación del viaje con el fin de que se adjunte en su justificación del viaje.\nAGENCIA DE VIAJES\n\nHay acuerdo marco con una agencia de viajes. En el\nportal de compras\n(se accede con cuenta de correo upm) viene toda la normativa, para hacer todo el proceso, etc.\nPERMISO DE VIAJE (SÓLO PDI)\n\nPara facilitar los trámites de autorización de viajes de menos de 15 días al PDI, se ha desarrollado una\naplicación\ninformática que se ha incluido en la Sede Electrónica de la UPM como nuevo procedimiento.\nA partir del día 15 de mayo de 2022, todas las solicitudes de viajes de este tipo, tienen que realizarse a través de dicha aplicación.\nEl nuevo procedimiento de solicitudes de permisos de viaje de menos de 15 días para el PDI sigue los siguientes pasos:\n1) El interesado entra en sede.upm.es y selecciona\n'Solicitud de viajes de duración menor de 15 días del catálogo de procedimientos'\n.  En el formulario de solicitud se introducen los datos del viaje y el nombre del profesor o profesores que le sustituirá durante en viaje. Se puede firmar la solicitud con usuario UPM y contraseña o con un certificado digital.\n· Es posible introducir varios destinos y motivos en una sola solicitud de autorización de viaje.\n· Es obligatorio realizar la solicitud al menos 5 días antes de la salida; en caso contrario, será necesario seguir el procedimiento actual de manera urgente y excepcional, no pudiendo garantizarse las coberturas del seguro de viajes contratado por la UPM\n2) El profesor (profesores) propuesto para que realice la sustitución, recibirá un correo electrónico con los datos del viaje y dos enlaces, uno para aceptar y otro para rechazar la sustitución.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud, para que pueda hacer una nueva solicitud proponiendo otro sustituto\n· En caso de aceptación, se sigue con la tramitación.\n3) El Director del Departamento del interesado recibe un correo del portafirmas con una petición de firma del permiso. Este permiso contiene los datos del viaje, el nombre del sustituto y un breve resumen de los últimos viajes autorizados del interesado.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud.\n· En caso de aceptación, se sigue con la tramitación.\n4) El Director/Decano de la Escuela/Facultad del interesado recibe un correo del portafirmas con una petición de firma del permiso firmado por el Director del Departamento.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud.\n· Para viajes dentro de la UE y aceptados por el Director/Decano, el interesado recibe un aviso de la aceptación de su solicitud y puede descargar el permiso en la Sede Electrónica.\n· En casos de viajes fuera de la UE aceptados por el Director/Decano, el Gerente tiene que autorizar el permiso antes del aviso al interesado.\n· En todo momento, se podrá consultar el estado del expediente en el apartado \"Mis Expedientes\" de la Sede Electrónica de la UPM\nFinalmente, al igual que en el procedimiento actual, se guardan todos los datos del viaje en COPERNYCO.\nPREVIAJE\n\nRellenar la hoja previaje no es difícil. Es la primera de las dos hojas del formulario PDF de la OTT.\nHay que rellenar con el mayor detalle:\n.- Teléfono: 73083\n.- Correo electrónico: admin-oeg@delicias.dia.fi.upm.es\n.- Proyecto: es la cuenta OTT del proyecto (si no se sabe se pregunta a Gestión)\n.- Nombre, DNI, datos bancarios, del investigador\n- Escala:\nBecario OTT\n,\nContratado OTT\n,\nContratado Investigación\n(FPU, FPI, CAM, UPM, JdC, BG, RyC, etc.), PDI:\nPAD, CD, PTEU, PTU, CEU, CU\n.\n.- Vinculación: Miembro del equipo de investigación. Sólo para determinadas personas y en proyectos nacionales es la otra opción (consultar)\n.- Número de días y fechas de viaje\n.- Itinerario del viaje (ej.:\nMadrid-Milán-Florencia/Florencia-Roma-Madrid\n)\n.- Tipo y motivo del viaje: \"\nPresentación del artículo \"XXX\" en la conferencia XXX, perteneciente al trabajo en el paquete de trabajo X del proyecto X\n\", \"\nImpartición de charla en el evento XXX, invitado por la organización, dentro de la diseminación del paquete de trabajo X del proyecto X\n\", \"\nNegociación de propuesta FPX-XXXX en la Unión Europea\n\", etc. Recordad que luego esto hay que demostrarlo con el artículo, con las transparencias de la charla, con el correo de invitación, etc.\n.- Medios de transporte:\navión\n,\ntren\n,\ncoche propio\n,\ncoche ajeno\n, etc.\n.- Si se pide o no anticipo y, en su caso, cantidad\n.- Fecha de firma, siempre anterior a la fecha de salida del viaje\n.- Nombre del IP de la cuenta OTT en la firma\nDURANTE EL VIAJE\n\nDurante el viaje los miembros deberán conservar todos los tickets, facturas, billetes, tarjetas de embarque, tickets de repostaje... que documenten gastos que deseen justificar.\nUtilizando la tarjeta OTT\n\nAquellos miembros que viajen con más frecuencia tienen la posibilidad de contar con tarjeta mastercard de investigador OTT, de forma que puedan pagar gastos de desplazamientos (avión, trenes, alquiler de coche, gasolina), alojamiento e inscripciones.\nLos miembros que soliciten (o bien ya posean) dicha tarjeta tendrán igualmente una serie de obligaciones, de forma que el incumplimiento en tres ocasiones de cualquiera de ellas, comportará la cancelación de la tarjeta:\n1. Firmar un documento en el se comprometan a elegir una de las dos siguientes opciones:\na) Hacerse responsables de la consulta del extracto de movimientos de la tarjeta, de forma que cada vez que realicen un viaje (\nen el plazo de una semana\n), deberán facilitar junto con su declaración de gastos, el/los importe/s que efectivamente se hubieran cargado en la cuenta de la tarjeta, como consecuencia de los gastos pagados con ésta.\nb) Delegar en el equipo de gestión del OEG dicha obligación, facilitando para ello el código PIN de su tarjeta, de forma que éstos puedan consultar el extracto de movimientos a fin de agilizar la tramitación de la declaración de gastos. Ello sin perjuicio de la obligación de cada miembro de cumplimentar debidamente su declaración de gastos.\n2. No pagar con la tarjeta OTT:\n- Gastos personales\n- Gastos cuyo anticipo se hubiera solicitado\n- Peajes de autopistas\n- Comidas en restaurantes\n- Taxis, salvo que éstos superen los 50 euros y se tenga permiso para cogerlo\n- Tickets de metro y autobús\n- Gastos inferiores a 10€\n3. Es muy importante que las facturas vayan a nombre de la persona a la que se haya autorizado el gasto en la hoja previaje. En el caso de que un único miembro pague gastos “comunes” de dos o más miembros con la tarjeta OTT, se solicitarán facturas individuales de forma que, en la factura de cada uno de ellos figuren su nombre y apellidos.\n4. Sólo se pagarán facturas enteras. Si en la factura van varios gastos y sólo se quiere pagar unos con tarjeta y otros con metálico, habrá que pedir dos facturas independientes, porque las facturas van ENTERAS, no se puede pagar parte de una factura con tarjeta OTT.\nPOSTVIAJE\n\nIMPORTANTE\n: Rectorado no admite ningún tipo de enmienda en el formulario. Si hay algún error, no se puede tachar, ni usar corrector, ni nada, hay que volver a hacerlo nuevo y con pulcritud.\nVoy a tratar de aclarar aquí lo que en verdad son los gastos de un viaje. Los gastos que se reflejan, claro. Cómo reflejarlos y cómo justificarlos.\nManutención\n\nPor lo que se refiere a los gastos de manutención, se pagará en todos los casos el total del importe justificado mediante facturas. Estos gastos deberán reflejarse en la hoja postviaje en forma de múltiplos de media dieta, de forma que habrá que calcular el total de gastos por ese concepto, y redondearlo a dietas enteras o medias, por arriba.\nCálculo del número de dietas máximas\n\nEs un dato que pide el formulario de OTT. El número de noches es obvio, pero el número de dietas no es obvio, depende de la hora de salida y llegada.\n.- Día de salida: Si se sale antes de las 14 horas, se cuenta una dieta entera ese día. Si se sale después de las 14 horas y antes de las 22 horas se cuenta media dieta. Si se sale después de las 22 horas no se cuenta ninguna dieta.\n.- Día intermedio: Una dieta por día.\n.- Día de llegada: Si se llega antes de las 14 horas, no se cuenta ninguna dieta. Si se llega después de las 14 horas y antes de las 22 horas, se cuenta media dieta. Si se llega después de las 22 horas y se tiene con un ticket de una consumición (cualquiera) se cuenta una dieta entera.\nAsí, aunque el viaje sean 3 días, 2 noches, pueden ser como dietas máximas de 1 a 3, según horarios.\nDesplazamiento en vehículo particular\n\nCuando nos desplacemos en nuestro vehículo particular con motivo de un viaje, podremos imputarnos como gasto indemnizable una cantidad de dinero por cada kilómetro recorrido. De forma que, multiplicaremos la distancia en kilómetros al aeropuerto (hay que adjuntar captura del cálculo de kilometraje, valiendo captura de GMaps) por\na) 0,19 € si el desplazamiento se realiza en automóvil\nb) 0,078 € si el desplazamiento se realiza en motocicleta\ny el resultado se multiplica por dos, pues se trata de un desplazamiento de ida y vuelta.\nEl kilometraje al aeropuerto sólo se paga si es desde una población que no sea Madrid capital, porque no se pagan desplazamientos dentro de Madrid.\nDocumentación a adjuntar\n\nAunque en el propio documento de la OTT aparece la documentación requerida, hay que recordar y destacar que se pide:\n.- Agenda del evento: agenda de la reunión, correo de convocatoria para una reunión, programa de la conferencia, etc.\n.- Certificado de asistencia: o listado de asistentes a una reunión\n.- Facturas de alojamiento y viaje (de la agencia o no) y tarjetas de embarque en caso de avión, billetes o tickets de otros transportes. Incluye tickets de repostaje para desplazamientos superiores a 150 km en vehículo particular\n.- Tickets de peajes\n.- Cambio “oficial” de moneda para gastos en moneda extranjera\n.- Facturas de otros gastos indemnizables (impresión de póster, inscripción, visado, etc.)\n.- Tickets de manutención\nGastos no imputados\n\nSi dentro del postviaje no se imputan gastos a alguna partida “imprescindible”, hay que justificar en el cuadro de Memoria del formulario por qué. Simplemente con poner (por ejemplo): “El alojamiento ha sido cubierto por otra financiación” es suficiente.\nNorma general\n\nUno tiene que poner en su postviaje los gastos de\nsu viaje\n. Da igual si se lo ha gastado él o no.\nEjemplo\n:\nSi yo voy a Gotham City 3 días, mi vuelo vale 100€, mi habitación vale 150€ y mis comidas valen 210€, mi postviaje valdrá: 100€ + 150€ + 210€ = 460€.\nY puede ser que el vuelo me lo pague Carmen con su tarjeta OTT, que la habitación la pague en metálico y que unas comidas las pague yo y a otras me invite Mora. El caso es que la OTT va a reintegrar el dinero que corresponda a cada uno: 100€ a la tarjeta OTT de Carmen, 150€ a mí y 210€ a mí. Es decir, Mora no cobra sus invitaciones.\nConsejo general\n: Que cada uno pague lo suyo (ya puede ser por facturas separadas o porque pague alguien lo de varios y cada uno le dé el dinero).\nGastos compartidos\n\nCuando viajan varias personas a una misma conferencia o reunión de proyecto, es normal y aconsejable (está más arriba) compartir habitación dos miembros del Grupo. Una de las personas paga la cuenta total de la habitación, pero cada una imputa el coste proporcional de su alojamiento. Una adjunta la factura original y los demás fotocopias de la factura.\nCuando se paga un hotel de habitación compartida con la tarjeta OTT tienen que realizar dos cargos, cada uno por la mitad de la habitación, porque los cargos con tarjeta no se pueden compartir entre proyectos, con lo que mejor siempre que hagan dos o no se pague con tarjeta OTT.\nEjemplo\n:\nMora y yo compartimos habitación las 3 noches en el Gotham Center Hotel. Como Mora tiene tarjeta OTT, paga con su tarjeta el hotel completo, es decir, hay una sola factura por 300€. Mora en su postviaje pondrá sus 150€ y adjuntará el original de la factura. Yo en mi postviaje pondré mis 150€ y adjuntaré fotocopia de la factura e indicaré que el original está en el postviaje de Mora. En ambos casos, el pago es con tarjeta OTT y en ambos hay que reintegrarlo a la tarjeta OTT de Mora. IMPORTANTE: Esto sólo se puede hacer si nos va a pagar el mismo proyecto. Si no, con la misma tarjeta OTT hay que pagar la habitación en dos partes porque hay que imputar dos cargos a dos proyectos diferentes.\nSi en vez de pagar con tarjeta OTT Mora paga en metálico porque tiene un billete de 500€ y quiere cambiarlo, yo le tendré que dar a Mora mis 150€ de hotel. Se operará igual en el postviaje y la factura. La única diferencia es que es a devolver en cada caso al que firma el postviaje porque es en metálico.\nY si hace falta, se divide por noches. O sea, si la habitación sólo la compartimos 2 noches y la otra sólo está Mora, pues Mora paga su noche completa y las otras dos se dividen y yo pago dos medias noches (en los previajes están las fechas de las noches que se cubren y de las que no).\nManutención por invitación\n\nComo la manutención se debe pagar en metálico, lo mejor es echar cuentas entre los miembros y saldar el dinero, puesto que luego cada uno recibirá su parte.\nEjemplo\n:\nCada uno pagamos en una factura independiente del hotel los desayunos, en metálico (60€). Carmen se va a comer con los peces gordos todos los días y les hacen facturas independientes en el restaurante, con lo que Carmen paga en metálico sus comidas (suman 300€). Mora come sandwiches de máquina cuando se acuerda de comer y paga en metálico (12€). Yo me voy a la \"Casa de España en Gotham\" en las comidas y pago en metálico (45€).\nSalimos a cenar por la Bigger Gotham Avenue Mora, Carmen y yo. Y entramos en un restaurante que elige Carmen. Como ha elegido Carmen, paga ella lo de los tres (90€). Otro día elige Mora y paga Mora (60€). Y otro día elijo yo y pago yo (30€).\nLo primero es arreglar cuentas entre nosotros. Yo tengo que pagar a Carmen 20€ y a Mora 10€ y Mora le tiene que pagar a Carmen 10€. Así ya estamos en paz, cada uno hemos pagado lo nuestro.\n¿Cuánto tenemos que pasar cada uno?\nCarmen pasará las dietas que le cubran sus 60€ + 300€ + 30€ = 390€.\nMora pasará las dietas que le cubran sus 60€ + 12€ + 60€ = 132€.\nYo pasaré las dietas que me cubran mis 60€ + 45€ + 60€ = 165€.\nA cada uno se le devolverá lo suyo y todos en paz, porque lo primero es que se arreglaron las cuentas y cada uno gastó (aunque no pagó) lo suyo.\nMás cosas\n\nPara el resto de cosas (billetes de autobús o tren, inscripciones, etc.), haced lo mismo y así es todo mucho más fácil.\nEn el caso de los taxis, puede uno pasar el taxi de varios, eso no hay problema, porque el servicio es el mismo para uno que para dos y el gasto de desplazamiento en taxi no es obligatorio (como en el caso del hotel, que sí que hay que dormir).\nDe todos modos, ante cualquier duda, preguntad antes de rellenar el postviaje y traérselo a Ana, para así evitar tener documentación a medias y demás.\nEstancias financiadas por OEG\n\nTodos aquellos que no tienen estancia financiada por un programa oficial o le hayan denegado la beca/ayuda de su programa, de la UPM, etc.\nLos\ncostes máximos\nque el Grupo pagará serán:\n- Viaje: 300€ Europa, 700€ América, 800€ Asia (con facturas)\n- Alojamiento: 500-600€/mes (con factura)\n- Manutención: 100€/mes\n- Taxis: 100€ (con facturas)\nPostviaje\n\nEl postviaje se realizará como uno normal a la hora de pasar el viaje (facturas), alojamiento (facturas) y taxis (facturas).\nPara la manutención se calcula (nº_meses)x100 y se ponen las dietas de manutención hasta cubrir esa cantidad. Por ejemplo, si se está dos meses y veinte días en un país cuya dieta son 40€/día: 2,6x100=260€ -> Se justificarán 6,5 dietas =260€.\n¿Qué ocurre si alguien se pasa del máximo?\nEj.: El viaje de avión+tren hasta llegar a donde voy cuesta 320€ i/v. El viaje se justifica igual, pero los 20 de exceso se restan a la manutención. 3 meses x 100 = 300€ - 20 exceso de viaje = 280€ a cubrir con las dietas.\nIgualmente se procederá con los excesos de alojamiento y taxis, de modo que el exceso del límite corre a cargo del que realiza la estancia.\nPara cualquier duda, que puede haber muchas porque hay mucha casuística, preguntad al equipo de gestión.\nAnexo: Cuantía de las dietas\n\nNota 1\n: Cuidado que Holanda viene como Países Bajos y los países que formaban Yugoslavia se rigen por la dieta de Yugoslavia.\nNota 2\n: Para los contratados C y D no rigen estas dietas, nos preguntáis las cantidades explícitamente a nosotros.\nPaís\nManutención\nAlojamiento\nEspaña\n37,40\n65,97\nResto del mundo\n40,87\n108,78\nAlemania\n59,50\n132,82\nAndorra\n37,86\n46,88\nAngola\n59,50\n135,23\nArabia Saudita\n54,09\n101,57\nArgelia\n44,47\n101,57\nArgentina\n55,29\n111,19\nAustralia\n51,09\n81,14\nAustria\n58,90\n95,56\nBélgica\n82,94\n148,45\nBolivia\n36,66\n51,09\nBosnia-Herzegovina\n49,88\n72,72\nBrasil\n79,33\n128,02\nBulgaria\n37,86\n53,49\nCamerún\n48,68\n88,35\nCanadá\n51,69\n94,36\nChile\n50,49\n102,17\nChina\n46,28\n71,52\nColombia\n78,13\n123,81\nCorea\n55,29\n102,17\nCosta de Marfil\n49,28\n61,30\nCosta Rica\n44,47\n65,51\nCroacia\n49,88\n72,72\nCuba\n33,06\n56,50\nDinamarca\n64,91\n122,61\nRepública dominicana\n36,66\n64,31\nEcuador\n43,27\n64,91\nEgipto\n39,07\n91,35\nEl Salvador\n43,27\n66,11\nEmiratos Árabes Unidos\n56,50\n101,57\nEslovaquia\n43,27\n75,73\nEstados Unidos\n69,72\n143,04\nEtiopía\n37,86\n119,60\nFilipinas\n39,67\n71,52\nFinlandia\n65,51\n114,79\nFrancia\n65,51\n122,61\nGabón\n52,89\n100,37\nGhana\n37,26\n66,71\nGrecia\n39,07\n69,12\nGuatemala\n42,67\n89,55\nGuinea ecuatorial\n50,49\n87,75\nHaití\n37,86\n45,08\nHonduras\n42,07\n69,72\nHong Kong\n51,69\n121,40\nHungría\n46,28\n115,39\nIndia\n38,46\n99,77\nIndonesia\n42,67\n102,17\nIrak\n39,07\n66,11\nIrán\n44,47\n80,54\nIrlanda\n48,08\n93,16\nIsrael\n56,50\n92,56\nItalia\n63,11\n131,02\nJamaica\n46,28\n46,93\nJapón\n96,76\n159,87\nJordania\n42,67\n93,16\nKenia\n39,67\n82,34\nKuwait\n44,47\n122,61\nLíbano\n34,86\n115,39\nLibia\n54,69\n102,17\nLuxemburgo\n55,89\n135,83\nMalasia\n34,26\n91,95\nMalta\n31,85\n46,28\nMarruecos\n39,67\n99,17\nMauritania\n39,07\n49,28\nMéjico\n43,27\n81,74\nMozambique\n42,67\n67,31\nNicaragua\n52,89\n94,36\nNigeria\n46,88\n117,80\nNoruega\n80,54\n132,82\nNueva Zelanda\n40,27\n65,51\nPaíses Bajos\n64,31\n126,81\nPakistán\n37,26\n58,30\nPanamá\n36,66\n64,91\nParaguay\n33,06\n45,68\nPerú\n43,27\n79,93\nPolonia\n42,67\n99,77\nPortugal\n43,87\n97,36\nReino Unido\n82,94\n156,86\nRepública Checa\n43,27\n101,57\nRumanía\n38,46\n126,81\nRusia\n73,32\n227,78\nSenegal\n45,08\n67,91\nSingapur\n48,08\n85,34\nSiria\n46,28\n83,54\nSudáfrica\n48,08\n64,31\nSuecia\n75,13\n147,25\nSuiza\n61,30\n148,45\nTailandia\n39,07\n69,12\nTaiwán\n48,68\n81,74\nTanzania\n30,05\n76,93\nTúnez\n46,28\n51,69\nTurquía\n39,07\n61,30\nUruguay\n41,47\n57,70\nVenezuela\n36,06\n78,13\nYemen\n43,27\n132,82\nYugoslavia\n49,88\n98,57\nZaire/Congo\n54,09\n101,57\nZimbawe\n39,07\n76,93",
  "speaker": "SYSTEM",
  "uuid": "7c90a4c1-7763-43bc-8e64-241347b6846b"
}