{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PlanetData \n\nGenerate mapping ontology, based on Reveltyx work (Feb 2011, Freddy). Provide results here and in PlanetData wiki\nOntology :\nhttp://dl.dropbox.com/u/531378/mappingpedia/mappingpedia-ontology.owl\nReport :\nhttp://dl.dropbox.com/u/531378/mappingpedia/rdb2rdf-mapping-vocabulary-report.pdf\nProvide a catalogue of mappings (March 2011, Freddy/José Mora). Provide results here and in PlanetData wiki\nR2O mappings catalogue :\nMappingPedia\nFreddy (end August 2011). Year 1: Mapping- based Data provisioning (RDB2RDF) tools. Catalogue of these tools (D2R, ODEMapster, etc.) (take it from the W3C RDB2RDF working group)\nYear 1: SPARQL endpoint with populated mapping ontology.\nhttp://mappingpedia.linkeddata.es/sparql\nYear 1: Generate\nhttp://mappingpedia.linkedata.es\n, wiki-style or something like that (scraperwiki-like)\nOSCAR (end August 2011): Generate a best practices document for sensor data provisioning (from WP1, and based on work at AEMET), looking like a use case description like the LATC data provisioning library one\nYear 2: Maintaining mappingpedia + extending this to other data provisioning tools (sensors, excel, etc.)\nYear 2: Think of mapping generation games for generating more stuff into mappingpedia.linkeddata.es (Freddy)\nT4.1. Assembly and maintenance of the PlanetData data set catalogue (Leader: FUB).\n\nGenerate real-time linked open data set. Tasks identified in\nhttp://planet-data-wiki.sti2.at/web/Data_Provisioning#Planet_Data_Vocabularies\n.\nState of the art of OGC Sensor Web Enablement, Pachube, Sensorbase, etc.\nSurvey datasets that provide those services (e.g., OGC SOS services, Pachube, datamarket, infochimps)\nPropose a vocabulary, aligned with CKAN, DataOne proposals, etc., to describe sensor-based datasets.\nMaterial\nDataCite Metadata Scheme (\nhttp://datacite.org/schema/DataCite-MetadataKernel_v2.0.pdf\n)\nDSPL: Dataset Publishing Language (\nhttp://code.google.com/apis/publicdata/\n)\nUpload CKAN descriptions of UPM datasets and inform Pablo Mendes about it\nhttp://geo.linkeddata.es/\nhttp://aemet.linkeddata.es/\nhttp://cultura.linkeddata.es/\nBiodiversity observatory at Spain\nISTAC\nBarcelona and smart Santander\nEOI companies\nAjuntament de Lleida\nProvide ingestion tools to fill in the catalogue automatically from OGC SOS services, Pachube, etc.\nTransformation tools for sensors platform (eg: Pachube) description to SSN Ontology (Spring 2011)\nPachube2RDF\nMaría will be providing a framework for (Linked Data) ontology quality based on the analysis of LOV vocabularies, and will be curating this data. This can be part of the general catalogue, and we will align with Pablo on this.\nThe final product should be a datamarket.com for sensor-based data\nMaterial:\nSSG4Env D5.2v2 (High-level API) + D3.3v2 (registry)\nFreddy will continue pursuing the idea of a \"mappingpedia\" (that is, a catalogue/kb of mappings that people are using) and will feed the data provisioning catalogue.\nAdditional ideas (not to be implemented yet)\nCatalogue of datasets transformed into stRDF ???\nNext steps (year 2 of PlanetData): Semantic catalogue of the IDEE...\nWP 6 Training\n\nT6.1. Training materials and open training infrastructure (Leader: STI2)\n\nCollect UPM materials and categorize them based on PlanetData curriculum.\nContinue video scientific journal (Oscar, together with Elena).\nReferences\n\nGaber, M, M., Zaslavsky, A., and Krishnaswamy, S.,\nMining Data Streams: A Review\n, in ACM SIGMOD Record, Vol. 34, No. 1, June 2005, ISSN: 0163-5808",
  "speaker": "SYSTEM",
  "uuid": "7cce8c8d-79ef-4dee-bac2-0d261613d773"
}