{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Observatorio \n\nContents\n[\nhide\n]\n1\nMiembros\n2\nDocumentos de trabajo\n3\nReuniones\n3.1\n2013.03.19\n3.2\n2013.04.04\nMiembros\n\nGrupo creado el 2013.03.19\nRaúl G., Dani V., María P., Víctor R.\nDocumentos de trabajo\n\n(o links a documentos de trabajo)\nHow to describe test data for the SEALS Test Data Repository\nExisting data catalogs\n¿Cómo nos interesa describir los recursos?\n¿Qué resultados de cada análisis queremos conservar para cada recurso?\n¿Cuáles y cómo son los parámetros de calidad contra los que querríamos comparar los resultados?\nReuniones\n\n2013.03.19\n\nDiscusión:\nDani V. nos presenta su visión de observatorio, con un bloque de \"data collection\", y otro de \"data analysis\" que genera\nresults\nslidedani\nMaría P. quiere observar datasets y almacerlo como DataCubes\nVíctor R. describe su interés en estudiar licencias de ontologías y datasets.\nRaúl expone Seals\nslidesseals\nAcordamos que adoptar Seals es un\noverhead\nmuy importante (BPEL? BPMN?) pero que la uniformización del concepto resultado es muy interesante. Un aspecto clave de Seals es la reproducibilidad de los experimentos, y eso implica hacer snapshots de los datos. No concretamos exactamente cómo lo haremos.\nAcciones:\n@TODOS: Describir los aspectos de los datasets/ontologías que nos interesan y ver si nos basta con usar VOID\n@TODOS: Describir los resultados que nos interesan (una lista de propiedades?)\n@TODOS: Describir los parámetros de calidad contra los que habría que comparar los resultados anteriores (menos urgente).\n2013.04.04\n\nMaría, DaniV, RáulG, Víctor\nDiscusión\nDaniV y Raúl abogan por que usemos conjuntamente el esquema de DCAT, en detrimento de VoiD\nEstamos de acuerdo en que nos podemos beneficiar mutuamente dello\nDebatimos sobre el campo \"fecha\" pero no me entero bien\nVíctor pide que se añadan más fuentes de datos (o fuentes de fuentes de datos)\nAcciones\n@TODOS: Dar ejemplo con algunos triples de DCAT y ponerlos en la Wiki.\n@TODOS: Rellenar más fuentes de datos\nSiguiente reunión a la misma hora la semana que viene.",
  "speaker": "SYSTEM",
  "uuid": "7d4a2f65-23ee-4265-abdb-1183633771a9"
}