{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 12\nTítulo: A semantic web page linguistic annotation model. Formando parte del libro Semantic Web Meets Language \nResources. \n \nRef.   \n revista  \n \n  Libro: \nClave: A  \nVolumen:  \nPáginas, inicial: 20      \nfinal: 29   \n \nFecha: 2002 \nEditorial (si libro): American Association for Artificial Intelligence (AAAI Press)     ISBN: 1-57735-169-x \nLugar de publicación: Menlo Park. California (USA) \n \nAutores (p.o. de firma): Aguado de Cea, G., Durán Escribano, P. (eds.) \nTítulo: La investigación en lenguas aplicadas: enfoque multidisciplinar. \n \nRef.   \n revista  \n \n  Libro: \nClave: E  \nVolumen:  \nPáginas, inicial: 1 final: 173  \n \nFecha: 2001 \nEditorial (si libro): Fundación Gómez Pardo, Universidad Politécnica de Madrid.    ISBN 84-95063-16-6. \nLugar de publicación: Madrid \n \nAutores (p.o. de firma): Aguado de Cea, G., Durán Escribano, P. (eds.) \nTítulo: Panorama de la investigación en lenguas aplicadas en España. Formando parte del libro La investigación en lenguas \naplicadas: enfoque multidisciplinar. Aguado de Cea, G., Durán Escribano, P. (eds.).  \nRef.   \n revista  \n \n  Libro: \nClave: A  \nVolumen:  \nPáginas, inicial: 9  \nfinal: 24  \nFecha: 2001 \nEditorial (si libro): Fundación Gómez Pardo, Universidad Politécnica de Madrid   ISBN 84-95063-16-6. \nLugar de publicación: Madrid \n \nAutores (p.o. de firma): Bernardos Galindo, S., y Aguado de Cea, G. \nTítulo: Adapting the Generalized Upper Model to Spanish. Formando parte del libro Recent Advances in Natural Language \nProcessing. \nRef.   \n revista  \n \n  Libro: \nClave: CL \nVolumen:  \nPáginas, inicial: 103 \nfinal: 107  \n \nFecha: 2001 \nEditorial (si libro): The Bulgarian Association for Computacional Linguistics.  ISBN 954-90906-1-2 \nLugar de publicación: Tzigov Chark, Bulgaria \n \nAutores (p.o. de firma): Bernardos Galindo, S. y Aguado de Cea, G. \nTítulo: Reutilización y adaptación de la ontología GUM al castellano. Formando parte del libro Actas de la IX Conferencia de \nla Asociación Española para la Inteligencia Artificial (CAEPIA 2001). \n \nRef.   \n revista  \n \n  Libro: \nClave: A  \nVolumen:  \nPáginas, inicial: 563 \n \nfinal: 572  \nFecha: 2001 \nEditorial (si libro): Asociación Española para la Inteligencia Artificial  \nISBN: 84-932297-0-9 \nLugar de publicación: Gijón \n \nAutores (p.o. de firma): Bernardos Galindo, S. y Aguado de Cea, G. \nTítulo: A New Approach in Building a Corpus for Natural Language Generation System. Formando parte del libro \nComputational Linguistics and Intelligent Text Processing. Gelbukh, A. (ed.): \n \nRef.   \n revista  \n \n  Libro: \nClave: CL \nVolumen:  \nPáginas, inicial: 216 \nfinal: 225  \n \nFecha: 2001 \nEditorial (si libro): Springer-Verlag (LNCS)  \n ISBN 3-540-41687-0 \nLugar de publicación: Mexico City, Mexico \n \nAutores (p.o. de firma): Aguado de Cea, G., y Pareja Lora, A \nTítulo: A Competition Model for the Generation of Complementation Patterns in Machine Translations. Publicado en la revista \nInternational Journal of Translation. Bahri, U.S. (ed.). \n \nRef.   \n revista  \n \n  Libro: \nClave: A  \nVolumen: 12 \nPáginas, inicial: 25  \nfinal: 37  \n \nFecha: 2000 \n",
  "speaker": "SYSTEM",
  "uuid": "7dbb6933-8111-4b0f-9059-0e3739b4a961"
}