{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 73\n71\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nis an open source platform, Cunei, which enables developers to build their own example based MT engine\n(similar to the Apertium platform for rules based translation). Most translation engines in development and\ncommercial use today are statistical or hybrid systems. \nProducts and Practitioners\nExample based machine translation is not available as a stand‐alone commercial product or service, but you\ncan find two open source projects: Cunei and Marclator. These are open source projects, and are only suit‐\nable for expert software developers and system administrators, as they are not turnkey solutions designed\nto be touched by end users. They are great for experimental use, but if you are looking for user‐ready plat‐\nform, look for statistical machine translation platforms.\nStatistical\nStatistical machine translation is currently the gold standard for machine translation, and is used by the most\npopular translation engines in use today. The process works by training the translation engine with a very\nlarge volume of parallel texts (source texts and their translations), as well as monolingual corpora. The sys‐\ntem looks for statistical correlations between source texts and translations, both for an entire segment, but\nalso smaller phrases, or N‐grams, within each segment. It then generates confidence scores for how likely it\nis that a given source text will map to a translation. The translation engine itself has no notion of rules or\ngrammar. \nThe key advantage of statistical machine translation is that it eliminates the need to handcraft a translation\nengine for each language pair, as is the case with rules based translation. Provided you have a large enough\ncollection of texts, you can train a generic translation engine for any language pair. \nThe main disadvantage of statistical machine translation is that it fails when it is presented texts that are not\nsimilar to material in the training corpora. For example, a translation engine that was trained using techni‐\ncal texts will have a difficult time translating texts written in casual style. Therefore, it is important to train\nthe engine with texts that are similar to the material you will be translating on an on‐going basis. Even with\nlarge and suitable training corpora, statistical machine translation does not generally produce publication\nquality text. It frequently translates items out of context or uses the wrong word order. However, it general‐\nly translates well enough that it is suitable for comprehension. If you need publication quality translation,\nyou’ll want to have some sort of human review and post‐edit process, which many commercial MT engines\nprovide as an option.\nProducts and Practitioners\nMany companies offer statistical machine translation, among the key providers are:\n• AsiaOnline (customized engine): AsiaOnline provides statistical machine translation as a hosted service\nfor corporate clients. They distinguish themselves by providing custom MT engine that have been\ntrained with the customer’s texts, in addition to standard sources of training corpora. \n• BeGlobal (SDL): BeGlobal is SDL’s machine translation offering. Derived from its acquisition of Language\nWeaver several years ago, BeGlobal enables users to combine machine translation with professional\ntranslation and post‐editing. A common workflow is to machine translate a text on the first pass, and\nthen have human translators and editors review the output and correct it. These corrections can, in\nturn, be fed back into the translation memory to further train it.\n• Google Translate (free): Google offers a free web translation service that is based on its own translation\nengine and research. The service can translate to and from over 50 languages, and is regarded as a\nbenchmark for translation quality for non‐specialized translation engines. \n",
  "speaker": "SYSTEM",
  "uuid": "7dc15fda-dc80-499f-9d6f-655c3af62f85"
}