{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 5\n \n \n5\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \nEl beneficiario de estas ayudas queda asimilado a trabajador por cuenta ajena, a los \nefectos de su inclusión en el Régimen General de la Seguridad Social, con la única \nexclusión, durante el período de beca, de la protección por desempleo, tal como se \nestablece en la disposición adicional primera del R.D. 63/2006  \nEstas ayudas, en su fase de beca, se encuentran exentas de las retenciones del \nImpuesto sobre la Renta de las Personas Físicas, según establece el art. 7, letra j) de \nla Ley 35/2006, del IRPF. \nEl coste de las aportaciones de la cuota empresarial a la Seguridad Social, será \nfinanciado por la Universidad Politécnica de Madrid, de acuerdo a los tipos de \ncotización y bonificaciones que correspondan para cada anualidad. \nLos efectos económicos, administrativos y alta en la Seguridad Social, se producirán \npor mensualidades completas con referencia a la situación de derecho del beneficiario \nsiempre y cuando se acredite en el documento justificativo de este extremo que han \niniciado sus funciones en los primeros días del mes que corresponda, para su \nincorporación en el centro receptor.  \nLa percepción de la beca en el mes de su finalización se hará con efectos del último \ndía que figure en la renovación siempre y cuando no se produzca la renuncia con \nanterioridad a esa fecha o existan otras causas de revocación o baja. En el supuesto \nexcepcional de incorporación o baja en fechas diferentes a las señaladas, el importe a \npercibir en ese mes será proporcional al período cubierto desde esa fecha. \n \n4.2. La financiación de estas ayudas correrá a cargo del programa 519 del presupuesto de \ngastos de la UPM.   \n \nQUINTO.-  PRESTACIONES COMPLEMENTARIAS \n5.1. Estancias breves.- El Rector podrá autorizar a los beneficiarios de estas ayudas, \nprevio informe favorable del Director y el VºBº del responsable de la Escuela, Facultad, \nCentro I+D o Instituto, a realizar una estancia temporal en otra Universidad o \nInstitución, tanto española como extranjera, con objeto de completar su formación, \npara la que se financiará hasta un máximo de tres meses al año y un mínimo de tres \nsemanas, en los términos que permitan las disponibilidades presupuestarias y acuerde \nel Vicerrectorado de Investigación, con cargo a cualesquiera  fondos públicos o \nprivados.   \nSe dará prioridad a las estancias de duración de un mínimo de tres meses cuando \nestén ligadas a acuerdos de obtención del Doctorado Europeo, siempre que la \nfinanciación correspondiente al período adicional de la estancia sea cubierta por el \nGrupo, Departamento, Centro o Instituto de adscripción del beneficiario. \nLas estancias podrán realizarse, tanto en el período de beca como en el de contrato, \nsegún las condiciones establecidas en la Resolución Rectoral dictada a tal efecto y \nque se publicará a primeros del año 2010, estableciéndose en ella dos períodos de \npresentación de solicitudes. \n",
  "speaker": "SYSTEM",
  "uuid": "7dd6e8bb-a9ba-411f-a9e9-ef9c873f972c"
}