{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 4\nBodil Nistrup Madsen & Hanne Erdman Thomsen  \ncation of both superordinate concepts. Polyhierarchy is only allowed, if the \ntwo superordinate concepts of the subordinate concept belong to two differ-\nent groups, i.e. if they fall within two different subdividing dimensions.  \nFigure 2 shows an example of dimension specifications for the concept \nprevention from Figure 1. This is a facility that we use in the CAOS proto-\ntype. Here the values associated with the corresponding attributes on the sub-\nconcepts of the concept prevention are specified, and the dimension specifica-\ntions written in bold face are subdividing dimensions. \n \nFigure 2: Dimension specifications for the concept “prevention”4\n \n Subdividing dimensions must be chosen in such a way that each sub-\nordinate concept has one and only one feature specification containing as an \nattribute a subdividing dimension of the superordinate concept. That is, \nthere can be no overlapping subdividing dimensions. A primary feature \nspecification containing a subdividing dimension as an attribute is called a \ndelimiting feature specification. Thus, a concept may contain one and only \none delimiting feature specification. The concept selective prevention in \nFigure 1 could have been characterized by two feature specifications: \n\"TARGET GROUP: population\" and \"ARENA: risk environment\", but only \none of these, \"TARGET GROUP: population\", is delimiting. In terminology \nwork this is the delimiting characteristic to be used in definition writing. \n In the following sections we will use the principles of terminological on-\ntologies for describing concepts in an ontology. \n \n2 Classification of ontologies – examples  \n \nMany authors have proposed classifications or categorizations of ontolo-\ngies. One example is Gómez-Pérez et al. (2003:25 ff), who collect the classi-\nfications of various other authors, i.e. Mizoguchi et al. (1995), van Heijst et \nal. (1997), Guarino (1998) and Lassila & McGuiness (2001). In the following \nwe will first show the ontologies of the four authors as terminological ontolo-\ngies, and then discuss how they can be merged according to terminological \n \n \n4\n \n4 The diagram in Figure 2 is made with the CAOS prototype. \n",
  "speaker": "SYSTEM",
  "uuid": "7e564edb-2c4b-4185-bd00-d9a61bcd88e5"
}