{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MONNET \n\nReunión MONNET en Madrid del 12 al 16 de diciembre de 2011\nResponsable del meeting: Elena Montiel Ponsoda\n- Identificar numero de participantes cada dia que se quedan a comer\n- Identificar necesidades de comida especiales\n- Interactuar entre la  UPM y el consorcio (y conmigo solo si algo está fuera del protocolo)\n- ....\nRaúl Alcázar\n- Solicitar a Juan Carlos el NAS en la sala de Juntas\n- Instalacion de cables, regletas, etc.\n- Envio al responsable del meeting (en este caso Elena) el mensaje de solicitud a parters de las MAC address\n- Papel en inglés de cómo conectarse.\n- Quedarse en la sala un rato hasta que todo esté funcionando el primer rato.\n- Cualquier otra cosa que hiciera en el meeting de seals y que no está escrita.\n- Desmantelar la sala al final del meeting\n- ....\nAna Ibarrola\n- Solicitud de los menús y cafés a Ernesto (Quedate con copia para que siempre sean los mismos)\n- Lunes/martes/... día xx de mes\n       - 8:45  café e infusion en la sala de Juntas para x personas (SIN pasta, zumos y agua). Se recoge a partir de las 11.30\n\n       - xx:xx a yy:yy Comida en el bloque 1 para Z personas (identificar vegetarianos)\n\n       - 13:00: Café e infusiones paraxxx  personas en la sala de juntas. \n\n       - Las personas de los cafés se calcula sumando 10 al numero de personas Z registradas\n- Pedido a Hipercorp  con lo mismo  de SEALS (el extendido)\n- Preguntar al organizador del meeting como va el tema de la cena del proyecto, negociar y reservar.  Precio cena: 40 euros aprox.\nEsther Núñez Vidal\n- Preparar todo a primerisima hora cada dia con el fin de que cuando llegue la gente a las 9 esté todo preparado\n- Carteleria\n- Alguna otra cosa que hiciera en SEAL\nJARG\n- Ayudar a recoger a Alcazar\n-Hacer un doc parecido al de SEALS con el logo OEG diciendo como llegar, recommeded hotels, etc. y subirlo al wiki",
  "speaker": "SYSTEM",
  "uuid": "7fc78fef-862c-4aa3-89b9-960b6b033da0"
}