{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 14\nNotice that the lower precision given by Falcon is in part owing to the fact that Fal-\ncon also aligns the imported ontologies (thus, it aligns the QR vocabulary imported in\nthe models). If the alignment is post-processed and these unnecessary alignments re-\nmoved, precision also reaches 92% (for the reduced representation).\nDiscussion Although these results are not conclusive, they are indicative that the use\nof traditional ontology matching techniques perform well for giving the similarity be-\ntween QR models. Only minor adaptation were required to reuse such techniques for\nthe purposes described in this paper.\n7\nRelated Work\nTo our best knowledge, the approach described in this paper has no counterpart in the\nﬁeld of qualitative modelling [5, 17, 28, 14]. Other modelling and simulation tools, such\nas Betty’s brain [23] or Stella [11] neither ground terms to a common vocabulary, nor\nget quality feedback from other models.\nWith regard to other conceptual modelling techniques beyond QR, CmapTools [9]\nis a software for representing knowledge using such as concept maps [26]. Although\nCmapTools is also intended for collaborative use, it neither relies on Semantic Web\nstandards to maximize its interoperability, nor uses common shared vocabularies to\nminimize the semantic gap between models. In [8] a method for suggesting concepts\nduring concept map modelling based on Web mining techniques is proposed, though an\neffective grounding with external concepts is not performed.\nRegarding the use of semantic techniques to enhance collaborative learning (one\nof the goals of DynaLearn), there have been some speciﬁc efforts, such as the work\ndescribed in [22], where DEPTHS (Design Patterns Teaching Help System) is intro-\nduced. DEPTHS system establishes a common ontological foundation for the integra-\ntion of different existing learning tools and systems in a common learning environment.\nThough our techniques differ, the motivation is along the same lines as our work. Never-\ntheless, DEPTHS focuses on the particular scenario of software engineering education,\nand supports recommendation more than quality feedback.\n8\nConclusions and Future Work\nIn this paper we propose a method for the semantic enhancement of the modelling\nprocess in the ﬁeld of Qualitative Reasoning. Our goal is to support the creation of\nsemantically networked models as a means to share and reuse conceptual knowledge. In\nour approach, QR models are ﬁrst exported into an ontological language and grounded\nto an external common vocabulary. Then, ontology matching techniques are used for\ngetting quality feedback, by identifying pieces of common knowledge across models.\nOur experiments show that the coverage of DBpedia, when used for grounding spe-\nciﬁc domain terminologies, is above other studied resources. We have also shown that\n85% of the covered terms in DBpedia contain suitable meanings according to human\nopinion. Finally, our experiments indicated a good behaviour of the state of the art on-\ntology matching systems when applied for the alignment of QR models.\n",
  "speaker": "SYSTEM",
  "uuid": "806f7072-a6b9-494c-be63-6a01c26fe587"
}