{
  "message": "SYSTEM: QRVocabulary.pdf: Página 9\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n91 / 103 \nA.7: Aggregates \nThere are two kinds of aggregates, namely model fragments and scenarios.  \nAggregates are complex model constituents, as they consist of multiple model \ningredients. \nA.7.1 Model Fragments  \nModel fragments describe part of the structure and behaviour of a system in a general \nway. They are partial models which are composed of multiple ingredients. Model \nfragments have the form of a rule. This means that model ingredients are incorporated \nas either conditions or consequences. Table 3 shows the abilities of ingredients to be \nused as a condition or consequence. As can be seen from the table, model fragments \nthemselves can be reused within other model fragments as conditions. Furthermore, \nsub-classes of model fragments can be made, which augment the parent model \nfragment with new ingredients. The consequence ingredients of model fragments that \nmatch on the actual system situation, will be added to the scenario. In that case, the \nscenario fulfils the conditions specified in the model fragment (which describes a \ngeneral situation). There are three different kinds of model fragments: static fragments, \nprocess fragments, and agent fragments. \nCondition \nThe conditions in a model fragment indicate what things should be true within a \nscenario (or state) in order for the consequences to be true. The model ingredients that \ncan be used as conditions within a model fragment are shown in Table 5. \n \nTable 5: Condition and consequence abilities of QRM ingredients \nPossible conditions \nImpossible conditions \nEntities \nConfigurations \nAgents \nAttributes \nQuantities \nInequalities \nMin/Plus \nAssumptions \nModel Fragments \nCorrespondences \nProportionalities \nInfluences \n \nPossible consequences \nImpossible consequences \nEntities (except in static MF) \nConfigurations (except in static MF) \nAttributes \nQuantities \nInequalities \nMin/Plus \nCorrespondences \nProportionalities \nInfluences \nAgents \nAssumptions \nModel Fragments \n \nConsequence \nConsequences within a model fragment capture the information that is added to a \nscenario when the conditions of the model fragment are fulfilled. The model ingredients \nthat can be used as consequences within a model fragment are shown in Table 5. \n",
  "speaker": "SYSTEM",
  "uuid": "8096afae-9eec-489b-9fe6-b5f7d7d283f1"
}