{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Proyectos_Fin_de_Carrera \n\nExtension of morph-streams with streaming systems like Spark, Google Big Query, Apache Samza, etc.\n(Oscar Corcho) [Propuesto en septiembre 2013]\nDevelopment of an RDF Stream processing framework that combines static and dynamic data. In this thesis, existing frameworks for RDF Stream processing that are being described in the context of the W3C RDF Stream Processing community group will be analysed, so as to select the most suitable framework to start with for the consideration of the combination of static and dynamic RDF data that can be useful for the development of applications in the context of Smart Cities.\nExploiting REST interfaces for query federation over Linked Data streams. In this thesis, existing work on RDF query processing over Linked Data (such as the Linked Data Fragments framework) will be enhanced with the implementation of physical query operators that respect the REST nature of Linked Data interfaces while at the same time provide efficient query processing for static and dynamic RDF data.\nLinked Connections for more efficient public transport routing. Linked Connections is a joint effort with the University of Ghent that has recently received the best demo award at the ISWC2015 conference, and which aims at exploiting REST interfaces for the provision of information about connections that can be done in multimodal transport routes. A set of utilities are expected to be developed in the context of this thesis in order to improve the current framework and extend it to more places in the world where transport data is available (normally in the form of GTFS files, but also as real-time feeds).\nPerfiles de investigadores a partir de sus publicaciones\n(Carlos Badenes-Olmedo): Uso de técnicas de modelado de tópicos junto con PLN y Word Embeddings para la construcción de modelos que permitan caracterizar a los investigadores a partir de sus publicaciones científicas.\nVisualización de tópicos, tendencias y evoluciones en corpus de gran tamaño\n(Carlos Badenes-Olmedo): Construcción de un sistema web que permita explorar las anotaciones derivadas de los modelos de tópicos generados a partir de corpus de gran tamaño.\nSemantic e-Science\n\nCitizen Science\n\nCiencia ciudadana sobre contaminación lumínica. Reponsable: Óscar Corcho [Duración: Septiembre 2016 -> Enero 2017]. El alumno adaptará la aplicación Dark Skies ISS a formato móvil, implementando, si es posible, alguna técnica de gamificación.\nSTARS4ALL: Herramientas de colaboración sobre contaminación lumínica. Reponsable: Óscar Corcho [Duración: Septiembre 2016 -> Enero 2017]. El alumno desplegará e integrará en STARS4ALL alguna herramienta de generación de ideas o colaboración entre ciudadanos. Actualmente está estudiando la herramienta utilizada por el Ayuntamiento de Madrid.\nCreación de contenidos educativos relacionados con eventos astronómicos para estudiantes de primaria y secundaria. Reponsable: Mari Carmen [Duración: Septiembre 2016 -> Enero 2017]. El alumno desarrollará una aplicación móvil para medir la actividad durante las lluvias de estrellas (Gemínidas, Perseidas, etc ...) desde su localización o viendo nuestra retransmisión por Youtube. Esta actividad está inspirada en una propuesta del IMO (International Meteor Organizationg)\n[8]\n.\nLinguistic Linked Data\n\n1.\nConstrucción de una interfaz de acceso a datos enlazados ligüísticos\n. La Terminoteca RDF es un dataset de terminologías multilingües (Terminesp, Termcat) enlazadas según el paradigma de los Datos Enlazados (Linked Data). Este proyecto pretende integrar distintas terminologías en un único grafo para así ofrecer un único punto de entrada a los datos. De esta manera, se puede navegar y buscar información terminológica procedente de distintas fuentes y desarrollada de manera independiente. Los datos se encuentran modelados en RDF siguiendo el modelo Lemon-OntoLex. Terminoteca RDF tiene una interfaz web y un SPARQL-endpoint con algunas consultas de ejemplo. La interfaz web es muy básica y no permite visualizar todos los datos disponibles en Terminoteca RDF, no es intuitiva, y no permite hacer búsquedas complejas al usuario que no conoce el lenguaje de consulta SPARQL. El proyecto consistirá en construir la interfaz de consulta de la Terminoteca RDF de forma que permita al usuario consultar toda la información disponible en el grafo (traducciones, definiciones, fuentes, notas de uso, normas terminológicas). Algunas de las funcionalidades de la nueva interfaz serán\nla ejecución de consultas complejas con SPARQL en el backend a partir de los filtros que proporcione el usuario en el front-end. Se proporcionará a alumno una serie de pautas y de conjuntos de combinaciones posibles.\nla visualización de los resultados de estas consulta en formato de tabla o grafo\nObjetivos:\nAdquisición de conocimientos básicos de RDF y SPARQL\nFamiliarización con el modelado de contenido lingüístico como Linguistic Linked Data mediante estándares de-facto\nCreación de la nueva interfaz\nImplementación y evaluación\nSe aconseja conocimientos de: Diseño web, HTML + CSS, JAVA, J2SE/J2EE, JSP, PHP.\nLos conocimientos básicos de SPARQL y Datos Enlazados resultarán igualmente muy útiles, aunque no son necesarios a priori.\nEl alumno ganará experiencia en el uso de tecnologías de la Web Semántica y adquirirá las principales nociones de los datos lingüísticos enlazados (Linguistic Linked Data).\n[Julia Bosque Gil]\n2.\nConstrucción del portal de Datos Lingüísticos Enlazados del Ontology Engineering Group\n. El portal de Datos Lingüísticos Enlazados del Ontology Engineering Group reúne una serie recursos lingüísticos pasados por el grupo de investigación al formato Resource Description Framework de la Web Semántica. No obstante, el portal está anticuado: la búsqueda de recursos no es intuitiva, existen páginas huérfanas, hay problemas gráficos y el mantenimiento resulta difícil. Este proyecto consiste en la construcción del portal para albergar, dar acceso y visualizar todo el trabajo del Ontology Engineering Group en la línea de Datos Enlazados Lingüísticos. Se proporcionarán al alumno todos los datos necesarios relacionados con el contenido, su organización/disposición, y las funcionalidades requeridas. La principal de ellas es el fácil mantenimiento: el portal debe permitir añadir contenido (referencias bibliográficas, artículos en PDF) y la creación de nuevas páginas de manera intuitiva. Se aconsejan conocimientos de: Diseño web,HTML, CSS, Java, etc.\n[Julia Bosque Gil]\n​",
  "speaker": "SYSTEM",
  "uuid": "80d9c95e-4351-4e0b-b5bd-037fd3bb0e5d"
}