{
  "message": "SYSTEM: ISWC13jmora.pdf: Página 60\nIntroduction\nState of the art\nAnalysis\nResults\nConclusions\nReferences\nREFERENCES I\nDiego Calvanese, Giuseppe De Giacomo, Domenico Lembo, Maurizio Lenzerini, and Riccardo Rosati. Tractable reasoning and efﬁcient query answering in\ndescription logics: The DL-Lite family. Journal of Automated Reasoning, 39(3):385–429, October 2007. doi: 10.1007/s10817-007-9078-x. URL\nhttp://dx.doi.org/10.1007/s10817-007-9078-x.\nAlexandros Chortaras, Despoina Trivela, and Giorgos Stamou. Optimized query rewriting for OWL 2 QL. In Nikolaj Bjørner and Viorica\nSofronie-Stokkermans, editors, Automated Deduction – CADE-23, volume 6803, pages 192–206. Springer Berlin Heidelberg, Berlin, Heidelberg, 2011.\nISBN 978-3-642-22437-9. URL http://www.springerlink.com/content/g8153m783k638210/.\nThomas Eiter, Magdalena Ortiz, Mantas \\vSimkus, Trung-Kien Tran, and Guohui Xiao. Query rewriting for horn-SHIQ plus rules. In Proc. of the 26th AAAI\nConference on Artiﬁcial Intelligence, AAAI, 2012. URL\nhttp://www.aaai.org/ocs/index.php/AAAI/AAAI12/paper/viewPDFInterstitial/4931/5263.\nGeorg Gottlob, Giorgio Orsi, and Andreas Pieris. Ontological queries: Rewriting and optimization (extended version). arXiv:1112.0343, December 2011.\nURL http://arxiv.org/abs/1112.0343.\nMartha Imprialou, Giorgos Stoilos, and Bernardo Cuenca Grau. Benchmarking ontology-based query rewriting systems. In Proceedings of the Twenty-Sixth\nAAAI Conference on Artiﬁcial Intelligence, AAAI, 2012. URL\nhttp://www.aaai.org/ocs/index.php/AAAI/AAAI12/paper/viewPDFInterstitial/4910/5270.\nJose Mora and Oscar Corcho. Engineering optimisations in query rewriting for OBDA. In Proceedings of the 9th International Conference on Semantic Systems,\nICPS, pages 41–48, Graz, Austria, September 2013. ACM.\nH´ector P´erez-Urbina, Ian Horrocks, and Boris Motik. Efﬁcient query answering for OWL 2. In The Semantic Web - ISWC 2009, volume 5823 of Lecture Notes in\nComputer Science, pages 489–504. Springer, 2009. URL http://dx.doi.org/10.1007/978-3-642-04930-9_31.\nRiccardo Rosati. Prexto: Query rewriting under extensional constraints in DL-Lite. In Elena Simperl, Philipp Cimiano, Axel Polleres, Oscar Corcho, and\nValentina Presutti, editors, The Semantic Web: Research and Applications, volume 7295 of Lecture Notes in Computer Science, pages 360–374. Springer Berlin\n/ Heidelberg, 2012. ISBN 978-3-642-30283-1. URL http://www.springerlink.com/content/1j61g52j78525175/abstract/.\nRiccardo Rosati and Alessandro Almatelli. Improving query answering over DL-Lite ontologies. In Fangzhen Lin, Ulrike Sattler, and Miroslaw\nTruszczynski, editors, Proceedings of the Twelfth International Conference on the Principles of Knowledge Representation and Reasoning. AAAI Press, 2010. URL\nhttp://dblp.uni-trier.de/db/conf/kr/kr2010.html.\nT. Venetis, G. Stoilos, and G. Stamou. Query rewriting under query extensions for OWL 2 QL ontologies. In The 7th International Workshop on Scalable\nSemantic Web Knowledge Base Systems (SSWS 2011), page 59, 2011. URL\nhttp://iswc2011.semanticweb.org/fileadmin/iswc/Papers/Workshops/SSWS/SSWS2011-Proceedings.pdf.\njmora@fi.upm.es\nEvaluating OBDA query rewriting\nBoadilla - October 10, 2013\n16 / 17\n",
  "speaker": "SYSTEM",
  "uuid": "81ef0666-a57f-4068-9ef4-33a6f66613f0"
}