{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 5\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \n8. Los costes derivados de la participación en la convocatoria correrán a cargo de los \nparticipantes. \n9. Las propuestas se podrán presentar en cualquier momento a partir de la fecha de inicio \nindicada en la presente convocatoria, y siempre que ésta permanezca abierta. \nQuinto. Aplicación de los principios de transparencia, igualdad de trato y no discriminación ni \nfalseamiento de la competencia. \nLa participación en la Consulta Preliminar al Mercado, los contactos mantenidos con los \nparticipantes o los intercambios de información se regirán bajo los principios comunitarios de \ntransparencia, igualdad de trato y no discriminación, sin que puedan tener como efecto restringir \no limitar la competencia, ni otorgar ventajas o derechos exclusivos. Su inobservancia podrá ser \nconsiderada como infracción. A tal efecto, la Secretaría de Estado para la Sociedad de la \nInformación y la Agenda Digital tomará las medidas apropiadas para garantizar el mantenimiento \nde los citados principios, tanto en el desarrollo de esta convocatoria como en cualquier \nprocedimiento de contratación posterior. \nLa participación en la Consulta Preliminar al Mercado no otorgará derecho ni preferencia alguna \nrespecto de la adjudicación de los contratos que puedan celebrarse con posterioridad en el \námbito del objeto de esta Resolución, y como consecuencia de ello, no conlleva ninguna \nobligación de financiación o aceptación de las propuestas presentadas. \nDurante el desarrollo de la consulta se publicará la información relativa a los avances (Fichas \navances de proyectos). \nFinalizada la consulta, se publicará con suficiente antelación, en el citado sitio web el denominado \n“mapa de demanda temprana” de las futuras contrataciones que se pretendan convocar, a los \nefectos de informar al mercado para que pueda preparar las oportunas ofertas, y facilitar la \nplanificación y la reducción del riesgo. \nSi se considerara de necesario, se podrá contactar con participantes concretos para recabar más \ninformación sobre su propuesta, aclarar dudas o solicitar demostraciones. \nAsimismo se podrán realizar jornadas informativas, reuniones con los participantes, y \ncualesquiera otras actuaciones de comunicación y difusión que se estimen oportunas. \nSin perjuicio del empleo de otros canales, toda la información actualizada sobre la consulta estará \ndisponible en la página web del Plan de Impulso de las Tecnologías del Lenguaje. \nSe hará pública aquella información intercambiada con los participantes en el marco de esta \nconvocatoria que garantice el cumplimiento de los principios de transparencia, igualdad de trato y \nno discriminación. Esta información se publicará mediante fichas de avance, jornadas públicas, \ndocumentos de información, mapas de demanda temprana u otros medios destinados a tal efecto \npor la Secretaría de Estado para la Sociedad de la Información y la Agenda Digital. Dicha \ninformación se hará pública, al menos, a través del sitio web antes citado. \nSexto. Plazo y actualizaciones de la Consulta Preliminar al Mercado. \nEl plazo para la presentación de propuestas comenzará el día siguiente al de publicación de esta \nResolución en el Boletín Oficial del Estado. \nLa Secretaría de Estado para la Sociedad de la Información y la Agenda Digital podrá publicar \nactualizaciones de la presente resolución con la incorporación de retos en otros ámbitos \nsectoriales, de nuevos retos en los ámbitos ya identificados o con una reformulación de los retos \npublicados fruto de la evolución del propio proceso de consulta al mercado. Se avisará de estas \n",
  "speaker": "SYSTEM",
  "uuid": "8280028f-84e9-4d1d-80f3-277f8f3cbec9"
}