{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 69\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 69 of 124\nTable 4.5: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nsnowﬂake data model(continued)\nSlot\nValue\nGeneral\n1. Identify the different classiﬁcation scheme item groups, Gi, i.e. entities, and create a\nclass for each entity, Ci.\n2. If there is a relationship between the entity classes then create it as an ad-hoc binary\nrelation, ri ∈R.\n3. If there is a super-class for the new entity related classes then create it and set the\nappropriate subClassOf relation between the entity classes and the super-class.\n4. For each classiﬁcation scheme item, cei on each entity of the snowﬂake model, cre-\nate an instance of the appropriate entity class, Ij.\n5. If you have created an ad-hoc binary relation between the entity classes then you\nhave to create the relation instance between the entity class instance.\nExample\n1. Create a COUNTRY class for the ISO 3166-1 Countries entity and a REGION class\nfor the ISO 3166-2 Subdivisions entity.\n2. Create the hasRegion binary relation with COUNTRY as domain and REGION as\nrange.\n3. Create a LOCATION class and assert that COUNTRY and REGION are subClassOf\nLOCATION.\n4. For each classiﬁcation scheme item on the ISO 3166-1 Countries entity create an\ninstance of the COUNTRY class.\n5. For each COUNTRY instance look for its REGION on the ISO 3166-2 Subdivisions\nentity and create an instance of REGION for each subdivision found. Also create\nan instance of the hasRegion relation associated to the current country instance and\nrelated to the current region instance.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\nPR-NOR-CLLO-04. Pattern for re-engineering a classiﬁcation scheme which follows the ﬂattened data\nmodel\nThe pattern for re-engineering classiﬁcation scheme shown in Table 4.6 suggests a guide to transform a\nclassiﬁcation scheme into a lightweight ontology. The classiﬁcation scheme is modeled with a ﬂattened\ndata model. This pattern aims at creating a lightweight ontology from the classiﬁcation scheme, being the\nsemantics of the relations between classiﬁcation scheme items the subClassOf and ad-hoc relationships.\nTable 4.6: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nﬂattened model\nSlot\nValue\nGeneral Information\nName\nClassiﬁcation scheme to Lightweight Ontology (ﬂattened model)\nIdentiﬁer\nPR-NOR-CLLO-04\nType of Component\nPattern for Re-engineering Non-Ontological Resources (PR-NOR)\nUse Case\nGeneral\nRe-engineering a classiﬁcation scheme which follows the ﬂattened model to design a\nLightweight Ontology.\nExample\nSuppose that someone wants to build a lightweight ontology based on the ISTAT7 standard\ncalled Codes and Names of geographical areas, provinces and regions. This standard fol-\nlows the ﬂattened data model.\nPattern for Re-engineering Non-Ontological Resources\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "82a02152-ecd3-40e9-8601-b50c10d28b0c"
}