{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PlanetData-DataProvisioningTools \n\nContents\n[\nhide\n]\n1\nR2O\n2\nODEMapster 1\n3\nSPARQL-CQ\n4\nODEMapster++\n5\nODEMapster2\n6\nODEMapster NTK Plugin\n7\nMorph\nR2O\n\nA declarative mapping language between RDB and RDF in XML format. Main characteristics are\nConcept Mapping. Mapping between data source (table, view) to a concept in RDF\nAttribute Mapping. Mapping between data source (column, expression) to a data property in RDF\nRelation Mapping. Mapping between data source (column, expression) to a object property in RDF\nConditional Expression. Expressions that have to be satisfied (evaluated to true) in order for mappings to be evaluated\nTransformational Expression. Expressions that transform one value to another value\nReference : Barrasa PhD thesis\nODEMapster 1\n\nAn engine that processes R2O mappings into SQL. This engine works in a batch mode or query driven mode.\nBatch mode. occurs when no query is defined so the engine evaluates the whole mappings.\nQuery driven mode. Occurs when a query in form of ODEMQL is defined.\nReference : Barrasa PhD thesis\nSPARQL-CQ\n\nA formalism of a class of SPARQL that is suitable to be used in the context of RDB2RDf domain, which gives polynomial time complexity when evaluated.\nReference : Fransisco Master thesis\nODEMapster++\n\nA extension model of R2O and ODEMapster that works with multiple databases. An engine that integrates the multiple databases, called Distributed Query Processor, is added to the original ODEMapster.\nReference : Freddy master thesis\nODEMapster2\n\nAn engine that process R2O mappings and generates the appropriate SQL. Similar purpose with ODEMapster, with some difference\nBatch mode. This mode is evaluated in stream mode, which unlike ODEMapster 1, doesnt process everything in memory\nQuery driven. This mode takes SPARQL query instead of ODEMQL. The algorithm is the adaptation of Cheboko's algorithm to R2O\nQuery Rewriting. This mode takes an ontology, a SPARQL query and optionally a set of mappings to which the query should be restricted and rewrites the original query into (possibly multiple) queries that are evaluated against the database.\nReference : Chebotko DKE journal 2009, Jose Mora Query Rewriting\nODEMapster NTK Plugin\n\nA graphical user interface that works under NeOn Toolkit that permits users to create R2O Mappings using drag and drop approach. This interface works with ODEMapster 1 and ODEMapster ++\nMorph\n\nA engine that takes R2RML mapping document.\nReference : R2RML specification",
  "speaker": "SYSTEM",
  "uuid": "837f4eb1-833d-4a37-9af6-34fc23b2f6db"
}