{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 8\n \n \n8\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \nOCTAVO.-  SEGUIMIENTO \n \n8.1. Para realizar el seguimiento del trabajo realizado durante la ayuda por el personal \ninvestigador en formación, se deberá presentar en el Servicio de Investigación los \nsiguientes informes, que se encuentran en la página web de investigación:  \na) En el período de beca, un mes antes de finalizar el primer y segundo año, se \npresentará un informe, una vida laboral y documento que acredite la vinculación al \nprograma de doctorado, para proceder a la renovación de la misma. En el caso de \nlos extranjeros deberán aportar también la tarjeta de identidad de extranjeros en \nvigor. \nb) En el período de contrato, un mes antes de finalizar el primer año del mismo, se \npresentará un informe de seguimiento y una vida laboral. \nc)  Al finalizar la ayuda, en el plazo de un mes, se entregará el informe final. \n \nNOVENO.-  TRANSICIÓN DEL PERÍODO DE BECA AL DE CONTRATO \n \n9.1. Cuando el beneficiario de la ayuda en período de beca cumpla los requisitos para \npasar al contrato en prácticas, éste deberá formalizarse de forma inmediata sin que \nexista interrupción en la actividad.  \n9.2. Si al término del período de beca el beneficiario no cumpliera con los requisitos para \nformalizar el contrato en prácticas, tendrá un período máximo de cuatro meses para \npoder acreditarlos. Dicho tiempo no será recuperable en el período de contrato. Si al \ntérmino de dicho período no consiguiera cumplir dichos requisitos perderá los \nderechos a la continuidad de la ayuda. \n9.3. Como se indica en el Art. 3.1.b), con carácter excepcional, se podrán formalizar \ncontratos de trabajo en prácticas sin necesidad de tener el Diploma de Estudios \nAvanzados o documento administrativo equivalente, siempre que el CNEAI haya \nevaluado positivamente la actividad del beneficiario, según lo estipulado en la Orden \n2657/2008. \n \nDÉCIMO.-  DERECHOS Y OBLIGACIONES DE LOS BENEFICIARIOS DE LAS \nAYUDAS \n \n10.1. Los beneficiarios que desarrollarán su labor con dedicación a tiempo completo (35 \nhoras semanales), quedan obligados a seguir el programa de formación y el plan de \ntrabajo presentados, bajo la supervisión del Director, con la dedicación y \naprovechamiento que éste considere adecuados, pudiendo suspenderse o retirarse la \nayuda de beca o contrato, en caso contrario, por el Vicerrectorado de Investigación de \nla Universidad Politécnica de Madrid. \nEl Director, con independencia del preceptivo informe anual indicado en el  artículo \n8.1., podrá emitir informe sobre el beneficiario en cualquier momento o cuando sea \nrequerido para ello por el Vicerrectorado de Investigación. \n",
  "speaker": "SYSTEM",
  "uuid": "8394daa7-bc98-42c0-a99e-2e9cdcf798ac"
}