{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SemWew2010 \n\nThe MediaEvent Services GmbH, one of our spin-offs, is looking for a Semantic Web Developer (m/f) in Berlin for a joint project with the Web-based Systems Group at Freie Unviersität Berlin and ontoprise GmbH, Karlsruhe, within the scope of Vulcan Inc.'s Project Halo.\nThe SMW-LDE project extends the SMW+ Semantic Enterprise Wiki with a Linked Data import workflow, enabling the use of data from the global Linked Data Web within SMW+. The technology will be initially deployed in an integrated portal for biomedical data.\nYour tasks:\n- Integration and extension of Java and PHP components that perform import, transformation and identity resolution of Linked Data\n- Development of JavaScript-based editors\n- Import and interlinking of biomedical datasets\nYour profile:\n- Solid Java and PHP skills; optionally Scala\n- Prior experienced with JavaScript and common frameworks is desirable\n- Diploma in computer science, related apprenticeship or several years of work experience\n- Prior biomedical knowledge is a plus\nExperience with Semantic Web and Linked Data technologies is not imperative, as we will provide in-depth training.\nThe MediaEvent Services GmbH offers an open, professional and informal working environment, experienced colleagues and team play. Candidates must be reliable and possess good English skills.\nThe position is initially limited until 31.01.2011; with high chances of extension.\nProject partners:\nFounded in 1999, MediaEvent Services develops innovative systems in the digital media field for customers such as Leica Microsystems and Hugo Boss.\nThe Web-based Systems Group at Freie Universität Berlin explores technical and economic questions concerning the development of global, decentralized information environments. Our current research focus are Linked Data technologies for extending the World Wide Web with a global data commons.\nontoprise is a leading independent software vendor for industry-proven Semantic Web infrastructure technologies and products used to support dynamic semantic information integration and information management processes at the enterprise level.\nVulcan Inc. creates and advances a variety of world-class endeavors and high impact initiatives that change and improve the way we live, learn, do business, and experience the world.\nHow to apply:\nPlease send your applications in PDF format to c.becker@mes-info.de, focusing on previous experience in the fields.\nContact\nChristian Becker\nMediaEvent Services GmbH & Co. KG\nStendaler Straße 4\n10559 Berlin\nTel. +49 (6441) 870 87-22\neMail c.becker@mes-info.de\nWeb\nhttp://mediaeventservices.com",
  "speaker": "SYSTEM",
  "uuid": "839c8d61-0014-4f68-a8d8-747e96b11931"
}