{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 16\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97741\npresentar su solicitud en una oficina de Correos, lo harán en sobre abierto para que la \ninstancia sea fechada y sellada por el funcionario de Correos antes de ser certificada.\n5.  La documentación de nueva alta, las solicitudes de ayudas de estancias breves y \nde traslados temporales, así como las memorias de seguimiento y justificativas de la \nrealización de éstas dos últimas, se presentarán ante las universidades o los organismos \nde los que dependen los centros de adscripción de los becarios, quienes con posterioridad \nlas enviarán a la Dirección General de Política Universitaria por el procedimiento indicado \nen el punto anterior.\nArtículo 23.  Subsanación de las solicitudes.\n1.  De conformidad con lo previsto en el artículo 23.5 de la Ley 38/2003, de 17 de \nnoviembre, General de Subvenciones, si la documentación aportada durante el período de \npresentación de solicitudes fuera incompleta o contuviese errores subsanables, se \nrequerirá al solicitante, para que en el plazo de 10 días hábiles subsane la falta o acompañe \nlos documentos preceptivos, con advertencia de que si no lo hiciese, se le tendrá por \ndesistido de su solicitud, previa solicitud que deberá ser dictada en los términos previstos \nen el artículo 71 de la Ley 30/1992 de 26 de noviembre, de Régimen Jurídico de las \nAdministraciones Públicas y del Procedimiento Administrativo Común.\n2.  Dicha comunicación se efectuará mediante publicación en el tablón de anuncios \nde la Dirección General de Política Universitaria, c/ Albacete, número 5, y en la página \nWeb http://www.educación.es, de la relación provisional de solicitudes admitidas y \nexcluidas, con indicación de la causa de exclusión o la necesidad de subsanación.\n3.  Durante el período de subsanación, no se podrán reformular las solicitudes \npresentadas.\nArtículo 24.  Resolución y notificación.\n1.  El órgano instructor recogido en el artículo 21, elevará al órgano competente para \nresolver la concesión de las ayudas la correspondiente propuesta, que se formulará en los \nplazos indicados en los apartados correspondientes a nuevas ayudas, estancias breves y \ntraslado temporal de la beca al extranjero. Los plazos se interrumpirán durante los períodos \npara los que se exija informes de evaluación externa de las solicitudes.\n2.  Las resoluciones de concesión de los diferentes tipos de ayuda, se publicarán en \nel Boletín Oficial del Estado y en la página Web del Ministerio de Educación mediante \nrelación nominal de los beneficiarios y organismos o instituciones a los que se adscriben. \nLas solicitudes no incluidas en las resoluciones de concesión se entenderán denegadas o \ndesestimadas y se publicarán en los tablones de anuncios y en la página Web mencionada, \ncon la indicación expresa de los motivos de denegación, de conformidad con el artículo 54 \nde la Ley 30/1992, de 26 de noviembre, de Régimen Jurídico de las Administraciones \nPúblicas y del Procedimiento Administrativo Común.\nLas universidades y organismos de los que dependan los centros de adscripción de las \nayudas recibirán, igualmente, la relación nominal de beneficiarios y, en su caso, las \ncredenciales para su entrega a los mismos.\n3.  En caso de que no se llevase a cabo la resolución de la concesión de ayudas en \nlos plazos señalados en cada uno de los apartados correspondientes o en su prórroga, se \nentenderán desestimadas las solicitudes. Los interesados estarán legitimados para \nentender desestimadas sus solicitudes. La Resolución pone fin a la vía administrativa.\nArtículo 25.  Publicidad.\n1.  Las ayudas concedidas se publicarán en la página Web del órgano instructor y en \nel «Boletín Oficial del Estado».\n2.  Los beneficiarios deberán hacer pública la cofinanciación por el organismo \nconcedente de la ayuda, y hacer referencia expresa a la financiación por parte del \nSubprograma en las ayudas a la formación de investigadores, contratos laborales, \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "8427dff2-b882-4ea8-bb7a-3a4615b32d5a"
}