{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 87\n85\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nNatural language queries are used to access information in a database. The database may be a base of struc‐\ntured data or a repository of digital texts in which certain parts have been marked as potential answers.\nAs the competition in the search engines is getting harder, more and more companies are combining differ‐\nent search approaches to refine and enhance the results and response time.\nCategorizers and Clustering Engines\nCategorizers and Clustering Engines are tools that provide semantic tagging for content elements using\nmathematical analysis or resources such as taxonomies or ontologies and Mathematical techniques to iden‐\ntify related categories of content. So, clustering engines organize search results by topic, thus offering a com‐\nplementary view to the flat‐ranked list returned by conventional search engines.\nIn a context of growing data, the efficient use of information can’t be achieved unless the right mechanism\nis applied to organize information. This is the main objective of categorizers and clustering engines that auto‐\nmatically cluster results into categories that have been intelligently selected from words and phrases con‐\ntained in search results. Categories help to navigate and access information providing human‐level accuracy.\nThese engines can help companies in several areas: for example, to capitalize expert and domain knowledge\nor to develop legal discovery practices.\nStatistical Algorithms\nStatistical algorithms, such as statistical inference or data mining, provide applications based on automated\nalgorithms for machine translation, machine aided human translation tools, localization tools, information\nretrieval and extraction, question answering, speech recognition, spelling and grammar checking, genera‐\ntion, etc.\nAmong the specific task that the statistical algorithms can provide, we must highlight: automatic summariza‐\ntion, co‐reference resolution, discourse analysis, machine translation, morphological segmentation, named\nentity recognition, natural language generation and understanding, topic and word segmentation, etc.\nSemantic technology\nSemantic technologies provide an abstraction layer from data /content files and application code. It includes\ntools for auto recognition of topics and concepts, information and meaning extraction and categorization.\nThe applications based on semantic technologies can be found in several industries such as healthcare (elec‐\ntronic medical records), finance (regulatory reporting) or emergence response (disease monitoring).\nData Resources\nMany intelligent content applications, and the tools they are built with, rely on underlying linguistic data\nresources such as annotating textual data (morphological categories, constituency and dependency syntac‐\ntic trees, anaphora, discourse structure, word‐sense disambiguation, parallel‐text alignment etc.), lexical\ndata (wordnets, translation dictionaries, valence lexicons etc.) and ontologies. \nAlthough there exist many open repositories for specific linguistic data resources (most of them in English),\nintelligent content providers must create their own specific resources to develop applications. Some of them\nobtain them through shared projects with universities departments, but many times as an internal develop‐\n",
  "speaker": "SYSTEM",
  "uuid": "8446d9ab-9dfb-4884-b452-e9bd9df0b4f0"
}