{
  "message": "SYSTEM: CV-Cicyt_Elena_Mar2016_v1_.pdf: Página 24\n \nAgosto 2011: miembro del comité de programa de pósters y demostraciones de la conferencia internacional \nInternational Semantic Web Conference – ISWC 2011 \n \nAbril 2011: revisora de propuestas en el XXIX congresso de la Asociación Española de Lingüística Aplicada – \nAESLA 2011 \n \nMarzo 2011: miembro del comité de programa del Workshop on Linked Data in Spain celebrado en el marco de la \nconferencia CAEPIA 2011 \n \nJunio 2010: miembro del comité de programa del Simposio Starting AI Researcher Symposium - STAIRS 2010 \n \nMayo 2010: miembro del comité de programa de pósters y demostraciones de la conferencia internacional \nInternational Semantic Web Conference – ISWC 2010 \n \nMayo 2010: revisora de la revista International Journal of Semantic Web and Information Systems - IJSWIS \n \nNoviembre 2009: miembro del comité de programa del área de Procesamiento de Lenguaje Natural de la \nConferencia European Conference on Artificial Intelligence - ECAI2010 \n \nDiciembre 2009: miembro del comité de programa de pósters y demostraciones de la Knowledge Engineering and \nKnowledge Management - EKAW2010 \n \nNoviembre 2008: miembro del comité de programa del workshop en Semantic Web Applications and Perspectives \nSWAP2008  \n \nESTANCIAS EN EL EXTRANJERO DURANTE LOS ESTUDIOS SUPERIORES: \n \nSeptiembre 2000- Febrero 2003: Estudiante de la Hochschule Magdeburg-Stendal, Alemania.  \n \nCurso 1999-2000 (1º cuatrimestre): Participante del programa europeo de intercambio de estudiantes Sócrates-\nErasmus con la Universidad de Middlesex (Middlesex University), Londres, como estudiante de Traducción e \nInterpretación. \n \nCurso 1998-1999 (1º cuatrimestre): Participante del programa europeo de intercambio de estudiantes Sócrates-\nErasmus con la Universidad de Ciencias Aplicadas de Magdeburgo, Alemania, como estudiante de Traducción e \nInterpretación. \n \nOTRAS TITULACIONES ACADÉMICAS: \n \nSeptiembre 2000: Ciclo Superior de Inglés. Escuela Oficial de Idiomas de Alicante. 7 Notable. \n \nSeptiembre 2001: Ciclo Superior de Alemán. Escuela Oficial de Idiomas de Alicante. 7 Notable. \n \nJulio 1999: Título Superior de Valenciano (Grau Superior) de la Junta Qualificadora de Coneixements de Valencià.  \n \nCURSOS Y SEMINARIOS RECIBIDOS: \n \nNoviembre 2012: Curso básico en el manejo de Moodle, organizado por el ICE, Instituto de Ciencias de la \nEducación de la en la Escuela Superior de Ingenieros de Telecomunicación de la UPM. \n \n5 abril 2011: Curso Avanzado en Ontology-based reasoning, dentro del módulo Ciencia de la Computación del \nPrograma Oficial de Posgrado de la Facultad de Informática de la UPM, por el profesor Bernardo Cuenca-Grau. \n \n24 septiembre-5 de octubre 2010: Curso en Aplicaciones del ACPEL Portfolio en el contexto de EEES, organizado \npor el Dpto. de Lingüística Aplicada a la Ciencia y a la Tecnología de la Universidad Politécnica de Madrid. \n \n27-31 agosto 2009: GATE Summer School 2009. En el Natural Language Processing Group de la Universidad de \nSheffield, Reino Unido. \n \n8-10 junio 2009: Cursos Avanzados en “Introduction to Ontological Semantics” y “Multi-Agent Simulation Systems \nfor Clinical Medicine”, dentro del módulo Ciencia de la Computación del Programa Oficial de Posgrado de la \n",
  "speaker": "SYSTEM",
  "uuid": "84824955-176c-4170-8abb-1a26ab546cb3"
}