{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 93\nBÚSQUEDA \n \n93 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nAsí, para obtener una versión de \"primero el menos costoso\" en grafo que asegure \nel hallazgo de un camino solución óptimo debemos modificar expandir-nodo del \nsiguiente modo: \n \nExpandir-nodo (n,ABIERTOS,CERRADOS) --> lista nodos \ne := estado-de-nodo (n) \n(e1, ..., er) := expandir-estado (e) \nlista-nuevos-nodos := () \nDesde i = 1 hasta r hacer \n        coste-auxiliar := coste-arista (e,ei) + valor de g en el nodo n \n \nSi ei aparece en un nodo n' de ABIERTOS \n \n \nentonces Si coste-auxiliar < valor de g en el nodo n' \n \n \n \n \n \n \n \nentonces modificar (destructivamente) en n' las informac. \n \n \n \n \n \n \n \n \n \n \n \npadre : n \n \n \n \n \n \n \n \n \n \n \n \ng : coste-auxiliar \n \n \n \n \n \n \n \n \n \n \n(estas modificaciones alteran ABIERTOS) \n \n \n \n \n \n \n \nsi no : no hacer nada \n \n \nsi no  \nSi ei no está en CERRADOS \n \n \n \n \n \n \nentonces Construir un nodo ni con informaciones: \n \n \n \n \n \n \n \n \n \n \n \nestado de ni : ei \n \n \n \n \n \n \n \n \n \n \n \ng, coste de ni : coste-auxiliar \n \n \n \n \n \n \n \n \n \n \n \npadre de ni : n \n \n \n \n \n \n \n \n \n \nAñadir el nodo así construido a la lista-nuevos-nodos \ndevolver (lista-nuevos-nodos) \nEs muy importante notar que expandir-nodo pasa de ser una función a ser un \nprocedimiento funcional, puesto que los resultados de su evaluación pueden dar \nlugar a dos procesos: modificación (en ocasiones) del parámetro ABIERTOS y \n(siempre) devolución de una lista de nodos nuevos (eventualmente vacía). Las \ncaracterísticas de Common Lisp hacen que al modificar (destructivamente) alguna \nvariable generalizada interna de un elemento que sea miembro de una lista, ésta \nquede automáticamente actualizada, por lo que implementando de modo natural el \nanterior \nalgoritmo \nobtendremos \nel \nresultado \nbuscado. \n(Con \n\"modificar \ndestructivamente\" nos referimos a un proceso que no reconstruya un nuevo nodo, \nsino que modifique la estructura interna, las variables generalizadas, del nodo que \nestá siendo modificado.) Una consecuencia de esta característica es que ABIERTOS \n",
  "speaker": "SYSTEM",
  "uuid": "8488ad9a-ac07-4539-af66-9b31556a1d65"
}