{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 75\nBÚSQUEDA \n \n75 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \n \nTEMA 4. Estrategias de \ncontrol heurísticas \n \n4.1. Heurísticas. \nLos métodos de búsqueda en anchura y en profundidad son denominados métodos \nciegos  de búsqueda. En general, serán muy ineficaces y sin aplicación práctica \ndebido al crecimiento exponencial del tiempo y del espacio que requieren (explosión \ncombinatoria).  \nLos métodos de búsqueda heurística disponen de alguna información sobre la \nproximidad de cada estado a un estado objetivo, lo que permite explorar en primer \nlugar los caminos más prometedores. \nSon características de los métodos heurísticos: \n• \nNo garantizan que se encuentre una solución, aunque existan soluciones. \n• \nSi encuentran una solución, no se asegura que ésta tenga buenas propiedades \n(que sea de longitud mínima o de coste óptimo). \n• \nEn algunas ocasiones (que, en general, no se podrán determinar a priori), \nencontrarán una solución (aceptablemente buena) en un tiempo razonable. \nPodemos decir que los métodos heurísticos sacrifican la completitud (es posible que \nalgunas soluciones se \"pierdan\") al incrementar la eficiencia. En general, los \nmétodos heurísticos son preferibles a los métodos no informados en la solución de \nproblemas difíciles para los que una búsqueda exhaustiva necesitaría un tiempo \ndemasiado grande. Esto cubre prácticamente la totalidad de los problemas reales \nque interesan en Inteligencia Artificial. \nEn cuanto al aspecto algorítmico, el mismo esquema presentado en 3.1 (es la \nversión en árbol; ver 3.5 para la versión en grafo) sirve para las búsquedas \nheurísticas o informadas. La única diferencia es que los pasos 6 (sensibilización de \nlas reglas) y 7 (reorganización de ABIERTOS) se realizan con criterios dependientes \ndel dominio del problema, de modo que el algoritmo tiene cierto conocimiento, que \nutilizará en tiempo de ejecución, sobre el problema concreto que debe resolver. \n",
  "speaker": "SYSTEM",
  "uuid": "85ea8fc1-695f-4930-abe3-fbbad50a2483"
}