{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual10062010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Evaluación Definitiva del proceso de asociación de semántica a etiquetas Sem4Tags.\nSe terminó la recolección de los datos de la campaña de evaluación. En total contamos con las evaluaciones de 40 usuarios. Además, se empezó la escritura del artículo del que se va a enviar al ISWC 2010 describiendo el enfoque y los resultados de la evaluación.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea Integración y patrones de reconocimiento avanzado 2.\nLa salida actual tiene tres componentes: la página HTML inicial enriquecida con las aportaciones mínimas obtenidas a partir del servicio GATE, la composición de la estructura lingüística realizada por TreeTagger esquematizada en RDF basado en una ontología específica de dicho analizador y la incorporación de información semántica obtenida de Sindice. El formato de salida del servicio REST es un documento XML con cada una de las partes anteriormente citadas.\nExisten problemas con peticiones específicas: Token vs NE. El analizador lingüístico necesita tener divididas en tokens las palabras sin embargo, las otras dos partes del modelo de salida se demoran en exceso y, además, se genera demasiada información irrelevante. Se esta trabajando en optimizar las búsquedas.\nBúsqueda y análisis de páginas Web para formar el corpus de pruebas.\nInterfaz Anotación Híbrida\n\n-- Se instalo exitosamente las nueva versión, se han estado trabajando en la conexion a la base de datos y la persistencia, para proveer autentificación a la interfaz de anotación. y ademas guardar información de la Página Anotada y de las minianotaciones realizadas. Para proveer informes.\n-- Se evalua ciertas api sociales para compartir en contenidos en redes sociales.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha instaldo el servidor de WS Axis.\n- Se han desplegado los servicios web de metaplanificación y adaptadores.\nTarea 1.4\n\nPersonal de vacaciones.\nTarea 7.1\n\n- RDF.\n· Continuación del desarrollo de ontologías para nuevos dominios \n      · Continuación de la generación de RDF para otros dominios\n      · Tratamiento de la geometría (bases de datos) para incorporación al RDF",
  "speaker": "SYSTEM",
  "uuid": "86ad5db1-8a6c-40b9-b236-1e81e92b33b9"
}