{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 15\nTerminological Principles used for Ontologies \n \n15\nFurthermore we have briefly discussed the distinction between ontology, \nunderstood as “concept model”, i.e. a model that may be defined as model for \nthe description of knowledge about concepts, and ontology, understood as \n“conceptual data model”, i.e. a formal model for the description of data in an \nIT system. In our opinion this is a very important distinction, and our recom-\nmendation is that the development of a conceptual data model should always \nbe preceded by the elaboration of a concept model. \n \nReferences  \n \nCarpenter, Bob; The Logic of Typed Feature Structures. Cambridge, Mass.: \nCambridge University Press, 1992. \n \nCEN CWA 15045 (2004). Multilingual Catalogue Strategies for eCommerce \nand eBusiness. \n  \nDIN 2331 (1980) Begriffssysteme und ihre Darstellung, Berlin. \n \nGómez-Pérez, Asunción, Mariano Fernández-López & Oscar Corcho. Onto-\nlogical Engineering – with examples from the areas of Knowledge Manage-\nment, e-Commerce and the Semantic Web. London: Springer Verlag, 2004. \n \nGuarino, Nicola; Formal Ontology and Information Systems. In Nicola \nGuarino (ed.): Formal Ontology in Information Systems, Proceedings of the \nFirst International Conference (FOIS'98), June 6-8, Trento, Italy, Amster-\ndam: IOS Press, 1998. \n \nISO 704. 2000. Terminology work — Principles and methods. Genève: ISO. \n \nLassila, Ora & Deborah McGuiness; The Role of Frame-based Representa-\ntion on the Semantic Web. Technical Report KSL-01-02. Knowledge Systems \nLaboratory. Stanford University, 2001. \n \nMadsen, Bodil Nistrup; Typed Feature Structures for Terminology Work - \nPart I.  In: LSP - Identity and Interface - Research, Knowledge and Society. \nProceedings of the 11th European Symposium on Language for Special Pur-\nposes, Copenhagen, august 1997, Copenhagen Business School, 1998. \n \nMadsen, Bodil Nistrup, Hanne Erdman Thomsen & Carl Vikner; Data Mod-\nelling and Conceptual Modelling in the Domain of Terminology. In: Melby, \n",
  "speaker": "SYSTEM",
  "uuid": "87004116-5d08-42e0-8126-c8fe3c1ac72f"
}