{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 4\nParticipación en Proyectos de I+D financiados en Convocatorias públicas.  \n \n \n(nacionales y/o internacionales) \n \nPROYECTOS DE INVESTIGACIÓN COMO INVESTIGADOR PRINCIPAL \n \nTítulo del proyecto: EspOnt. Evaluación de Tecnologías Semánticas Utilizando Patrones Ontológicos (CCG10-\nUPM/TIC-5794)  \n \nEntidad financiadora: Comunidad de Madrid y Universidad Politécnica de Madrid \nConvocatoria: Ayudas para la creación y consolidación de Grupos de Investigación 2010 \nEntidades participantes: Universidad Politécnica de Madrid \nDuración,  desde: Enero 2011 \nhasta: Diciembre 2011 \n \nCuantía de la subvención: 18.281 € (total) \nInvestigador responsable: Raúl García Castro \nNúmero de investigadores participantes: 8 \nTipo de participación: Investigador Principal \n \n \nPROYECTOS DE INVESTIGACIÓN  \n \nTítulo del proyecto: READY4SmartCities. ICT Roadmap and Data Interoperability for Energy Systems in Smart Cities \n(FP7-608711)  \n \nEntidad financiadora: Unión Europea \nConvocatoria: Framework Programme 7 \nEntidades participantes: D’Appolonia SpA, Universidad Politécnica de Madrid, Centre Scientifique et Technique Du \nBatiment, Centre for Research and Technology Hellas / Information Technologies Institute, Teknologian Tutkimuskeskus \nVTT, Institut National de Recherche en Informatique et en Automatique, AIT Austrian Institute of Technology GmbH, AEC3 \nLtd., Politecnico Di Torino, empirica Gesellschaft für Kommunikations-und Technologieforschung mbH \nDuración,  desde: Octubre 2013 \nhasta: Septiembre 2015 \n \nCuantía de la subvención: 999.389 € (total) \n           164.542 € (UPM) \nInvestigador responsable: Christian Mastrodonatto \nNúmero de investigadores participantes: 21 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: Ciudad2020: Hacia un nuevo modelo de ciudad inteligente sostenible (IPT-20111006)  \n \nEntidad financiadora: Centro para el Desarrollo Tecnológico Industrial (CDTI). Ministerio de Ciencia e Innovación \nConvocatoria: Programa INNPRONTA 2011 \nEntidades participantes: Indra Sistemas, Ferrovial Servicios, ATOS, GFI Informática, Fagor Electrónica, iSOCO, Fractalia, \nDaedalus, Tekia. OPIs y CITs subcontratadas: Universidad Politécnica de Madrid, Centro de Innovación de Infraestructuras \nInteligentes, Universidad de Alcalá, Universidad de Cantabria, Fundación Barcelona Digital, Universidade da Coruña, \nUniversidad de Zaragoza, Universidad Carlos III de Madrid \nDuración,  desde: Octubre 2011 \nhasta: Diciembre 2014 \n \nCuantía de la subvención: 16.945.048 € (total)  \n                112.873 € (UPM) \nInvestigador responsable: Mercedes Badillo López \nInvestigador responsable por la UPM: Oscar Corcho García  \nNúmero de investigadores participantes: más de 100 \nTipo de participación: Miembro del equipo investigador \n \n \nTítulo del proyecto: Red Temática Española de Linked Data (TIN2010-10811-E)  \n \nEntidad financiadora: Ministerio de Ciencia e Innovación \nConvocatoria: Acción Complementaria del Plan Nacional de Investigación Científica 2010 \nEntidades participantes: Universidad Politécnica de Madrid, Euskal Herriko Unibertsitatea, Universidad Rey Juan Carlos, \nUniversidad de Deusto, Universidad Complutense de Madrid, Universidad Nacional de Educación a Distancia, Universitat de \n",
  "speaker": "SYSTEM",
  "uuid": "87200139-ab86-4005-81a1-1df2271e37b4"
}