{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD11-12 \n\nHere we include information for the students of the \"Máster Universitario en Inteligencia Artificial\".\nContents\n[\nhide\n]\n1\nObjectives\n2\nLectures structure\n3\nEvaluation\n4\nSchedule and Material\n5\nHands on activities\n6\nResearch topics\nObjectives\n\nThe aim of this module is to provide the theoretical and practical scientific,\nmethodological and technology basis involved in building ontologies, which will be\nused in building applications that integrate, combine and deduce distributed and\nheterogeneous information. In particular, we will present:\nthe concepts of ontology and annotation in the context of Semantic Web, Web of Data and corporate semantics,\nthe fundamental theory and best-known ontologies;\nlanguages RDF(S) and OWL,\nthe methodologies, methods and techniques used in its building that include guidelines for identifying the life-cycle, specification, planning, conceptualisation, correspondences, reuse, reengineering, etc.;\nmethods and techniques for the annotation of resources and significant applications.\nThroughout the entire module open research problems will be set that allow students to provide innovative solutions.\nSome initial reading to reflect on the objectives:\nhttp://iospress.metapress.com/content/p063121l16757521/fulltext.html\nLectures structure\n\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation\n\nEvaluation will be done on the basis of: weekly work and participation in discussion (10%), ontology building assignment (30%), Linked Data assignment (30%) and research work (30%)\nPartial assignments that will be done throughout the academic year, and which are specified in the schedule section, will allow creating the aforementioned ontology building and Linked Data assignments, which will be presented orally on the last session of the course. The optional research work will have to be submitted in January 2012 (31/01/2012).\nThose students that present their works in\nJuly\n, they should present, individually (gropus are NOT allowed):\nan ontology(33%)\na linked data application(33%)\na research study (34%)\nDelivery date: 2nd July, 12:00\nOral presentation: 3rd July at 17:00. Students should present during 20 minutes the ontology and the linked data application.\nSend your hands-on to the following email\nontologies@delicias.dia.fi.upm.es\nSchedule and Material",
  "speaker": "SYSTEM",
  "uuid": "873e37e7-e3a2-4628-8e64-ab21e5d8c021"
}