{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 12\n12\nGraeme Hirst\nthe agent of spraying (Nadia) is optional (the causative alternation) in the ﬁrst case\n(example 3) but not the second (example 4).\nIn view of the many different possible syntactic arrangements of the arguments\nof a verb, and the many different possible combinations of requirement, prohibi-\ntion, and optionality for each argument in each position, a large number of different\nkinds of alternations are possible. However, if we classify verbs by the syntactic al-\nternations that they may and may not undergo, as Levin (1993) has for many verbs\nof English, we see a semantic coherence to the classes. For example, many verbs\nthat denote the covering of a surface behave in the same manner as spray, includ-\ning daub, splash, and sprinkle. Nonetheless, the semantic regularities in alternation\nbehaviour often seem ontologically unmotivated, and even arbitrary. For example,\nverbs of destruction that include in their meaning the resulting state of an entity\n(smash, crush, shatter), fall into a completely different behaviour class from verbs\nthat do not (destroy, demolish, wreck) (Levin 1993, p. 239).\nEven what is perhaps the most basic and seemingly ontological distinction made\nby languages, the distinction between nouns, verbs, and other syntactic categories,\nis not as ontologically well-founded as it seems. From the viewpoint of object-\ndominant languages (Talmy 2000a) such as English (and the majority of other lan-\nguages), we are used to the idea that nouns denote physical and abstract objects\nand events (elephant, Abelian group, running, lunch) and verbs denote actions, pro-\ncesses, and states (run, disembark, glow). But even within European languages, we\nﬁnd that occasionally what is construed as an action or state in one language is not\nin another; a commonly cited example is the English verb like translating to an ad-\nverb, a quality of an action, in German: Nadia likes to sing: Nadia singt gern. But\nthere are action-dominant languages in which even physical objects are referred to\nwith verbs:\nFor example, in a situation in which English might say There’s a rope lying on the\nground, Atsugewi [a language of Northern California] might use the single polysyn-\nthetic verb form ´woswalak\u0001a . . . [This can] be glossed as ‘a-ﬂexible-linear-object-\nis-located on-the-ground because-of-gravity-acting-on-it’. But to suggest its noun-\nless ﬂavor, the Atsugewi form can perhaps be fancifully rendered in English as:\n“it gravitically-linearizes-aground”. In this example, then, Atsugewi refers to two\nphysical entities, a ropelike object and the ground underfoot, without any nouns.\n(Talmy 2000a, p. 46)\n1.4.4 Language, cognition, and the world\nAll the discussion above on the distinction between lexicon and ontology is really\nnothing more than a few examples of issues and problems that arise in discussions\nof the relationship between language, cognition, and our view of the world. This is,\nof course, a Big Question on which there is an enormous literature, and we cannot\npossibly do more than just allude to it here in order to put the preceding discus-\nsion into perspective. Issues include the degree of mutual causal inﬂuence between\n",
  "speaker": "SYSTEM",
  "uuid": "88047b18-6929-4d64-b211-98dfebd4aa42"
}