{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 4\n \n \nPág. 6 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n• \nLa elaboración, gestión y seguimiento de programas orientados a la promoción de la \noferta de nuevas tecnologías, servicios y aplicaciones y contenidos en el ámbito de \nlas telecomunicaciones y la Sociedad de la Información, así como la definición y \ngestión coordinada de esta política con los correspondientes programas e iniciativas \nde la Unión Europea y con otros programas internacionales en esta materia. \nEn el marco de sus competencias, además, la SETSI es responsable de la ejecución y \ncoordinación de la Agenda Digital para España, y en este contexto es el órgano gestor de las \nactividades de la Acción Estratégica de Economía y Sociedad Digital 2013-2016. \n \nEl actual desarrollo de Internet y, en general de las TIC, pone al alcance volúmenes enormes y \ncrecientes de información textual. Sin embargo, los sistemas informáticos, que procesan \nfácilmente datos, no pueden procesar directamente el lenguaje humano. \nEl lenguaje es una de las herramientas distintivas del ser humano. Las matemáticas por su parte, \nson el soporte de nuestra ciencia y base de las tecnologías de la información y las \ncomunicaciones. Las tecnologías de procesamiento del lenguaje natural aúnan ambos \ninstrumentos aplicando métodos científicos, por medio de las tecnologías de la información, a la \ncomprensión del lenguaje humano en la amplia diversidad de lenguas, dialectos y formas de \ncomunicación. Herramientas tales como buscadores, asistentes personales, clasificadores de \ntexto o traductores automáticos se han convertido en indispensables para el desarrollo de \nnuestra labor cotidiana, sea cual sea nuestro campo de actividad. Pero hay otras muchas \naplicaciones donde el Procesamiento del Lenguaje Natural (PLN) y la Traducción Automática \n(TA) pueden resultar críticas para dotar al ciudadano de nuevos servicios avanzados y de \noptimizar procesos y recursos productivos tanto en el ámbito empresarial como en las \nAdministraciones Públicas. Cualquier paso en la mejora de la comprensión, síntesis, clasificación \no traducción automática de información textual no estructurada genera valor para la sociedad y \nresulta de aplicación transversal a todos los sectores productivos.  \nEl mercado de las tecnologías del lenguaje está creciendo rápidamente y los informes de varias \nconsultoras1 estiman un gran crecimiento del mercado mundial en los próximos años basándose \nen la explosión de aplicaciones observada en los últimos dos años y en el crecimiento \nexponencial de los datos textuales digitales.  \nJunto a este avance tecnológico, existen otros elementos importantes que justifican la \noportunidad del plan que aquí se expone. \nEn el ámbito de la Unión Europea hay que destacar que la prioridad dada por la Comisión \nEuropea al logro de un Mercado Digital Único (Digital Single Market, DSM) implica, entre sus \nretos, superar las barreras que imponen la existencia de un gran número de lenguas en el seno \nde la Unión Europea. Esta diversidad lingüística es, al mismo tiempo, una de sus mayores \nriquezas culturales. Por ello, las tecnologías del lenguaje tienen un papel muy relevante en la \nUnión Europea.  \n                                                           \n1 Gartner 2014, LT-Innovate, AltaPlana, etc. \n",
  "speaker": "SYSTEM",
  "uuid": "883a40e4-67b6-4f5b-848f-9bc2a84b4c64"
}