{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 1\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \n \nRESOLUCIÓN DE 20 DE ABRIL DE 2017, DE LA SECRETARÍA DE ESTADO PARA LA SOCIEDAD DE LA \nINFORMACIÓN Y LA AGENDA DIGITAL POR LA QUE SE CONVOCA UNA CONSULTA PRELIMINAR \nAL MERCADO PREVIA AL PROCEDIMIENTO DE COMPRA PÚBLICA DE INNOVACIÓN EN EL MARCO \nDEL PLAN DE IMPULSO DE LAS TECNOLOGÍAS DEL LENGUAJE. \n \nDe conformidad con lo dispuesto en la disposición adicional tercera del Real Decreto 424/2016, \nde 11 de noviembre, por el que se establece la estructura orgánica básica de los departamentos \nministeriales, corresponde a la Secretaría de Estado para la Sociedad de la Información y la \nAgenda Digital, entre otras, la propuesta y ejecución de la política del Gobierno en materia de \ntelecomunicaciones y sociedad de la información, así como el desarrollo de la Agenda Digital. \nEl Consejo de Ministros aprobó en su reunión del 15 de febrero de 2013 la Agenda Digital para \nEspaña, que marca la hoja de ruta para el cumplimiento de los objetivos de la Agenda Digital para \nEuropa en 2015 y 2020, e incorpora objetivos específicos para el desarrollo de la economía y la \nsociedad digital en España.  \nLa Agenda Digital para España, así como la Estrategia Española de Ciencia y Tecnología y de \nInnovación, establece el desarrollo de la economía y la sociedad digital como uno de los retos \nglobales que requieren un mayor esfuerzo en materia de Investigación Científica, Desarrollo e \nInnovación (I+D+i); y señalan como una fortaleza del país la posición de liderazgo científico, \ntecnológico y empresarial del sector de las Tecnologías de la Información y la Comunicación (TIC). \nEn febrero de 2015, se aprobó el Programa Operativo de Crecimiento Inteligente, el cual describe \nlas actuaciones que en materia de TIC serán cofinanciadas con FEDER en el marco 2014/2020. \nY en octubre de 2015, la Secretaría de Estado para la Sociedad de la Información y la Agenda \nDigital (entonces Secretaría de Estado de Telecomunicaciones y para la Sociedad de la \nInformación) lanzó el Plan de Impulso de las Tecnologías del Lenguaje, que se inserta en la Agenda \nDigital \npara \nEspaña \n(para \nmayor \ninformación \npuede \nconsultarse \nel \nsitio \nweb: \nwww.agendadigital.gob.es). \n \nEn las pasadas décadas se produjo una digitalización masiva de todo tipo de contenidos y hoy \nbuena parte de la materia prima informativa se produce ya directamente en formato electrónico \n(textos, audio, vídeo, mediciones, etc.). Aunque se encuentre en formato electrónico, se trata \nesencialmente de una forma de almacenamiento de la información, que facilita operaciones como \nsu replicación y transmisión. Sigue siendo una información destinada para comprendida por \nhumanos (libros, fotografías, películas, música, etc.); y se distingue de la denominada información \nestructurada, que es aquella cuyo contenido puede interpretar directamente un ordenador, lo \nque le permite asimilarla, buscarla y procesarla muy rápidamente (por ejemplo, las bases de \ndatos). \nSin embargo, el volumen de información no estructurada crece tan vertiginosamente que su \naprovechamiento está ya fuera del alcance de las capacidades humanas. Buena parte de esta \ninformación es de contenido lingüístico (oral y escrito). Y son las tecnologías del lenguaje las que \npermiten explotar automáticamente (“estructurar”) dicha información.  \nPor ello, las tecnologías del lenguaje tienen un protagonismo principal para construir una \nsiguiente etapa en la economía de los datos. Las tecnologías del lenguaje son el pilar de un sector \n",
  "speaker": "SYSTEM",
  "uuid": "88df6a24-c266-4e40-abf9-d8caf72256a4"
}