{
  "message": "SYSTEM: D5.3.2.pdf: Página 33\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 33 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n \nFigure 16. Tasks for Scheduling \nTask 1. Select the ontology network life cycle model (ONLCM). \nThe goal of this task is to obtain the most appropriate ontology network life cycle model for the \nontology network to be developed. Users, domain experts and the ontology development team \ncarry out this task taking as input the ontology requirement specification document (ORSD) and the \nset of potential knowledge-aware resources to be used during the development. The actors \ninvolved in this task use the set of natural language questions related to the ontology network \nrequirements proposed here. \nThe main question to be answered in this task is: “Which ontology network life cycle model should \nbe chosen?”. Such choice should be based on software organization culture, previous experience \nof the team of software developers and ontology practitioners, application area, and \ncomprehension and volatility of the ontology network requirements. Furthermore, general ontology \nnetwork development requirements should be taken into account. \nTo help software developers and ontology practitioners to decide the most appropriate model \namong the ones in the collection presented in Section  3.2, the following set of natural language \nquestions are proposed. \n\u0003 Are the ontology network requirements assumed to be fully known at the beginning of the \nontology network development? \no If the answer is yes, then we can propose to choose the waterfall ontology network life \ncycle model.    \n\u0003 Is it possible that the ontology network requirements are not fully known at the beginning of the \nontology network development and/or that they may change during the development? \n",
  "speaker": "SYSTEM",
  "uuid": "8a18b14c-d700-4955-b208-c72b0f72010e"
}