{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD10-11 \n\nLectures will be held every Thursday in lecture room 6206, from 15:00 to 17:00.\n9/9/2010. Introduction (Asun)\nRecomended reading: Tim Bernes Lee articles\nSlides: [\nIntro Sweb\n]\nAssignment (deadline: 15/09/2010 9pm): discuss and summarise the following reading/watching list in approximately three pages (in groups of three):\nArticles written by TBL in 1996 and 2002\nTED 2009 talk by TBL\nLinked Data dessign issues technical report\nLinked Data Vision paper from Bizer et al., 2009\n16/9/2010. Ontologies and terminologies (Asun)\nRecommended reading:\nSlides: [\nTerminology in ontologies\n]\nAssignment (no deadline, and no need to submit anything): Students should read the first two articles and one more selected from the others: [\n[1]\n]  [\n[2]\n]  [\n[3]\n[\n[4]\n][\n[5]\n] [\nOntoterminology\n]\nPresentation: No presentation will be selected from this block of papers\n23/9/2010. Theoretical Foundations of Ontologies  (Asun)\nRecommended reading: Chapter 1 and 2 of the book \"Ontological Engineering\"\nSlides: [\nFoundations of ontologies\n]\nAssignment: Choose betwen one of them.\nRead and comment the following paper that includes several definitions of ontologies: Guarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nSearch papers on the topic of Ontological Commitments.  Read, comment and compare at least the following two papers:\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nChoose a domain and find  ontological and non ontological available resources consensuated by a community. Classify them in the continuous line identified by Lassila and McGuiness. Justify why they are important and how do you know that they represent consesuated knowledge.\nIdentify a set of criteria to be used to compare technologies used for searching ontologies. Classify existing technologies according to the criteria.\n30/09/2010. Methodologies I (Asun)\nThe objective of this lecture is to show scenarios for the construction of ontologies, and provide methods and tools to create the ontology requirements specification document, to perform the search of potential resources to be reused, to select the ontology life cycle model and to plan and schedule the ontology development.\nRecommended reading and resources:\nNeOn Glossary of Processes and Activities\nOntology Requirements Specification:\n[6]\nPlanning and Scheduling:\n[7]\nNeOn Toolkit:\nhttp://neon-toolkit.org/wiki/Download\nNeOn Book. NeOn Methodology in a Nutshell:\nhttp://www.neon-project.org/nw/NeOn_Book\nSlides:\n[8]\nAssignment (deadline: 20/10/2010 9pm):\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[9]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nSchedule the ontology network development using the gOntt plugin included in the NeOn toolkit.\nComment if the NeOn methodology should be adapted for building ontologies in this scenario and write your proposal.\nFill in the questionnaire\n[10]\nregarding the guideliness related with ontology requirement specification.\nDo the same\n[11]\nabout the gOntt plug-in.\n7/10/2010. Invited talk: General Ontologies (Mariano Fernández López)\nThe goal of this lecture is to present guidelines for reusing general or common ontologies.\nRecommended reading:\nSlides:\nGeneral ontologies\nAssignment: see the butlast slide\n14/10/2010. Methodologies II (Asun)\nThe goal of this lecture is to present methods and tools for reusing and re-engineering non-ontological resources into ontologies.\nRecommended reading (Reusing and Re-engineering non-ontological resources):\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[12]\nChapter 6: Non-Ontological Resource Reuse and Re-engineering.\nD2.2.2. Methods and Tools Supporting Re-engineering\n[13]\nChapter 2: State of the Art.\nChapter 3: NeOn Method for Re-engineering Non-ontological Resources.\nChapter 4: Methods for Re-engineering Classification Schemes.\nChapter 5: Methods for Re-engineering Thesauri.\nSlides:\n[14]\nAssignment (deadine: 20/10/2010 9pm) Use PRNOR to build the ontologies\n[15]\n21/10/2010 and 28/10/2010. Ontology languages I - RDF(S) and SPARQL (Oscar)\nRecommended reading:\nChapter 4 of the book \"Ontological Engineering\", W3C documents on RDF, RDF Schema and SPARQL\nJ. Perez, M. Arenas, C. Gutierrez, The Semantics and Complexity of SPARQL. 5th International Semantic Web Conference, ISWC 2006, Athens, Georgia, USA, November 2006.\nhttp://www.dcc.uchile.cl/~cgutierr/papers/sparql.pdf\nSlides:\nRDF(S)\nSPARQL\nAdditional RDF(S) examples:\nEjemplos RDF(S)\nAssignment: see Ontology Languages (II)\n4/11/2010. Annotation (Oscar)\nRecommended reading:\nHandschuh S, Staab S (2003). Annotation for the Semantic Web. IOS Press\nCorcho, O. Ontology-based document annotation: trends and open research problems. International Journal of Metadata, Semantics and Ontologies 1(1):47-57. 2006.\n[16]\nSix challenges for the Semantic Web. Benjamins VR, Contreras J, Corcho O, Gómez-Pérez A. KR2002 Workshop on Semantic Web. Toulouse, France. April 2002\nRequirements and Services for Metadata Management. Missier P, Alper P, Corcho O, Dunlop I, Goble C. IEEE Internet Computing 11(5): 16-24\nToward a New Generation of Semantic Web Applications. d'Aquin M, Motta E, Sabou M, Angeletou S, Gridinoc L, Lopez V, Guidi D. IEEE Intelligent Systems, June 2008\nRDFa tools (\nhttp://www.w3.org/2001/sw/wiki/RDFa\n)\nWYMeditor -\nhttp://wymeditor.org/\n- which integrates with Drupal, Rails, Django, or WordPress. Prototype:\nhttp://files.wymeditor.org/wymeditor/trunk/src/examples/15-rdfa-editor.html\nAloha editor with a RDFa prototype at\nhttp://aloha-editor.com/wiki/index.php/Semantic_Annotation\nRDFa Documents:\nhttp://www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1759526\n. Only supports RDFa 1.0.\nRDFa Square:\nhttp://demos.inf.ed.ac.uk:8836/rdfasquare\nSome links:\nhttp://www.ebusiness-unibw.org/wiki/RDFaAuthoring\nSlides:\nSlides\nAssignment: Taking into account the domain ontologies generated in the previous assignments, select a set of Web pages, wikis, databases or any other resources and make ontology-based annotations about them, publishing them in a suitable form.\nDeadline: there is no need to deliver this assignment. It is just homework for you.\n11/11/2010. Linked Data generation (Oscar)\nRecommended reading:\nDocumentación disponible en\nhttp://www.geolinkeddata.es\nA Survey of Current Approaches for Mapping of Relational Databases to RDF (PDF), Satya S. Sahoo, Wolfgang Halb, Sebastian Hellmann, Kingsley Idehen, Ted Thibodeau Jr, Sören Auer, Juan Sequeda, Ahmed Ezzat, 2009-01-31. Available at\nhttp://www.w3.org/2005/Incubator/rdb2rdf/RDB2RDF_SurveyReport.pdf\nCheck\nhttp://code.google.com/p/google-refine/\nfor some of the issues that we were talking about as well.\nSlides:\n[17]\nAssignment: Generate Linked Data in a domain like the one proposed in hands-on 1\nDeadline: 24/11/2010 9pm\n25/11/2010. Ontology languages II. OWL (Oscar)\nRecommended reading: Chapter 4 of the book \"Ontological Engineering\", OWL 2 documents available at W3C\nSlides: [\nOntology languages (OWL)\n] [\nOWL Modularisation and Debugging\n] [\nSample OWL ontology with inconsistencies\n]\nAdditional reading:\n[1] Cuenca Grau B, Horrocks I, Kazakov Y, Sattler U. Just the Right Amount: Extracting Modules from Ontologies. WWW2007,",
  "speaker": "SYSTEM",
  "uuid": "8a52aa85-a82a-4aa4-8930-9b02f3eca7ce"
}