{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 5\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11154\n3.  En la resolución de concesión del subprograma se indicará el beneficiario o \nbeneficiarios de las ayudas, y candidatos de reserva, en su caso, así como las condiciones \nde concesión de las ayudas, duración y cuantía de las mismas, hará alusión a los criterios \nde valoración de las solicitudes y recogerá los recursos que, en su caso, quepan contra \ndicha Resolución, plazo de interposición y órgano competente para su resolución.\n4.  En el caso del subprograma de Formación de Personal Investigador del Ministerio \nde Ciencia e Innovación, contra la resolución del procedimiento de concesión, que pone fin \na la vía administrativa, se podrá interponer, potestativamente, recurso de reposición ante \nel órgano que la dictó, en el plazo de un mes, si la resolución fuera expresa, o de tres \nmeses si no lo fuera, de acuerdo con lo dispuesto en los artículos 116 y 117 de la Ley \n30/1992, de 26 de noviembre, de Régimen Jurídico de las Administraciones Públicas y del \nProcedimiento Administrativo Común.\nSin perjuicio de lo anterior, contra la resolución del procedimiento de concesión cabe \ninterponer recurso contencioso-administrativo ante la Sala de lo Contencioso-Administrativo \nde la Audiencia Nacional, en el plazo de dos meses, si la resolución fuera expresa, o de \nseis meses si no lo fuera, de acuerdo con lo dispuesto en los artículos 11.1.a) y 46 de la \nLey 29/1998, de 13 de julio, de la Jurisdicción Contencioso-Administrativa.\n5.  En el caso del subprograma de Formación de Personal Investigador en \nAgroalimentación en los centros de investigación INIA-CCAA, contra la resolución del \nprocedimiento de concesión, que no pone fin a la vía administrativa, se podrá interponer, \nrecurso de alzada ante el órgano superior jerárquico que la dictó, en el plazo de un mes, \nsi la resolución fuera expresa, o de tres meses si no lo fuera, de acuerdo con lo dispuesto \nen los artículos 116 y 117 de la Ley 30/1992, de 26 de noviembre, de Régimen Jurídico de \nlas Administraciones Públicas y del Procedimiento Administrativo Común.\nSin perjuicio de lo anterior, contra la resolución del procedimiento de concesión cabe \ninterponer recurso contencioso-administrativo ante los Juzgados Centrales de lo \nContencioso-Administrativo, en el plazo de dos meses, si la resolución fuera expresa, o de \nseis meses si no lo fuera, de acuerdo con lo dispuesto en los artículos 9.c) y 46 de la Ley \n29/1998, de 13 de julio, de la Jurisdicción Contencioso-Administrativa.\nArtículo 9.  Modificaciones.\nCualquier modificación de las condiciones iniciales de concesión de las ayudas y de \nlos plazos para su ejecución deberá ser autorizada por el órgano concedente del \nsubprograma, que podrá recabar los informes que considere oportunos y dar lugar a la \nmodificación de los términos de la concesión mediante nueva resolución.\nArtículo 10.  Publicidad.\n1.  Las ayudas concedidas se publicarán en la página web del órgano concedente del \nsubprograma y en el Boletín Oficial del Estado, indicando el beneficiario, la cuantía de la \nayuda y el subprograma y crédito presupuestario a los que se imputan.\n2.  Los beneficiarios deberán dar publicidad al carácter público de la financiación de \nla actividad subvencionada, haciendo referencia expresa al subprograma de ayudas a la \nformación de investigadores de que se trate y al órgano concedente en los contratos \nlaborales, así como en las publicaciones, ponencias y otras actividades de difusión de \nresultados que resulten de las ayudas concedidas al amparo de la presente resolución.\n3.  Cuando se comunique a los beneficiarios que las ayudas han sido cofinanciadas \ncon recursos procedentes del Fondo Social Europeo, deberá hacerse mención expresa de \nesta circunstancia tanto en el contrato laboral como en las publicaciones y demás \nactuaciones resultantes de la financiación por el correspondiente subprograma, y cumplir \ncon las obligaciones que establezca la normativa comunitaria aplicable. A tal efecto, se \npublicará en la página web del órgano concedente la relación de ayudas cofinanciadas con \ndicho fondo, con posterioridad a la presentación de la justificación económica por el centro \nbeneficiario, y su declaración por el MICINN como gasto elegible a la Autoridad de Gestión \ndel Fondo Social Europeo.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "8ad598f6-b62a-4068-b6c0-e88d96822792"
}