{
  "message": "SYSTEM: Wiki: En esta página se guardan ideas de proyectos que han surgido de discusiones en la lista del grupo.\nPor ejemplo, a partir de la discusión del 5 de diciembre, relacionada con datos sobre accesibilidad en estaciones de Metro con ascensor e intercambiadores proporcionadas por el Consorcio de Transportes de Madrid, han surgido las siguientes ideas:\nNomenclatura\npersona con diversidad funcional o con discapacidad (discapacitado) -> es válido\nminusválido -> minus es menos, es peyorativo-> no hay que usarlo.\nPara personas discapacitadas\nAyuda para coger los mejores trayectos según su movilidad y accesibilidad de las estaciones...\nUn planificador de rutas para personas con discapacidad que adapte la ruta generada:\nal mapa este que teneis\na las capacidades funcionales de la persona que este usando la aplicación\nal estado real este del mapa que tenéis (actualizado por crowdsourcing para cosas como ascensores que no funcionan, cosas que realmente están en el mapa y no en la realidad)\nLas rutas generadas también han de ser luego adaptadas para que el usuario las entienda (auidio guía, interfaz haptico, etc), . Para esto se puede usar el mismo perfil de capacidad del usuario que usamos para generar la ruta.\nAudio guía para ayudarles a moverse por el Metro\nRealidad aumentada cruzada con los datos que muestras para saber en todo momento dónde está el usuario en cuestión\nPara personas no discapacitadas\nRealidad aumentada con integración de datos para saber donde está exactamente la salida de metro que busca el usuario según una dirección o filtros, esto es super útil cuando llevas prisa y no sabes si subirte en la cabecera o parte trasera del tren o porque zona salir o ir :) (transbordos infernales)\nCálculos en base a estos planos para saber por donde moverse (por ejemplo, en la estación Canal es recomendable subir por arriba que seguir las señales, porque así ves si el metro se va o no y tienes que echarte una carrerita :))\nSaber qué salidas están cerradas en cada momento (por la tarde noche cierran algunas, y es un rollo tener que cruzarte dos cerradas hasta que encuentras la buena).\nSi tengo mi destino marcado en un mapa, saber qué salida es por la que tengo que salir.\nQue me avise de lo que voy a tener que andar dentro de una estación. Por ejemplo, la trampa que hay en plaza de España-Noviciado. En plan un aviso diciendo: cuidado, te vas a meter 15 minutos de transbordo por lo larga que es esta estación!\nOutdoor-indoor-outdoor navigation\nPara el propio Metro\nPosibilidad de poner balizas iBeacon para mostrar información al usuario, con estos planos se puede calcular la distancia óptima y zonas a las cuales no les llega onda\nConstrucción de diferentes rutas y optimización de la propia infraestructura de las estaciones según la cantidad de usuarios que pasan, ¿para que tener cuatro salidas si solo se usan dos?\nCalculadora semántica (RDF a partir de planos de estación) de rutas \"costosas\" para discapacitados (comparado con el coste para no discapacitados). Coste es tiempo (o distancia) entre cualesquiera entrada y salida.\nCrowdsourcing: actualizar el estado de los elementos que aparecen en los planos en amarillo y naranja en tiempo real.",
  "speaker": "SYSTEM",
  "uuid": "8aed973e-b1df-4ec1-aafc-6dd47fccc159"
}