{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Madrid,_28_Enero_2008 \n\nLugar: IGN, Madrid\nFecha: 28 Enero 2008, 10:30-13:00\nAsistentes: UPM (Asunción Gómez, José Angel Ramos, Luis Manuel Vilches, Oscar Corcho), IGN (Antonio Rodríguez, Carlos González, José Angel Alonso, Cristina Iguácel)\nContents\n[\nhide\n]\n1\nTemas tratados\n2\nPreguntas principales de UPM\n3\nOtros comentarios\n3.1\nNuevos servicios disponibles pronto (IGN)\n3.2\nOtros\nTemas tratados\n\n- Estado del convenio IGN-UPM (presentado por José Angel Ramos)\n- Presentación de GeoBuddies (presentado por Asun)\n- Preguntas para el desarrollo de GeoBuddies (ver más abajo)\nPreguntas principales de UPM\n\n- ¿Podría el IGN proporcionar mapas sobre algunas zonas del camino?\nNo sería problema para IGN proporcionarnos dichos mapas si es necesario. Sin embargo, no lo ven\nmuy conveniente teniendo en cuenta que ellos se pueden encargar de todo lo relacionado con servir\nmapas utilizando los servidores de mapas (WMS, etc.) que ya hemos probado con clientes ligeros.\n- ¿En caso de que fuera necesario que los usuarios se descarguen mapas a los móviles/PDAs, vulnera esto el copyright del IGN?\nEn general utilizando WMS cualquier usuario podría descargarse cualquier conjunto de mapas que\nquisiera, y usarlos como deseara, así que es algo que no se puede evitar. Sin embargo, para\nproporcionar soporte adecuado para esto, en primer lugar se proporcionaría sin ningún problema\nsi es para uso no comercial, y además habría que tener cuidado con los servidores necesarios en\ncaso de que esto cargara mucho los servidores del IGN en algún momento concreto (por las noches\ncuando los peregrinos se descargan el itinerario del siguiente día, etc.).\n- ¿Deberíamos generar algún servicio para anotación?\nPodría interesar poner en marcha un servicio WFS-T, que permita la creación y anotación \nde puntos de interés por parte de los usuarios y a continuación se pueda publicar mediante un  \nservicio de mapas WMS. Esto resulta factible para IGN: incluyendo el alojamiento de los datos \nen sus instalaciones. \nSería interesante enviar a IGN el modelo de datos que se usará y los requisitos que serán \nnecesarios para este servicio. \nAdemás estos servicios se encuentran estrechamente vinculados con las políticas de gestión del \ncontenido de los datos para evitar usos ilícitos o fraudulentos así como información de carácter \nerróneo. Por ejemplo, Antonio propuso el protocolo de WikiMapia para dar validez a las anotaciones\n(valoraciones positivas y negativas).\n- ¿Podría interesar extender alguna herramienta de metadatos?\nIGN comenta que los metadatos que tratan herramientas como CatMEdit y GeoNetworks están orientados\na aspectos distintos a los metadatos que se tratan en GeoBuddies, y por tanto puede que sea más\nconveniente crear otra herramienta adicional para proporcionar anotaciones. Sin embargo, en todo\ncaso IGN podría interceder para realizar ampliaciones sensatas a la herramienta CatMEdit.\nOtros comentarios\n\nNuevos servicios disponibles pronto (IGN)\n\nIGN está actualizando el servidor de mapas para ofrecer WMS-C, que es lo que se utiliza en aplicaciones como Google Maps para poder ofrecer mapas de mejor manera y cachear los que están alrededor, mejorando la eficiencia en la transferencia de datos. Esto estará disponible para varias bases de datos.\nIGN proporciona un servicio WPS de localización bajo el proyecto CartoCiudad (dada una dirección o una carretera y punto kilométrico, obtener sus coordenadas geográficas), así como caminos mínimos a pie entre un punto y otro, que están implementados mediante un WFS.\nOtros\n\nIGN propone que GeoBuddies utilice como fuente de topónimos\nGeoNames\n, que es una iniciativa europea con muchísimos topónimos y en distintos idiomas. Por ejemplo, todos los topónimos de Guipúzcoa están en esta base de datos.\nIGN no conoce bases de datos geográficas específicas para móviles. UPM comprobará esto (de hecho, Víctor Saquicela ya ha comprobado la existencia de algunas de estas bases de datos).\nAlgunos de los términos podrían también conseguirse fácilmente en portugués y francés, a través de colaboraciones con las organizaciones de Portugal y Francia.",
  "speaker": "SYSTEM",
  "uuid": "8b21da8a-ed86-4d8d-8ab8-1b461325c098"
}