{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 11\nSemantic Grounding of Cross-Lingual Folksonomies\n11\n5\nEvaluation and Discussion\nWe evaluated a total of 2260 tagging activities (TAS) corresponding to 764\npictures tagged with 1112 tags23 (see table 1). Evaluators were able to identify\nthe semantics of 87% of the TAS (known entities). From this subset, 62.6% were\nconsidered in English and 87.7% in Spanish24. In addition, the number of tags\nconsidered as named entities was 53.3% in English and 55.7% in Spanish.\nTable 1. Description of the dataset.\nUsers Evaluations Evaluations/ Pictures Tags TAS\nTAS/\nuser\npicture\nAll entities\n41\n138063\n3367.39\n764\n1112 2260\n2.96\n(±142.17)\n(±0.23)\nEnglish known entities\n41\n30400\n741.46\n642\n659 1232\n1.92\n(±206.51)\n(±0.79)\nSpanish known entities\n41\n49568\n1208.98\n742\n816 1727\n2.33\n(±152.10)\n(±0.74)\nEnglish known named entities\n40\n11872\n296.80\n470\n335\n657\n1.40\n(±152.39)\n(±0.60)\nSpanish known named entities\n41\n26688\n650.93\n597\n450\n963\n1.61\n(±183.01)\n(±0.70)\nEnglish known unnamed entities\n41\n18528\n451.90\n455\n422\n687\n1.51\n(±120.59)\n(±0.65)\nSpanish known unnamed entities\n41\n22880\n558.05\n599\n533\n966\n1.61\n(±117.84)\n(±0.70)\n5.1\nPrecision and Recall Analysis\nTables 2 and 3 show the results obtained by the diﬀerent approaches on entities\nmarked as English and Spanish respectively. As explained in Section 3, in the\nexperiment, each tagging activity was evaluated by three users. The users had\nto decide whether or not a semantic entity was relevant for a tag, and had to\nstate the language of such tag, choosing one out four options: English, Spanish,\nboth and other. For a given tag, based on the three users’ evaluations, a semantic\nentity was considered relevant if at least two users stated it was highly related\n(or related/highly related) to the tag. There was a substantial agreement among\nusers. Fleiss’ kappa statistic [25] measuring users’ agreement was κ = 0.76 (a\nvalue κ = 1 means complete agreement) for the highly related case, and κ =\n0.71 for the related/highly related case. In the reported results, the former case\nwas used because of its higher agreement level. Similar average performance\nresults were obtained with the latter case. Precision values were higher and\nrecall values were lower. There were more relevant entities so it was easier to\naccurately retrieve a relevant entity, while it was more diﬃcult to retrieve all\nrelevant entities. Similarly to the deﬁnition of relevance agreement, a tag (within\na certain semantic context) was considered in English (Spanish) if at least two\nusers chose English (Spanish) or both options. There was an almost perfect\n23 Dataset\navailable\nin\nhttp://delicias.dia.fi.upm.es/wiki/images/5/55/VW_\nEVALUATION.zip\n24 Evaluators deﬁned that the tag was written in the speciﬁc language or in both. For\ninstance, the Madrid tag is valid both in Spanish and English.\n",
  "speaker": "SYSTEM",
  "uuid": "8b3adc1d-6eb7-43cd-b58a-a0bd6c75745d"
}