{
  "message": "SYSTEM: Wiki: For the acquisition and management of research projects in the areas of\nSemantic Web, Web 3.0, Linked Open Data, Information Retrieval and\nInformation Portals the GESIS - Leibniz-Institute for Social Sciences,\ndepartment \"Information Processes in the Social Sciences\" (IPS), opens a\nposition for 1 Postdoctoral Researcher (TV-L EG 14) at the location Bonn/Cologne\nThe contract will first be limited to 2 years. A prolongation of the\nappointment is planned.\nYour job will be ...\n- acquisition of research projects at the national and international level\n- project management\n- supervision of PhD candidates\n- enhancing research output of the department\nWe expect from you ...\n- PhD degree in Computer Science or related field\n- outstanding research in the research areas of the department\n- skills in software development (particular in SOA)\n- skills in project management and team leading\n- conceptual thinking ability\nWHO ARE WE\nThe GESIS - Leibniz-Institute for the Social Sciences is funded by the\nFederal Ministry of Education and Research (BMBF) and the Federal States.\nThe GESIS department \"Information Processes in the Social Sciences\" (IPS)\nperforms research and development of state-of-the-art Web technologies in\nthe application domain of Social Sciences and consists of computer\nscientists and information scientists.\nHOW TO APPLY\nGESIS is an equal opportunities employer and therefore encourages equal\ntreatment of men and women. Guidelines for the employment of the disabled\nare adhered to, as are the legal requirements regarding part-time work.\nPlease send your CV with the usual documents preferably as Email attachments\nby April 30, to Klaus Skeries, HR department, Bonn, telephone\n+49-228-2281-111, email <\nmailto:klaus.skeries@gesis.org\n>.\nFURTHER INFORMATION\nPlease feel free to contact Prof. Dr. York Sure (Tel. +49-621-1246-196,\nemail <\nmailto:york.sure@gesis.org\n>) or Peter Mutschke (Tel.\n+49-228-2281-135, email <\nmailto:peter.mutschke@gesis.org\n>) for any further\nquestion you might have.",
  "speaker": "SYSTEM",
  "uuid": "8b3fda87-bfc0-4dfd-b4f3-6c9edbc99824"
}