{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 47\n• \nOctubre 2010 – Mayo 2011. Curso “Formación Inicial del Profesorado en el Marco del Espacio Europeo de \nEducación Superior” Instituto de Ciencias de la Educación, Universidad Politécnica de Madrid. Madrid (España). \nCursados 6 ECTS: \no \nMódulo 1. Planificación de la enseñanza universitaria \no \nMódulo 2. Metodología para la enseñanza universitaria \no \nMódulo 3. Las Tecnologías de la Información y la Comunicación aplicadas a la enseñanza \n• \nOctubre 2008. Curso “Divulgación Científica y Tecnológica” (30 de octubre de 2008). Madrid (España). 4 horas. \n• \nOctubre 2008. Curso “Seminario de Vigilancia Tecnológica” (1 de octubre de 2008). Madrid (España). 5 horas. \n• \nAbril 2008. Curso “Semantic heterogeneity and ontology matching” (15, 16 y 17 de abril de 2008). Madrid (España). \n12 horas. \n• \nJulio 2005. Asistencia a “The Third European Summer School on Ontological Engineering and the Semantic Web \n(SSSW-2005)”. (10-16 Julio de 2004). Cercedilla (España). 40 horas. \nACTIVIDAD EN EMPRESAS Y PROFESIÓN LIBRE: \n• \nDesde diciembre de 1999 a marzo de 2003: Responsable de desarrollo en la empresa Servicios Integrales de Internet \nS.L. Análisis, desarrollo y mantenimiento de aplicaciones Web, intranets y extranets para empresas. \n• \nDesde octubre de 1996 a diciembre de 1999: Colaborador en el Departamento de Mecánica Estructural y \nConstrucciones Industriales de la E.T.S. de Ingenieros Industriales de la Universidad Politécnica de Madrid, realizando \nel análisis y desarrollo de la aplicación de cálculo de pórticos de catenaria CalPor para el Departamento de \nMantenimiento e Infraestructura de RENFE. \nOTRAS CERTIFICACIONES: \n• \nCisco Certified Network Associate (CCNA).  \n• \nSolaris 8 Operating Environment System Administrator. \nAUTORÍA DE PROGRAMAS INFORMÁTICOS: \n• ESPRAD. Sistema de estadísticas de acceso telefónico para RADIUS.  \no \nhttp://sourceforge.net/projects/esprad/ \n• WebODE Performance Benchmark Suite. Herramienta para la evaluación de la eficiencia de editores de ontologías. \no \nhttp://knowledgeweb.semanticweb.org/wpbs/ \n• IBSE. Herramienta para la evaluación de la interoperabilidad de tecnologías semánticas.  \no \nhttp://knowledgeweb.semanticweb.org/benchmarking_interoperability/ibse/ \n• OWLDLGenerator. Generador de casos de prueba basado en keywords para evaluar la conformidad de tecnologías \nsemánticas. \no \nhttp://knowledgeweb.semanticweb.org/benchmarking_interoperability/OWLDLGenerator/ \nCO-AUTORÍA DE PROGRAMAS INFORMÁTICOS: \n• WebODE. Editor de ontologías.  \no \nhttp://webode.dia.fi.upm.es/ \n• SEALS Platform. Infraestructura para la evaluación de tecnologías semánticas.  \no \nhttp://www.seals-project.eu/seals-platform \n• \nOWL2EG. Generador de ontologías expresivas para evaluar la conformidad de tecnologías semánticas. \no \nhttp://knowledgeweb.semanticweb.org/benchmarking_interoperability/OWL2EG/ \n \n",
  "speaker": "SYSTEM",
  "uuid": "8bb39aa4-0cd8-4748-8026-5232b6455458"
}