{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 41\n39\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nColumbia University are helping identify critical issues in the practice of medicine where the Watson tech‐\nnology may be able to contribute, and physicians at the University of Maryland are working to identify the\nbest way that a technology like Watson could interact with medical practitioners to provide the maximum\nassistance.\nScenario: Asymmetric Ecosystems\nA company with significant market strength facilitates a network of organisations that participate at differ‐\nent points in the value chain:\n• For small companies, wider access to markets, customers, without loss of autonomy\n• For large companies, build capabilities without expense and risk of acquisition\n• Can provide a rich mix of technologies\n• Well suited to collaboration in verticals\nExample: Salesforce Marketing Cloud ecosystem\nSalesforce has launched the Marketing Cloud Social Insights ecosystem in October 2012. The product allows\nusers to track social influence and sentiment in 17 languages, as well as identify sales leads, using data pro‐\nduced by 20 analytics services.\nThe Marketing Cloud ecosystem includes partners Bitext, Calais, Caterva, Clarabridge Link, EpiAnalytics,\nKanjoya, Klout, Kred, LeadSift, Lexalytics, LinguaSys, Lymbix, Metavana, OpenAmplify, PeekAnalytics, Rapleaf,\nSolariat, Soshio, The SelfService Company and Trendspottr.\nScenario: Asymmetric Alliances\nA company with significant market strength partners with a niche developer of innovative technologies:\n• Purely tactical\n• Channel partnerships that give access to customers for smaller partners\n• Commitment of training from larger to smaller partner\n• Can have characteristics of a marketplace\n• Could lead to acquisition\nExample: ABBYY and Google Enterprise – OCR as a background service for search\nABBYY, a provider of document recognition, data capture and linguistic technologies and professional serv‐\nices, joined the Google Enterprise Partner program in October 2012. The program extends the power of\nGoogle technologies across the enterprise and helps customers get more value out of their Google enter‐\nprise deployments. The ABBYY integration provides organizations with a single solution that simplifies the\nmanagement, organization and locating of image‐format  documents.\nThe Google Enterprise Partner program includes developers, consultants and independent software vendors\nthat provide value‐added services for Google enterprise products. As part of the Google Enterprise Partner\nprogram, ABBYY received training, support and deployment services from Google, allowing the company to\nretain a close relationship with its customers in order to provide additional services and support.\n",
  "speaker": "SYSTEM",
  "uuid": "8c504866-d365-4c2d-9e56-768510d2ebcc"
}