{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 108\nPage 108 of 111 \nNeOn Integrated Project EU-IST-027595 \nReferences \n1. IEEE Standard Glossary of Software Engineering Terminology. IEEE Std 610.12-1990 \n(Revision and redesignation of IEEE Std 792-1983). \n2. IEEE Guide for Developing Software Life Cycle Processes. IEEE Std 1074.1-1995. \n3. IEEE Standard for Developing Software Life Cycle Processes. IEEE Std 1074-1997 (Revision \nof IEEE Std 1074-1995; Replaces IEEE Std 1074.1-1995). \n4. IEEE Standard for Developing a Software Project Life Cycle Process. IEEE Std 1074-2006. \n(Revision of IEEE Std 1074-1997). \n5. ISO 12200:1999. Computer applications in terminology. Machine-readable terminology \ninterchange format (MARTIf). Negotiated interchange. \n6. ISO 1087-1:2000. Terminology work. Vocabulary. Part 1: Theory and application. \n7. ISO 12207 Systems and Software Engineering - Software Life Cycle Processes. 2006. \n8. German Ministry of Defense. V-Model: Software lifecycle process model. 1992. General \nReprint \nNº250. \nBundesminister \ndes \nInnern, \nKoordinierungs-und \nBeratungstelle \nder \nBundesregierung für Informationstechnik in der Bundesverwaltung. \n9. NeOn Consortium. NeOn: Lifecycle Support for Networked Ontologies. NeOn Technical Annex. \n2006. \n10. US Department of Transportation. Systems Engineering for Intelligent Transportation Systems. \n2007. Available at: http://www.ops.fhwa.dot.gov/publications/seitsguide/seguide.pdf. \n11. F. Alonso, N. Juristo, J. Pazos. Trends in life-cycle models for SE and KE: Proposal for a \nspiral-conical life-cycle approach. 1995. International Journal of Software Engineering and \nKnowledge Engineering, Vol. 5, No. 3 (1995) 445-465.  \n12. F. Alonso, N. Juristo Juzgado, J. L. Maté, J. Pazos. Software engineering and knowledge \nengineering: Towards a common life cycle. Journal of Systems and Software 33(1): 65-79. \n1996. \n13. K. Beck, C. Andres. Extreme Programming Explained: Embrace Change (2nd Edition), 2004. \nAddison-Wesley, Boston. \n14. M. Blázquez, M. Fernández-López, J.M. García-Pinar, A. Gómez-Pérez. Building Ontologies at \nthe Knowledge Level using the Ontology Design Environment. 1998. In: Gaines BR, Musen MA \n(eds) 11th International Workshop on Knowledge Acquisition, Modeling and Management \n(KAW’98). Banff, Canada, SHARE4:1–15. \n15. B. W. Boehm. Software engineering. IEEE Transactions on Computers. Vol. C-25, pp. 1226-\n1241, December. 1976. \n16. B. W. Boehm. A spiral model of software development and enhancement. ACM SIGSOFT \nSoftware Engineering Notes. Vol. 11, no. 4, pp. 14-24, August 1986; reprinted in Computer, \nvol. 21. no. 5, pp. 61-72, May 1988. \n \n",
  "speaker": "SYSTEM",
  "uuid": "8c6b5060-d863-4efd-bfa2-deb5eefc6703"
}