{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_viajes \n\nContents\n[\nhide\n]\n1\nAVISO GENERAL\n2\nNORMATIVA APLICABLE\n3\nDOCUMENTOS DESCARGABLES\n4\nPLAZOS\n5\nAGENCIA DE VIAJES\n6\nPERMISO DE VIAJE (SÓLO PDI)\n7\nPREVIAJE\n8\nDURANTE EL VIAJE\n8.1\nUtilizando la tarjeta OTT\n9\nPOSTVIAJE\n9.1\nManutención\n9.2\nCálculo del número de dietas máximas\n9.3\nDesplazamiento en vehículo particular\n9.4\nDocumentación a adjuntar\n9.5\nGastos no imputados\n9.6\nNorma general\n9.7\nGastos compartidos\n9.7.1\nManutención por invitación\n9.7.2\nMás cosas\n9.8\nEstancias financiadas por OEG\n9.8.1\nPostviaje\n10\nAnexo: Cuantía de las dietas\nAVISO GENERAL\n\nSiempre que se falta del puesto de trabajo y se está trabajando: o se tiene un permiso de teletrabajo (protocolo de vacaciones y permisos) o se tiene un previaje. Queda excluido si la ausencia es por estar en Rectorado firmando contrato, en una charla de doctorandos, etc.\nNORMATIVA APLICABLE\n\nReal Decreto 462/2002 de 24 de Mayo, sobre indemnizaciones por razón del servicio\nOrden EHA/3770/2005 de 1 de diciembre por la que se revisa el importe de la indemnización por uso de vehículo particular establecida en el Real Decreto 462/2002, de 24 de mayo, sobre indemnizaciones por razón del servicio\nNormas para estancias dependientes de cada país\n.\nDOCUMENTOS DESCARGABLES\n\nEn el Repositorio Conocimiento del Portal Investigador UPM está el formulario de gastos de viaje, en formato Excel.\n1. Formularios excel (va uno en blanco para casos especiales) Marzo 2021\nOJO: Nuevo fichero aquí:\nhttps://delicias.dia.fi.upm.es/wiki/images/3/37/Gastos_viajes_rellenable_JULIO_2023.xlsx\n2. Compromiso Tarjeta OTT\n3. Compromiso Conocimiento Protocolo\nPLAZOS\n\nDe modo genérico, hay que entregar los previajes con más de 15 días de anticipación y los postviajes hasta 15 días después de la finalización del viaje.\nAdemás, en los casos de:\nViajes realizados en julio: tienen la obligatoriedad de presentar las facturas y postviajes antes de irse de vacaciones.\nViajes de agosto: la UPM solo cierra dos semanas y, por tanto, el postviaje debe entregarse al equipo de gestión antes de que la UPM cierre o bien nada más que la UPM abra.\nEstancias superiores a un mes: consulta explícita a Gestión sobre cada caso.\nPara la compra de billetes de avión, inscripciones a congresos y pagos de hoteles, se recomienda solicitar un anticipo en el previaje por el valor exacto de lo pagado.\nComo todos sabéis, desde que cada uno entrega un postviaje hasta llega a la OTT se requiere un papeleo interno, escribir las cartas, firmas, escaneo de la documentación, traslado de papeles a la OTT, etc. Todo esto puede llevar días o semanas.\nEn aquellos casos en los que alguien reciba un anticipo para un viaje, y no se gaste dicho anticipo entero, debe devolver a la UPM las cantidades no justificadas del anticipo en un plazo también de dos semanas desde la terminación del viaje con el fin de que se adjunte en su justificación del viaje.\nAGENCIA DE VIAJES\n\nHay acuerdo marco con una agencia de viajes. En el\nportal de compras\n(se accede con cuenta de correo upm) viene toda la normativa, para hacer todo el proceso, etc.\nPERMISO DE VIAJE (SÓLO PDI)\n\nPara facilitar los trámites de autorización de viajes de menos de 15 días al PDI, se ha desarrollado una\naplicación\ninformática que se ha incluido en la Sede Electrónica de la UPM como nuevo procedimiento.\nA partir del día 15 de mayo de 2022, todas las solicitudes de viajes de este tipo, tienen que realizarse a través de dicha aplicación.\nEl nuevo procedimiento de solicitudes de permisos de viaje de menos de 15 días para el PDI sigue los siguientes pasos:\n1) El interesado entra en sede.upm.es y selecciona\n'Solicitud de viajes de duración menor de 15 días del catálogo de procedimientos'\n.  En el formulario de solicitud se introducen los datos del viaje y el nombre del profesor o profesores que le sustituirá durante en viaje. Se puede firmar la solicitud con usuario UPM y contraseña o con un certificado digital.\n· Es posible introducir varios destinos y motivos en una sola solicitud de autorización de viaje.\n· Es obligatorio realizar la solicitud al menos 5 días antes de la salida; en caso contrario, será necesario seguir el procedimiento actual de manera urgente y excepcional, no pudiendo garantizarse las coberturas del seguro de viajes contratado por la UPM\n2) El profesor (profesores) propuesto para que realice la sustitución, recibirá un correo electrónico con los datos del viaje y dos enlaces, uno para aceptar y otro para rechazar la sustitución.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud, para que pueda hacer una nueva solicitud proponiendo otro sustituto\n· En caso de aceptación, se sigue con la tramitación.\n3) El Director del Departamento del interesado recibe un correo del portafirmas con una petición de firma del permiso. Este permiso contiene los datos del viaje, el nombre del sustituto y un breve resumen de los últimos viajes autorizados del interesado.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud.\n· En caso de aceptación, se sigue con la tramitación.\n4) El Director/Decano de la Escuela/Facultad del interesado recibe un correo del portafirmas con una petición de firma del permiso firmado por el Director del Departamento.\n· En caso de rechazo, se avisa al interesado y se archiva la solicitud.\n· Para viajes dentro de la UE y aceptados por el Director/Decano, el interesado recibe un aviso de la aceptación de su solicitud y puede descargar el permiso en la Sede Electrónica.\n· En casos de viajes fuera de la UE aceptados por el Director/Decano, el Gerente tiene que autorizar el permiso antes del aviso al interesado.\n· En todo momento, se podrá consultar el estado del expediente en el apartado \"Mis Expedientes\" de la Sede Electrónica de la UPM\nFinalmente, al igual que en el procedimiento actual, se guardan todos los datos del viaje en COPERNYCO.\nPREVIAJE\n\nRellenar la hoja previaje no es difícil. Es la primera de las dos hojas del formulario PDF de la OTT.\nHay que rellenar con el mayor detalle:\n.- Teléfono: 73083\n.- Correo electrónico: admin-oeg@delicias.dia.fi.upm.es\n.- Proyecto: es la cuenta OTT del proyecto (si no se sabe se pregunta a Gestión)\n.- Nombre, DNI, datos bancarios, del investigador\n- Escala:\nBecario OTT\n,\nContratado OTT\n,\nContratado Investigación\n(FPU, FPI, CAM, UPM, JdC, BG, RyC, etc.), PDI:\nPAD, CD, PTEU, PTU, CEU, CU\n.\n.- Vinculación: Miembro del equipo de investigación. Sólo para determinadas personas y en proyectos nacionales es la otra opción (consultar)\n.- Número de días y fechas de viaje\n.- Itinerario del viaje (ej.:\nMadrid-Milán-Florencia/Florencia-Roma-Madrid\n)\n.- Tipo y motivo del viaje: \"\nPresentación del artículo \"XXX\" en la conferencia XXX, perteneciente al trabajo en el paquete de trabajo X del proyecto X\n\", \"\nImpartición de charla en el evento XXX, invitado por la organización, dentro de la diseminación del paquete de trabajo X del proyecto X\n\", \"\nNegociación de propuesta FPX-XXXX en la Unión Europea\n\", etc. Recordad que luego esto hay que demostrarlo con el artículo, con las transparencias de la charla, con el correo de invitación, etc.\n.- Medios de transporte:\navión\n,\ntren\n,\ncoche propio\n,\ncoche ajeno\n, etc.\n.- Si se pide o no anticipo y, en su caso, cantidad\n.- Fecha de firma, siempre anterior a la fecha de salida del viaje\n.- Nombre del IP de la cuenta OTT en la firma\nDURANTE EL VIAJE\n\nDurante el viaje los miembros deberán conservar todos los tickets, facturas, billetes, tarjetas de embarque, tickets de repostaje... que documenten gastos que deseen justificar.\nUtilizando la tarjeta OTT",
  "speaker": "SYSTEM",
  "uuid": "8d271955-7286-44d2-969c-095abc5349e1"
}