{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Art%C3%ADculos_relacionados_con_el_data_provenance \n\n1.-\n#The Open Provenance Model\n2.-\n#A semantic Web Approach to the Provenance Challenge\n3.-\n#Using trust and Provenance for content filtering on the semantic Web\n4.-\n#Annotation and Provenance Trackin in Semantic Web Photo Libraries\n5.-\n#A distributed Algorithm for Determining the Provenance Data\n6.-\n#Towards Content Trust of Web Resources\n7.-\n#Conceptos reutilizables del estado del arte de los proyectos mIO! y España Virtual\n8.-\n#Problem-Solving Methods for understanding Process Executions\n9.-\n#Validation of E-Science Experiments using a Provenance-based Approach (presentación)\n10.-\n#Provenance and Interoperability (presentación)\n11.-\n#Semantic e-Science\n12.-\n#Assessing Information Quality Using Web Data Provenance\n13.-\n#PrOM: A Semantic Web Framework for Provenance Mangement in Science\nContents\n[\nhide\n]\n1\nThe Open Provenance Model\n2\nA semantic Web Approach to the Provenance Challenge\n3\nUsing trust and Provenance for content filtering on the semantic Web\n4\nAnnotation and Provenance Tracking in Semantic Web Photo Libraries\n5\nA distributed Algorithm for Determining the Provenance Data\n6\nTowards Content Trust of Web Resources\n7\nConceptos reutilizables del estado del arte de los proyectos mIO! y España Virtual\n8\nProblem-Solving Methods for understanding Process Executions\n9\nValidation of E-Science Experiments using a Provenance-based Approach (presentación)\n10\nProvenance and Interoperability (presentación)\n11\nSemantic e-Science\n12\nAssessing Information Quality Using Web Data Provenance\n13\nPrOM: A Semantic Web Framework for Provenance Mangement in Science\nThe Open Provenance Model\n\nAutores\n: Luc Moreau(Editor), Beth Pale, Simon Miles, Carole Goble, Paolo Missier, Roger Barga, Yogesh Simmhan, Joer Futrelle, Robert E. McGrath, Jim Myers, Patrick Paulson, Shawn Bowers, Bertram Ludaescher, Natalia Kwasnikowska, Jan Van den Bussche, Tommy Ellkvist, Juliana Freire y Paul Groth.\nFecha\n: 17 de julio, 2008\nPaper donde se introduce un modelo de provenance que intenta cubrir los siguientes requisitos:\nPermitir que la información del provenance pueda ser compartida entre sistemas basándose en un modelo de provenance compartido\nPermitir a los desarrolladores construir y compartir herramientas para operar con dicho modelo.\nDefinir el modelo\nDefinir un conjunto de reglas que identifiquen las inferencias válidas en grafos provenance\nSin embargo, no se especifican las representaciones internas que debe hacer cada sistema para manipular el provenance internamente, no se define una sintaxis \"parseable\" para el modelo, y no se especifican protocolos para almacenar la información del provenance en los repositorios.\nEl modelo que se propone está basado en 3 entidades primarias: artefactos, procesos y agentes.\nLos artefactos son piezas inmutables de estado, que bien pueden representar un objeto físico o bien uno digital en un sistema. Los procesos son las acción o series de acciones causadas por los artefactos, que desembocan en la creación de nuevos artefactos.\nLos agentes, por último, son los \"catalizadores\" del proceso, facilitando o controlando su desarrollo.\nLas dependencias que existen entre estas entidades varían:\nExiste una dependencia de uso cuando un proceso P usa un artefacto A en su ejecución\nExiste una dependencia de \"serGeneradoPor\" cuando un artefacto A es resultante del proceso P.\nExiste una dependencia de \"serControladoPor\" cuando el agente Ag controla el proceso P\nExiste una dependencia de \"serActivadoPor\" cuando un proceso P2 activa un proceso P1\nExiste una dependencia de \"serDerivadoDe\" cuado un artefacto A2 se obtiene a partir del artefacto A1.\nEn el caso de las 3 primeras, hay que destacar que como un proceso puede usar varios artefactos,(o un artefacto ser generado por varios procesos, o un proceso ser controlado por varios agentes), es importante identificar el rol bajo el cual se usó cada uno de ellos.\nCada proceso, agente o artefacto tiene un identificador propio que los distingue de los demás. Sólo son iguales si coinciden sus ids. Las aristas del grafo se distinguen por su fuente, destino y su rol.\nSe proponen 2 modelos de grafo : uno si tener en cuenta el tiempo en el que ocurren los sucesos y otro teniéndolo en cuenta, dado que se argumenta que el tiempo no influye en la causalidad de las entidades: que un proceso se produzca antes que otro no quiere decir que el segundo dependa de alguna manera del primero.\nEn cuanto al conocimiento que puede ser inferido, se introduce la relación \"puedeHaberSidoDerivadoDe\", si un artefacto fue generado por un proceso que a su vez usó otro artefacto. Además se define el cierre transitivo de las relaciones de uso, serGeneradoPor,serDerivadoDe y serActivadoPor,( de manera que, por ejemplo, si un proceso fue activado por otro y ese otro usaba un artefacto, entonces podríamos decir que el nuevo proceso también lo ha usado).\nPara terminar, se explica un ejemplo con detalle y se subraya que este modelo sirve para ejecuciones pasadas. Además se invita a los grupos que hayan definido su propio modelo a convertir sus representaciones al que se presenta y viceversa.\nA semantic Web Approach to the Provenance Challenge",
  "speaker": "SYSTEM",
  "uuid": "8d5abe94-f999-4276-ac64-4a273495d47f"
}