{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 75\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 75 of 124\nFigure 5.1: Thesaurus Standards Evolution [Lab07]\n• ANSI/NISO Z39.19-2005, guidelines for the construction, format, and management of monolingual\ncontrolled vocabularies [ANS05]. This standard is related to ISO 2788. It presents guidelines and con-\nventions for the contents, display, construction, testing, maintenance, and management of monolingual\ncontrolled vocabularies. It focuses on controlled vocabularies that are used for the representation of\ncontent objects in knowledge organization systems including lists, synonym rings, taxonomies, and\nthesauri.\n• BS 8723-1:2005 and BS 8723-2:2005 [BS 05a, BS 05b]. The British Standard BS 8723-1 deﬁnes\nthe terminology used throughout the rest of the BS 8723 series. It provides an excellent glossary for\nterminology relating to the use of thesauri for indexing and retrieval. The British Standard BS 8723-\n2 provides guidelines for the construction and maintenance of thesauri that are intended as retrieval\ntools.\nGuidance is also given for designers of software supporting the creation and maintenance\nprocess.\n5.3\nComponents of a Thesaurus\nAccording to the ANSI/NISO Z39.19-2005 [ANS05] a thesaurus is a controlled vocabulary in a known order\nand structured so that various relationships among terms are displayed clearly and identiﬁed by standardized\nrelationships indicators. There are three types of relationships used in thesaurus:\n• Equivalency. When the same concept can be expressed by two or more terms, one of these is selected\nas the preferred term. The relationship between preferred and non-preferred terms is an equivalence\nrelationship in which each term is regarded as referring to the same concept. The equivalence rela-\ntionship is expressed by the following conventions:\n– U or USE, which leads from a non-preferred term to the preferred term.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "8d9ee28e-33b6-425d-83a8-bd958aa34a1b"
}