{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Wache_et_al-survey \n\nBUSTER uses ontology to further define terms from the database or the database schema.\nThese definitions do not correspond to the structure of the database, these are only linked to the information by the term that defined.\nThe definition can be a set of rules.\nHowever, In most cases the terms are described by concept definitions.\nStructure Enrichment\n\nmost common approach\ncombines the two previously mentioned approaches\na logical model that resembles the structure of the information source and contains additional definitions of concepts.[Kashyap and Sheth, 1996a]\nsystems that use this approach include OBSERVER, KRAFT, PICSEL, DWQ\nOBSERVER uses DL for both structure and additional definitions\nPICSEL and DWQ defines the structure of information by (typed) horn rules. Additional info about concepts in the rules is given in DL.\nKRAFT does not commit to a specific definition of scheme.\nMeta-Annotations\n\nThis approach becomes prominent with the need to integrate information present in the WWW\nApproaches developed for the WWW are Ontobroker[Fensel et al., 1998] and SHOE[Heflin and Hendler, 2000b].\nInter-Ontology Mapping\n\nMany information integration systems such as [Mena et al., 1996] or [Preece et al., 1999] use mutiple ontologies.\nMapping between different ontologies is a well known problem\nThis survey focuses on some general approaches used in information integration:\nDefined Mappings\n\nIn KRAFT special mediator agents are used to translate between different ontologies and even different languages.\nDifferent kinds of mappings:\none-to-one mappings between classes and values\nmappings between compound expressions.\nThis approach allows great flexibility, but it fails at ensuring semantics because the user is free to define mappings which does not make sense.\nLexical Relations\n\nIn OBSERVER, relationships uses are synonym, hyoernym, hyponyn, overlap, covering and disjoint.\nwhile similar to DL constructors these do not have formal semantics, hence, the subsumption algorithm is rather heuristic than formally grounded.\nTop-Level Grounding\n\nIn order to avoid loss of semantics, one has to stay inside a formal representation language when defining mappings (e.g. DWQ)\none way to achieve this, is to relate all ontologies used to a single top-level ontology (by inheriting concepts from the common top-level ontology)\nthis allows to establish connections between concepts from diferent ontologies in terms of common superclasses.\nhowever, it does not establish direct correspondance.\nSemantic Correspondence\n\ntries to overcome the ambiguity of indirect mapping via top-level grounding\nto avoid arbitrary mappings between concepts, these approaches rely on a common vocabulary for defining mappings.\n[Wache, 1999] uses semantic labels in order to compute correspondences between database fields.\nStuckenschmidt et al. build a description logic model of terms from different information sources, and shows that subsumption reasoning can be used to establish relations between different terminologies.\napproaches using formal concept analysis also fall into this category, because they define concepts on the basis of a comon voc. to compute a common concept lattice.\nOntology Engineering\n\nDevelopment Methodology\n\n...\nOntology Evolution\n\nAn integration system, and the ontologies, must support adding and/or removing sources and must be robust to changes in the information sources.\nHowever, few of the evaluated systems takes this into account, only SHOE does.\nOpen Questions\n\nthe evaluated integration systems show that reasonable results have been achieved on the technical side of using ontologies for this task.\nthe use of mappings is an exception\nmost aproaches still use ad-hoc or arbitrary mappings.\nthere are some approaches that try to prodide well-founded mappings, but they either rely on assumptions that cannot always be guarantee or face technical problems.\nthe authors found that there is a lack of sophisticated methodologies for supporting the development and use of ontologies.\nthe comparison shows that the language and structure of the ontology depends on the kind of information to be integrated.\nthe author believes that more general methodologies must be developed.\na good methodology must also cover evaluation and verification",
  "speaker": "SYSTEM",
  "uuid": "8de93e8c-537f-4fbc-b8a2-a68a93ab114e"
}