{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_viajes \n\nCuando viajan varias personas a una misma conferencia o reunión de proyecto, es normal y aconsejable (está más arriba) compartir habitación dos miembros del Grupo. Una de las personas paga la cuenta total de la habitación, pero cada una imputa el coste proporcional de su alojamiento. Una adjunta la factura original y los demás fotocopias de la factura.\nCuando se paga un hotel de habitación compartida con la tarjeta OTT tienen que realizar dos cargos, cada uno por la mitad de la habitación, porque los cargos con tarjeta no se pueden compartir entre proyectos, con lo que mejor siempre que hagan dos o no se pague con tarjeta OTT.\nEjemplo\n:\nMora y yo compartimos habitación las 3 noches en el Gotham Center Hotel. Como Mora tiene tarjeta OTT, paga con su tarjeta el hotel completo, es decir, hay una sola factura por 300€. Mora en su postviaje pondrá sus 150€ y adjuntará el original de la factura. Yo en mi postviaje pondré mis 150€ y adjuntaré fotocopia de la factura e indicaré que el original está en el postviaje de Mora. En ambos casos, el pago es con tarjeta OTT y en ambos hay que reintegrarlo a la tarjeta OTT de Mora. IMPORTANTE: Esto sólo se puede hacer si nos va a pagar el mismo proyecto. Si no, con la misma tarjeta OTT hay que pagar la habitación en dos partes porque hay que imputar dos cargos a dos proyectos diferentes.\nSi en vez de pagar con tarjeta OTT Mora paga en metálico porque tiene un billete de 500€ y quiere cambiarlo, yo le tendré que dar a Mora mis 150€ de hotel. Se operará igual en el postviaje y la factura. La única diferencia es que es a devolver en cada caso al que firma el postviaje porque es en metálico.\nY si hace falta, se divide por noches. O sea, si la habitación sólo la compartimos 2 noches y la otra sólo está Mora, pues Mora paga su noche completa y las otras dos se dividen y yo pago dos medias noches (en los previajes están las fechas de las noches que se cubren y de las que no).\nManutención por invitación\n\nComo la manutención se debe pagar en metálico, lo mejor es echar cuentas entre los miembros y saldar el dinero, puesto que luego cada uno recibirá su parte.\nEjemplo\n:\nCada uno pagamos en una factura independiente del hotel los desayunos, en metálico (60€). Carmen se va a comer con los peces gordos todos los días y les hacen facturas independientes en el restaurante, con lo que Carmen paga en metálico sus comidas (suman 300€). Mora come sandwiches de máquina cuando se acuerda de comer y paga en metálico (12€). Yo me voy a la \"Casa de España en Gotham\" en las comidas y pago en metálico (45€).\nSalimos a cenar por la Bigger Gotham Avenue Mora, Carmen y yo. Y entramos en un restaurante que elige Carmen. Como ha elegido Carmen, paga ella lo de los tres (90€). Otro día elige Mora y paga Mora (60€). Y otro día elijo yo y pago yo (30€).\nLo primero es arreglar cuentas entre nosotros. Yo tengo que pagar a Carmen 20€ y a Mora 10€ y Mora le tiene que pagar a Carmen 10€. Así ya estamos en paz, cada uno hemos pagado lo nuestro.\n¿Cuánto tenemos que pasar cada uno?\nCarmen pasará las dietas que le cubran sus 60€ + 300€ + 30€ = 390€.\nMora pasará las dietas que le cubran sus 60€ + 12€ + 60€ = 132€.\nYo pasaré las dietas que me cubran mis 60€ + 45€ + 60€ = 165€.\nA cada uno se le devolverá lo suyo y todos en paz, porque lo primero es que se arreglaron las cuentas y cada uno gastó (aunque no pagó) lo suyo.\nMás cosas\n\nPara el resto de cosas (billetes de autobús o tren, inscripciones, etc.), haced lo mismo y así es todo mucho más fácil.\nEn el caso de los taxis, puede uno pasar el taxi de varios, eso no hay problema, porque el servicio es el mismo para uno que para dos y el gasto de desplazamiento en taxi no es obligatorio (como en el caso del hotel, que sí que hay que dormir).\nDe todos modos, ante cualquier duda, preguntad antes de rellenar el postviaje y traérselo a Ana, para así evitar tener documentación a medias y demás.\nEstancias financiadas por OEG\n\nTodos aquellos que no tienen estancia financiada por un programa oficial o le hayan denegado la beca/ayuda de su programa, de la UPM, etc.\nLos\ncostes máximos\nque el Grupo pagará serán:\n- Viaje: 300€ Europa, 700€ América, 800€ Asia (con facturas)\n- Alojamiento: 500-600€/mes (con factura)\n- Manutención: 100€/mes\n- Taxis: 100€ (con facturas)\nPostviaje\n\nEl postviaje se realizará como uno normal a la hora de pasar el viaje (facturas), alojamiento (facturas) y taxis (facturas).\nPara la manutención se calcula (nº_meses)x100 y se ponen las dietas de manutención hasta cubrir esa cantidad. Por ejemplo, si se está dos meses y veinte días en un país cuya dieta son 40€/día: 2,6x100=260€ -> Se justificarán 6,5 dietas =260€.\n¿Qué ocurre si alguien se pasa del máximo?\nEj.: El viaje de avión+tren hasta llegar a donde voy cuesta 320€ i/v. El viaje se justifica igual, pero los 20 de exceso se restan a la manutención. 3 meses x 100 = 300€ - 20 exceso de viaje = 280€ a cubrir con las dietas.\nIgualmente se procederá con los excesos de alojamiento y taxis, de modo que el exceso del límite corre a cargo del que realiza la estancia.\nPara cualquier duda, que puede haber muchas porque hay mucha casuística, preguntad al equipo de gestión.\nAnexo: Cuantía de las dietas\n\nNota 1\n: Cuidado que Holanda viene como Países Bajos y los países que formaban Yugoslavia se rigen por la dieta de Yugoslavia.\nNota 2\n: Para los contratados C y D no rigen estas dietas, nos preguntáis las cantidades explícitamente a nosotros.\nPaís\nManutención\nAlojamiento\nEspaña\n37,40\n65,97\nResto del mundo\n40,87\n108,78\nAlemania\n59,50\n132,82\nAndorra\n37,86\n46,88\nAngola\n59,50\n135,23\nArabia Saudita\n54,09\n101,57\nArgelia\n44,47\n101,57\nArgentina\n55,29\n111,19\nAustralia\n51,09\n81,14\nAustria\n58,90\n95,56\nBélgica\n82,94\n148,45\nBolivia\n36,66\n51,09\nBosnia-Herzegovina\n49,88\n72,72\nBrasil\n79,33\n128,02\nBulgaria\n37,86\n53,49\nCamerún\n48,68\n88,35\nCanadá\n51,69\n94,36\nChile\n50,49\n102,17\nChina\n46,28\n71,52\nColombia\n78,13\n123,81\nCorea\n55,29\n102,17\nCosta de Marfil\n49,28\n61,30\nCosta Rica\n44,47\n65,51\nCroacia\n49,88\n72,72\nCuba\n33,06\n56,50\nDinamarca\n64,91\n122,61\nRepública dominicana\n36,66\n64,31\nEcuador\n43,27\n64,91\nEgipto\n39,07\n91,35\nEl Salvador\n43,27\n66,11\nEmiratos Árabes Unidos\n56,50\n101,57\nEslovaquia\n43,27\n75,73\nEstados Unidos\n69,72\n143,04\nEtiopía\n37,86\n119,60\nFilipinas\n39,67\n71,52\nFinlandia\n65,51\n114,79\nFrancia\n65,51\n122,61\nGabón\n52,89\n100,37\nGhana\n37,26\n66,71\nGrecia\n39,07\n69,12\nGuatemala\n42,67\n89,55\nGuinea ecuatorial\n50,49\n87,75\nHaití\n37,86\n45,08\nHonduras\n42,07\n69,72\nHong Kong\n51,69\n121,40\nHungría\n46,28\n115,39\nIndia\n38,46\n99,77\nIndonesia\n42,67\n102,17\nIrak\n39,07\n66,11\nIrán\n44,47\n80,54\nIrlanda\n48,08\n93,16\nIsrael\n56,50\n92,56\nItalia\n63,11\n131,02\nJamaica\n46,28\n46,93\nJapón\n96,76\n159,87\nJordania\n42,67\n93,16\nKenia\n39,67\n82,34\nKuwait\n44,47\n122,61\nLíbano\n34,86\n115,39\nLibia\n54,69\n102,17\nLuxemburgo\n55,89\n135,83\nMalasia\n34,26\n91,95\nMalta\n31,85\n46,28\nMarruecos\n39,67\n99,17\nMauritania\n39,07\n49,28\nMéjico\n43,27\n81,74\nMozambique\n42,67\n67,31\nNicaragua\n52,89\n94,36\nNigeria\n46,88\n117,80\nNoruega\n80,54\n132,82\nNueva Zelanda\n40,27\n65,51\nPaíses Bajos\n64,31\n126,81\nPakistán\n37,26\n58,30\nPanamá\n36,66\n64,91\nParaguay\n33,06\n45,68\nPerú\n43,27\n79,93\nPolonia\n42,67\n99,77\nPortugal\n43,87\n97,36\nReino Unido\n82,94\n156,86\nRepública Checa\n43,27\n101,57\nRumanía\n38,46\n126,81\nRusia\n73,32\n227,78\nSenegal\n45,08\n67,91\nSingapur\n48,08\n85,34\nSiria\n46,28\n83,54\nSudáfrica\n48,08\n64,31\nSuecia\n75,13\n147,25\nSuiza\n61,30\n148,45\nTailandia\n39,07\n69,12\nTaiwán\n48,68\n81,74\nTanzania\n30,05\n76,93\nTúnez\n46,28\n51,69\nTurquía\n39,07\n61,30\nUruguay\n41,47\n57,70\nVenezuela\n36,06\n78,13\nYemen\n43,27\n132,82\nYugoslavia\n49,88\n98,57\nZaire/Congo\n54,09\n101,57\nZimbawe\n39,07\n76,93",
  "speaker": "SYSTEM",
  "uuid": "901416b0-59a0-4a63-8880-917c008718f2"
}