{
  "message": "SYSTEM: Cicyt_jorge_CV_2016_01.pdf: Página 34\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \nREVISOR EN CONFERENCIAS Y REVISTAS \n- \nREVISTAS: International Journal on Semantic Web and Information Systems; Artificial Intelligence Journal; Knowledge and \nInformation Systems; Journal of Data Semantics; Journal of Web Semantics; Semantic Web Journal; Data & Knowledge Engineering \nJournal; International Journal of Knowledge Engineering and Data Mining \n- \nCONFERENCIAS: International Semantic Web Conference (ISWC 2013), International World Wide Web Conference (WWW2010); \nIEEE International conference on Information Reuse and Integration (IEEE IRI-2008, IEEE IRI-2009); Knowledge Engineering and \nKnowledge Management (EKAW 2008, EKAW 2010) \n \nSEMINARIOS IMPARTIDOS \n- \nSeminario impartido en Università di Roma \"La Sapienza\", Dipartimento di Informatica: \"Heterogeneity issues and multilingual \nchallenges on the Semantic Web\" el 24/10/2014 \n- \nSeminario impartido en INRIA (Grenoble, Francia): “Cross-lingual linking and ontology translation on the Web of Data”, el 11/06/2013  \n- \nSeminario impartido en INRIA (Grenoble, Francia): “The multilingual Web of Data and the problem of cross-lingual Ontology \nMatching”, el 12/06/2012 \n- \nSeminario impartido en el Human Computer Studies Laboratory (University of Amsterdam, Holanda): “Techniques for Semantic \nHeterogeneity Reduction on the Web”, el 9/09/2009 \n- \nSeminario impartido en el Knowledge Media Institute (Open University, Reino Unido): “Discovering the semantics of user keywords: \nan application to improve ontology matching”, el 5/09/2007 \n \nPARTICIPACIÓN EN GRUPOS DE INVESTIGACIÓN \n- \nMiembro del Ontology Engineering Group (Univ. Politécnica de Madrid) y colaborador del grupo de Sistemas de Información \nDistribuidos (Univ. Zaragoza)  \n \nOTROS ESTUDIOS DE POSTGRADO \n- \nCertificado de Aptitud Pedagógica (ICE, Universidad de Zaragoza) (1996-1997) \n- \nCertificado de Postgrado en Gestor de Proyectos Informáticos (Univ. Oberta de Catalunya, 2002) \n- \nCertificado de Postgrado en Programador en Java para Internet (UOC,  2002) \n- \nCertificado de Postgrado en Técnico en Gestión del Conocimiento (UOC,  2003) \n- \nDiploma de Formación Pedagógica para el Profesorado Universitario (Instituto de Ciencias de la Educación, Universidad de \nZaragoza, 2005-2006) \n- \nCurso Avanzado en “Semantic heterogeneity and ontology matching” (Facultad de Informática, UPM, 2008) \n- \nPrimer curso de la Diplomatura de Estadística en la Facultad de Ciencias de la Universidad de Zaragoza \n \nOTROS CURSOS DE FORMACIÓN TÉCNICA \n- \n1998: Beca de Formación de la empresa CORITEL sobre entornos Cliente/Servidor lenguaje C, SQL, Visual Basic, metodología y \nestándares de diseño estructurado, etc. (300 horas); Curso de PL/SQL. \n- \n1999: Curso de DSS Agent  impartido por MicroStrategy. \n- \n2000: Curso de DEVELOPER 2000; Curso de C++ (2000); Curso de Redes Digitales Integradas en la Escuela de Ingeniería de La \nSalle (Universidad Ramon Llull de Barcelona) (80 horas). \n- \n2001: Curso de Optimización de Aplicaciones sobre Oracle; Curso de Estructura y Utilidades de Oracle; Curso de Análisis y Diseño \nOrientado a Objetos con UML. \n- \n2002: Curso de DEVELOPER 6i.  \n- \n2013: Course on “Data Analysis” (8 weeks) by John’s Hopkins University at Coursera; Course on “Statistics: Making Sense of Data” \n(8 weeks) by University of Toronto at Coursera. \n- \n2014: Course on “The Data Scientist’s Toolbox” (4 weeks) and “R Programming” (4 weeks)  by John’s Hopkins University at \nCoursera. \n \nEXPERIENCIA PROFESIONAL \n- \n07/1998 a 12/1999: CORITEL (consultora de servicios informáticos del grupo Accenture) como programador en entornos \nCliente/Servidor en proyecto de Datawarehouse para la empresa Danone. \n- \n12/1999 a 11/2003: TECO SOFT (grupo TELECOM ITALIA) participando en proyectos de Ingeniería del Software como Analista \nFuncional para importantes empresas de telecomunicaciones (Retevision, Auna), adquiriendo experiencia en modelado de datos, \nanálisis de requerimientos, coordinación de pequeños equipos de trabajo, aplicación de metodologías de desarrollo, etc. \n",
  "speaker": "SYSTEM",
  "uuid": "90e3d230-86ce-45ca-bdaf-3f445f27bf37"
}