{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 7\nimportance. He who works with the door open gets all kinds of interruptions, but he also occasionally gets\nclues as to what the world is and what might be important. Now I cannot prove the cause and effect\n\u0007\nsequence because you might say, ``The closed door is symbolic of a closed mind.'' I don't know. But I can\n\u0006\nsay there is a pretty good correlation between those who work with the doors open and those who\n\u0006\nultimately do important things, although people who work with doors closed often work harder. Somehow\n-\nthey seem to work on slightly the wrong thing - not much, but enough that they miss fame.\n\f\nI want to talk on another topic. It is based on the song which I think many of you know, ``It ain't what you\ndo, it's the way that you do it.'' I'll start with an example of my own. I was conned into doing on a digital\n \ncomputer, in the absolute binary days, a problem which the best analog computers couldn't do. And I was\n\u0007\ngetting an answer. When I thought carefully and said to myself, ``You know, Hamming, you're going to\n\u0017\nhave to file a report on this military job; after you spend a lot of money you're going to have to account for\n\u001a\nit and every analog installation is going to want the report to see if they can't find flaws in it.'' I was doing\nthe required integration by a rather crummy method, to say the least, but I was getting the answer. And I\n\f\nrealized that in truth the problem was not just to get the answer; it was to demonstrate for the first time, and\nbeyond question, that I could beat the analog computer on its own ground with a digital machine. I\n\u001d\nreworked the method of solution, created a theory which was nice and elegant, and changed the way we\n\u0018\ncomputed the answer; the results were no different. The published report had an elegant method which was\n\u0007\nlater known for years as ``Hamming's Method of Integrating Differential Equations.'' It is somewhat\n%\nobsolete now, but for a while it was a very good method. By changing the problem slightly, I did important\n\u000e\nwork rather than trivial work.\n\nIn the same way, when using the machine up in the attic in the early days, I was solving one problem after\nanother after another; a fair number were successful and there were a few failures. I went home one Friday\n\t\nafter finishing a problem, and curiously enough I wasn't happy; I was depressed. I could see life being a\n\t\nlong sequence of one problem after another after another. After quite a while of thinking I decided, ``No, I\nshould be in the mass production of a variable product. I should be concerned with \n\u0006\nall\n.\n of next year's\nproblems, not just the one in front of my face.'' By changing the question I still got the same kind of results\n\u000f\nor better, but I changed things and did important work. I attacked the major problem - How do I conquer\n\u000e\nmachines and do all of next year's problems when I don't know what they are going to be? How do I\n\u0014\nprepare for it? How do I do this one so I'll be on top of it? How do I obey Newton's rule? He said, ``If I\n\u000f\nhave seen further than others, it is because I've stood on the shoulders of giants.'' These days we stand on\n\u001a\neach other's feet!\n\b\nYou should do your job in such a fashion that others can build on top of it, so they will indeed say, ``Yes,\nI've stood on so and so's shoulders and I saw further.'' The essence of science is cumulative. By changing a\nproblem slightly you can often do great work rather than merely good work. Instead of attacking isolated\n\u000f\nproblems, I made the resolution that I would never again solve an isolated problem except as characteristic\n\u000f\nof a class.\n\u000e\nNow if you are much of a mathematician you know that the effort to generalize often means that the\n\u0011\nsolution is simple. Often by stopping and saying, ``This is the problem he wants but this is characteristic of\n\u0006\nso and so. Yes, I can attack the whole class with a far superior method than the particular one because I was\n\u0006\nearlier embedded in needless detail.'' The business of abstraction frequently makes things simple.\n\b\nFurthermore, I filed away the methods and prepared for the future problems.\n/\nTo end this part, I'll remind you, ``It is a poor workman who blames his tools - the good man gets on with\n$\nthe job, given what he's got, and gets the best answer he can.'' And I suggest that by altering the problem,\n\f\nby looking at the thing differently, you can make a great deal of difference in your final productivity\n\u001d\nbecause you can either do it in such a fashion that people can indeed build on what you've done, or you can\n\u001d\ndo it in such a fashion that the next person has to essentially duplicate again what you've done. It isn't just a\n \nmatter of the job, it's the way you write the report, the way you write the paper, the whole attitude. It's just\n\u0014\nas easy to do a broad, general job as one very special case. And it's much more satisfying and rewarding!\n\t\nI have now come down to a topic which is very distasteful; it is not sufficient to do a job, you have to sell\nit. `Selling' to a scientist is an awkward thing to do. It's very ugly; you shouldn't have to do it. The world is\nsupposed to be waiting, and when you do something great, they should rush out and welcome it. But the\n\u0006\nfact is everyone is busy with their own work. You must present it so well that they will set aside what they\nare doing, look at what you've done, read it, and come back and say, ``Yes, that was good.'' I suggest that\n\t\n",
  "speaker": "SYSTEM",
  "uuid": "925152e4-6389-4f13-834c-ddc85528161e"
}