{
  "message": "SYSTEM: Planing_Scheduling.pdf: Página 5\nIn the guided way: gOntt creates a preliminary plan \nfor the ontology development by means of (1) \ntemplates that schedule ontology projects and (2) a \nsimple wizard that contains intuitive questions \nimplicitly allowing the ontology developer to select the \nontology life cycle model and the processes and \nactivities needed in his development. To answer such \nquestions the ontology developer should take into \naccount the ontology requirements and the type of \ncandidate knowledge resources to be reused.  \ngOntt \nuses \ninternally \nthe \nmethodological \nfoundations explained in Section 4. \ngOntt main output is the initial plan for building the \nontology in the form of a Gantt chart, which the \ndeveloper can modify later on (a) by including, \nmodifying, or deleting processes, activities and phases; \n(b) by changing order and dependencies among \nprocesses and activities; and (c) by including resource \nassignments and restrictions to the plan. This \nfunctionality to generate preliminary plans provides a \ngreat advantage over the tools that schedule projects. \n \n5.2. Helping to execute an ontology project \n \n \nWith the aim of helping ontology developers to \ncarry out a particular process or activity, gOntt \nprovides prescriptive methodological guidelines by \nmeans of (1) a filling card that includes the process or \nactivity definition, its goal, the inputs and outputs, the \nperformer of the action, and the time required, and (2) \na workflow that describes how the process or the \nactivity should be performed with its inputs, outputs, \ntasks and actors involved. Figure 3 presents the \nmethodological \nguidelines \nfor \nthe \nontology \nrequirements specification activity. \n  \n \nFigure 3. Example of methodological guidelines \nIn addition, gOntt provides a direct and automatic \naccess to NeOn Toolkit plug-ins3 associated to each \nprocess and activity. Besides, gOntt displays a quick-\nstart guide for using the plug-in launched. \n \n6. Evaluation of gOntt  \n \nWe conducted an experiment using gOntt in two \nsettings that involved Master and PhD students. Both \ngroups of students had chosen the ‘Ontology \nEngineering and Semantic Web’ subject. The students \nexecuted the experiment during the period of October-\nNovember 2009. The students (working in pairs) had \nto develop an ontology network in a free domain. They \nwere provided with (1) a set of mandatory processes \nand activities (e.g., to specify requirements and to \nreuse different types of knowledge resources) and (2) a \nset of optional processes and activities (e.g., \nlocalization, evaluation, and modularization) to be \ncarried out in the ontology development project. \nThe main goal of the experiment was to test that the \nstudents (1) scheduled their ontology development \nproject with gOntt, (2) performed the ontology \ndevelopment project following the schedule created \nwith gOntt and using the methodological guidelines \nprovided by gOntt, and (3) used the necessary NeOn \nToolkit plug-ins for every process and activity \nscheduled. The plug-ins could be triggered by gOntt in \nthe right moment of the schedule.  \nAt the end of the experiment, the students had to fill \na questionnaire. Such a questionnaire was divided in \ntwo main parts: (1) one related to background \nknowledge, and (2) another related to the experiences \ngained by using gOntt. The second part included 10 \nquestions with fixed answers and an open question in \nwhich they were asked to express other comments. \nIn order to analyze the students’ perception of \ngOntt, \nwe \nselected \nthree \nquestions \nfrom \nthe \nquestionnaire. The answers are displayed in Table 3. \nTable 3. Answers to the questions selected \nQuestion \nDistribution of answers \n \nYes \nNo \nOther \nIs \ngOntt \nuseful \nfor \nscheduling \nontology \ndevelopment projects? \n14 \n1 \n1 \n \nQuestion \nDistribution of answers \n \nA useful \nidea? \nA nice \nutility? \nA useless \nidea? \nI don’t \nknow \nIs \nthe \nidea \nof \nhaving \nmethodological \nguidelines \nin \ngOntt:  \n10 \n6 \n0 \n0 \nIs the idea of triggering NeOn \nToolkit plug-ins from gOntt:  \n6 \n4 \n0 \n6 \n                                                           \n3 http://neon-toolkit.org/wiki/Neon_Plugins \n",
  "speaker": "SYSTEM",
  "uuid": "92d18977-e150-4cfa-9687-76c62c5c77db"
}