{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 23\n21\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nIntelligent Content Technology Market\nTrends – Intelligent Content Technology\nIntelligent applications for search, analytics, and content are generally built on (or within) existing main‐\nstream software environments and solutions. Trends in the market for this technology, therefore, track\nclosely with Enterprise software markets. Enterprise buyers in the search and analytics space are line of busi‐\nness managers, who demand compelling Unified Information (UI), task and process–based applications. \nWhile not strictly speaking part of the LT segment of the market, new data storage platforms (NoSQL,\nHadoop, SAP HANA) condition the take‐up of big data and large‐scale analytics applications. Business\nIntelligence, social analytics, decision support, business‐process outsourcing, and predictive modelling dom‐\ninate that landscape. Key Enterprise functions where these applications are being deployed are Marketing,\nFinance, and R&D. Customers are looking for faster (and therefore more actionable) insight, to handle a\ndiverse range of data and content resources, to solve core business problems.\nNew search‐based applications supporting a specific task or workflow (e‐discovery, fraud detection, voice of\nthe customer, sales prospecting, research, customer support) integrate domain knowledge to support the\nparticular task, including industry taxonomies and vocabularies. Search is embedded in the process; it’s\nsearch without a query box. Expertise discovery applications, such as that from Sinequa, support skills man‐\nagement in large Enterprises, while Textkernel uses web mining and semantics in the recruitment process.\nCloud‐based Enterprise search, where Exalead is a leader, has caught also the attention of Amazon and\nMicrosoft. Open‐source and mobile search are both on the agenda. Google’s Knowledge Graph has made\nsemantics mainstream, while Bing added social search to its platform. Adding OCR as a background service\nfor search unlocks documents stored in image formats.\nOn the content side, we see intelligent automatic authoring of regulated documents (safety data sheets,\nproduct leaflets) in industries such as chemicals and pharmaceuticals. Checking and authoring technology\nfrom Acrolinx (recently named by eContent magazine as one of the top 100 companies in the digital content\nindustry) deliver content optimisation, and can be applied to the creation of technical content using stan‐\ndards such as STE and DITA, and to “SEO at source” by guiding the use of keywords during the writing\nprocess. Intelligent creation of content overlaps with translation, as both promote the use and management\nof standard terminology, and use linguistic analysis of text to achieve clearer and more translatable content. \nWhile Intelligent Content (IC) technology is mostly being deployed at Enterprise level, imaging technology\nhas a new lease of life, as scanning and OCR applications migrate to mobile devices; ABBYY’s Mobile OCR\nEngine SDK enables embedded scanning apps on all the major mobile platforms. Uses range from business\ncard scanning to the address book and reading barcodes, to capturing text for translation applications. We\nalso see the first mainstream mobile application of intelligent search, combined with Speech Technology, in\nApple’s Siri.\nAlthough with its horizontal/Enterprise focus, IC Technology is used in all industries, markets leading the\ntake‐up of advanced search and analytics include:\n• Banking and Financial Services\n• Communications, Media and Services\n• Government\n• Manufacturing\n• Natural Resources\nMajor gaps and opportunities for Intelligent Content Technology:\n• Large‐scale development of industry/domain/vertical specific solutions in search and analytics\n",
  "speaker": "SYSTEM",
  "uuid": "93b8cfd2-c4bb-40ef-8f49-a2be4a75db8c"
}