{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Madrid2feb2011 \n\nEl grupo de Procesamiento del Lenguaje Natural y Recuperación de Información de la UNED (\nhttp://nlp.uned.es\n) oferta una beca dentro del programa de Formación de Personal Investigador (FPI) para realizar la tesis doctoral. La beca está vinculada al proyecto coordinado de investigación financiado por el Ministerio de Ciencia e Innovación \"HOLOPEDIA: la enciclopedia automática de personas y organizaciones” (TIN2010-21128-C02-01):\nhttp://www.micinn.es/stfls/MICINN/Ayudas/PN_2008_2011/LIA_RRHH/FICHERO/FPI_2011/PROYECTOS_SUSCEPTIBLES_AYUDAS_FPI_2011.pdf\nCondiciones\nLa financiación cubre un período de cuatro años durante el cual el receptor deberá concluir su doctorado. Los dos primeros años se financian como beca, y los dos segundos como contrato. Además el estudiante podrá optar a ayudas para estancias breves en centros de investigación nacionales o extranjeros. La fecha prevista de incorporación sería agosto o septiembre de 2011. El receptor de esta\nbeca asumirá una parte de las tareas planteadas en el proyecto, directamente relacionadas con su Tesis Doctoral. Se pueden consultar las condiciones de financiación en la página web de información sobre las FPI del Ministerio de Ciencia e Innovación.\nPlazo de presentación\nEl plazo de presentación de solicitudes lo fija el Ministerio. Es conveniente estar atento a los plazos oficiales de presentación decandidaturas que aparecerán durante el mes de febrero del 2011 en la web del Ministerio de Ciencia e Innovación.\nPerfil de los candidatos\nSe buscan candidatos preferiblemente con alguna de las siguientes titulaciones o equivalentes: Ingeniería Informática, Ciencias de la Computación, Lingüística Computacional, etc. Se valorará el expedienteacadémico así como un buen nivel de inglés y otras lenguas. Se puedenconsultar los requisitos legales de los candidatos en la página web de\ninformación sobre las FPI del Ministerio de Ciencia e Innovación:\nhttp://www.micinn.es/portal/site/MICINN/menuitem.dbc68b34d11ccbd5d52ffeb801432ea0/?vgnextoid=2d161e84ed136210VgnVCM1000001d04140aRCRDvgnextchannel=8da5b9746e160210VgnVCM1000001034e20aRCRD\nMás información:\nhttp://bit.ly/fpi-¬holopedia",
  "speaker": "SYSTEM",
  "uuid": "93c0a49b-9570-4de6-8f18-db3fb418cfe0"
}