{
  "message": "SYSTEM: CVA_jorge_2016_03.pdf: Página 1\n \n \n1 \n \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \n \n \nParte A. DATOS PERSONALES \nNombre y apellidos \nJorge Gracia del Río \nDNI/NIE/pasaporte \n25456978A \nEdad \n43 \nNúm. identificación del investigador \nResearcher ID \n J-5230-2013 \nCódigo Orcid \norcid.org/0000-0001-6452-\n7627 \n \nA.1. Situación profesional actual  \nOrganismo \nUniversidad Politécnica de Madrid  \nDpto./Centro \nDepartamento de Inteligencia Artificial  \nDirección \nCampus de Montegancedo s/n Boadilla del Monte 28660 Madrid  \nTeléfono \n 913363672 \ncorreo electrónico\njgracia@fi.upm.es \nCategoría profesional \n Investigador “Juan de la Cierva” \nFecha inicio \n1/12/2015 \nEspec. cód. UNESCO \n  \nPalabras clave \nWeb Semántica, ontology matching, desambiguación, multilinguismo en \nla Web de Datos, datos enlazados lingüísticos  \n \nA.2. Formación académica (título, institución, fecha) \nLicenciatura/Grado/Doctorado \nUniversidad \nAño \nDoctor en Informática \nUniversidad de Zaragoza \n16/10/2009 \nDiploma de Estudios Avanzados \nUniversidad de Zaragoza \n04/12/2005 \nTítulo de Postgrado en \nInformática \nCentro Politécnico Superior (Universidad de \nZaragoza) \n15/07/1997 \nLicenciado en Ciencias Físicas \nFacultad de Ciencias (Universidad de Zaragoza) \n24/09/1996 \n \nA.3. Indicadores generales de calidad de la producción científica (véanse instrucciones) \n \nTesis doctorales dirigidas: Esther Lozano Hontecillas “A Semantic Approach to Problem-Based \nLearning with Conceptual Models”, Universidad Politécnica de Madrid, 30/06/2015 \n   \nÍndice h: 13, total citas: 803, promedio citas anual (últimos cinco años): 112 [Google Scholar] \n \nPublicaciones en journals de Q1: 3; Publicaciones en conferencias CORE A o A+: 4    \n \nParte B. RESUMEN LIBRE DEL CURRÍCULUM (máximo 3500 caracteres, incluyendo \nespacios en blanco) \n \nActualmente, Jorge Gracia trabaja como investigador postdoctoral en el Departamento de Inteligencia \nArtificial de la Universidad Politécnica de Madrid (UPM), financiado por el programa “Juan de la \nCierva-Incorporacíon” del Ministerio de Economía y Competitividad desde diciembre de 2015. Con \nanterioridad ganó otro contrato postdoctoral \"Juan de la Cierva\" entre los años 2011 y 2014 en el \nmismo departamento. Sus actuales líneas de investigación son el multilingüísmo en la Web Semántica, \nlos datos enlazados lingüísticos, y el alineamiento entre ontologías. \n \nJorge obtuvo su doctorado en informática en 2009 por la Universidad de Zaragoza, con mención de \ndoctorado europeo. Durante su doctorado el investigador estudió los problemas de heterogeneidad \nsemántica en la Web, proponiendo métodos y técnicas de: alineamiento entre ontologías, cálculo de \nsimilitud semánticas, desambiguación de sentidos, “query interpretation”, etc. \n \nEl investigador ha trabajado en varios proyectos nacionales y europeos, como los proyectos \nDynaLearn, Monnet y, recientemente, LIDER, donde desarrolló el rol de “Quality Assurance \nFecha del CVA  \n 30/03/2016 \n",
  "speaker": "SYSTEM",
  "uuid": "93d96725-4ef3-4737-b3ad-d5c3a85eb9ce"
}