{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 51\n49\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nits dominance in the market. It has acquired many of its competitors, including some of the global vendors\nsuch as Phillips Speech Recognition Systems and the Speech Recognition division of IBM. Recently, it\nacquired Loquendo Inc., which was one of its main competitors in the market. \nLumenVox LLC. is in second place in the Global ASR Applications market. This vendor has a strong presence\nin Europe and in some Asian countries. Telisma S.A. (On Mobile Global Ltd.) is in a strong position in the mar‐\nket and an Automatic Speech Recognition and text‐to‐speech (TTS) applications provider. Telisma was\nacquired by India‐based company On Mobile Global Ltd. in 2010. Telisma has formed strong alliances with\nspeech recognition platform and service providers, and has a strong position in Asian countries, particularly\nin India. Rank\nOther major vendors in the Global ASR Applications market are AT&T and Raytheon BBN Technologies. \nThese vendors provide dictation software in hosted interactive voice response platforms. They provide TTS\nand automatic speech recognition applications to both enterprises and no business customers. Some of the\nother vendors in this market that pose a threat to the market shares of Nuance are Microsoft Tellme, and\nVoxeo Corp. Micosoft Tellme is a subsidiary of Microsoft Corp. and offers efficient ASR applications to indi‐\nvidual end‐users along with ASR applications to the enterprises.  Both Google and Microsoft are active in\nmobile and internet markets.\n4.7 Opportunities and Challenges for Speech Technology\nSpeech Technology Opportunities\nThe speech applications market shows immense potential, and it is expected to grow rapidly in the next few\nyears. The market has been witnessing a transition from the use of embedded automatic speech recognition\napplications to the use of networked and cloud‐based automatic speech recognition applications. Vendors\nare gradually shifting to networked and cloud‐based models to realize the full potential of the market across\nvarious end‐user segments. In addition, the Mobile Devices End‐user segment is witnessing numerous tech‐\nnological advancements, which is expected to further improve the growth of this segment in the Global\nAutomatic Speech Recognition Applications market.\nThe market is mainly driven by the increased demand in the Mobile Devices segment. This segment is wit‐\nnessing high demand for speech recognition applications because of the increase in the number of regula‐\ntions on the use of mobile phones while driving. Moreover, the vendors in this segment are developing cost‐\neffective and easy‐to‐deploy ASR applications. In addition, growing security concerns have increased the\ndemand for biometrics, which in turn is driving the need for ASR applications. \nA decoupling of Apps from phones may eventually become reality as more content and services are shifted\nto being hosted on the cloud rather than on native Apps. This could potentially reduce the motivation for\nCompany\nDescription\nNuance Communications\nGlobal speech recognition applications provider\nLumenVox LLC\nGlobal ASR and TTS applications provider\nTelisma/On Mobile Global Ltd.\nGlobal ASR applications provider\nAT&T\nTTS and ASR applications provider\nRaytheon BBN Technologies\nASR, TTS and professional services provider\nMicrosoft Tellme\nCloud‐based ASR applications provider\nVoxeo Corp.\nDirected dialog ASR provider\n",
  "speaker": "SYSTEM",
  "uuid": "93ecae03-ade3-48a8-82a1-8917b84f0570"
}