{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_viajes \n\nAquellos miembros que viajen con más frecuencia tienen la posibilidad de contar con tarjeta mastercard de investigador OTT, de forma que puedan pagar gastos de desplazamientos (avión, trenes, alquiler de coche, gasolina), alojamiento e inscripciones.\nLos miembros que soliciten (o bien ya posean) dicha tarjeta tendrán igualmente una serie de obligaciones, de forma que el incumplimiento en tres ocasiones de cualquiera de ellas, comportará la cancelación de la tarjeta:\n1. Firmar un documento en el se comprometan a elegir una de las dos siguientes opciones:\na) Hacerse responsables de la consulta del extracto de movimientos de la tarjeta, de forma que cada vez que realicen un viaje (\nen el plazo de una semana\n), deberán facilitar junto con su declaración de gastos, el/los importe/s que efectivamente se hubieran cargado en la cuenta de la tarjeta, como consecuencia de los gastos pagados con ésta.\nb) Delegar en el equipo de gestión del OEG dicha obligación, facilitando para ello el código PIN de su tarjeta, de forma que éstos puedan consultar el extracto de movimientos a fin de agilizar la tramitación de la declaración de gastos. Ello sin perjuicio de la obligación de cada miembro de cumplimentar debidamente su declaración de gastos.\n2. No pagar con la tarjeta OTT:\n- Gastos personales\n- Gastos cuyo anticipo se hubiera solicitado\n- Peajes de autopistas\n- Comidas en restaurantes\n- Taxis, salvo que éstos superen los 50 euros y se tenga permiso para cogerlo\n- Tickets de metro y autobús\n- Gastos inferiores a 10€\n3. Es muy importante que las facturas vayan a nombre de la persona a la que se haya autorizado el gasto en la hoja previaje. En el caso de que un único miembro pague gastos “comunes” de dos o más miembros con la tarjeta OTT, se solicitarán facturas individuales de forma que, en la factura de cada uno de ellos figuren su nombre y apellidos.\n4. Sólo se pagarán facturas enteras. Si en la factura van varios gastos y sólo se quiere pagar unos con tarjeta y otros con metálico, habrá que pedir dos facturas independientes, porque las facturas van ENTERAS, no se puede pagar parte de una factura con tarjeta OTT.\nPOSTVIAJE\n\nIMPORTANTE\n: Rectorado no admite ningún tipo de enmienda en el formulario. Si hay algún error, no se puede tachar, ni usar corrector, ni nada, hay que volver a hacerlo nuevo y con pulcritud.\nVoy a tratar de aclarar aquí lo que en verdad son los gastos de un viaje. Los gastos que se reflejan, claro. Cómo reflejarlos y cómo justificarlos.\nManutención\n\nPor lo que se refiere a los gastos de manutención, se pagará en todos los casos el total del importe justificado mediante facturas. Estos gastos deberán reflejarse en la hoja postviaje en forma de múltiplos de media dieta, de forma que habrá que calcular el total de gastos por ese concepto, y redondearlo a dietas enteras o medias, por arriba.\nCálculo del número de dietas máximas\n\nEs un dato que pide el formulario de OTT. El número de noches es obvio, pero el número de dietas no es obvio, depende de la hora de salida y llegada.\n.- Día de salida: Si se sale antes de las 14 horas, se cuenta una dieta entera ese día. Si se sale después de las 14 horas y antes de las 22 horas se cuenta media dieta. Si se sale después de las 22 horas no se cuenta ninguna dieta.\n.- Día intermedio: Una dieta por día.\n.- Día de llegada: Si se llega antes de las 14 horas, no se cuenta ninguna dieta. Si se llega después de las 14 horas y antes de las 22 horas, se cuenta media dieta. Si se llega después de las 22 horas y se tiene con un ticket de una consumición (cualquiera) se cuenta una dieta entera.\nAsí, aunque el viaje sean 3 días, 2 noches, pueden ser como dietas máximas de 1 a 3, según horarios.\nDesplazamiento en vehículo particular\n\nCuando nos desplacemos en nuestro vehículo particular con motivo de un viaje, podremos imputarnos como gasto indemnizable una cantidad de dinero por cada kilómetro recorrido. De forma que, multiplicaremos la distancia en kilómetros al aeropuerto (hay que adjuntar captura del cálculo de kilometraje, valiendo captura de GMaps) por\na) 0,19 € si el desplazamiento se realiza en automóvil\nb) 0,078 € si el desplazamiento se realiza en motocicleta\ny el resultado se multiplica por dos, pues se trata de un desplazamiento de ida y vuelta.\nEl kilometraje al aeropuerto sólo se paga si es desde una población que no sea Madrid capital, porque no se pagan desplazamientos dentro de Madrid.\nDocumentación a adjuntar\n\nAunque en el propio documento de la OTT aparece la documentación requerida, hay que recordar y destacar que se pide:\n.- Agenda del evento: agenda de la reunión, correo de convocatoria para una reunión, programa de la conferencia, etc.\n.- Certificado de asistencia: o listado de asistentes a una reunión\n.- Facturas de alojamiento y viaje (de la agencia o no) y tarjetas de embarque en caso de avión, billetes o tickets de otros transportes. Incluye tickets de repostaje para desplazamientos superiores a 150 km en vehículo particular\n.- Tickets de peajes\n.- Cambio “oficial” de moneda para gastos en moneda extranjera\n.- Facturas de otros gastos indemnizables (impresión de póster, inscripción, visado, etc.)\n.- Tickets de manutención\nGastos no imputados\n\nSi dentro del postviaje no se imputan gastos a alguna partida “imprescindible”, hay que justificar en el cuadro de Memoria del formulario por qué. Simplemente con poner (por ejemplo): “El alojamiento ha sido cubierto por otra financiación” es suficiente.\nNorma general\n\nUno tiene que poner en su postviaje los gastos de\nsu viaje\n. Da igual si se lo ha gastado él o no.\nEjemplo\n:\nSi yo voy a Gotham City 3 días, mi vuelo vale 100€, mi habitación vale 150€ y mis comidas valen 210€, mi postviaje valdrá: 100€ + 150€ + 210€ = 460€.\nY puede ser que el vuelo me lo pague Carmen con su tarjeta OTT, que la habitación la pague en metálico y que unas comidas las pague yo y a otras me invite Mora. El caso es que la OTT va a reintegrar el dinero que corresponda a cada uno: 100€ a la tarjeta OTT de Carmen, 150€ a mí y 210€ a mí. Es decir, Mora no cobra sus invitaciones.\nConsejo general\n: Que cada uno pague lo suyo (ya puede ser por facturas separadas o porque pague alguien lo de varios y cada uno le dé el dinero).\nGastos compartidos",
  "speaker": "SYSTEM",
  "uuid": "94367aeb-112e-4c86-9a3e-e634b77a902b"
}