{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 9\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11158\nArtículo 18.  Principios que han de respetar los proyectos.\nLos proyectos deberán respetar los principios que se establezcan en las convocatorias \nde ayudas del Programa Nacional de Proyectos de Investigación Fundamental.\nArtículo 19.  Características y duración de las ayudas.\n1.  La duración de las ayudas será de un máximo de 48 meses, contados a partir de \nla fecha de incorporación del personal investigador en formación al Centro de I+D, y se \nestructuran en dos periodos diferenciados:\na)  En el primero, con una duración de 24 meses, la ayuda revestirá las características \nde una beca y, durante el mismo, el personal investigador en formación deberá obtener el \nDEA, en el caso de los programas de doctorado regulados por el Real Decreto 778/1998, \nde 30 de abril, o superar los 60 créditos u obtener el título de Máster en el programa oficial \nde posgrado que incluya el máster y doctorado en el caso de estudios regulados por el \nReal Decreto 56/2005, de 21 de enero, o superar las actividades del período formativo al \nque se refiere al artículo 18 del Real Decreto 1393/2007, de 29 de octubre.\nAunque el investigador en formación hubiera obtenido el DEA o el certificado académico \nque acredita que se encuentra en el periodo de investigación del Programa de Doctorado \nal que se refiere al artículo 20 del Real Decreto 1393/2007 con anterioridad a la finalización \nde los dos primeros años de beca, no accederá a la fase de contrato hasta que no haya \ncompletado el período de veinticuatro meses de beca.\nb)  En el segundo periodo, que comprenderá como máximo los dos años siguientes \ndesde la finalización del periodo de beca, el Centro de I+D formalizará con el personal \ninvestigador en formación, que esté en posesión del DEA o el certificado académico que \nacredita que se encuentra en el periodo de investigación del Programa de Doctorado, un \ncontrato de trabajo en prácticas en virtud del cual el investigador quedará vinculado al \ncentro de adscripción de la ayuda, asumiendo ambas partes las obligaciones contractuales \nque del mismo se deriven, y que en todo caso se adecuarán al contenido de la solicitud de \nayuda.\nCon carácter excepcional, y siempre que se hayan cumplido los dos años de beca, el \ncentro de adscripción del personal investigador en formación podrá celebrar un contrato \nen prácticas sin que el sujeto afectado haya obtenido el DEA o el certificado académico \nque acredita que se encuentra en el periodo de investigación del Programa de Doctorado, \nsiempre que su actividad científica sea evaluada positivamente por la Comisión Nacional \nde la Actividad Investigadora, de acuerdo con el procedimiento establecido en la Orden \nCIN/2657/2008, de 18 de septiembre.\n2.  Del periodo máximo de disfrute de la beca y, en su caso, de contrato, se descontarán \nlos periodos en que se haya disfrutado de otras becas o ayudas equivalentes por su \nanáloga naturaleza, atendiendo a criterios como el objeto, la cuantía, el proceso de \nselección u otros. El procedimiento u órgano gestor que determine la equivalencia entre \nayudas se establecerá en cada subprograma.\n3.  De acuerdo con lo establecido en el artículo 7.j) de la Ley 35/2006, de 28 de \nnoviembre, del Impuesto sobre la Renta de las Personas Físicas, estas ayudas para la \nformación de personal investigador en su periodo de beca están exentas del Impuesto \nsobre la Renta de las Personas Físicas.\n4.  De acuerdo con lo establecido en el artículo 2.2.3.º del Reglamento del Impuesto \nsobre la Renta de las Personas Físicas, las dotaciones económicas complementarias a las \nayudas objeto de este capítulo que tengan por objeto compensar los gastos de locomoción, \nmanutención y estancia derivados de la asistencia a foros y reuniones científicas, así \ncomo la realización de estancias temporales en universidades y centros de investigación \ndistintos a los de su adscripción para completar, en ambos casos, la formación investigadora \ndel personal investigador, están exentas del Impuesto sobre la Renta de las Personas \nFísicas.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "94518f18-8b34-4d81-a084-1a38445cd087"
}