{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 106\n104\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nAnnex: Business Analytics and Big Data definitions\nBusiness Analytics Software Market Definition\nIDC defines the business analytics software market as an aggregation of several software tools and applica‐\ntion markets, with the functionality to aggregate, manage, organize, analyse, access, and deliver structured\nand unstructured data. As shown in Figure 1, the business analytics software market has three primary seg‐\nments: performance management and analytic applications, business intelligence and analytic tools, and\ndata warehouse platform software. Each of the primary segments has sub segments as follows:\n• Business intelligence and analytic tools. Business intelligence and analytic tools include query, report‐\ning, and analysis tools; advanced analytics tools; spatial information analytics tools; and content analy‐\nsis tools. The business intelligence (BI) tools segment includes both standalone and embedded soft‐\nware:\n‐ Standalone BI software refers to tools that are packaged and marketed under separate products\nand are accounted for within the IDC functional markets of end‐user query, reporting, and analysis\nand advanced analytics.\n‐ Embedded BI software refers to tools that are components of other software, specifically relational\ndatabase management software or application server software. These products are not priced sep‐\narate of the software into which they are embedded. Examples include Microsoft SQL Server\nAnalysis Services embedded within Microsoft SQL Server, Oracle Reports embedded within Oracle\nApplication Server, and IBM InfoSphere Warehouse Data Mining embedded within IBM InfoSphere\nWarehouse.\n• Data warehousing platform software. IDC defines data warehousing as a process that organizes time‐\nbased data coming from multiple sources according to subjects meaningful to the business and driven\nby the need to inform decision makers. The data warehouse platform software competitive market\nincludes two market segments:\n‐ Data warehouse generation. These software tools are software used in the design, cleansing, trans‐\nformation, loading, and administration of the data warehouse.\n‐ Data warehouse management. These software tools are database management software used to\nmanage data in the data warehouse.\n• Performance management and analytic applications. IDC defines these applications as software that\nmust meet each of the following three conditions:\n‐ Business process support. Commercial application software that structures and automates a group\nof tasks pertaining to the review and optimization of business operations (i.e., control) or the dis‐\ncovery and development of new business (i.e., opportunity)\n‐ Separation of function. Can function independently of an organization’s core transactional applica‐\ntions, yet can be dependent on such applications for data and may send results back to these appli‐\ncations\n‐ Time‐oriented, integrated data from multiple sources. Extracts, transforms, and integrates data\nfrom multiple sources (internal or external to the business) — supporting a time‐based dimension\nfor analysis of past and future trends — or accesses such a database\n",
  "speaker": "SYSTEM",
  "uuid": "94a256ee-6006-44e9-9b14-b2bbce8b21d6"
}