{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 8\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97733\ni)  Facilitar cuanta información les sea requerida por la Intervención General de la \nAdministración del Estado, por el Tribunal de Cuentas y por el Ministerio de Educación.\nj)  En los contratos en prácticas entre los organismos y entidades y el personal \ninvestigador en formación y en las publicaciones y otros resultados a los que pueda dar \nlugar las investigaciones realizadas al amparo de este programa de ayudas, deberá \nhacerse referencia a la financiación por parte del Ministerio de Educación.\nk)  En el caso de los centros de adscripción de beneficiarios de ayudas de FPU que \nno sean universidades, deberán suscribir el correspondiente convenio de colaboración \ncomprometiendo la vinculación necesaria con una universidad al objeto de cumplir lo \nestablecido en el artículo 5.3 de la presente convocatoria.\nl)  Las restantes obligaciones establecidas en el artículo séptimo del Real Decreto \n63/2006, por el que se aprueba el Estatuto del personal investigador en formación.\nArtículo 11.  Dotación de las ayudas.\n1.  Durante el período de beca la cuantía de la ayuda mensual será de 1.142,00 \neuros, por un máximo de 12 meses al año y de 1.173,00 euros durante el período de \ncontrato por 14 mensualidades. En el contrato en prácticas que se formalice con el \norganismo o institución de adscripción deberá figurar esta cantidad como retribución \nmínima anual. Dichas dotaciones podrán ser modificadas de conformidad con lo dispuesto \nen el apartado VIII.2 de la presente convocatoria.\n2.  El coste de las aportaciones de la cuota empresarial a la Seguridad Social, serán \nigualmente financiados por el Ministerio de Educación, de acuerdo a los tipos de cotización \ny bonificaciones que correspondan para cada año.\n3.  Durante el período de beca o de contrato en prácticas y en los casos que \ncorresponda, se abonarán las ayudas a las que se refieren los capítulos V, VI y VII de la \npresente convocatoria, a los organismos de adscripción o a las universidades en las que \nse encuentren matriculados los beneficiarios de becas o de contratos en prácticas.\n4.  De acuerdo con lo establecido en los correspondientes convenios de colaboración \nentre el Ministerio de Educación y las entidades colaboradoras, de adscripción de los \nbeneficiarios de las ayudas, éstas percibirán una compensación económica por los costes \nderivados por su participación en la gestión de las ayudas y contratos, proporcional al \nnúmero de beneficiarios activos y cuya cuantía se fijará anualmente por la Secretaría \nGeneral de Universidades.\n5.  Las cuantías anteriores podrán ser actualizadas en las posteriores resoluciones \nde convocatoria, en las resoluciones de concesión de esta convocatoria, o por resolución \nexpresa del Secretario General de Universidades, con la fecha de efectos que se indique \nen las mismas, y siempre que ello no resulte lesivo para los interesados.\n6.  Los beneficiarios de ayudas vigentes, concedidas al amparo de convocatorias \nanteriores de este programa, tanto bajo la relación jurídica de beca como de contrato, \ntendrán derecho a la percepción de las dotaciones recogidas en esta Orden y, en su caso, \na las actualizaciones de las mismas, en los mismos términos indicados en el punto \nanterior.\nArtículo 12.  Pago de las Ayudas.\n1.  El pago de las ayudas correspondientes a los beneficiarios en activo se efectuará \nal centro de adscripción por anticipado. El importe se transferirá anualmente teniendo en \ncuenta que para los beneficiarios que durante el ejercicio modifiquen su situación de beca \na contrato, la ayuda recogerá la cuantía que corresponda a ambas por los períodos \nprevistos para el cambio de situación.\n2.  El importe de las ayudas de cada anualidad se librará por anticipado por el \nMinisterio de Educación a las entidades con las que se haya suscrito el convenio de \ncolaboración, a las que se exime de la constitución de garantías, de acuerdo con lo \nestablecido en el convenio de colaboración suscrito según lo señalado en los puntos 1 y 2 \ndel artículo 10 de la presente convocatoria. Los rendimientos financieros que se pudieran \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "94d2ad4d-fe72-4201-bb56-b70524cf22cb"
}