{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nSoftware Requirements\n1.1\nValentina Presutti\n1.2\nTom Heath\n1.3\nSean Bechhofer\n1.4\nMathieu D'Aquin\nSoftware Requirements\n\nValentina Presutti\n\nThe software to install on the lab machines can be downloaded at\n[1]\n(you will need a svn client - see below). It is an evolving Apache project incubator named Stanbol, we will probably use the KReS and FISE components, mainly. Additionally, I will provide a Javascript applications, which is the interactive exercise - it's not ready, yet.\nThe tutorial won't need additional software to be executed, the Stanbol package includes Sling, the web container that can be used for running everything.\nAlthough [1] is a stable link, the version of the software will change by the date of the summer school.\nI will indicate the actual version and further details, later.\nAdditionally, please be sure all the machines have:\nNTK with XD plugin\n[2]\nJava version 6\n[3]\nMaven\n[4]\nfor compiling the software\na SVN client (here a list of clients for all platforms):\nsubclipse (eclipse plug-in)\n[5]\nsvnx for Mac users\n[6]\ntortoise for Windows\n[7]\ncommand line tool (mac and unix usually have it by default)\n[8]\nEmail:\nValentina.Presutti@istc.cnr.it\nTom Heath\n\nmy requirements for the Linked Data session will be:\nApache 2.x (latest version)\nPHP 5.x (latest version)\nSome specific libraries for handling RDF/Linked Data in PHP:\nARC\n[9]\nMoriarty\n[10]\nAll of these should run fine on Windows, though we'll need to spend some effort ensuring they're configured correctly well in advance of the session.\nGiven that we'll be consuming large amounts of data live from the public Web, it would be really useful to be running a caching Web proxy on site, such as IPCop\n[11]\n(very easy to deploy on an old box with two network cards - can operate transparently too, so no tricky config issues for clients). Is that an option? What is the speed of the net connection to the residence these days?\nEmail:\ntom.heath@talis.com\nSean Bechhofer\n\nRequirements:\nProtege-OWL\nA web browser\nEmail:\nsean.bechhofer@manchester.ac.uk\nMathieu D'Aquin\n\nRequirements:\nNeOn Toolkit (latest version)\nWatson plugin for NTK\nApache webserver\nPHP 5.x (latest version)\nARC2 PHP library\nThe list is not closed. Maybe new requirements will be added.\nEmail:\nm.daquin@open.ac.uk",
  "speaker": "SYSTEM",
  "uuid": "9523da84-c9b7-4efe-ae3f-c907a3713ca8"
}