{
  "message": "SYSTEM: Ontoterminology_a_new_paradigm_for_terminology.pdf: Página 3\nKEOD-International Conference on Knowledge Engineering and Ontology Development. Madeira October 5-8 2009 \n \nFigure 2. The ontology of relay. \n \nIn fact we need to bear in mind that writing \ndocuments is the concern of textual linguistics, one \nof whose principles is the incompleteness of text. \nWhereas building ontology, viewed as task-\nindependent knowledge, is the concern of modelling \nbased on formal (and not natural) languages. We \nshould also bear in mind that using rhetorical figures \nlike ellipsis in writing text modifies the perception \nof any concepts we may have. In the previous \nexample (figures 1 and 2) the term “voltage relay” \ndoes not denote a <Voltage relay> concept which \nwould be a sub-concept of <Relay>. It denotes the \n<Voltage threshold relay> concept which is a sub-\nconcept of <Threshold relay>. Let us notice that the \nlinguistic expression “voltage threshold relay” is not \nin usage, but can be defined as a normalised term.  \n \nAlthough we can extract some useful information \nfrom texts, ontology cannot be built directly from \nthem since we need ontology for understanding text \n(understanding \ntext \nrequires \nextra-linguistic \nknowledge which by definition is not included in the \ncorpus). \n \nThis is why we have introduced the new \nparadigm of ontoterminology [Roche 2007] to take \ninto account these two different activities – \nconceptualisation and writing text – and to focus on \nconceptualisation. The main goal of terminology is \nfirst to understand and conceptualise the world and \nthen to name it. Ontoterminology allows building a \nnew kind of terminology in which the concept plays \na central role. An ontoterminology is a terminology \nwhose terms, either of usage or normalised, are \nrelated to concepts defined in a formal ontology. \nThis makes it possible to manage the linguistic and \nconceptual dimensions of terminology and provide \ntwo kinds of definition: the first formally defines the \nconcept whereas the second explains the term and its \nusage from a linguistic point of view. \n \n \n2.2 \nTerm and concept \nConcepts in ontoterminology exist in their own \nright. Thus, ontoterminology manages terms as well \nas concepts; both are entries in this new kind of \nterminology. It also means that term and concept \ndefinitions are separate but connected since the \nmeaning of a term is related to a concept. In the \nexample below (see figure 3), these definitions \nappear in two different cards, one for the concept \nand another for the term.  \n \nOntoterminology \nenables \nfocusing \non \nthe \nconceptual \nand \nlinguistic \ndimensions \nof \nterminology. Terms and concepts belong to different \nand non-isomorphic semiotic systems. In order to \nshow such a difference, terms, as linguistic \nexpressions, are written between quotation marks \ne.g. “turbine”, while concepts, as entities of a formal \nsystem, are written between chevrons and start with \nan upper case e.g. < Hydraulic turbine>.  \n \nIf ontoterminology enables normalisation of \nlanguage, unlike classical terminology it also \nenables preserving the diversity of language between \ndifferent communities of practice since they share \nthe same domain conceptualisation. In point of fact, \ntwo different terms can denote the same concept \nwhose name should be written so that we understand \nthe right place of the concept in the ontology. Such \nconcept names define normalised terms which \ncannot be used in text (e.g. because they are too \nlong) but are necessary for term meaning and \nunderstanding. For example “voltage relay” in \nEnglish and “relais de tension” in French denote the \nsame concept of <Voltage threshold relay>. \n2.3 \nConceptual structure \nThe conceptual relationships are used for \nstructuring entries. In figure 3 the concepts are listed \nin alphabetical order combined with either the “is-a” \nor the “part-of” relationship. These conceptual \nrelationships are also used for building the lexical \nstructure which is automatically updated each time \nthe conceptualisation is modified. \n \nWords and linguistic relationships are no longer \nthe \nonly \nmeans \nto \naccess \ninformation \nin \nterminology. Associating information to concepts, \ne.g \nterm \ndefinitions, \ndocuments, \nreturns \non \nexperience, etc., amounts to classifying expert \nknowledge in the terminology.  \nIt is also possible to define new paradigms of \nnavigation based on the domain ontology. Ontology \n",
  "speaker": "SYSTEM",
  "uuid": "957c20b8-df9b-48f0-b937-92b7949edd8f"
}