{
  "message": "SYSTEM: Neonglossaryofactivities.pdf: Página 1\nNeOn Glossary of Activities \n\u0001\u0002 Ontology Aligning refers to the activity of finding the correspondences between \ntwo or more ontologies and storing/exploiting them. A synonym for this activity is \nOntology Mapping. \n \n\u0001\u0002 Ontology Annotation refers to the activity of enriching the ontology with \nadditional information, e.g. metadata or comments. \n\u0001\u0002 Ontology Assessment refers to the activity of checking an ontology against user \nrequirements, such as usability, usefulness, abstraction, quality, etc. \n\u0001\u0002 Ontology Comparison refers to the activity of finding differences between two or \nmore ontologies or between two or more ontology modules. \n\u0001\u0002 Ontology Conceptualization refers to the activity of organizing and structuring \nthe information (data, knowledge, etc.), obtained during the acquisition process, \ninto meaningful models at the knowledge level according to the ontology \nspecification document. This activity is independent of the way in which the \nontology implementation will be carried out. \n\u0001\u0002 Ontology Configuration Management  refers to the activity of recording all the \nversions of the documentation, software and ontology code, and of controling the \nchanges. \n\u0001\u0002 Control refers to the activity of guaranteeing that scheduled activities in the \nontology development process are completed in the manner intended to be \nperformed. \n\u0001\u0002 Ontology Customization refers to the activity of adapting an ontology to a \nspecific user's needs. \n\u0001\u0002 Ontology Diagnosis refers to the activity of identifying parts of the ontology \ndirectly responsible for incorrectness and incompleteness. Ontology diagnosis is \ntriggered by ontology validation. \n\u0001\u0002 Ontology Documentation refers to the collection of documents and explanatory \ncomments generated during the entire ontology building process. \nNote: Examples of documents external to the implemented ontology include \nontology specification documents, sources used for acquiring knowledge, \nontology conceptualization document, design and decision criteria, ontological \ncommitments, etc. \nInformation inside the implemented ontology includes natural language \ncomments, ontology metadata, and implementation code. \nIn summary: anything that could be useful to help users, who did not build the \nontology, to understand and learn how the ontology was built. Note that the level \nof granularity of descriptions (might) help or hinder the understanding of the \nontology.  \n\u0001\u0002 Ontology Elicitation is a knowledge acquisition activity in which conceptual \nstructures (e.g. T-Box) and their instances (e.g. A-Box) are acquired from domain \nexperts. \n \n\u0001\u0002 Ontology Enrichment refers to the activity of extending an ontology with new \nconceptual structures (e.g., concepts, roles, axioms, etc.). \n\u0001\u0002 Ontology Environment Study refers to the activity of analyzing the environment \nin which the ontology is going to be developed. \n",
  "speaker": "SYSTEM",
  "uuid": "95f853e1-964b-43c6-9726-01b8d9e883fc"
}