{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 5\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13913\neste plazo por un año más, que excepcionalmente podría ampliarse por otro año adicional, \nen las condiciones que se hayan establecido en el correspondiente programa de doctorado. \nEn el caso de estudios a tiempo parcial la prórroga podrá autorizarse por dos años más \nque, asimismo, excepcionalmente, podría ampliarse por otro año adicional.\nA los efectos del cómputo del periodo anterior no se tendrán en cuenta las bajas por \nenfermedad, embarazo o cualquier otra causa prevista por la normativa vigente.\nAsimismo, el doctorando podrá solicitar su baja temporal en el programa por un período \nmáximo de un año, ampliable hasta un año más. Dicha solicitud deberá ser dirigida y \njustificada ante la comisión académica responsable del programa, que se pronunciará \nsobre la procedencia de acceder a lo solicitado por el doctorando.\nArtículo 4.  Organización de la formación doctoral.\n1.  Los programas de doctorado incluirán aspectos organizados de formación \ninvestigadora que no requerirán su estructuración en créditos ECTS y comprenderán tanto \nformación transversal como específica del ámbito de cada programa, si bien en todo caso \nla actividad esencial del doctorando será la investigadora.\n2.  La organización de dicha formación y los procedimientos para su control deberán \nexpresarse en la memoria para la verificación de los programas de doctorado incluida en \nel Anexo I de esta norma y formarán parte de la posterior evaluación a efectos de la \nrenovación de la acreditación de dichos programas.\n3.  Las actividades de formación realizadas por el doctorando se recogerán en el \ndocumento de actividades a que se refiere el artículo 2.5.\nArtículo 5.  Competencias que debe adquirir el doctorando.\n1.  Los estudios de doctorado garantizarán, como mínimo, la adquisición por el \ndoctorando de las siguientes competencias básicas así como aquellas otras que figuren \nen el Marco Español de Cualificaciones para la Educación Superior:\na)  Comprensión sistemática de un campo de estudio y dominio de las habilidades y \nmétodos de investigación relacionados con dicho campo.\nb)  Capacidad de concebir, diseñar o crear, poner en práctica y adoptar un proceso \nsustancial de investigación o creación.\nc)  Capacidad para contribuir a la ampliación de las fronteras del conocimiento a \ntravés de una investigación original.\nd)  Capacidad de realizar un análisis crítico y de evaluación y síntesis de ideas nuevas \ny complejas.\ne)  Capacidad de comunicación con la comunidad académica y científica y con la \nsociedad en general acerca de sus ámbitos de conocimiento en los modos e idiomas de \nuso habitual en su comunidad científica internacional.\nf)  Capacidad de fomentar, en contextos académicos y profesionales, el avance \ncientífico, tecnológico, social, artístico o cultural dentro de una sociedad basada en el \nconocimiento.\n2.  Asimismo, la obtención del título de Doctor debe proporcionar una alta capacitación \nprofesional en ámbitos diversos, especialmente en aquellos que requieren creatividad e \ninnovación. Los doctores habrán adquirido, al menos, las siguientes capacidades y \ndestrezas personales para:\na)  Desenvolverse en contextos en los que hay poca información específica.\nb)  Encontrar las preguntas claves que hay que responder para resolver un problema \ncomplejo.\nc)  Diseñar, crear, desarrollar y emprender proyectos novedosos e innovadores en su \námbito de conocimiento.\nd)  Trabajar tanto en equipo como de manera autónoma en un contexto internacional \no multidisciplinar.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "96ed616b-f1df-4994-99b7-fe7793750076"
}