{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 27\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11176\nArtículo 55.  Dotación de las ayudas.\n1.  Durante el periodo de beca la cuantía de las ayudas será de 1.200 euros mensuales \nbrutos, de la que se deducirá la cuota de la seguridad social que está obligado a cotizar el \ninvestigador beneficiario y serán abonada por meses vencidos y en función del número de \ndías que el personal investigador en formación esté de alta, considerando en todos los \ncasos meses de 30 días. De acuerdo con lo establecido en el artículo 7.j) de la Ley 35/2006, \nde 28 de noviembre, del Impuesto sobre la Renta de las Personas Físicas, estas ayudas \npara la formación de personal investigador en su periodo de beca están exentas del \nImpuesto sobre la Renta de las Personas Físicas. Esta ayuda podrá ser actualizada por \nResolución de la Dirección General del INIA, en cuanto a su dotación económica mediante \nResolución anual de renovación de las ayudas, al menos en cuantía igual o superior al IPC \nanual y si la disponibilidad presupuestaria lo permite\n2.  De acuerdo con el Real Decreto 63/2006, de 27 de enero, por el que se aprueba \nel Estatuto del personal investigador en formación, durante el periodo de beca, los becarios \nquedarán asimilados a trabajadores por cuenta ajena, a efectos de su inclusión en el \nRégimen General de la Seguridad Social. La solicitud de alta en el Régimen General de la \nSeguridad Social será efectuada por el INIA con efectos del día de incorporación del \ninvestigador beneficiario al Centro de I+D adscrito, de acuerdo con lo indicado en la \ndisposición cuarta, punto 1, apartado a). Sin perjuicio de anterior, los becarios disfrutarán \nde un seguro de accidentes.\n3.  En el periodo de contrato la cuantía del mismo, correspondiente a 14 mensualidades \npor año, para los contratos formalizados en organismos de la Administración General del \nEstado, será el 80% de lo establecido en Tabla Salarial del Convenio Único para el personal \nlaboral de la Administración General del Estado, para la contratación de un titulado superior \nde investigación y laboratorio, grupo profesional 1 (GP1). Los contratos laborales en \nprácticas formalizados por los Centros de I+D e instituciones de las Comunidades \nAutónomas, podrán ser de la misma cuantía que el establecido para los organismos de la \nadministración general del estado, siempre que estén de acuerdo con lo establecido por el \nartículo 11.1 del texto refundido del Estatuto de los Trabajadores, aprobado por Real \nDecreto Legislativo 1/1995, de 24 de marzo, y su normativa de desarrollo, donde se \nestablece que el importe del salario bruto no será inferior al 60% para el primer año, ni \ninferior al 75% en el segundo año de contrato, respecto a los valores de la tabla salarial \nvigente en la Comunidad Autónoma, para la contratación de un titulado superior de \ninvestigación y laboratorio, grupo profesional 1 (GP1) o categoría equivalente en la \nmisma.\n4.  La ayuda para cada uno de los contratos que se formalicen al amparo de este \nsubprograma se destinará necesariamente a abonar el salario y la cuota empresarial de la \nSeguridad Social de los investigadores contratados. La cuota empresarial de la Seguridad \nSocial que se aporte se calculará de acuerdo a los tipos de cotización que correspondan \ncada año. Los Centros de I+D beneficiarios realizarán en su caso las correspondientes \nretenciones fiscales e ingresos por los pagos que realicen al personal investigador en \nformación.\nArtículo 56.  Obligaciones de los Centros de I+D.\n1.  El desarrollo de las ayudas se realizará en los Centros de Investigación Agraria y \nAlimentaria que para cada beca, junto con los tutores, figura en los servidores de información \ndel INIA (www.inia.es).\n2.  Adicionalmente a las obligaciones establecidas en el artículo 24, los Centros de \nI+D+I tendrán las siguientes obligaciones:\na)  Comunicar al órgano instructor la obtención del DEA o documento que lo sustituya \nde acuerdo con la nueva estructura de enseñanza adaptada al Espacio Europeo de \nEducación superior del personal investigador en formación incorporado al Centro de I+D \nen el plazo máximo de 10 días hábiles desde la fecha de su obtención.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "973d2f9c-443d-4dd6-971c-7643e8f1cd24"
}