{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 5\nmalmente ahora reconocido por la Comunidad de Madrid, con el n.º 940589, Publidoc-\nUCM, Gestión de la Información en el sector público) se fue viendo la necesidad de iden-\ntificar aquellos elementos informativos que sin duda iban a constituir el caudal primario\nde reutilización. En efecto, los primeros elementos estudiados fueron las publicaciones\noficiales, tanto monografías como publicaciones periódicas, puesto que de su análisis se\npodría deducir, por ejemplo, cuáles eran los temas que mayor interés suscitaban o el dina-\nmismo de las distintas unidades editoras.\nPosteriormente se fue configurando un panorama más general de los activos de infor-\nmación de naturaleza pública, y de ahí se llegó a plantear la identificación de todos los\nrecursos públicos que manejan las distintas administraciones públicas, estructurados en\ncuatro apartados: Publicaciones oficiales, bases de datos, repositorios de información que\nno son bases de datos y, por último, archivos y registros administrativos.\nEn paralelo, primero a través de Internet y más tarde también mediante contacto per-\nsonal, comenzamos a analizar los trabajos que se estaban ya realizando en el resto de\nEuropa para el desarrollo de la directiva y también en Estados Unidos. Sin duda, el con-\ntacto más provechoso ha sido con la red ePSIplus, la cual, además de permitirnos contras-\ntar la validez de los trabajos realizados por el Grupo, nos ha ayudado a orientar definitiva-\nmente la actividad en el ámbito de la Documentación, y más en concreto en la definición\nde estándares de información.\nSi en el futuro disponemos de los medios necesarios podríamos continuar mejorando\nla accesibilidad a la información pública en España desde esta modesta posición de orga-\nnizar los recursos públicos de información que, como se pone de relieve en este trabajo,\ndista de ser tarea sencilla, incluso en formato electrónico.\nLos siguientes pasos que nos proponemos dar se orientan a profundizar en el inventa-\nrio de activos de información en otros formatos de información distintos a las bases de\ndatos y en otros organismos del sector público (Poder Judicial, Legislativo, Administracio-\nnes Autonómicas y Locales y resto de la Administración Central). Asimismo para aumen-\ntar la visibilidad de la información que vamos inventariando en un futuro próximo el\nGrupo pondrá en línea este directorio que ahora se presenta en texto escrito en su página\nWeb (http://multidoc.rediris.es/ppo/).\nEl trabajo que presentamos sobre las bases de datos de libre acceso de la Administra-\nción General del Estado se encuentra expuesto con detalle en cuanto a su metodología y\ncontexto investigador en el capítulo que sigue a continuación. Aunque hemos huido de\ncualquier valoración, en la redacción de las fichas del repertorio queremos dejar en estas\nlíneas unos breves comentarios sobre la impresión general del trabajo realizado. Algunas\nson demasiado obvias, pero aun así no queremos dejar pasar la ocasión de exponerla.\nAntes de terminar queremos agradecer a las personas que nos han ayudado a que este\ntrabajo vea la luz desde los becarios (Isabel Castillo, Rosalía Crespo, Lara Nebreda,\nEnrique Ortega y Francisco Valentín) que hicieron las primeras búsquedas hasta la respon-\nsable de la Editorial Complutense que ha confiado en nosotros para esta publicación, sin\nolvidar al Ministerio, ahora de Ciencia e Innovación, que apoyó y financió nuestro proyec-\nto de investigación.\nDr. L. Fernando Ramos Simón (ramos@ccdoc.ucm.es)\nCoordinador del Grupo de Investigación Publidoc-UCM\nPRESENTACIÓN\n8\nBASES DE DATOS  1/1/04  03:39  Página 8\n",
  "speaker": "SYSTEM",
  "uuid": "981d0ccd-daba-4262-82d0-215eb9babf4e"
}