{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 15\nstarting from scratch the identification of an exhaustive list of occupations on the \nIT domain and a list of economic activities. As a result of the search we found \nfour potential non-ontological resources that included terms related to \noccupation, and three potential non-ontological resources related to economic \nactivities. \n• \nUsing NeOn guidelines for reusing knowledge-aware resources [16], we assessed \nthe set of candidate non-ontological resources based on coverage and precision \ncriteria. First, we extracted the lexical entries of the non-ontological resources. \nThen we calculated the coverage and precision of the non-ontological resource \nlexical entries against the terms that appeared in the pre-glossary in the ORSD. \nThe non-ontological resources with best coverage and precision, and thus the \nselected ones, were ISCO-88 (COM)18 and ONET19 for occupations, and NACE18 \nstandard for economic activities. Then, these non-ontological resources were re-\nengineered into ontologies. \n• \nRegarding geographical location classifications, we did the search in similar sites \nand we found four non-ontological resources including named entities related \nwith geographical location (e.g. Spain, France). Following the NeOn guidelines, \nwe selected the ISO 316620 standard and we transformed it into an ontology. \n• \nFinally, we evaluated the resultant SEEMP Reference Ontology by means of the \nCQs from the ORSD. We formalized the CQs into SPARQL queries, and \ntransformed the Reference Ontology WSML implementation into RDF(S). In this \nsense, we checked whether the query results of every formalized CQ were empty. \nThus, the ORSD helped us to find existing consensual knowledge-aware resources \nto be used in the development of the SEEMP Reference Ontology [12]. This ontology \nis composed of thirteen modular ontologies, from which ten were built by reusing and \nre-engineering non-ontological resources, and three were built from scratch. The \nReference Ontology has 1985 concepts, 315 attributes, 1449 instances and 1037 \naxioms. The ontology was built in 6 months. It must be said that at least 2 months \nwere dedicated to the ontology requirements specification activity. Finally, the \nevaluation of the ontology lasted approximately one month. \nOur experience in SEEMP has served us to demonstrate that the approach to build \nthe ORSD following detailed methodological guidelines saves time and effort during \nthe ontology development. We compared our previous experiences developing \nontologies with the development of the SEEMP Reference Ontology and we realized \nthat a decrease in the development time occurred. For example, we developed a set of \nLegal Ontologies [6], without the guidelines described in this paper, spending 10 MM \n(man months) and, as already mentioned, we spent 6 MM for the development of the \nSEEMP Reference Ontology. It is worth mentioning that these two ontologies (Legal \nand SEEMP ones) have similar level of complexity. The ORSD, also, facilitated the \nreuse of existing ontologies, the reuse and later re-engineering of existing and already \nconsensual non-ontological resources, and the evaluation of the ontology content. In \nthis paper we have demonstrated that with a good ORSD, better ontologies can be \nbuilt faster. \n                                                           \n18 http://ec.europa.eu/eurostat/ramon \n19 http://online.onetcenter.org/ \n20 http://www.iso.org/iso/en/prods-services/iso3166ma/index.htm \n",
  "speaker": "SYSTEM",
  "uuid": "98c3fa02-59a6-4557-9826-f3f7214a409f"
}