{
  "message": "SYSTEM: Wiki: The Semantics Technology and Applications Research Laboratory (STARLab) [1], part of the Computer Science Department of the Vrije Universiteit Brussel (VUB) [2] is offering a 1-year position for a junior researcher in the area of knowledge management, open data and linked data. The candidate will be working on the Open Semantic Cloud for Brussels (OSCB) project funded by the Brussels Institute for Research and Innovation.\nOSCB is a joint project between STARLab (coordinator, Prof. Robert Meersman), the Department of Electronics and Informatics (Vrije Universiteit Brussel ETRO, Prof. Bart Jansen), Web & Information Technologies (Université Libre de Bruxelles WIT, Prof. Esteban Zimanyi) and the Centre for Special Language and Communication (Erasmushogeschool Brussel CVC, Prof. Rita Temmerman).\nAbout OSCB\nOpen Semantic Cloud for Brussels aims to cover Brussels, metaphorically speaking of course, with a cloud of structured and interlinked information elements produced by “atomizing” a collection of relevant databases and other resources.  In this project, a platform will be built for communities to create ontologies with natural language. Those ontologies will be then used for publishing data in databases on the Web and automatically annotate resources such as videos and images. The multilingual nature of Brussels also asks for means to access that data through different languages. Each member of the consortium is leading one of the four pillars of this project. The members were chosen not solely on their expertise in the areas, but also on their earlier collaboration in EU or local projects. The four pillars constituting the whole platform are: Ontology Creation, Automatic Annotation of Images and Video, Atomization of Databases and Multilingual Terminology Bases. STARLab will use its expertise in methods and tools for ontology construction to create a framework for knowledge management focusing on guiding the community and their dialogue based on fact-oriented database modeling techniques.\nExpected Profile\n- The candidate should have a MSc in Computer Science or Information Technology\n- The ability to work well in teams\n- Fluent in English\n- Good programming skills\n- Experience in one or more of the following areas: Knowledge Management, Ontology Engineering, Ontology Languages (RDF, RDF(S), OWL, DL) and Tools, Social Web applications (wikis, CMS, ...), Linked Data, Reasoning.\nDetails\n- Application deadline: applications will be accepted until the position is filled.\n- Earliest start-date: April 2011\n- Duration: 12 months\n- Salary: € 1.700,00 (might vary depending on experience, etc.)\n- Location: STARLab at the Vrije Universiteit Brussel\n- The candidate will work under the guidance of Prof. Dr. Robert Meersman\nHow to Apply\nPlease send your CV with “OSCB Position” via email to Dr. Ioana Ciuciu (Ioana-Georgiana.Ciuciu@vub.ac.be). Please feel free to contact Ioana Ciuciu to obtain more information about the open position.\n[1]\nhttp://starlab.vub.ac.be/\n[2]\nhttp://www.vub.ac.be/",
  "speaker": "SYSTEM",
  "uuid": "991d0907-c163-4694-aaed-7e9eb08bdddf"
}