{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 83\n81\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nLegend: very low, low, moderate, high, very high \nTranslation Technology Value Chain\nThe following graphs present the value chain for Translation Technologies as well as for the different trans‐\nlation components and tools. \nIn the case of translation technologies, translation components and tools need to interact together for cre‐\nating a translating project; in addition these components do not interact on their own for other purposes dif‐\nferent from translation and localization processes. Thus all get represented by a unique value chain. \nSpecific market trends\nTranslation\nTechnologies con-\nvergence\nTaking into consideration the accuracy limits of trans-\nlation memory, companies are combining memory\ntranslation technologies to increase accuracy. This is\nproducing a progressive convergence to a single\ntranslation engine able to use the most accurate tech-\nnology depending on the situation.\nHigh\nMedium-term\nAccelerator\n\n\nLT consolidation\nLT are mature and are living a progressively conver-\ngence not only between them but also with other tech-\nnologies such as content analytics, In-memory pro-\ncessing, in-database analytics, search-based applica-\ntions, non-row databases, and non-SQL analytics.\nHigh\nMedium-term\nAccelerator\n\n\nLack of standardiza-\ntion \nand \nshared\nresources\nLinguistic data resources are usually expensive or no\nshared by companies. LT companies must recreate\nthe required resources inhibiting a faster time-to-mar-\nket and the proper market development.\nModerate\nShort-term\nInhibitor\n\n\nLabour supply\nTalent scarcity\nThe availability and the skill level of talent have a\ndirect impact on LT markets such as speech, transla-\ntion or intelligent content. Whilst in the previous\ndecades, the LT talent scarcity has been covered by\nIT experts, the current availability may inhibit adop-\ntion rates and market development and growth.\nModerate\nMedium-term\nInhibitor\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "9983a45a-2443-4410-9f21-6f912b613d56"
}