{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 4\nGu´ıa de orientaci´on para investigadores noveles\n4\nDocente e Investigador (PDI) y qu´e requisitos se deben cumplir para poder\nconseguir la acreditaci´on para la ﬁgura que deseemos. En la secci´on 7 se\npondr´a como ejemplo un supuesto para que el joven investigador reﬂexione\nacerca de si es importante planiﬁcar una investigaci´on o no, seguida de unas\nconclusiones ﬁnales en la secci´on 8. Por ´ultimo, en el anexo A se listar´an\nuna serie de fuentes de informaci´on2 donde se pueden ampliar cada uno de\nlos temas introducidos en este material y pueden ser muy ´utiles para los\nlectores que deseen saber m´as acerca de alg´un tema en concreto.\n2.\nIntroducci´on: la investigaci´on como salida pro-\nfesional\nUna vez ﬁnalizada la carrera de Ingenier´ıa en Inform´atica y despu´es de,\ncomo m´ınimo, cinco a˜nos de mucha constancia, tes´on y esfuerzo, el reciente\ningeniero ﬁnaliza ya su etapa de estudios superiores y emprende una nueva\netapa hacia el mundo laboral. Muchos se decantar´an por la opci´on de tra-\nbajar en la empresa privada, ya se trate de grandes multinacionales o de\npeque˜nas o medianas empresas (PYMES), otros decidir´an cambiar de rum-\nbo y trabajar en temas que no guarden relaci´on con los estudios realizados,\notros optar´an por seguir estudiando pero de otra manera, por ejemplo para\npreparar alg´un tipo de oposici´on, e incluso habr´a personas con esp´ıritu em-\nprendedor que se atrevan a lanzarse en el mundo empresarial o a marcharse\nfuera de su pa´ıs como un reto m´as. Pero, a pesar de todas las posibilidades\nque se han mencionado, no son ´estas las ´unicas salidas: podemos tomar la\ndecisi´on de continuar y ampliar nuestra formaci´on mediante la realizaci´on\nde un doctorado, enmarcado dentro del programa de estudios de tercer ciclo.\nOptar por esta opci´on es una manera de iniciarse en la investigaci´on, ya que\nestos estudios se estructuran de forma distinta a los estudios de primer y se-\ngundo ciclo. Adem´as, se contar´a con el apoyo y la supervisi´on de un director\nde tesis (en ocasiones, puede haber tambi´en codirectores) que ir´a marcan-\ndo las l´ıneas de investigaci´on a seguir por el doctorando. Para m´as detalles\nsobre los programas de doctorado, v´ease la secci´on 2.1. A pesar de que\nla realizaci´on del doctorado tiene un car´acter eminentemente investigador,\npues el objetivo del mismo es la defensa de un trabajo original que aporte\nnuevo conocimiento (tesis), no todas las personas que lo realizan tienen este\nobjetivo en mente. Seg´un las circunstancias personales de cada individuo,\nlos motivos que les llevar´an a decidirse por la realizaci´on del doctorado,\npueden ser muy distintos: desde una simple forma de mantenerse al d´ıa en\nel estado de la cuesti´on de un determinado tema, hasta por aﬁci´on o hobby.\nEntre estas personas, claro est´a, se incluir´an aqu´ellas a las que les gustar´ıa\nen un futuro poder formar parte del Personal Docente e Investigador (PDI)\n2Las p´aginas Web citadas en este trabajo han sido accedidas por ´ultima vez el\n13/05/2008.\n",
  "speaker": "SYSTEM",
  "uuid": "9a4804b0-5ecb-41a0-8c14-c9b4defcaf9c"
}