{
  "message": "SYSTEM: Wiki: JOB VACANCY: Research Fellow (\nhttp://www.jobs.ac.uk/job/ACE001/research-fellow-isense-making-sense-of-nonsense/\n) CERCIA, School Of Computer Science, University of Birmingham, UKSalary from GBP27,319 to GBP35,646 a year, with potential progression to GBP37,839 a year.\nThe Centre of Excellence for Research in Computational Intelligence and Applications (CERCIA) in the School of Computer Science, is looking for a Research Fellow create and contribute to the creation of knowledge by undertaking a range of activities within the iSense (Making Sense ofNonsense)project funded by the European Commission.  The post is available immediately and is funded until 31 December 2013.\nThe main objective of the iSense project is to develop intelligent data processing methods for analysing and interpreting the data such that system/network faults are detected (and where possible anticipated), isolated, identified as soon as possible, and accommodated for in future decisions or actuator actions.\nThe Research Fellow will work within the iSense project in CERCIA developing research objectives and proposals for own or joint research, under the supervision of the project supervisor. S/He will contribute to writing future bids for research funding and will operate within the area of computer science, particularly in ensemble learning and other chine learning domains.S/He willalso analyse and interpret research findings and results with the aim of disseminating them in top international journals and conferences.\nTo apply, you should have completed, or nearly completed, a PhD in ensemble learning. You should have a high level of analytical ability and you should have high level computational skills (including programming skills and knowledge of various statistical test methods for evaluating and comparing experimental results). Fluency in relevant machine learning models, techniques or methods, along with ability contribute to developing new ones, is also required. You are also expected to teach modules in the general natural computation field, including neural and evolutionary computation.\nInformal enquiries may be made to Prof Xin Yao (x.yao@cs.bham.ac.uk) at the School of Computer Science. Please do not send applications to this address.\nClosing date: 20th February 2011\nReference: 43651 (\nhttp://www.jobs.ac.uk/job/ACE001/research-fellow-isense-making-sense-of-n\nonsense/)\nTo download the details and submit an electronic application online visit: www.hr.bham.ac.uk/jobs alternatively information can be obtained from +44 121 415 9000.",
  "speaker": "SYSTEM",
  "uuid": "9c3679ba-31cc-4624-93f3-a5870f3db27d"
}