{
  "message": "SYSTEM: RQRQR.pdf: Página 13\n6\nAcknoledgements\ngracias a la UPM por la beca, y gracias a Luis, Freddy y Miguel ngel por los\ncasos de prueba. Gracias especiales a Hctor por compartir el cdigo y permitir su\nmodiﬁcacin.\nReferences\n1. J. Sequeda, “A Survey of Current Approaches for Mapping of Relational Databases\nto RDF,” 2009.\n2. H. Wache, T. Voegele, U. Visser, and H, “Ontology-based integration of\ninformation-a survey of existing approaches,” IJCAI-01 Workshop:, vol. 2001,\npp. 108–117, 2001.\n3. J. Bleiholder, S. Khuller, F. Naumann, and L. Raschid, “Query planning in the\npresence of overlapping sources,” Advances in Database, pp. 811–828, 2006.\n4. M. Friedman, A. Levy, and T. Millstein, “Navigational plans for data integration,”\nsixteenth national conference on Artiﬁcial intelligence and the eleventh Innovative\napplications of artiﬁcial intelligence conference, pp. 67–73, 1999.\n5. Paton N.W., Goble C.A., and Bechhofer S., “Knowledge based information inte-\ngration systems,” Information and Software Technology, vol. 42, pp. 299–312, Apr.\n2000.\n6. A. Halevy, A. Rajaraman, and J. Ordille, “Data integration: The teenage years,”\nconference on Very Large Data Bases (VLDB), pp. 9–16, 2006.\n7. D. Calvanese, G. De Giacomo, D. Lembo, M. Lenzerini, and R. Rosati, “Tractable\nReasoning and Eﬃcient Query Answering in Description Logics: The DL-Lite Fam-\nily,” Journal of Automated Reasoning, vol. 39, pp. 385–429, Oct. 2007.\n8. J. Barrasa, O. Corcho, and A. G´omez-P´erez, “R2O, an Extensible and Semantically\nbased Database-to-Ontology Mapping Language,” 2nd Workshop on Semantic Web\nand Databases (SWDB2004), vol. 3372, pp. 1069—-1070, 2004.\n9. B. C. Grau, I. Horrocks, B. Motik, B. Parsia, P. Patel-Schneider, and U. Sattler,\n“OWL 2: The next step for OWL,” Web Semantics: Science, Services and Agents\non the World Wide Web, vol. 6, pp. 309–322, Nov. 2008.\n10. H. P´erez-Urbina, B. Motik, and I. Horrocks, “Tractable query answering and\nrewriting under description logic constraints,” Journal of Applied Logic, vol. 8,\npp. 186–209, June 2010.\n11. H. P´erez-Urbina, I. Horrocks, and B. Motik, “Eﬃcient Query Answering for OWL\n2,” The Semantic Web-ISWC 2009, 2009.\n12. L. Bl´azquez, M. Poveda, M. Su´arez-Figueroa, and A, “Towntology &amp; hydrOn-\ntology: Relationship between Urban and Hydrographic Features in the Geographic\nInformation Domain,” Ontologies for Urban Development, pp. 73–84, 2007.\n13. A. G´omez-P´erez, J. Ramos, and A. Rodr´ıguez, “The IGN-E Case: Integrating\nThrough a Hidden Ontology,” Headway in Spatial Data Handling, pp. 417–435,\n2008.\n",
  "speaker": "SYSTEM",
  "uuid": "9c5e45e2-333f-4f11-9bf6-68e6a3643369"
}