{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 25\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 25 de 42 \n24. Radulovic F, García-Castro R. Extending Software Quality Models - A Sample In The \nSemantic Technologies Domain. The 23rd International Conference on Software \nEngineering & Knowledge Engineering. SEKE 2011. ISBN: 978-1-891706-29-5. \n25. Ramos JA, Fernández-López M, Gómez-Pérez A. Descubrimiento automático de \nmappings en un caso de uso real con altas exigencias de certeza. CAEPIA 11. La \nLaguna, \nEspaña. \n7-11 \nde \nnoviembre \n2011. \nhttp://erevista.aepia.org/index.php/aia/article/viewFile/908/731. \n26. Ramos JA, Vilches-Blázquez LM. Relacionando la información geográfica con su \ncomponente semántico a través de las IDE. Jornadas Ibéricas de Infraestructuras de \nDatos Espaciales 2011 (JIIDE 2011). Barcelona, España    . 9-11 de noviembre de \n2011. http://www.jiide2011.org/jiide2011/pdf/C_65.pdf. \n27. Ramos JA, Vilches-Blázquez LM. Conflación semántica sobre linked data. CAEPIA 11. \nLa \nLaguna, \nEspaña. \n07-11 \nde \nnoviembre \nde \n2011. \nhttp://erevista.aepia.org/index.php/aia/article/viewFile/919/742. \n28. Rico M, Corcho O, Méndez V, Gómez-Pérez JM. A Semantically Enhanced UPnP \nControl Point to Sharing Multimedia Content. IEEE Internet Computing. IEEE Computer \nSociety, Estados Unidos. Volumen: 15(6). Diciembre de 2011. Pp: 58-64. ISSN: 1089-\n7801. \n29. Roussey C, Pinet F, Ah Kang M, Corcho O. An Introduction to Ontologies and Ontology \nEngineering. Ontologies in Urban Development Projects. Editores: Falquet G, Métral C, \nTeller J, Tweed C. Springer-Verlag. Agosto de 2011. Pp: 9-38. ISBN: 978-0-85729-724-\n2. \n30. Roussey C, Pinet F, Ah Kang M, Corcho O. Ontologies for Interoperability. Ontologies \nin Urban Development Projects. Editores: Falquet G, Métral C, Teller J, Tweed C. \nSpringer-Verlag. Agosto de 2011. Pp: 39-54. ISBN: 978-0-85729-724-2. \n31. Saquicela V,Vilches-Blázquez LM,Corcho O. Lightweight Semantic Annotation of \nGeospatial RESTful Services. The Semantic Web: research and application. \nESWC2011. ISBN: 978-3-642-21033-4. \n32. Saquicela V,Vilches-Blázquez LM,Corcho O. Anotación semántica de Web Feature \nServices. Jornadas Ibéricas de Infraestructuras de Datos Espaciales 2011 (JIIDE \n2011). \nBarcelona, \nEspaña. \n9-11 \nde \nnoviembre \nde \n2011. \nhttp://www.jiide2011.org/jiide2011/pdf/C_67.pdf. \n33. Sequeda JF, Tirmizi SH, Corcho O, Miranker DP. Survey of Directly Mapping SQL \nDatabases to the Semantic Web. Knowledge Engineering Review. Elsevier. Volumen: \n26(4). 26 de diciembre de 2011. Pp: 445-486. ISSN: 0269-8889. \n34. Suárez-Figueroa MC. Evolución en el uso de las TICs: pasado, presente y futuro. Una \nexperiencia en Programación Lógica. Aplicación de la web social a la formación on-line: \nSocial-learning (Revista RELADA). VI Jornada de Innovación Pedagógica (Proyecto \nADA-Madrid). Universidad Complutense de Madrid. 29 de abril de 2011. \n35. Suárez-Figueroa MC, Atemezing GA, Corcho O. The Landscape of Multimedia \nOntologies in the last Decade. Multimedia Tools and Applications. Springer-Verlag. . \nISSN: 1380-7501. \n36. Suárez-Figueroa MC, García-Castro R, Villazón B, Gómez-Pérez A. Essentials In \nOntology Engineering: Methodologies, Languages, And Tools. Proceedings of the 2nd \nWorkshop organized by the eeb data models community- CIB conference W078-W012. \n2nd Workshop on eeBuildings Data Models - CIB conference W078-W012. Sophia \nAntipolis, Francia. 26-28 octubre de 2011. \n37. Vila D, Escolano E. Linked Data at the Spanish National Library and the Application of \nIFLA RDFS Models. Newsletter of the Standing Committee of the IFLA Cataloguing \nSection. IFLA2011. Junio 2011. ISSN: 1022-9841. \n38. Villazón-Terrazas B, Ramírez J, Suárez-Figueroa MC, Gómez-Pérez A. A Network of \nOntology Networks for building e-Employment Advanced Systems. Expert Systems \nwith Applications. Pergamon-Elsevier Science Ltd. - Q1, 2011. ISSN: 0957-4174. \n39. Yaikhom G, Atkinson M, van Hemert J, Corcho O, Krause A. Validation and mismatch \nrepair of workflows through typed data streams. Philosophical Transactions of the Royal \nSociety A. Royal Society. Volumen: 369(1949). Agosto 2011. Pp: 3285-3299. ISSN: \n1364-503X. \n40. Zhao J, Corcho O, Missier P, Belhajjame K, Newmann D, de Roure D, Goble CA. \neScience. Handbook of Semantic Web Technologies. Springer-Verlag. Volumen 2. \nISBN: 978-3-540-92912-3. \n",
  "speaker": "SYSTEM",
  "uuid": "9cb330bb-4daf-4e8e-9ab3-64f8f7150d89"
}