{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 9\nEn 1998 se elaboró un Libro Verde sobre la información del sector público en la socie-\ndad de la información4 que contiene las propuestas que representaron el punto de partida\nde la Directiva 2003/98/CE. El Libro Verde explica cómo la información del sector públi-\nco genera oportunidades para el crecimiento económico y el empleo, y por qué el acceso\na la información del sector público es tan importante para las empresas. También destaca\nel potencial que representa este tipo de información: “representa el mayor recurso único\nde contenido de información para crear contenidos y servicios de información de valor\nañadido”5. Con estos antecedentes, la Directiva propone la armonización de normas y\nprácticas de reutilización de la información pública en todos los países de la Unión\nEuropea y solicita que los organismos públicos pongan a disposición de las empresas pri-\nvadas la información para fomentar la reutilización.\nLa propuesta se presentó al Consejo de Ministros de la UE y al Parlamento Europeo,\ndonde se aprobó el 17 de noviembre de 2003, con la obligación de que los países miem-\nbros de la UE notificaran a la Comisión Europea las disposiciones de aplicación de la\nDirectiva a más tardar el 1 de julio de 2005. España, junto a Austria, Bélgica, Luxemburgo\ny Portugal, no respetó esta obligación y la Comisión los denunció ante el Tribunal de\nJusticia Europeo. \nFinalmente, el 16 de noviembre de 2007 se aprobó en España la Ley 37 sobre la reuti-\nlización de la información del sector público, basada en un proyecto propuesto por los\nMinisterios de Justicia, Industria, Comercio y Turismo, Presidencia y Administraciones\nPúblicas, a iniciativa del Ministerio de Cultura y publicada en el “BOE” del 17 de noviem-\nbre. La Ley era sumamente necesaria para regular la reutilización de la información públi-\nca en España.\n2. DIRECTIVA 2003/98/CE\nEl objeto principal de la Directiva es regular el “comportamiento“ de los organismos\ndel sector público cuando participan en el mercado de la información o cuando hacen posi-\nble su reutilización, ofreciendo medios para que dichos organismos “mejoren la reutiliza-\nción de sus recursos informativos mediante la fijación de normas sobre las solicitudes de\nreutilización o la disponibilidad de los documentos”6. \nA través de la adopción de la Directiva se han creado nuevas oportunidades para la\nindustria europea de contenidos para explotar la información del sector público, para crear\nnuevos productos y servicios con valor añadido con efectos transfronterizos (sistemas de\nnavegación, servicios meteorológicos, etc.) y para mejorar las condiciones de las institu-\nciones del sector público para poder compartir, difundir y permitir la reutilización de sus\ndatos7.\nASPECTOS DE LA DIRECTIVA DE 2003/98/CE DEL PARLAMENTO EUROPEO Y DEL CONSEJO…\n13\n4 La información del sector público: un recurso clave para Europa. Libro verde sobre la información del sector públi-\nco en la sociedad de la información / Comisión Europea, COM(1998) 585. En: ftp://ftp.cordis.lu/pub/econtent/\ndocs/gp_es.pdf (última consulta: 26 de junio de 2008).\n5 Ídem, p. 3.\n6 Información del sector público ahora más fácil de reutilizar en todos los Estados miembros. “¿Es esto lo bastante\nfácil?”, pregunta la Comisión en una nueva consulta pública/Comisión Europea, Bruselas, 26 de junio de 2008,\nIP/08/1017.\n7 Public Consultation, Review of the PSI Directive/European Commission, Information Society Directorate-General. En:\nhttp://ec.europa.eu/information_society/policy/psi/docs/pdfs/online_consultation/consultation_review_psi_2008.pdf (últi-\nma consulta: 29 de junio de 2008).\nBASES DE DATOS  1/1/04  03:39  Página 13\n",
  "speaker": "SYSTEM",
  "uuid": "9d77a34a-c98e-424a-8b34-1404820b7a7b"
}