{
  "message": "SYSTEM: RQRQR.pdf: Página 12\nas described in section 3.1. Finally ‘G’ will be used for the “global” approach,\nwhich will keep all the mapped predicates in the ontology after pruning it, since\nthey could be complementary to some extent, again as described in section 3.1.\nThe query posed to the system for comparison purposes is a general query\ncovering a good part of the ontology, in the case of hydrOntology the query is\nsimply Q(x) ←Aguas(x), which covers as a superclass most of the taxonomy\npresent in hydrOntology. Similarly in the case of PhenomenOntology the query\nused is Q(x) ←Red(x), being a module about transportation networks, the\nconcept “Red” is the most general one. Both queries cover most of the mappings\nand ontologies used for the tests, providing a good approximation of what could\nbe expected in a diﬀerent context.\n5\nConclusions\nAs a ﬁrst consequence the number of queries and information in several steps\nof the process can be reduced when considering the information provided by\nthe RDB2RDF mappings, this is the information that can be retrieved from\none single source, either a physical source or an abstraction of several sources.\nBecause of this reduction there is a gain in eﬃciency, taking less time to rewrite\nthe query. Therefore, an algorithm that takes into account the capabilities of the\nsource of information can make a better use of this source queried, even when\nthere is one single source. The rewriting of the query in logical terms, logical\npath search, is powered with this information, leading to better results.\nThere is still a big room for improvement. The redundancy of information in\nrelated concepts is not considered, and it is responsibility of the user to specify\nif there is no overlap or if there is a complete containment of subclasses by their\nrespective classes, however, when the overlap is partial and multiple, checking\nthe minimum set of predicates to retrieve the maximum number of answers to the\noriginal query is not trivial. Thus, the description of the information provided\nby the source, in logical terms, can be improved in this sense. Similarly, the\ninformation regarding the sources of information available and the information\nthey provide is not considered here. The same way that concept inclusion can be\nconsidered, these concepts could keep information of the provenance, allowing\nthe algorithm to diﬀerentiate among the concepts that are provided by diﬀerent\nsources and again the overlapping that may exist among them.\nFinally, the datalog program is heavily pruned immediately after its genera-\ntion. Keeping a more descriptive datalog program and using a distributed query\nprocessor capable of handling this expressiveness would allow posing more com-\nplex queries to the sources. Albeit this is not a trivial task either. posiblemente\nampliar, explicar que se diferencia de perez-urbina en la medida en que hay\nconceptos que no se han mapeado\n",
  "speaker": "SYSTEM",
  "uuid": "9d939818-ef1e-4c89-b1c3-b66234df4c3e"
}