{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Nantesfeb2011 \n\nPh.D. position : Man-machine collaboration processes for continuous knowledge extraction using distributed semantic wikis. LINA/University of Nantes\nThis Ph.D. is part of Kolflow, a research project funded by the the French national research agency,  starting in 2011 and ending in July 2014.\nKolflow aims at building a social semantic space where humans collaborate with smart agents in order to produce knowledge understandable by humans and machines. Humans are able to understand the actions of smart agents. Smart agents are able to understand actions of humans. Kolflow targets the co-evolution of content and knowledge as the result of interactions of humans and machines. If human-machine collaboration can be the key to ensure co-evolution of content and knowledge, such collaboration can fail if not managed.\nThis PhD subject focuses on two aspects of distributed semantic social spaces:\n1.on the representation and enactment of knowledge extraction processes in the context of man-machine collaboration in a social semantic space. The PhD will investigate how to extend a distributed semantic wiki in order to support declarative collaborative processes. These processes will handle the continuous integration of contributions of knowledge extraction by smart agents and humans. These processes have to ensure the non regression of the system and consequently, makes the man-machine collaboration stable and sustainable.\n2.\ton the management of consistency of distributed semantic spaces relying on Commutative Replicated Data Types (CRDTs). The PhD will investigate the development of specific CRDTs for replicating semantic data  across an network of semantic peers. This data type must be evaluated on real semantic web data in order to measure the overhead of this new datatype.\nThe candidate should have a background in semantic web and distributed systems.\nApplication are open until end of Spring 2011.\nhttp://atlas.lina.univ-nantes.fr/gdd/members/molli/kolflow-2011",
  "speaker": "SYSTEM",
  "uuid": "9e022358-67ab-4599-bf81-f1dcb554a0c7"
}