{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 26\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11175\nArtículo 51.  Presentación de solicitudes.\n1.  Las solicitudes serán cumplimentadas por las universidades, a través de los \nmedios telemáticos habilitados para ello, a los que se podrá acceder en la página web del \nMICINN. El plazo de presentación de solicitudes será desde el día 16 al 30 de septiembre \nde 2010, ambos inclusive.\nEn las solicitudes se incluirá la relación de investigadores en formación a los que se les \nha eximido del pago de los precios públicos, con indicación del número de créditos a los \nque alcanza la exención.\n2.  La solicitud podrá presentarse en el Registro del Ministerio de Ciencia e Innovación \nde la calle Ramírez de Arellano, 29, 28071, Madrid, o en cualquiera de los lugares señalados \nen el artículo 38.4 de la Ley 30/1992, de 26 de noviembre, de Régimen Jurídico de las \nAdministraciones Públicas y del Procedimiento Administrativo Común. También se podrá \nhacer uso de la posibilidad de registro telemático con la firma electrónica del representante \nlegal de la universidad solicitante, siempre que los medios telemáticos estén habilitados al \nefecto. Si se opta por esta posibilidad, se atenderá a las instrucciones que en la página \nweb del MICINN se indiquen.\nEn el caso de que las universidades optaran por presentar su solicitud en una oficina \nde Correos de España, lo harán en sobre abierto para que la instancia sea fechada y \nsellada por el personal de Correos antes de ser certificada.\n3.  La presentación de la solicitud conlleva la autorización al órgano concedente para \nrecabar, en los casos en que sea legalmente exigible, los certificados a emitir por la Agencia \nEstatal de la Administración Tributaria y por la Tesorería General de la Seguridad Social.\nEn el impreso de solicitud se incluirá declaración responsable del representante legal \nde la universidad solicitante de no encontrarse incurso en ninguna de las situaciones que \nimpiden acceder a la condición de beneficiario. La universidad deberá comunicar al órgano \nconcedente las posibles alteraciones de las circunstancias recogidas en dicha \ndeclaración.\n4.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \ncomunicación a terceros de los datos recogidos en la misma, con objeto del tratamiento \nposterior de los datos con fines históricos, estadísticos o científicos, en el marco de la Ley \nOrgánica 15/1999, de 13 de diciembre, de Protección de Datos de Carácter Personal.\n5.  La presentación de una solicitud de ayuda conlleva el consentimiento para la \nutilización, por parte del órgano instructor o del órgano concedente, de medios electrónicos \npara la practica de las notificaciones que se realicen a lo largo del procedimiento.\nArtículo 52.  Propuesta de resolución.\nEl órgano instructor, recogido en el artículo 3.1, elevará al órgano competente para \nresolver la concesión de las ayudas la correspondiente propuesta de resolución definitiva\nArtículo 53.  Incompatibilidades.\nLas ayudas de precios públicos indicadas en la presente convocatoria serán \nincompatibles con las obtenidas para el mismo fin en cualquier otra convocatoria de \nentidades públicas o privadas, para los mismos créditos que se acrediten en la solicitud.\nCAPÍTULO VI\nDisposiciones específicas del Subprograma de Formación del Personal Investigador en \nagroalimentación en los centros de investigación INIA-CCAA (Subprograma FPI-INIA)\nArtículo 54.  Requisitos de los beneficiarios.\nPodrán ser beneficiarios de estas ayudas durante el periodo de beca, al que se refiere \nel artículo 19, las personas físicas que, como norma general, en la fecha de incorporación \na su centro de adscripción, cumplan los requisitos recogidos en el artículo 17.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "9e2763eb-b2c5-4710-8875-82c4071c8ac1"
}