{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 27\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97752\n5.  En caso de no llevarse a cabo la estancia en las condiciones que fue concedida o \nde no poderla justificar, el beneficiario está obligado a reintegrar la totalidad de la cantidad \npercibida. En el caso de reducción del período concedido, el beneficiario deberá justificar \nlas causas. Igualmente deberá reintegrar las cantidades percibidas en exceso sobre el \ncoste real al viaje realizado, todo ello relacionado con la finalidad de la estancia.\n6.  Los organismos y entidades de los que dependan los centros de adscripción de \nbeneficiarios de ayudas de estancias breves concedidas, deberán presentar antes del 30 \nde marzo de 2011 ante la Dirección General de Política Universitaria, la certificación de los \ngastos realizados con cargo a este concepto durante el año 2010, firmada por el responsable \ndel órgano competente de cada uno de ellos. Si la cantidad resultante de la justificación \nfuera inferior a la abonada por el Ministerio de Educación, deberá ser reintegrada por el \nprocedimiento y normativa aplicable al caso.\n7.  De acuerdo con el artículo 16.1.d) de la Ley 40/1998 del Impuesto sobre la Renta \nde las Personas Físicas, las ayudas para estancias breves no tendrán la consideración de \nrendimientos del trabajo, por lo que no estarán sujeta a retención y pago del Impuesto \nsobre la Renta de las Personas Físicas.\nCAPÍTULO VI\nTraslado temporal a un centro extranjero\nLos beneficiarios de ayudas para becas o contratos en prácticas derivados de la \npresente convocatoria, podrán solicitar el traslado temporal de la beca a un centro \nextranjero, de acuerdo con los requisitos que se establecen en este apartado.\nArtículo 45.  Objeto del traslado temporal.\n1.  El traslado temporal tiene por objeto reforzar la formación científica y capacidad \ntécnica, mediante su incorporación a un centro o grupo de investigación relevante en el \námbito internacional y vinculado al campo científico, técnico o artístico correspondiente al \ncontenido de la tesis doctoral para la que se concedió la beca.\n2.  Las actividades a realizar durante el período de traslado temporal, deben \nconsiderarse significativas y beneficiosas para el cumplimiento del objeto de formación de \nla ayuda de FPU.\nArtículo 46.  Características y fecha de inicio.\n1.  El traslado a un centro extranjero, tendrá una duración mínima de seis meses y \nmáxima de doce. Podrá iniciarse a partir del mes siguiente de la fecha de concesión \nprevista para julio de 2010 para las solicitudes presentadas en el mes de marzo 2010, y \npara enero de 2011, para las presentadas en septiembre de 2010.\n2.  El disfrute de un traslado temporal es incompatible con el de una estancia breve u \notra estancia temporal que finalice en el mismo año y deberá mediar al menos seis meses \nentre ambas.\n3.  El traslado temporal de estas becas al extranjero comporta las ayudas que a \ncontinuación se detallan:\na)  una dotación mensual complementaria a la dotación de la beca de hasta 1.500 €, \nen consideración al país de destino,\nb)  una ayuda única para instalación y viajes, determinada en consideración al país \nde destino, hasta un máximo de 2.500 €, según país de destino y duración.\n4.  Por la Dirección General de Política Universitaria se establecerán las cuantías de \nlas dotaciones y las ayudas a los viajes e instalación, según el país de destino del traslado \ntemporal.\n5.  Los beneficiarios de ayudas para traslado temporal a centros en el extranjero, \ndisfrutarán, sin perjuicio de la cobertura de la Seguridad Social, de un seguro de accidentes \ny de asistencia médica en los desplazamientos al extranjero autorizados por la Dirección \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "9ed82b88-fdc0-442d-839a-011f3d74cf75"
}