{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 77\nBÚSQUEDA \n \n77 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nEn todo lo que sigue (y mientras no se diga lo contrario), las funciones heurísticas \nserán siempre bien fundadas y supondremos que miden lo cerca que estamos de \nalcanzar un objetivo (es decir, valores menores son preferibles). \nLo realmente difícil en el diseño de un sistema de producción con estrategia de \ncontrol informada es encontrar la función heurística adecuada. \nVeamos ejemplos de heurísticas para algunos problemas concretos. Para el \nproblema del 8-puzzle tenemos la siguientes heurísticas: \na) La basada en la distancia Manhattan (o distancia taxi). Se asocia a cada casilla \nun número que es su distancia taxi con su posición en el tablero objetivo (esto es, la \nsuma de diferencias de sus coordenadas x e y). La función heurística es la suma de \nlas distancias de cada una de las casillas (excluyendo la que se encuentra vacía). \nb) Otra heurística, mucho más simple, consiste en contar el número de casillas \nque están fuera de su sitio (respecto al tablero objetivo). Es una heurística más \npobre que la anterior, puesto que no usa la información relativa al esfuerzo (número \nde movimientos) necesario para llevar una pieza a su lugar. \nc) La distancia taxi no tiene en cuenta que si dos casillas adyacentes deben ser \ninvertidas (por ejemplo, si tenemos a la izquierda del dígito 2 el dígito 1 y en el \ntablero objetivo el dígito 1 debe estar a la derecha del 2 y en la posición actualmente \nocupada por éste) necesitaremos más de dos movimientos. Entonces, podríamos \ntomar como heurística el doble del número de pares de piezas que están en esa \ndisposición. Esta heurística también es pobre, puesto que se concentra demasiado \nen un cierto tipo de dificultad. En particular, tendrán valor 0 muchos tableros que no \nson el objetivo (nótese que eso no sucedía en ninguna de las dos heurísticas \nanteriores). \nd) La cuarta posibilidad que consideramos es definir como función heurística la \nsuma de las funciones definidas en (a) y (c). Es la heurística más fina, pero también \nla que requiere un mayor esfuerzo de cálculo. \nEn la Figura 1 se recoge una ilustración de estas heurísticas en un caso concreto. \nEjercicio. Otra heurística posible para el 8-puzzle, si el estado objetivo es el \nrecogido en la figura 1, es la siguiente: h(e) = 3 * seq(e), donde seq(e) cuenta 1 si \nhay un dígito central en e y 2 por cada dígito x no central que no es seguido (en el \nsentido de la agujas del reloj) por su sucesor x+1 (imponemos por convenio que 8 + \n1 = 1). Calcular el valor de esta heurística para los estados que aparecen en la figura \n1. Generalizar esta idea para estados objetivos cualesquiera. \nIntroducimos a continuación un nuevo problema:  \n",
  "speaker": "SYSTEM",
  "uuid": "9eeb2526-b49e-4e72-92a7-98ded5462ffb"
}