{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 8\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n2. Centro de Documentación de Música y Danza en España \n- \nhttp://www.mcu.es/comun/bases/spa/cdmr/index.html \n- \nEsta base de datos contiene información de todas las actividades relacionadas \ncon la música y la danza a nivel estatal. Profesionales, entidades, actividades y \npublicaciones periódicas. \n- \nEjemplo de una consulta: \n \n \n \n \n \n \n \n \n \n \n \n2.3 Taxonomías \nLa taxonomía es la práctica y ciencia de la clasificación. Las taxonomías están compuestas por \ndiferentes tipos de elementos, llamados taxones, que son organizados frecuentemente en una \nestructura jerárquica, típicamente por relaciones de parentesco subtipo-supertipo, también \nconocidas como relaciones padre-hijo. De esa forma, las taxonomías pueden ser útiles a la hora \nde construir una ontología, ya que pueden proporcionar informaciones para la construcción de \nlas relaciones “SubclasseOf” entre los conceptos. \n2.3.1 Estándares  \n \n \nhttp://absysnet.com/legislacion/estandares.html \nA continuación aparece un conjunto de estándares que se utilizan para clasificar obras de \narte de distintos dominios como libros, música o videograbaciones. \n1. ISBN - International Standard Book Number. El ISBN es un número, formado por 10 \ndígitos, que fue creado para dotar a cada libro de un \"nombre\" que lo identifique, de cara \nal uso de la informática. Un ISBN, por ejemplo 84-7490-693-8,  está formado por cuatro \npartes: \n- \nIdentificador del grupo o país que identifica las publicaciones de un país o grupo \ngeográfico. \n- \nIdentificador de la publicación que identifica una publicación dentro de un grupo. \n- \nIdentificador del título que identifica un título particular o la edición de un título. \n- \nDígito de chequeo que valida el ISBN  \n \n8\n",
  "speaker": "SYSTEM",
  "uuid": "9f9b52b7-0801-48d6-b136-ee096c89d212"
}