{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master10-11 \n\nLas clases se imparten en el aula 6302 los martes de de 3 a 5 y los jueves de 6 a 7.\nContents\n[\nhide\n]\n1\nEvaluación\n2\nProgramación docente de la asignatura de Gestión de Conocimientos (Máster de Ingeniero en Informática\n3\nPrácticas\n3.1\nPráctica 1\n3.1.1\nNormas de entrega\n3.1.2\nSoftware a utilizar y documentación adicional\n4\nOfertas de trabajo relacionadas\nEvaluación\n\nEl 13 de Enero (Jueves) se realizará una prueba asociada a los contenidos impartidos por los profesores Pazos y Rodríguez-Patón\nEl día 18 de febrero a las 17 horas se realizará un examen de todos los contenidos impartidos para aquellos alumnos que no hayan superado la asignatura por evaluación continua.\nUno de los profesores de la asignatura ha estado durante 15 minutos esperando en el aula correspondiente, y ningún alumno ha aparecido, por lo que no se ha realizado esta prueba. Se ruega a los alumnos Junior Alberto Díaz Martínez, Javier Formica y Carmen Luisa Sánchez la Hoz que se pongan en contacto con Oscar Corcho.\nProgramación docente de la asignatura de Gestión de Conocimientos (Máster de Ingeniero en Informática\n\nTema 1\nSemana 1: Introducción (A. Gómez-Pérez)\nSemana 2: Tema 1 (D. Manrique)\nSemana 3: Tema 1 (D. Manrique)\nTema 2\nSemana 4 (5 y 7 de Octubre): Representación del Conocimiento (A. Gómez-Pérez)\n[\nIntroducción a la Representación del Conocimiento\n]\n[\nRedes Semánticas\n]\nSemana 5 (14 de Octubre): Ontologías(A. Gómez-Pérez)\n[\nFundamentos de las ontologías\n]\nSemana 6 y 7 (19, 21 y 26 de Octubre): Metodología para construir ontologías (A. Gómez-Pérez)\n[Metodología:\nhttp://delicias.dia.fi.upm.es/wiki/images/c/c4/6._GC_Metodolog%C3%ADa-1-v1%28asun%29.pdf\n]\nSemanas 7 y 8 (28 de Octubre, 2 y 4 de noviembre): RDF(S) y SPARQL (Oscar)\nRDF(S)\nSPARQL\nEjemplos RDF(S)\nSemanas 11 y 12 (23, 25 y 30 de noviembre): Oscar\nOWL\nEjercicio\nFichero OWL inicial\nFichero OWL final\nEl 2 de diciembre se realiza un examen de una hora (Asun)\nTema 3\nSemana 9 (11 de noviembre) (Pazos)\nSemana 12 (examen 2 de diciembre): Asun\nSemana 13 (9 de diciembre): Asun\n[1]\nSemana 14 (14 y 16 de diciembre): Pazos\nSemana 15  (21 y 23 de diciembre): Alfonso Rodríguez-Patón\nPrácticas\n\nTodas las prácticas se deben entregar por correo electrónico a masterii10@delicias.dia.fi.upm.es.\nPráctica 1\n\nSe debe diseñar una ontología, que debe ser implementada en el lenguaje RDF [1], que represente la información correspondiente a alguno de los bancos de datos gratuitos y de libre disposición que están disponibles en las páginas Web del Ministerio de Medio Ambiente [2], y que están disponibles en diversos formatos (Microsoft Excel, PDF, ficheros ASCII, etc.). Por ejemplo, se pueden seleccionar los datos correspondientes a las estadísticas de índices forestales [3], que están disponibles en formato Excel. A partir de estos datos y de su estructura, se deberán crear las ontologías que se consideren más adecuadas, y si es posible, enlazando algunas de estas informaciones con otras redes semánticas disponibles en la Web, como las de DBPedia [4], GeoLinkedData [5] o GeoNames [6]. También se pueden utilizar buscadores genéricos como sig.ma [7]. Finalmente, un vocabulario que puede ser de utilidad para la representación de estadísticas, en caso de que se consideren útiles, puede ser SCOVO [8].\nEntrega 1: 2 de noviembre. Se entrega la documentación relativa a la construcción de la ontología.\nNormas de entrega\n\nLas diferentes entregas deberán ser enviada a la cuenta de correo electrónico de la asignatura antes de las 15:00 del día de entrega. Si no se ha recibido confirmación explícita de la recepción de la práctica, los alumnos se deberán poner en contacto con el profesor de la asignatura lo más pronto posible.\nSe deberá adjuntar un fichero comprimido con el nombre PrácticaRedesSemánticas_XXX.zip, donde XXX es el nombre y apellidos de uno de los autores de la práctica. El fichero contendrá la siguiente información:\nFichero “autores.txt” con los nombres y apellidos, y número de matrícula, de cada uno de los alumnos.\nFichero “memoria.pdf”, con la memoria de la práctica, que no debe exceder 5 páginas, donde se deberán incluir las principales decisiones de diseño tomadas para la construcción de la red semántica y la selección de vocabularios y estructura de la red, así como la descripción del proceso realizado para la generación del código RDF.\nFichero “datos.rdf” con la implementación en RDF.\nSoftware a utilizar y documentación adicional\n\nPara la implementación de la red semántica se puede utilizar cualquier software que permita la edición de ficheros de texto o la gestión de datos en el formato RDF, tanto desde una interfaz de usuario (por ejemplo, la herramienta RDF Gravity [9]) como a través de una interfaz de programación (por ejemplo, Jena [10]). También se pueden utilizar herramientas de transformación de recursos disponibles en hojas de cálculo a RDF, como la librería NOR2O [11], que está integrada en herramientas como NeOn Toolkit [12].\nEn las horas de tutoría de práctica no se atenderán dudas básicas relacionadas con estos sistemas, pues los alumnos deben ser capaces de leer la documentación asociada a los mismos, sino sólo dudas que pueden estar relacionadas con el diseño de la red semántica y el proceso de transformación.\n[1]\nhttp://www.w3.org/RDF/\n[2]\nhttp://www.mma.es/portal/secciones/biodiversidad/banco_datos/\n[3]\nhttp://www.mma.es/portal/secciones/biodiversidad/montes_politica_forestal/estadisticas_forestal/indice_estadisticas_forestales_2007.htm\n[4]\nhttp://dbpedia.org/\n[5]\nhttp://geo.linkeddata.es/\n[6]\nhttp://www.geonames.org/\n[7]\nhttp://sig.ma/\n[8]\nhttp://purl.org/NET/scovo#\n[9]\nhttp://semweb.salzburgresearch.at/apps/rdf-gravity/\n[10]\nhttp://jena.sourceforge.net/\n[11]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[12]\nhttp://www.neon-toolkit.org/\nOfertas de trabajo relacionadas\n\nEEUU. Los Ángeles. Agosto 2010. Distributed/Federated Query Expert\nOrangeDog2010\n(más información: contactar con Oscar Corcho begin_of_the_skype_highlighting     end_of_the_skype_highlighting)\nUK. Oxford. Agosto 2010. Research.\nOxford2010\n(más información: contactar con Oscar Corcho)\nGermany. Munich. Agosto 2010. Researcher: SEMANTIC TECHNOLOGIES and SERVICE-ORIENTED COMPUTING.\nDOCOMO2010\n(más información: contactar con Oscar Corcho)\nAustria. Vienna. Julio 2010. Junior Researcher.\nSTI2010\n(más información: contactar con Oscar Corcho)\nItaly. Ancona. Julio 2010. Semantic Web Applications.\nSemWebApp2010\n(más información: contactar con Oscar Corcho)\nAlemania. Berlín. Julio 2010. Semantic Web Developer.\nSemWew2010\n(más información: contactar con Oscar Corcho)\nAlemania. Berlín. Abril 2010. DBPedia developer.\nDBPediaApr2010\n(más información: contactar con Oscar Corcho)\nAustria. Enero 2010. Semantic-technologies software engineer en Playence (más información: contactar con Oscar Corcho)\nReino Unido. Milton Keynes (Knowledge Media Institute). Enero 2010. Short internship (más información: contactar con Oscar Corcho)\nEspaña. Madrid. Becario a tiempo parcial. Enero 2010. iSOCO (más información: contactar con Oscar Corcho)\nAlemania. Senior researcher. Diciembre 2009. Semantic Web:\nSeniorResearcherKoblenz\nAustralia. Senior Scientist en CSIRO. Diciembre 2009. Semantic data management and sensor information systems:\nhttps://recruitment.csiro.au/asp/job_details.asp?RefNo=2009%2F800\nFrancia. Postdoc en LORIA/INRIA. Noviembre 2009. Semantic wikis:\nPostdocLORIA\nIrlanda. Bell Labs. Octubre 2009. Semantic Web expert.\nBellLabsIrelandOct2009\nInglaterra. Julio 2009. Ontology Engineer.\nhttp://www.trueknowledge.com/jobs/\nAustria. Febrero 2009.\nhttp://www.sti-innsbruck.at/about/jobs/\nNature Publishing Group:\nhttp://www.cs.man.ac.uk/~hulld/npg.pdf\nFujitsu, Londres, Enero 2009:\nhttp://delicias.dia.fi.upm.es/wiki/images/2/2b/OfertaTrabajoFujitsu_Jan09.pdf\nBerlin, Alemania, Enero 2009.\nhttp://www.corporate-semantic-web.de/reader/items/we-are-hiring---ppen-phd-position-at-corporate-semantic-web.html\nAustralia. Enero 2009.\nhttps://recruitment.csiro.au/asp/job_details.asp?RefNo=2008%2F1497\nReino Unido. Enero 2009.\nhttp://kmi.open.ac.uk/jobs/vacancy-5245.php",
  "speaker": "SYSTEM",
  "uuid": "9fe9e431-7b27-40e6-8657-e412100bd80a"
}