{
  "message": "SYSTEM: D5.3.2.pdf: Página 12\nPage 12 of 48 \nNeOn Integrated Project EU-IST-027595 \n \nGlossary. In this regard, we relate the activities and processes included in the NeOn Glossary with \nNeOn plug-ins in Section  2.3. \n2.1. Getting Feedback from the Ontology Engineering Community \nImportant goals of having the NeOn Glossary of Processes and Activities are to have as complete \nas possible agreed collection of the important terms in the field of ontology engineering. Because \nthe terminology in a dynamic field like ontology engineering is continually evolving, it is essential to \nestablish a workflow for collecting the feedback about existing terms and the suggestion of new \nterms for maintaining the NeOn Glossary. \nFor this purpose, we set up a discussion project2 in the Cicero argumentation tool . The discussion \nproject is being used for collecting the feedback from the ontology engineering community. People \nwho are interested in the glossary can find all current definitions on Wiki pages in Cicero3. \nFurthermore, a quick start guide4 explains how to use the tool and how to get access and \ncontribute to it. More details about Cicero and its discussion methodology are available in [ 3,  4].  \nUsing Cicero for getting feedback has several advantages:  \n\u0001 With Cicero, all discussions are centrally collected and accessible for everyone.  \n\u0001 Cicero applies a specialized methodology for structuring discussions. For this methodology it \nwas shown that Cicero facilitates efficient discussions and accelerates convergence to a \nsolution (see [ 3,  9]).  \n\u0001 The captured discussions are part of the design rationale and the documentation of the \nglossary. Because Cicero is an extension of the well-known MediaWiki software, it is \npossible to have glossary definitions and discussions in the same system. This can then be \nused for easily linking glossary definitions and relevant discussions with each other and thus \nfor enhancing the documentation of the glossary. \nDuring the feedback process, we can distinguish between feedback with regard to already existing \ndefinitions (e.g. if the distinction between two terms should be made clearer) and the proposal of \nnew terms that should be included in the glossary. It is explained below how Cicero can be used in \neither of these cases:  \n1. Proposing the inclusion of new activities If we want to discuss whether a new activity \nshould be included into the glossary, we have to describe the issue first (e.g. \"We need a \nbetter coverage of activities related to ontology maintenance ...\"). Before creating a new \nissue, we should check whether a relevant issue does not already exist. In either case, we \ncan then reply to the issue and submit concrete solution proposals. In the example above, a \nsolution proposal may be the actual description of a missing activity. The solution proposal \nmay then be discussed together with other people by giving supporting or objecting \narguments (e.g. an example of an ontology maintenance workflow may be given where this \nactivity is relevant).  \n2. Changing the description of an already existing activity In this case, we may start by \nlooking for the discussion where the activity was originally proposed. Once found, we can \nthen extend the existing discussion and propose a new solution for describing the activity. If \nno relevant discussion can be found, we may also create a new issue (e.g. \"In the glossary, \n                                                \n2 http://cicero.uni-koblenz.de/wiki/index.php/Prj:NeOn_Glossary_of_Processes_and_Activities \n3 http://cicero.uni-koblenz.de/wiki/index.php/Category:Glossary_Definition \n4 http://cicero.uni-koblenz.de/wiki/index.php/Help:Quick_Start \n",
  "speaker": "SYSTEM",
  "uuid": "a0ee0638-8a34-4cec-a4d2-b20f43c7a25b"
}