{
  "message": "SYSTEM: FormularioCPM_ocorcho.pdf: Página 6\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n1.6. Coste estimado del desarrollo de su solución propuesta\n€\n1.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n1.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n1.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n1.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 1.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­6­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n24\n139.992,00\nlibrAIry avanza en la tarea de mejorar la comprensión, clasificación y síntesis automática de \ngrandes colecciones de información textual no estructurada y sirve de apoyo a todos los \nsectores productivos a la vez que genera valor para la sociedad.  \n \nTeniendo en cuenta la política de Reutilización de la Información del Sector Público \n(RISP) y siguiendo la filosofía de los datos abiertos, librAIry identifica y ofrece cada \nrecurso mediante una URI única. Un recurso puede ser un conjunto de documentos, un \ndocumento, una persona, un lugar, una organización, o cualquier otro elemento anotado \nsobre un texto. De esta forma, se pueden crear vínculos con otros sistemas externos que \nutilicen o referencien también los mismos recursos enriqueciendo las consultas que \npuedan derivarse de ello. LibrAIry se pone a disposición de la sociedad de la información \nde manera abierta como un recurso que puede ser explotado económicamente. \nDado el carácter distribuido y modular de la solución ofrecida por librAIry, herramientas de \nProcesamiento del Lenguaje Natural (PLN) desarrolladas en distintos lenguajes de \nprogramación, así como otras herramientas de Extracción de Información (EI) construidas \nsobre diferentes pilas tecnológicas, podrían trabajar de forma colaborativa e integrada \ndesde entornos aislados utilizando únicamente la interfaz API-REST que ofrece la librería. \nJunto a las consultas de lectura, escritura, modificación y borrado de recursos, librAIry \nincorpora un servicio de notificación de eventos desde su API que permite que los módulos \nactúen de forma reactiva ante cualquier cambio que se produzca en el entorno. De esta \nforma, dinámicamente emergen flujos de trabajo como resultado de las acciones que \nrealizan cada módulo sobre los recursos (documentos, palabras, corpus, anotaciones, etc) \nque existan en el sistema en un momento dado. \n \nAunque el uso de modelos de tópicos está ampliamente extendido en colecciones de \ndocumentos en inglés, no ocurre lo mismo para textos escritos en español y resto de \nlenguas oficiales del Estado. La incorporación de técnicas de procesamiento adaptadas al \nespañol junto con la generación de modelos entrenados con corpus también en esta lengua, \npermitirá impulsar el desarrollo de soluciones basadas en textos no estructurados más allá \ndel ámbito de esta propuesta.\nEl diseño modular de librAIry, mediante unidades independientes, facilita el consumo \najustado de recursos, según las exigencias que haya en ese momento, al evitar los \nbloqueos propios de los sistemas acoplados. Cada uno de los módulos se ejecuta en \nprocesos aislados e independientes, permitiendo así la reserva de recursos (memoria, \nhilos, descriptores de fichero, etc.) adecuada para su perfil de uso, sin verse afectados \npor la carga que pueda introducir el resto. Para la ejecución de algoritmos se ha utilizado \nel framework de computación distribuida Apache Spark. Cada uno de los cálculos \nrealizados en el sistema se distribuyen localmente entre los procesadores disponibles en \nel servidor y remotamente entre los nodos que componen el clúster. Con este reparto de \noperaciones durante la ejecución de los algoritmos se paraleliza el análisis sobre ́\n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "a1b9ee7e-4247-4cb1-a3fc-3b811b8d9631"
}