{
  "message": "SYSTEM: RQRQR.pdf: Página 3\nis being processed is pruned, the better the consequences in the load reduction\nfor the following steps of the process are. With this rationale, in this paper a\nmethod to prune the number of clauses involved in the process of query rewriting\nis presented. The method, as will be explained later, has two working modes and\nacts at two diﬀerent phases of the algorithm.\nThis paper is structured as follows: section 2 will provide some background\nabout the RDF2RDF tools and their mappings, as well as the use description\nlogics used to describe the global schema in information integration and the\nreasoning methods used with these logics for query rewriting. Section 3 will ex-\nplain he method used to prune the inference to avoid the generation of queries\nrendered as futile for the mismatch between RDF2RDF mappings and the de-\nscription logics global schema. Section 4 presents the evaluation and comparison\nwith the results obtained, where the eﬃciency gain can be checked. Finally,\nsection 5 contains the conclusions of the paper.\n2\nBackground\nThe contribution presented in this paper starts from the use of reasoning to\nrewrite queries posed in a global schema and the use of RDB2RDF tools to obtain\nfrom a relational database the RDF individuals that populate that schema.\nOn the one hand, it is important to know the common capabilities, limitations\nand the diﬀerences between RDB2RDF tools, as the information provided by\nthem through the use of their mappings is the base on which the query answering\nsystem lies. Some details will be provided in section 2.1 in addition to the brief\ndescription already provided in section 1.\nOn the other hand, the rules in the corresponding DL family in which the\nontology is implemented deﬁne the rules that will allow the rewriting of the query\nas they are uniﬁed with the axioms provided by the TBox. The corresponding\nreasoning algorithm describes the way in which these rules are going to be applied\nand the solutions that will be found through the inference steps given through the\napplication of these rules. Since this is a very broad area, the focus in this paper\nwill be set on the use of reasoning for query rewriting. Thus, it is also important\nto know current state of the art in the relationship between query rewriting\nalgorithms and DL families for a better comprehension of the remainder of the\npaper.\n2.1\nRDB2RDF tools\nThe importance of oﬀering the information available in relational databases\n(RDBs) as RDF is reﬂected in the number of approaches taken to produce RDF\ndata from relational databases, which are classiﬁed into three main categories\n[1]: proof of concept projects, domain-speciﬁc projects and tools/applications.\nAll RDB2RDF tools take some information from a RDB and oﬀer some RDF\nas output. The representation of the correspondence between the information in\nthe DB and the code generated in RDF is done by means of mappings. There are\n",
  "speaker": "SYSTEM",
  "uuid": "a1e2c907-89f1-456c-a55c-c7e11b727fdf"
}