{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master-Eng-07-08 \n\nThis page contains information for the Master Students that take the course in English\nCourse Goals\n\nYou can download the course goals and its sillabus clicking [\nhere\n].\nSlides\n\n[\nIntroduction\n]\n[\nOntologies\n]\n[\nOntology Languages\n] [\nAdditional Resources\n]\nSome students have asked for more data about possible tools to manage RDF(S). In this link you can find\n some of them:\nhttp://esw.w3.org/topic/SemanticWebTools\nI recommend using any of the following: Altova SemanticWorks and TopBraid Composer.\n I have been also asked for information about how to detect whether a SPARQL query is syntactically correct. An\n online validator is available at\nhttp://www.sparql.org/validator.html\n[\nOntology Tools\n]\nIn this class we will use Protégé version 4 (\nhttp://protege.stanford.edu/\n) for editing OWL ontologies. Students\n may come with Protégé installed in their laptops if they want to work at the same time as the explanation is\n being made\n[\nMultilinguality\n]\n[\nOntology-based access to legacy databases\n] There is no assignment related to this lecture.\nHands on sessions\n\nAll hands-on sessions must be e-mailed to Oscar Corcho.\n[\nIntroduction\n]\nActivity 1\n(delivery date: 3/12/2007). Compilation of information sources in a specific domain (leisure, food, restaurants, etc.). This includes documents, encyclopedias, Web sites, public and private databases, thesauri, controlled vocabularies, term lists, ontologies, etc. You must provide a brief description of each of them and an analysis of the importance that they may have in the context of the domain.\nActivity 2\n(delivery date: 10/12/2007). Development of class and property taxonomies in RDF Schema, with some sample individuals so as to check how they can be represented in RDF. This development can be done in a text editor or with an RDF(S) development tool (recommended). Besides, students will have to write 10 SPARQL queries, where they will try to exploit the expressive possibilities of this query language.\nActivity 3\n(delivery date: 17/12/2007). Development of OWL ontologies, based on the development done for the previous activity. We recommend using ontology tools like Protégé 4 or SWOOP. Ontologies should have at least 40 classes and 20 object properties, and at least 10 of those classes should be defined (non-primitive). Besides, the asserted and inferred taxonomies should be different. Students should also include class definitions that make the ontology inconsistent, as well as instance definitions that are inconsistent, and explain why.\nActivity 4\n(delivery date: 8/1/2008). Identify the life cycle model and the specific life cycle of the ontology to be developed.\nSelect the group of activities needed for the development of the ontology using the activity table.\nSelect the life cycle model to be used and justify the selection.\nIdentify the group of possible scenarios in the development of the ontology.\nIdentify the specific life cycle to follow in the development of the ontology.\nBuild a Gantt diagram for the development of the ontology.\nFill the questionnaire about the utility and the usability of the guidelines.\nQuestionnaire\n.",
  "speaker": "SYSTEM",
  "uuid": "a327256d-7f1f-470b-b25e-33e2217ae141"
}