{
  "message": "SYSTEM: Wiki: Esta página intenta aclarar quién hace qué dentro del personal de gestión y soporte del Grupo.\nContents\n[\nhide\n]\n1\nGestión\n2\nSoporte\n3\nQué hacer si...\n4\nContacto\nGestión\n\nAna: gestión de proyectos, comunicación con instituciones (Decanato, Rectorado, Ministerio, UE, Ocaso), contratos y bajas, becas, tramitación de permisos de viaje y previajes, pagos (facturas, postviajes), propuestas proyectos nacionales e internacionales.\nJARG: control de horas, distribución de esfuerzos y CS de proyectos, asignación de taquillas, agenda telefónica, recepción nuevos miembros,  reprografía (fotocopias, encuadernaciones, escaneos, impresión pósters y folletos), solicitud de vacaciones y permisos, organización de eventos sociales, publicaciones portal, registros de software, agenda telefónica.\nSoporte\n\nAlcázar: hardware, software, tóner.\nQué hacer si...\n\nVamos a ver aquí algunos ejemplos de casos y cómo actuar:\n\"No he cobrado la beca este mes.\" --> Esto es comunicación con la OTT --> Correo a JARG.\n\"No tengo cuenta UPM para cargar las horas.\" --> Esto es comunicación con Rectorado --> Correo a Ana.\n\"No sé qué horas cargar en la aplicación de la UPM.\" --> Esto es control de esfuerzos --> Correo a JARG.\n\"Tengo unas actas y quiero fotocopiarme unos artículos.\" --> Esto es reprografía --> JARG.\n\"He venido de un congreso y tengo unas actas con mi artículo, pero no quiero fotocopias con cartulinas como siempre, quiero que se me escanee y yo lo imprimo.\" --> Esto es reprografía --> JARG.\n\"El coordinador de mi proyecto me pide, como jefe de proyecto o gestor de proyecto, que reporte los esfuerzos del último periodo.\" --> Esto es control de esfuerzo --> Correo a JARG.\n\"El coordinador de mi proyecto me pide, como jefe de proyecto o gestor de proyecto, que reporte gastos, Form C y/o auditoría.\" --> Esto es gestión de proyectos --> Correo a Ana.\n\"No sé si algo que he hecho son horas computables como trabajo de Grupo o no.\" --> Esto es control de horas --> Correo a JARG.\n\"Se incorpora alguien nuevo al Grupo.\" --> Esto es hardware, puesto y recepción. --> Correo con antelación a JARG y Alcázar del día de incorporación. El nuevo miembro ha de pasar por JARG para la recepción.\n\"He cambiado de número de teléfono.\" --> Esto es agenda telefónica. --> Correo a JARG.\nContacto\n\nTodo lo tramitable por correo electrónico se hará así (\nadmin-oeg@delicias.dia.fi.upm.es\n). Para la atención en persona el horario es:\nAna\n: Previo acuerdo por correo o teléfono.\nJARG\n: Previo acuerdo por correo o teléfono.\nAlcázar\n: Previo acuerdo por correo o teléfono.",
  "speaker": "SYSTEM",
  "uuid": "a42a1748-e5f1-428c-be6e-7ad4e8020d89"
}