{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master07-08 \n\nEsta página incluye información para alumnos de máster.\nObjetivos de la asignatura\n\n[\nDescripción\n]\nTransparencias\n\n[\nNormas\n]\n[\nIntroducción\n]\n[\nOntologías\n]\n[\nLenguajes de Ontologías\n] [\nRecursos adicionales\n]\nAlgunos estudiantes me han pedido más datos sobre posibles herramientas de RDF(S). En este enlace\n se pueden encontrar algunas:\nhttp://esw.w3.org/topic/SemanticWebTools\nAlgunas que he utilizado para editar RDF(S) son: Altova SemanticWorks y TopBraid Composer.\n También me han solicitado información sobre cómo detectar si una consulta SPARQL es correcta. En la URL\nhttp://www.sparql.org/validator.html\nhay un validador de sintaxis de SPARQL\n[\nHerramientas de Ontologías\n]\nPara la clase de herramientas se recomienda que los alumnos vengan con sus portátiles (si es posible)\n En ellos deberían instalar la herramienta Protégé versión 4 (\nhttp://protege.stanford.edu/\n)\n[\nTerminología en las ontologías y otros recursos\n]\n[\nCiclos de vida\n]\nMaterial de apoyo:\nD5.3.1\ndel proyecto\nNeOn\n[\nMetodologías: Especificación y Adquisición de Conocimientos\n]\nMaterial de apoyo:\nD3.1\ndel proyecto\nSEEMP\n[\nMetodologías: Conceptualización y Reingeniería\n]\nMaterial de apoyo: Artículo sobre el proceso de conceptualización\n[1]\npresentado en el workshop FIRST07 del\nInternational Semantic Web Conference 2007\n[\nAcceso basado en ontologías a bases de datos de legado\n] No habrá práctica de esta clase, sino sólo demostraciones realizadas por el profesor.\n[\nAnotación de recursos\n]. No habrá práctica de esta clase, sino sólo demostraciones realizadas por el profesor.\n[\nOntologías y multilingualidad\n]\nPrácticas\n\nTodas las prácticas se deben entregar por correo electrónico a Oscar Corcho.\n[\nIntroducción a las prácticas\n]\nPráctica 1\n(entrega 22/10/2007). Trabajo de recopilación de fuentes de información útiles en el dominio elegido por vuestro grupo. Esto incluye documentos (en formato papel o electrónico), enciclopedias, sitios Web, bases de datos públicas y privadas, tesauros, vocabularios controlados, listas de términos, ontologías, etc. Se requiere una descripción breve de cada una de ellas y un análisis de la importancia que pueden tener en el contexto del problema elegido.\nPráctica 2\n(entrega 29/10/2007). Desarrollo de taxonomías de conceptos y relaciones entre ellos en RDF Schema, con algunos individuos de ejemplo para poder mostrar cómo éstos se representan en RDF. Se puede hacer el desarrollo de manera manual (con un editor de texto, no recomendado) o con herramientas de edición de RDF(S). Asimismo, se deberán escribir 10 consultas en SPARQL teniendo en cuenta las taxonomías y relaciones implementadas, e intentando explotar las posibilidades expresivas de este lenguaje de consultas, junto con un análisis de cómo se abordarían estas consultas en una base de datos relacional.\nPráctica 3\n(entrega 19/11/2007). Desarrollo de ontologías en OWL, basado en el desarrollo que se ha realizado con RDF Schema y los comentarios recibidos para la práctica anterior. Se debe hacer el desarrollo con herramientas de edición de OWL (herramientas recomendadas: Protégé 4 y SWOOP). Las ontologías deben contar al menos con 40 clases y 20 relaciones (ObjectProperties), y de las clases representadas al menos 10 deben ser definidas. Asimismo, la taxonomía escrita y la inferida deben ser distintas. También se deben incluir ejemplos de definiciones de clases que harían la ontología inconsistente y definiciones de instancias inconsistentes, y describir por qué. Las consultas SPARQL de la sesión previa se deben refinar teniendo en cuenta el nuevo modelo.\nPráctica 4\n(entrega 26/11/2007). Cada grupo puede hacer una de las dos propuestas siguientes:(a y b), o bien, c.\n(a) Poner en RDFS/OWL cualquier tesauro que se haya encontrado en la primera práctica, fijándose que las relaciones no siempre son iguales (subclase-de, sinónimo, etc), tal como se ha apuntado en la clase. Una herramienta que recientemente se ha anunciado es:\nhttp://www.heppnetz.de/projects/skos2gentax/\n(b) Incorporar las definiciones o contextos extraídos de diccionarios o glosarios que se han manejado e incorporar las definiciones o contextos que sean pertinentes en las ontologías que se han desarrollado, es decir, en los temas que se han trabajado\n(c) Buscar tesauros en SKOS sobre los temas que se han asignado y ver cómo se pueden integrar en ontologías\nPráctica 5\n(entrega 3/12/2007). Cada grupo de trabajo debe identificar el modelo de ciclo de vida y el ciclo de vida concreto de la ontología que va a desarrollar.\n(a) Seleccionar el conjunto de actividades necesarias para el desarrollo de la ontología usando la tabla de actividades.\n(b) Identificar el modelo de ciclo de vida a utilizar para el desarrollo de la ontología y justificar por qué se usa.\n(c) Identificar el conjunto de posibles escenarios en la construcción de la ontología.\n(d) Identificar el ciclo de vida concreto a seguir para desarrollar la ontología\n(e) Construir un diagrama Gantt para el desarrollo de la ontología.\n(f) Rellenar el cuestionario sobre la utilidad y usabilidad de las guías.\nCuestionario\nPráctica 6\n(entrega 17/12/2007). Cada grupo de trabajo debe realizar la especificación de la ontología que va a desarrollar siguiendo la guía-1 o la guía-2.\n(a) Realizar el documento de especificación de requisitos de la ontología.\n(b) Documentar en detalle cómo se han realizado todas y cada una de las tareas.\n(c) Rellenar el cuestionario sobre la utilidad y usabilidad de las guías.\nCuestionarios y guías\nPráctica7\n(entrega 8/1/2008). Cada grupo de trabajo debe realizar la conceptualización de la ontología que va a desarrollar indicando:\n(a) Comentar si es necesario la reutilización y reingeniería de otras ontologías. Justificar los criterios utilizados a la hora de seleccionar una ontología entre varias disponibles.\n(b) Clasificar en la \"pirámide de ontologías\" donde se incluyen cada una de las ontologías que se necesitan para la aplicación.\n(c) Modelo Conceptual de alto nivel de la ontología, indicando si las ontologías se obtienen de otros recursos ontológicos o de otras ontologías.\n(d) Construir el modelo Conceptual detallado de la ontología, identificando cuáles son los conceptos principales involucrados y las relaciones entre ellos.\n(e) Implementar una parte de la ontología con un editor, incluyendo propiedades en los conceptos e identificando algún axioma.\nTrabajo Final Recopilatorio\n(entrega 14/3/2008).Cada grupo realizará un trabajo final en el que unificará y resumirá las prácticas realizadas a lo largo del curso. El objetivo del trabajo es mejorar los trabajos individuales y agruparlos en un único documento. Se pide:\npresentar con un enfoque metodológico la ontología construída, justificando aspectos como: la planificación de la ontología, la especificación de requisitos, los recursos no ontológicos reutilizados para su construcción, la conceptualización obtenida y la evaluación realizada a la ontología.\nImplementar la ontología en OWL con los métodos, técnicas y herramientas presentados a lo largo del curso.\nValorar  los contenidos de la asignatura, los contenidos aprendidos y los métodos docentes empleados\nLas prácticas se presentarán oralmente el día 27 de marzo en horario de 18:00 a 21:00 en el aula 6106. Cada grupo hará una breve presentación de 10 minutos y se le harán preguntas durante otros cinco minutos.",
  "speaker": "SYSTEM",
  "uuid": "a503e7eb-55b2-4bd9-a735-b970b6439559"
}