{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 162\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n168\n217.- Directorio de revistas de Ciencia y Tecnología. Consejo Superior\nde Investigaciones Científicas (CSIC)\nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do?tabla=revi&bd=\nICYT&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología\n(IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Ciencia y tecnología.\nDescripción y comentarios: Base de datos que recoge la descripción completa de las\nrevistas científicas de ciencia y tecnología editadas en España y que son analizadas en la\nbase de datos ICYT. Temática: Agronomía, Astronomía, Astrofísica, Ciencias de la Vida,\nCiencias de la Tierra y el Espacio, Farmacología, Física, Matemáticas, Química y\nTecnologías. Volumen: 764 publicaciones periódicas editadas en España, correspondiendo\n308 a títulos vigentes y 456 a revistas que no están vigentes. \n218.- Directorio de revistas de Ciencias Sociales y Humanidades.\nConsejo Superior de Investigaciones Científicas (CSIC) \nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do?tabla=revi&bd=\nISOC&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Base de datos que recoge la descripción de las revistas cien-\ntíficas españolas de CC. Sociales y Humanidades analizadas en las bases de datos biblio-\ngráficas ISOC. Permite la recuperación de información sobre estos títulos, por diversos\ncriterios de búsqueda. Temática: Antropología, Arqueología y Prehistoria, Bellas Artes,\nBiblioteconomía y Documentación, Derecho, Economía, CC. Educación, Filosofía,\nGeografía, Historia, Lingüística, Literatura, Psicología, CC. Políticas, Sociología,\nUrbanismo, Estudios americanistas. Volumen: 2.288 publicaciones periódicas editadas en\nEspaña, de las que 1.558 son revistas vivas y 730 están ya cerradas. \nBASES DE DATOS  1/1/04  03:39  Página 168\n",
  "speaker": "SYSTEM",
  "uuid": "a555d36f-d11d-4fb6-abc7-eedd43cadcd0"
}