{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 82\nPage 82 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nFigure 35. Temporal Order of Activities \n5.3. Obtaining the Ontology Network Life Cycle  \nThe main objective of the ontology network life cycle is to determine when the activities identified \nshould be carried out and through which stages the ontology network moves during its life. \nThe ontology network life cycle is defined as the specific ordered sequence of activities that \nsoftware developers and ontology practitioners carry out during the life of the ontology network. \nThe question now is how software developers and ontology practitioners decide which \nontology network life cycle model (taken from the collection presented in Section 5.1.) is the \nmost appropriate for their ontology network and which concrete activities (taken from those \nidentified in Chapter 3) should be carried out in their ontology network life cycle.  \nOnce software developers and ontology practitioners have taken these decisions, they obtain (by \nmapping the selected ontology network life cycle model and the selected activities, and then \nplacing in order such activities) the particular life cycle for their ontology network. That is, the \nordered sequence of activities to be carried our during the life of the ontology network.  \nTo help software developers and ontology practitioners in the ontology network life cycle \nestablishment we propose the following main steps:  \n1. Identify ontology network development requirements. \nIn this step, software developers and ontology practitioners informally identify the main needs \nand expectations of the ontology network development.  \n2. Select the ontology network life cycle model (ONLCM) to be used. \nThe main question is: “which ontology network life cycle model should be chosen?”. Such \nchoice should be based on: software organization culture, previous experience of software \ndevelopers and ontology practitioners team, application area, and comprehension and volatility \nof the ontology network requirements. Furthermore, general ontology network development \n \n",
  "speaker": "SYSTEM",
  "uuid": "a55d3cdc-c0db-4468-901f-61fd4bfdb2d4"
}