{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 10\nGalicia. The Country concept has four binary relations: ‘Country is \nnation of Job Seeker’ (with the Job Seeker concept from the Job Seeker \nOntology), ‘Country is residence of Job Seeker’ (with the Job Seeker \nconcept from the Job Seeker Ontology), ‘Country is located in Continent’ \nand ‘Country has region Region’.  \n• Labour Regulatory Ontology. This ontology is based on the LE FOREM10 \nclassifications ContracTypes and WorkRuleTypes, both of them expressed in \nXML format. ContractTypes classification has ten contract types and \nWorkRuleTypes has 9 work rule types. The resultant Labour Regulatory \nOntology has 2 concepts.  For every type of work condition or contract type \nconsidered by LE FOREM, a different instance of one of these two concepts \n(Contract Type or Work Condition) is included in the ontology. An \nexample instance of the Contract Type concept is Autonomous. An \nexample instance of the Work Condition concept is Partial time. The \nWork Condition concept has 2 binary relations: ‘Work Condition is \nassociated to Objective’ (with the Objective concept from the Job Seeker \nOntology) and ‘Work Condition is associated with Job Vacancy’ (with \nthe Job Vacancy concept from the Job Offer Ontology). The Contract \nType concept has two binary relations: ‘Contract Type is associated to \nObjective’ (with the Objective concept from the Job Seeker Ontology) \nand ‘Contract Type is associated with Job Vacancy’ (with the Job \nVacancy concept from the Job Offer Ontology).  \n• Language Ontology. This ontology is based on the ISO 639211 and the Common \nEuropean Framework of Reference (CEF)12. The ISO 6392 is expressed in \nHTML format and CEF is a description in PDF format. The ISO 6392 has 490 \nlanguage codes and CEF has 6 language levels. The resultant Language Ontology \nhas \n3 \nconcepts: \nLanguage, \nLanguage \nLevel \nand \nLanguage \nProficiency. For every language element specified in the ISO 6392 a \ndifferent instance of the Language concept is defined, so the Language \nconcept has 490 instances. For every language level element specified in the CEF \na different instance of the Language Level concept is defined, so the \nLanguage Level concept has 6 instances. An example instance of the \nLanguage concept is eng – English. An example instance of the \nLanguage Level concept is A2 – Basic User. The Language concept \nhas three relations: ‘Language is mother tongue of Job Seeker’ (with the \nJob Seeker concept from the Job Seeker Ontology), ‘Language is spoken by \nJob Seeker’ (with the Job Seeker concept from the Job Seeker Ontology) \nand ‘Language is evaluated by Language Proficiency’ (with the \nLanguage Proficiency concept from the Language Ontology).  \n• Skill Ontology. This ontology models knowledge of Skills and abilities. It is based \non European Dynamics Skill classification. This classification has 291 skills and \n                                                           \n10 LE FOREM is an user partner of the SEEMP project, http://www.leforem.be/ \n11 http://www.iso.org/iso/en/prods-services/popstds/languagecodes.html \n12 http://www.cambridgeesol.org/exams/cef.htm \n",
  "speaker": "SYSTEM",
  "uuid": "a5f0a991-2db3-458f-b9e4-03aaf61a40f2"
}