{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 1\n1. Ontology and the Lexicon\nGraeme Hirst\nDepartment of Computer Science, University of Toronto,\nToronto M5S 3G4, Ontario, Canada\ne-mail: gh@cs.toronto.edu\n1.1 Lexicons and lexical knowledge\n1.1.1 Lexicons\nA lexicon is a list of words in a language—a vocabulary—along with some knowl-\nedge of how each word is used. A lexicon may be general or domain-speciﬁc; we\nmight have, for example, a lexicon of several thousand common words of English\nor German, or a lexicon of the technical terms of dentistry in some language. The\nwords that are of interest are usually open-class or content words, such as nouns,\nverbs, and adjectives, rather than closed-class or grammatical function words,\nsuch as articles, pronouns, and prepositions, whose behaviour is more tightly bound\nto the grammar of the language. A lexicon may also include multi-word expressions\nsuch as ﬁxed phrases (by and large), phrasal verbs (tear apart), and other common\nexpressions (merry Christmas!; teach\nhsomeonei’s grandmother to suck eggs; Elvis\nhas left the building).\nEach word or phrase in a lexicon is described in a lexical entry; exactly what is\nincluded in each entry depends on the purpose of the particular lexicon. The details\nthat are given (to be discussed further in sections 1.2.1 and 1.3.2 below) may include\nany of its properties of spelling or sound, grammatical behaviour, meaning, or use,\nand the nature of its relationships with other words. A lexical entry is therefore\na potentially large record specifying many aspects of the linguistic behaviour and\nmeaning of a word.\nHence a lexicon can be viewed as an index that maps from the written form of\na word to information about that word. This is not a one-to-one correspondence,\nhowever. Words that occur in more than one syntactic category will usually have\na separate entry for each category; for example, ﬂap would have one entry as a\nnoun and another as a verb. Separate entries are usually also appropriate for each\nof the senses of a homonym—a word that has more than one unrelated sense even\nwithin a single syntactic category; for example, the noun pen would have distinct\nentries for the senses writing instrument, animal enclosure, and swan. Polysemy—\nrelated or overlapping senses—is a more-complex situation; sometimes the senses\nmay be discrete enough that we can treat them as distinct: for example, window as\nboth opening in wall and glass pane in opening in wall (fall through the window;\nbreak the window). But this is not always so; the word open, for example, has many\noverlapping senses concerning unfolding, expanding, revealing, moving to an open\nposition, making openings in, and so on, and separating them into discrete senses, as\n",
  "speaker": "SYSTEM",
  "uuid": "a602721f-ad1b-432b-840f-fb0f35727725"
}