{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/GeoBuddies \n\n3.1   Personal en formación  (x doctores, z másters, w ingenieros)\nSe están dirigiendo X tesis doctorales:\n•\tD. Hector Andrés García Silva (UPM), becario FPI (BES-2008-007622) desde el 1 de octubre de 2008, siendo la temática de la tesis Asociación Semántica de Etiquetas y Evolución de Ontologías, y los codirectores: Dña A. Gómez-Pérez y D. Oscar Corcho García\n•\tD. Victor Saquicela Galarza(Contratado temporal, UPM) desde el 1 de mayo de 2008, siendo la temática de la tesis la integración de información, basada en ontologías, de fuentes de datos heterogéneas y desconocidas a priori, y el Director de la tesis D. Oscar Corcho García\n•\tD. Luis Manuel Vilches Blázquez (UPM), becario OTT desde el 1 de enero de 2008, siendo la temática de la tesis la generación de una metodología de integración de información, basada en ontologías, de fuentes de datos geográficas, y los codirectores: D. Oscar Corcho García y D. Miguel Angel Bernabé Poveda.\n•\tD. Antonio Pareja Lora (Profesor Colaborador, UCM) desde el de septiembre de 2001, siendo la temática de la tesis anotación semántica, y las codirectoras de la misma Dª. Guadalupe Aguado de Cea y Dª. Asunción Gómez Pérez.\nSe están dirigiendo X tesis de maestría:\n•\tXxxxx\nSe han dirigido X proyectos fin de carrera:\n•\tDña. María Poveda Villalón (UPM) ha defendido su PFC titulado “Red de Ontologías para el Camino de Santiago”, siendo su directora Dña. María del Carmen Suárez de Figueroa Baonza.\n•\tXxxxx\n3.2   Estancias de investigación relacionadas con el proyecto ( X meses):\n•\tHector Andrés García (UPM) ha visitado el grupo IAM (Intelligence, Agents and Multimedia) de la Universidad de Southampton en el Reino Unido, desde el 02 de Marzo al 30 de Mayo de 2009 para trabajar con el Dr. Harith Alani en la desambiguación de etiquetas utilizando DBpedia como recurso semántico. Estancia financiada por el programa Formación de Personal Investigador FPI del ministerio de ciencia e innovación.\n•\tDña. Elena Montiel Ponsoda (UPM) ha visitado el DFKI en Alemania, desde el 18 de octubre de 2008 al 11 de febrero de 2009 para trabajar con el Dr.Paul Buitelaar y el investigador Thierry Declerck en modelos para la representación de información multilingüe en ontologías, y en patrones multilingües para la reutilización de patrones de diseño ontológico. Adicionalmente, la doctoranda ha realizado una estancia en el Natural Language Processing Group de la Universidad de Sheffield en Reino Unido del 26 de julio al 15 de agosto de 2009 para trabajar con la Dra. Diana Maynar en la implementación de patrones multilingües en la arquitectura GATE. Ambas estancias financiadas por el programa propio de la Universidad Politécnica de Madrid (Tarea X).\n•\tAsunción Gómez Pérez (UPM) ha visitado el Knowledge Media Institute de la Open University en el Reino Unido, desde el 17 de Julio al 17 de Agosto de 2009 para trabajar en el equipo del Prof. Dr. Enrico Motta, entre otros aspectos, en algoritmos de descubrimiento de relaciones entre folksonomias y ontologías (Tarea X)\n•\tCatherine Roussey (LIRIS, Francia) ha visitado la Universidad Politécnica de Madrid, desde el 1 de octubre de 2008 hasta el 30 de junio de 2009, para trabajar en el área de depuración de ontologías en el dominio de la hidrografía (Tarea X)\n•\nAlguna otra estancia???\n3.3 Diseminación\nUn resumen de las actividades de diseminación realizadas en este proyecto son las siguientes: x artículos en revistas internacionales, x en confernecias internacionales, x en workshops, x posters en conferencias internacionales, x en confernecias nacionales, x en workshops nacionales, x capítulos de libros, y x tesis doctorales en progreso. One of these posters was awarded as Best Poster in the WWW2006 international conference.\nSe han mantenido dos reuniones de seguimiento con el Instituto Geográfico Nacional, el cual participa activamente en el proyecto mediante el asesoramiento y aporte de diversos servicios web, conformes con Open Geospatial Consortium (OGC), y recursos de información geo-espacial (por ejemplo: la base de datos perteneciente a la Base Topográfica Numérica a escala 1:25.000, denominada BTN25).\nSe ha asistido al  FLaReNet (Fostering Language Resources Network) Launching Event, celebrado en Viena (12-13 de febrero de 2009), con el fin de determinar posibles cauces alternativos de diseminación y cooperación con otros grupos de investigación europeos en: (i) la generación y mantenimiento de los recursos (computacionales) lingüísticos generados durante el proyecto y (ii) la compartición o reutilización de aquellos que no se poseen y son necesarios para la culminación del mismo.\nLa lista de contactos de relevancia establecidos y presentaciones realizadas durante el año 2008 y 2009 es la siguiente:\n-\tUniversidad de Liverpool. Charla invitada. Enero 2008. (UPM)\n-\tUniversidad de Manchester. Charla invitada. Enero 2008. (UPM)\n-\tJornadas Web3.0: semantically powered, organizada por Robotiker Tecnalia. Abril 2008. (USC).\n-\tCurso de Ontologías y Web semántica en el Máster de Tecnologías de la Información, Investigación en IA y en el Máster Erasmus Mundus en Computational Logic. Facultad de Informática. UPM. Curso 2008/2009 y 2009/2010.\n-       Workshop \"Putting Mobile Services into Context\" del ICT-Mobile Summit 2009. Santander. Junio 2009.\n-       Reunión en el castillo de Dagstuhl sobre el futuro de la Web Semántica. Dagstuhl, Alemania. Junio 2009.\nSe han realizado demostraciones del prototipo a las siguientes Instituciones:\n1.\tUniversidades y centros de investigación: Open University (UK), Universidad de Southampton (UK), Stanford University (USA), Rensselaer Polytechnic Institute (USA), EURECOM (FR), Amit??  USC—Manuel\n2.\tEmpresas de desarrollo de software: Intelligent Software Components, Instituto Geográfico Nacional, LikeCube Ltd. (Reino Unido) y Parquesoft (Colombia). USC—Manuel\n3.      Empresas de telefonía: Telefónica I+D, Vodafone\n4.\tAgentes de turismo: USC—Manuel\nEl proyecto ha dado lugar a colaboraciones con grupos de investigación y empresas internacionales, con los que se han mantenido contactos y reuniones de trabajo:\n-\tGrupo Information Management Group de la Universidad de Manchester, con el que la UPM mantuvo una reunión en los primeros meses del proyecto para determinar si era posible extender la expresividad de los lenguajes de consulta basados en lógica descriptiva para el manejo de información heterogénea procedentes de varias fuentes de datos.\n-\tEmpresa Ordnance Survey, del Reino Unido, con la que la UPM mantuvo una reunión para mostrar resultados del proyecto en términos de ontologías desarrolladas, y para obtener también algunas de las ontologías desarrolladas por la empresa en el dominio geográfico.\nLos resultados de estas reuniones y trabajo realizado en ellas fueron mostrados en varias charlas invitadas, como se ha especificado en las secciones anteriores.\nSe han realizado diseminación para el público en general:\n1.\tEn Youtube\nhttp://www.youtube.com/watch?v=dsLNP2alb-U\n2.\tEn radio, entrevista en la COPE en \"La Gran Manzana Ciencia\" para explicar la aplicación para \nmóviles destinada a los peregrinos del Camino de Santiago (\nhttp://www.fi.upm.es/?id=tablon&acciongt=consulta1&idet=254\n)\n3.\tEn el Web site de la Facultad de Informática\nhttp://www.fi.upm.es/?id=tablon&acciongt=consulta1&idet=199\n. Esta nota de prensa ha originado publicaciones en otras webs\no\tACM Tech News 06.05.2009\no\tIllinois Informatics Institute 07.05.2009\no\tThe Web Scene 08.05.2009\no\tTwine 06.05.2009\no\tAlpha Galileo 05.05.2009 (english)\no\tAlpha Galileo 05.05.2009\no\tSINC 05.05.2009\no\tPlica Zaragozame 04.05.2009\no\tUPM Noticias 05.05.2009\no\tEl Camino Digital 09.09.2009\no\tCreer en lo nuestro 20.05.2009\n4. En la web del proyecto europeo NeOn (historia sobre Geobuddies --> MC: se deberia incluir????) url:\nhttp://www.neon-project.org/web-content/index.php?option=com_content&view=article&id=136:applying-the-neon-methodology-to-build-ontology-networks-for-the-way-of-saint-james-\n3.4   Technology transfer",
  "speaker": "SYSTEM",
  "uuid": "a680e518-d894-48d4-9ee1-77c92cc9ec12"
}