{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 7\n1. Ontology and the Lexicon\n7\nSometimes names such as is-a and a-kind-of are used for hyponymy and subsump-\ntion for hypernymy; because these names are also used for ontological categories,\nwe avoid using them here for lexical relationships. The inclusion relationship be-\ntween verbs is sometimes known as troponymy, emphasizing the point that verb\ninclusion tends to be a matter of “manner”; to murmur is to talk in a certain manner\n(Fellbaum 2002). Inclusion relationships are transitive, and thus form a semantic\nhierarchy, or multiple hierarchies, among word senses; words without hyponyms\nare leaves and words without hypernyms are roots. (The structures are more usually\nnetworks than trees, but we shall use the word hierarchy to emphasize the inheri-\ntance aspect of the structures.)\nThe part–whole relationships meronymy and holonymy also form hierarchies.\nAlthough they may be glossed roughly as has-part and part-of, we again avoid these\nontologically biased terms. The notion of part–whole is overloaded; for example,\nthe relationship between wheel and bicycle is not the same as that of professor and\nfaculty or tree and forest; the ﬁrst relationship is that of functional component, the\nsecond is group membership, and the third is element of a collection. For analysis\nof part–whole relationships, see Cruse (1986), Iris, Litowitz, and Evens (1988), or\nPribbenow (2002).\nWords that are opposites, generally speaking, share most elements of their mean-\ning, except for being positioned at the two extremes of one particular dimension.\nThus hot and cold are opposites—antonyms, in fact—but telephone and Abelian\ngroup are not, even though they have no properties in common (that is, they are\n“opposite” in every feature or dimension). Cruse (1986) distinguishes several dif-\nferent lexical relations of oppositeness, including antonymy of gradable adjectives,\ncomplementarity of mutually exclusive alternatives (alive–dead), and directional\nopposites (forwards–backwards).\nThese “classical” lexical relationships are the ones that are included in the Word-\nNet lexicon. Synonymy is represented, as mentioned earlier, by means of synsets: if\ntwo words have identical senses, they are members of the same synset. Synsets are\nthen connected to one another by pointers representing inclusion, part–whole, and\nopposite relations, thereby creating hierarchies.\nIn addition to the “classical” lexical relationships, there are many others, which\nmay be broadly thought of as associative or typicality relations. For example, the\nrelationship between dog and bark is that the former is a frequent and typical agent\nof the latter. Other examples of this kind of relationship include typical instrumen-\ntality (nail–hammer), cause (leak–drip), and location (doctor–hospital).\nSynonymy, inclusion, and associative relations are often the basis of the struc-\nture of a thesaurus. While general-purpose thesauri, such as Roget’s, leave the re-\nlationships implicit, others, especially those used in the classiﬁcation of technical\ndocuments, will make them explicit with labels such as equivalent term, broader\nterm, narrower term, and related term.\n",
  "speaker": "SYSTEM",
  "uuid": "a6b3e836-28f5-44db-bb0a-3070c5807336"
}