{
  "message": "SYSTEM: CV_abreviado_FreddyPriyatna_Marzo2016.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \n \nde Medeiros, L. F., Priyatna, F., & Corcho, O. (2015). MIRROR: Automatic R2RML \nMapping Generation from Relational Databases. In Engineering the Web in the Big \nData Era (pp. 326-343). Springer International Publishing. \n \n \nFreddy Priyatna, Raul Alonso-Calvo, Sergio Paraiso, Gueton Padron-Sanchez and \nOscar Corcho. R2RML-based access and querying to relational clinical data with \nmorph-RDB. Semantic Web Applications and Tools for Life Sciences (SWAT 2015). \n \n \nMihindukulasooriya, N., Priyatna, F., Corcho, O., García-Castro, R., & Esteban-\nGutiérrez, M. (2014). morph-LDP: An R2RML-Based Linked Data Platform \nImplementation. In The Semantic Web: ESWC 2014 Satellite Events (pp. 418-423). \nSpringer International Publishing. \n \n \nFreddy Priyatna, Carlos Buil Aranda, Oscar Corcho. Applying SPARQL-DQP for \nFederated SPARQL Querying over Google Fusion Tables. Extended Semantic Web \nConference (ESWC2013) Demo Session. Montpellier, France. May, 2013 \n \n \nJuan F. Sequeda, Freddy Priyatna and Boris Villazon-Terrazas: Relational Database \nto RDF Mapping Patterns. Workshop of Ontology Patterns (WOP2012). Boston, USA. \nNovember, 2012 \n \n \nBoris Villazon-Terrazas and Freddy Priyatna: Building Ontologies by using Re-\nengineering Patterns and R2RML Mappings. Workshop of Ontology Patterns \n(WOP2012). Boston, USA. November, 2012 \n \n \nCorcho. O, Calbimonte. JP, Garcia-Castro. R, and Priyatna. F. Linked Sensor Data \n101. Future Internet Symposium 2011, Viena, Austria. \n \n \nde León. Alexander, Saquicela. Victor, Vilches. Luis M, Villazón-Terrazas. B, and \nPriyatna. F, and Corcho. Oscar. Geographical linked data: a Spanish use case. \nInternational Conference on Semantics System 2010, Graz, Austria. \n \nC.2. Proyectos \n \nTítulo del proyecto: NeOn - Lifecycle Support for Networked Ontologies (FP6-\n027595). Entidad financiadora: Unión Europea. Duración, desde: 01-03-2006 hasta: \n28-02-2010. Investigador responsable: Enrico Motta. Participación: Investigador. \n \nTítulo del proyecto: España Virtual (CENIT2008-1030). Entidad financiadora: \nMinisterio de Industria, Turismo y Comercio. Programa CENIT. Entidades \nparticipantes:  Deimos Space S.L., Androme Iberica, S.L., Centro Nacional de \nInformación \nGeográfica, \nDnextep \nConsulting, \nS.L., \nGrid \nSystems, \nS.A., \nGeoSpatiumLab, S.L., GeoVirtual, S.L., Indra Espacio, S.A., Universidad Politécnica \nde Madrid, Universidad Carlos III de Madrid, Universidad de Málaga, Barcelona \nMedia, Animante Baleares, Universidad de Zaragoza, Universidad de Valladolid, \nUniversidad Jaume I, Solucions on Hand, ELIMCO Sistemas, SIGRID, IVER, UNED, \nUniversidad Politécnica de Catalunya, Universitat de les Illes Balears, Bot Consulting. \nDuración,  desde: 01/09/2008 \n \nhasta:   \nCuantiía de la subvención: \n25.192.648,00 ? (total),  1.010.504,00? (UPM). Investigador responsable: Carlos \nFernández de la Peña (proyecto), Asunción Gómez Pérez (UPM). Número de \ninvestigadores participantes: +10. Participación: investigador. \n \nTítulo del proyecto: PlanetData (FP7-257641). Entidad financiadora: Unión Europea. \nEntidades participantes: University of Innsbruck, Stichting Centrum voor Wiskunde en \nInformatica, Ecole Polytechnique Federale de Lausanne, Foundation for Research \nand Technology‐Hellas, Freie Universitat Berlin, Jozef Stefan Institute, Karlsruhe \nInstitute of Technology, Semantic Technology Institute International, Universidad \nPolitecnica de Madrid. Duración,  desde: 01/10/2010 \nhasta: 30/09/2013. Cuantía \n         v    ó :  3.001.662 € (t t  ), 180.212€ (UPM). Fechas de trabajo en \nproyecto: 01/10/2010 – 30/09/2013 . Investigador responsable: Dieter Fensel \n(proyecto), Oscar Corcho (UPM). Número de investigadores participantes: 40. \nParticipación: investigador. \n",
  "speaker": "SYSTEM",
  "uuid": "a71725bf-71cc-4392-be48-1dfb29cebd55"
}