{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Art%C3%ADculos_relacionados_con_el_data_provenance \n\nAutores :\nSylvia Wong, Simon Miles, Weijian Fang, Paul Groth y Luc Moreau\nFecha :\n???, Universidad de Southampton, Reino Unido.\nPresentación en la que se describe un sistema para validar experimentos con ayuda del provenance y ontologías. Muy útil cuando queremos verificar si un experimento se ha ejecutado correctamente con un criterio dado, (que no tiene porqué saberse cuando el propio experimento se diseñó o ejecutó).\nCuando se diseña un experimento, tenemos que distinguir todos los servicios que se usan y, para cada servicio, realizar una descripción del mismo que contenga lo que hace el servicio, sus entradas de datos y sus salidas de datos. Cada descripción se guardará en un registro.\nUna vez se ponga en marcha el experimento, se guardarán sus detalles en el provenance, y cada servicio documentará su propia ejecución.\nSi ahora quisiéramos reconstruir el experimento para saber, por ejemplo, si las salidas de un determinado proceso son compatibles con las entradas de otro, en primer lugar extraeríamos del provenance el par de procesos implicados, y miraríamos en el registro sus descripciones.\nEl problema es que normalmente las entradas de un proceso suelen ser la generalización de las salidas de otro, por lo que aquí es donde entra en juego la ontología: si describimos la relación de los tipos de las salidas, podremos razonar posteriormente si ambos son compatibles.\nProvenance and Interoperability (presentación)\n\nAutores :\nSimon Miles\nFecha :\n???, King's College, London\nPresentación donde se describe brevemente el porqué del provenance, los estándares que se intentan seguir a la hora de construir uno, y algunas de las herramientas que podemos utilizar para manejarlo en la actualidad.\nComienza enumerando las preguntas a las que debe ser capaz de responder el provenance, (¿Qué entradas se han usado para obtener la salida de este proceso?, ¿Cómo he llegado a este resultado?, etc.), y distinguiéndo qué entendemos exactamente por provenance,(todo aquello que ha causado que una entidad esté en el estado que está actualmente).También resalta la importancia de que muchas veces no estamos buscando todo un grafo, sino tan sólo una parte relevante del mismo.\nEn segundo lugar, se efectúa una breve descripción del OPM, del que ya he hablado en el primer artículo; y termina describiendo algunas de las herramientas en las que se usa, como Tupelo o Taverna.\nSemantic e-Science",
  "speaker": "SYSTEM",
  "uuid": "a759adb9-3edf-4439-a9f0-148ecf8e576b"
}