{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 85\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 85 of 124\nTable 5.1: Pattern for Re-engineering a term-based thesaurus which follows the\nrecord-based model(continued)\nSlot\nValue\nExample\n1. Create the learning class and the personal development class.\n2. Create the competence class and assert that competence is subClassOf\nlearning.\n3. Create the performance class and assert that performance is subClassOf\ndevelopment.\n4. Create the achievement class and assert that achievement is equivalentClass\nof performance.\n5. Assert that competence is relatedClass of performance.\n6. Create the learning class and assert that learning is equivalentClass of\ncompetence.\n6.1. Create the efficiency class and assert that efficiency is subClassOf\nperformance.t’\n6.2. Create the failure class and assert that failure is subClassOf\nperformance.\n6.3. Create the success class and assert that success is subClassOf\nperformance.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\nPR-NOR-TSLO-02.\nPattern for re-engineering a term-based thesaurus which follows the relation-\nbased data model\nThe pattern for re-engineering thesaurus shown in Table 5.2 suggests a guide to transform a thesaurus into a\nlightweight ontology. The thesaurus is a term-based one and it is modeled with a relation- based data model.\nThis pattern aims at creating a lightweight ontology from the thesaurus, being the semantics of the BT/NT\nrelations between terms the subClassOf relationship.\nTable 5.2: Pattern for Re-engineering a term-based thesaurus which follows the\nrelation-based model\nSlot\nValue\nGeneral Information\nName\nTerm-based Thesaurus to Lightweight Ontology (record-based model)\nIdentiﬁer\nPR-NOR-TSLO-02\nType of Component\nPattern for Re-engineering Non-Ontological Resources (PR-NOR)\nUse Case\nGeneral\nRe-engineering a term-based thesaurus which follows the relation-based model to design a\nLightweight Ontology.\nExample\nSuppose that someone wants to build a lightweight ontology based on earlier version of the\nAGROVOC Thesaurus, which is a term-based thesaurus and it follows the relation-based\nmodel.\nPattern for Re-engineering Non-Ontological Resources\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a term-based thesaurus which follows the relation-based\nmodel.\nA thesaurus represents the knowledge of a domain with a collection of terms and a limited\nset of relations between them.\nThe relation-based data model [Soe95] is a normalized structure, in which relationship\ntypes are not deﬁned as ﬁelds in a record, but they are simply data values in a relationship\nrecord, thus new relationship types can be introduced with ease.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "a78d553d-d3bb-44f0-a3bb-e52db3938759"
}