{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 6\noperations. These improvements can be summarised as: (i) we only support\nwindows deﬁned in time, (ii) the result of a window operation is a window of\ntriples, not a stream, over which traditional operators can be applied, as such we\nhave added window-to-stream operators, and (iii) we have adopted the sparql\n1.1 deﬁnition for aggregates. We also present S2O for the deﬁnition of stream-\nto-ontology mappings.\n4.1\nSPARQLStream\nJust as in c-sparql we deﬁne an rdf stream as a sequence of pairs (Ti, τi)\nwhere Ti is an rdf triple ⟨si, pi, oi⟩and τi is a timestamp which comes from a\nmonotonically non-decreasing sequence. An rdf stream is identiﬁed by an iri,\nwhich provides the location of the data source6.\nWindow deﬁnitions are of the form ‘FROM Start TO End [STEP] [Literal]’,\nwhere the Start and End are of the form NOW or NOW – Literal, and Literal\nrepresents some number of time unit (DAYS, HOURS, MINUTES, or SECONDS)7.\nThe optional STEP indicates the gap between each successive window evaluation.\nNote, if the size of the step is smaller than the range of the window, then the\nwindows will overlap, if it coincides with the size of the window then every triple\nwill appear in one and only one window, and if the step is larger than the range\nthen the windows sample the stream. Also note that the deﬁnition of a window\ncan be completely in the past. This is useful for correlating current values on a\nstream with values that have previously occurred.\nThe result of applying a window over a stream is a timestamped bag of triples\nover which conjunctions between triple patterns, and other “classical” operators\ncan be evaluated. Windows can be converted back into a stream of triples by\napplying one of the window-to-stream operators in the SELECT clause: ISTREAM\nfor returning all newly inserted answers since the last window, DSTREAM for\nreturning all deleted answers since the last window, and RSTREAM for returning\nall answers in the window.\nListing 1 shows a complete sparqlStream query which, every minute, returns\nthe average of the last 10 minutes of wind speed measurements for each sensor,\nif it is higher than the average speed from 2 to 3 hours ago.\nNote, sparqlStream only supports time-based windows. c-sparql also has\nthe notion of a triple-based window. However, such windows are problematic\nsince the number of triples required to generate an answer may be greater than\nthe size of the triple window. For example, consider a window size of 1 triple and\nthe graph pattern from the example query in Listing 1. Only one of the triples\nthat form the graph pattern would be kept by the window, and hence it would\nnot be possible to compute the query answer.\n6 Note in our work the iri’s identify virtual rdf streams since they are derived from\nthe streaming data sources.\n7 Note that the parser will also accept the non-plural form of the time units and is\nnot case sensitive.\n6\n",
  "speaker": "SYSTEM",
  "uuid": "a823caaa-66a0-4516-a110-7cd069b41ab2"
}