{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 47\n45\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nis a difference between speaker recognition (recognizing who is speaking) and speaker diarisation (recogniz‐\ning when the same speaker is speaking).\nApplications for Speaker ID\nMajor breakthroughs in the development of voice authentication have taken place in the last decade, and\nthe market potential for this technology is evolving rapidly. Due to the unique characteristics of the human\nvoice, voice authentication is being used to verify the identity of individuals for the purposes of public safe‐\nty and national security or to ensure the confidentiality of sensitive data or information. The United Kingdom\ngovernment’s Supervision and Surveillance Programme uses voice authentication to identify and control cur‐\nfew orders of youth parolees. Compared to other biometrics voice authentication is easier and more cost\neffective to deploy – since it works from any telephone – and can handle a range of applications from facil‐\nities access to the protection of sensitive data. \nOn average it takes less than two minutes to create a ‘voiceprint’ based on specific text such as ‘Name’ and\n‘Account Number’. This is then stored against the individual’s record, so when they next call, they can sim‐\nply say their name and if the voiceprint matches what they have stored, then the person is put straight\nthrough to a customer service representative. This takes less than 30 seconds and also bypasses the need for\nthe individual to have to run through a series of tedious ID checks such as passwords, address details.\nGlobal enterprises can use voice authentication to allow customers to conduct secure financial and con‐\nsumer transactions over the telephone without needing to speak to an agent. Moreover, the identity of\nemployees can be verified before they are granted network access. Voice authentication also adds a new\nlevel of security to pass‐code controlled systems, or to entirely eliminate pass‐codes (passwords and\nPersonal Identification Numbers – PINs). Traditional pass‐code oriented schemes have two major flaws: peo‐\nple continually forget their pass‐codes and pass‐codes can be guessed or stolen. Both these flaws represent\nMarket\nApplication\nDrivers\nFinancial Services\nAccess to Banking, Brokerage, 401K\nReduce Financial Risk\nTelecom\nCalling Card\nReduce Fraud\nCellular Roaming\nProtect Personal Information\nUnified Messaging\nCompetitive Advantage\nAuto Attendant\nRetail\nOrder Entry\nReduce Fraud\nPersonalized Service\nIncrease Revenue (1:1Marketing)\nEnterprise and IT\nAccess to Intranet, Extranet and Corporate\nApplications\nIncrease Security\nPIN Reset\nReduce Cost\nTravel\nFrequent Customer Services\nConvenience\nPersonalization\nInternet\nAuthenticate Users for\nReduce Financial Risk\nInternet Banking and e‐Commerce\nHealth: \nHMOs, \nHospitals,\nInsurance\nAccess to Patient Information\nProtect Personal Privacy\nAuthorize Drug Prescription\nMeet US HIPAA (Health Insurance Portability and\nAccountability Act of 1996)\nAuthorize Insurance Payment\nReduce Fraud\nGovernment/Military\nAccess to Sensitive Information\nIncrease Security\nParolee Tracking\nReduce Cost\n",
  "speaker": "SYSTEM",
  "uuid": "a87c3ba0-86e4-4dc5-96b8-007268a08838"
}