{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 28\n \n \nPág. 30 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nMotivo: \nEl español es una lengua transnacional con cerca de 470 millones de hablantes, lo que \nrepresenta un gran mercado. Además, nueve de cada diez usuarios de la tecnología potenciada \npor este Plan se encuentran fuera de nuestras fronteras. Esto representa una gran oportunidad \nde ampliar el área de internacionalización, así como una oportunidad de ampliar la cooperación \ninstitucional y económica con los países de Iberoamérica.  \nObjetivos: \nLos objetivos principales de esta línea de actuación son los siguientes: \n \nMejorar la internacionalización de las empresas del sector, especialmente en el mercado \niberoamericano y norteamericano. \n \nHacer uso de las herramientas proporcionadas por el Plan de Internacionalización de la \nAgenda Digital para España, que contiene un programa de financiación directa a las \nempresas para actividades de internacionalización (ICEX, AECID, etc.). \n \nApoyar el papel tractor de las grandes empresas españolas asentadas en el mercado \niberoamericano y otros mercados emergentes. \n \nMejorar la cooperación con la comunidad iberoamericana para liderar la implantación de \nlas tecnologías de procesamiento de lenguaje natural y traducción automática en \nespañol. Apoyo y participación institucional de los distintos países iberoamericanos en el \nproyecto. Trabajar conjuntamente en la creación de recursos y datos abiertos de interés \nlingüístico. \n \nMedidas: \n- Medida 1: Elaborar un plan de internacionalización. \n- Medida 2: Cooperación con Iberoamérica (Cumbre Iberoamericana, IODC 2016 Madrid, \n…). Colaboración con la Secretaría General Iberoamericana (SEGIB) y otras instituciones \niberoamericanas.  \n- Medida 3: Coordinación con los programas de la AECID y utilización de la Red de \nConsejeros Científicos en el Exterior y de las asociaciones ya creadas de científicos \nespañoles en el exterior. \n- Medida 4: Posibilidad de integrar el procesamiento de lenguaje natural y traducción \nautomática dentro de los ámbitos que se financian actualmente en el marco de la Acción \nEstratégica de Economía y Sociedad Digital. \n- Medida 5: El sector TIC es uno de los prioritarios en Invest in Spain para ampliar la \ninversión extranjera en España. Se debe incluir el procesamiento de lenguaje natural y la \n",
  "speaker": "SYSTEM",
  "uuid": "a986c4af-3173-4731-ad79-ce1070b9e5c9"
}