{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Barcelonajan2011 \n\nData engineer for the Yahoo! Research Lab in Barcelona - BM0015\nThe Yahoo! Labs within Barcelona Media has an opening for a data-engineer position in Barcelona, Spain.\nYahoo! Labs is pioneering the new sciences underlying the web. As the center of scientific excellence for Yahoo!, Yahoo! Labs delivers both fundamental and applied scientific leadership through published research and new technologies powering the company's products.\nEngineers at Yahoo! Labs work alongside our world-class scientists to deliver the next generation of businesses to the company. Engineers at Yahoo! Labs have the opportunity to work on a variety of project types, including: rapid prototype and proof-of-concept development, research engineering libraries, tools, and platforms for distributed computing and algorithm evaluation, as well as working as part of a team directly with Yahoo! scientists.\nIn this position you will be working together with our scientists to develop novel algorithms for processing and mining extremely large amounts of data coming from user action logs and social networks.\nRequired skills/qualifications:\n* Bachelor degree in Computer Science, with 2+ years of practical experience (Master degree is a plus);\n   * Proficiency in both written and spoken English;\n   * Fast learner with strong problem-solving and analytical skills;\n   * Proven ability to develop software solutions for complex design/implementation problems;\n   * Familiarity with concepts of data mining and machine learning;\n   * Experience in working with large document corpora, large time-series data, and/or large graphs, a plus;\n   * Experience in the development of Web applications, a plus;\n   * Experience in distributed processing of large data sets (Hadoop/Pig a plus);\n   * Proficiency in at least one of Python, Perl, C/C++, Java;\n   * Experience with UNIX systems;\nGeneral information on positions at Barcelona Media Innovation Centre in partnership with Yahoo! Labs is available here.\nhttp://comunicacio.barcelonamedia.org/Ofertes/web\nTo apply for this position please send your CV to rrhh@barcelonamedia.org indicating the position's code.\nReference: BM0015",
  "speaker": "SYSTEM",
  "uuid": "ab26d164-1e05-4a9b-884b-5f2448da0c4d"
}