{
  "message": "SYSTEM: Wiki: Formado por: Luis M. Vilches, Víctor Saquicela, Óscar Corcho, María Poveda, José Ángel Ramos\nContents\n[\nhide\n]\n1\nProyectos de tesis\n2\nProyectos en ejecución o antiguos\n3\nRecursos\n4\nBibliografía\n5\nProyectos fin de carrera propuestos para este área\nProyectos de tesis\n\nViclhes: incluye un párrafo del tuyo\nSaquicela: incluye un párrafo del tuyo\nJARG (pensando si incluirla porque sólo es el dominio)\nProyectos en ejecución o antiguos\n\nGeoBuddies\nEspañaVirtual\nRecursos\n\nFAO's geopolitical ontology\n[1]\n- versión OWL:\n[2]\nBibliografía\n\nAlonso G, Abbadi AE (1994) “Cooperative modelling in applied geographic research”. International Journal of Intelligent and Cooperative Information Systems, 3(1): 83-102\nBishr Y (1998) “Overcoming the semantic and other barriers to GIS interoperability”. International Journal of Geographical Information Science, 12(4): 299–314.\nInternational Standard Organization (ISO) (2003) ISO 19112:2003 “Geographic Information – Spatial referencing by geographic identifiers”.\nFonseca FT, Egenhofer MJ, Davis CA, Câmara G (2002) “Semantic Granularity in Ontology-Driven Geographic Information Systems”. Annals of Mathematics and Artificial Intelligence. Volume: 36, 2002. Issue: 1-2, p. 121 – 151.\nGreenwood J, Hart G (2003) “Sharing Feature Based Geographic Information – A Data Model Perspective”. 7th Int. Conference on GeoComputation. United Kingdom.\nHakimpour F (2003) “Using Ontologies to Resolve Semantic Heterogeneity for Integrating Spatial Database Schemata”. Ph.D. thesis, Zurich University. Switzerland, 2003.\nHakimpour F, Timpf S (2001) “Using Ontologies for Resolution of Semantic Heterogeneity in GIS”. 4th. AGILE Conference on Geographic Information Science, Brno, Czech Republic, 2001.\nISO 19110 (2005) “Geographic Information” – Methodology for feature cataloguing.\nISO 19112 (2003) “Geographic Information” – Spatial referencing by geographic identifiers.\nLopez-Pellicer F, Vilches-Blázquez LM, Nogueras-Iso J, Corcho O, Bernabé MA, Rodríguez AF (2007) Using a hybrid approach for the development of an ontology in the hydrographical domain. In: Proceedings of 2nd Workshop of COST Action C21 -Towntology Ontologies for urban development: conceptual models for practitioners.\nNomenclátor Geográfico Conciso de España, versión 1.0. “Presentación y Especificaciones”. Instituto Geográfico Nacional. Octubre 2006.\nhttp://www.idee.es/ApliVisio/\nNomenclator/NGCE.pdf\nOGC (2003) “OpenGIS Reference Model”, Version 0.1.2, OGC Inc. Wayland, MA, USA.\nRodríguez Pascual AF, García Asensio L (2005) “A fully integrated information system to manage cartographic and geographic data at a 1:25,000 scale”. XXII International Cartographic Conference (ICC2005). A Coruña, Spain. ISBN: 0-958-46093-0\nSevilla Sánchez, C, Rodríguez Pascual A.F., González Matesanz FJ, Blanco Ortega LM, Vilches-Blázquez LM (2006) “Un SIG corporativo en el IGN para la gestión integrada, publicación y análisis de datos geográficos”. In proceedings of XII Congreso Nacional de Tecnologías de la Información Geográfica. Camacho Olmedo, M.T.; Cañete Pérez, J.A.y Lara Valle, J.J. Ed. ISBN: 84-338-3944-6 Depósito Legal: GR-1855-2006\nStuckenschmidt H, Visser U, Schuster G, Vögele T (1999) “Ontologies for geographic information integration”. Proceedings of Workshop Intelligent Methods in Environmental Protection: Special Aspects of Processing in Space and Time, 13. International Symposium of Computer Science for Environmental Protection, CSEP 1999, pp. 81-107.\nVilches-Blázquez LM, Rodríguez Pascual A F, Mezcua Rodríguez J, Bernabé Poveda MA, Corcho O (2007a) “An approach towards a harmonized framework for hydrographic features domain”. In Conference Proceedings of XXIII International Cartographic Conference. 4-10 August 2007. Moscow, Russia.\nVilches Blázquez LM, Bernabé Poveda MA, Suárez Figueroa MC, Gómez-Pérez A, Rodríguez Pascual A F (2007b) “Towntology & hydrOntology: Relationship between Urban and Hydrographic Features in the Geographic Information Domain”. Ontologies for Urban Development Ed. Teller, J.; Roussey, C.; Lee, J. Springer-Verlag, 2007. ISBN: 978-3-540-71975-5. pp: 73-84.\nA completar por Vilches y Saquicela, con contribuciones de María (la de las ontologías)\nMans Shapshak  , Tracasa SA  \"Combining GIS and Semantic Technology to Create a Cultural Visualizer.\"\nProyectos fin de carrera propuestos para este área\n\nMaría: incluye un párrafo del tuyo\nA rellenar con ideas que vayan surgiendo y que den para proyectos fin de carrera o tesinas de máster",
  "speaker": "SYSTEM",
  "uuid": "ac35c9e9-f382-46b9-9517-b76d161cf049"
}