{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Short_description_for_the_Web_and_leaf_let \n\nThe Ontology Engineering Group (OEG) is based at the Computer Science School at Universidad Politécnica de Madrid (UPM). It ranks eighth among the two hundred research groups from UPM and it is widely recognised in Europe in the areas of Ontology Engineering, Semantic Infrastructure, Linked Data, and Data Integration.\nOur main research areas are: Ontological Engineering, Semantic Web and Linked Data, Semantic e-Science, Computational Linguistics, and the Future Internet. The most relevant achievements obtained by the group are (a)\nMethontology\n(now deprecated) and the\nNeOn Methodology\n, a scenario-based methodology for developing ontology networks that provided guidance on all the key aspects of the ontology engineering process, including collaborative ontology development, the reuse of ontological and non-ontological resources, and the evolution and maintenance of networked ontologies; (b)\nOOPS!\n, a web-based evaluation tool for ontologies; (c)\nMorph\n, a family of tools that exploit the W3C recommendation R2RML to allow accessing legacy relational databases, data streams and Google Fusion Tables using SPARQL or data streaming extensions of it; (d)\nMarimba\n, a tool to transform library records in MARC 21 format to Linked Data; (e)\ngeometry2rdf\nand\nmap4rdf\n, tools for the transformation of geographical information to Linked Data and its exploitation through faceted browsing; (f)\nSPARQL-DQP\na system that optimizes federated SPARQL queries; and (g)\nSem4Tags\n, a multilingual tool that given an input tag in English or Spanish and a context generates as a result a DBpedia resource representing the tag meaning. Finally, the group has developed applications in a wide range of domains, including knowledge management, software Application Lifecycle Management, e-commerce, job and funding search, geo-localisation, R&D project management, etc. Special mention deserves Linked Data applications in partnership with the National Geographic Institute of Spain (GeolinkedData), the Spanish National Library (datos.bne.es), Prisa Digital (El Viajero) and Fundeu (Terminesp).\nIn addition, OEG maintains the Spanish chapter of DBpedia, and has participated and is currently participating in many standardization activities at the W3C such as the Linked Data Platform specification, PROV-O provenance ontology, Sensor Network Ontology, Ontolex model for ontology-lexica, Best practices for Multilingual Linked Open Data. We have also participated in ISO/TC 37 Committee activities within the SC 4 and in the ISO/TC 37/TCG /Terminology Coordination Group and in the OASIS Technical Committees related to OSLC.",
  "speaker": "SYSTEM",
  "uuid": "ac59dcd8-3941-437c-80b3-4243c3a82f00"
}