{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 90\n88\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n‐ Keyboard‐based input: produces machine‐readable text that is suitable for indexing, searching, and\nhandling by contemporary character‐based technology.\n• Regarding optimization techniques, they are a combination of movement minimization and language\nprediction (that exploits the statistical nature of a language to predict the user’s intended letters or\nwords).\nAs a result, text input solutions includes:\n• Capture capabilities (via a virtual or physical keyboard)\n• Predicting capabilities: based on linguistic (semantics, ontologies, thesaurus, etc.) and artificial intelli‐\ngence to predict the word that is being typed.\n• Error Correction: provides meaningful correction on real‐time.\n• Personalized text input experience: the system progressively is being adapted to the customer.\n• Multilingual: provide writing capabilities in multiple languages.\n• Industry specific dictionaries: provide access to specific domains such as finance.\nApplications\nScanning and text input software provides several business applications:\n• Accounting: Minimizing human touch points (and human error) helps companies reduce errors and\nexceptions and recognize errors earlier in the process (e.g., incorrect shipments), reduce cycle time\n(process more orders, more quickly), and improve customer relationships. This can be applied to:\ninvoice processing, purchase order processing, sales order processing, new account opening and con‐\ntract management. \n• Customer correspondence / support: is a high‐volume document processing opportunity for capture\nand image management vendors.\n• Human resources documents: HR must cope with large volumes of documents of very diverse types,\nincluding recruitment, hiring, and on boarding documents; benefits enrolments and electronic forms;\nand employee agreements and annual reviews.\n• Case management: increasing use of case management in government, healthcare, and legal.\n• Claims processing: must deal with many different document types, including paper forms collected by\nbranch offices, telephone documents, mail‐in documents, faxed‐in documents, externally generated\ndocuments in electronic formats, internally generated electronic documents, email documents, and\nWeb documents. This can be also applied to insurance and warranty processing.\n• Product life‐cycle management: Barcodes and other technologies are used combined to manage the\nlife‐cycle of products in the retail industry among others.\n• Marketing: QR Codes and the required scanning technologies are starring becoming mainstream in\n",
  "speaker": "SYSTEM",
  "uuid": "ac7aabf0-5434-43f5-b13c-68242c1f29cd"
}