{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Carlos%27_Tasks/eswc201dqpreview \n\nReview of the paper Distributed Querying to RDF Repositories using SPARQL-DQP\n\nThe paper\nFrom reviewer 1 (Angela Fogarolli):\nIt will be nice to have an architectural view in the paper about which modules has been re-used from existing solution and which have developed by the authors.\nFrom reviewer 2 (Mischa Tuffield):\nIt would have been nice if the methodology prescribed in the DARQ system was made more explicit, insofar as how the system achieves the goal of distributed sparql queries without the need to extend the sparql language. This is eluded to in paragraph 6 of section 1, but is not clear to the reader.\n--> He says that we should have explained better (or removed from SparqlDQP) why we extended SPARQL. Either we remove this extension (also a comment from Freddy which I share) or we explain better why is it there.\nWhy did the author's choose the re-use the verb \"FROM\". As this is already defined in the SPARQL specification. There was talk of a verb named \"SERVICE\" in the currently active SPARQL working group, which seems a lot more similar to authors' intentions. SERVICE was said to allow a user to point at a sparql-endpoint.\n-> I will check the SPARQL-WG and use SERVICE from now on\nThe notation used : ?dbpedia.bank p:genre <\nhttp://dbpedia.org/resource/Madchester\n>\n-> he is always commenting about the syntax, he is missing the point as it is noted later. This is something to fix.\nThe utility of the examples presented in this paper, don't seem to suggest that this approach gives a SPARQL user any further querying power than SPARQL already provides.\n--> This is inline with the evaluation, put here a better query, directly the one with the bio2rdf endpoints so he will not be able to say it is not sufficient enough\nFinally, it is not clear to me how the SPARQL-DQP fits in with the WS-DAI, or what benefits are presented if a given user interacts with the WS-DAI.\n--> We did not explain enough WS-DAI (or too much). Maybe an example with workflows? or use one from OGSA-DQP but with SPARQL and RDF data sets\nFrom reviewer 3 (Peter Haase):\nThe description of the query language / SPARQL extensions is very unclear, both in terms of syntax as well as semantics. The authors merely explain the extensions with an example, which is not sufficient to understand the proposed language.\n--> Again, the reviewer misses the point, the goal is not an extension to SPARQL but a way for querying distributed RDF data sets. Either we explain better what can be done with this extension or we specify that this is only an example to be improved later (as the PC notes later)\nThe description of the proposed optimization techniques is very brief and abstract. It is not clear which exact techniques are applied, whether and how they are novel, and what their benefit is (see evaluation)\n--> Agree, nothing to say but that these techniques have to be improved\nThe benefit of the integration with the WS*/OGSA protocols may exist, but it is not clear from the paper. Also, it is quite orthogonal to the rest of the paper\n--> Agree\nThe evaluation part is really, really weak. The evaluation is very limited in terms the systems that have been evaluated and in terms of the queries that have been performed. Not being able to get other systems running is not a good excuse. For the queries, I would expect some analysis with respect to the contributions of the paper, especially the effect of the optimization techniques.\n--> Agree, nothing to add.\nRegarding the PC comments, he is saying the good things from the paper: innovative system, not much out there, but the methodology could have been better or with more details. The problem is that it is still preliminary but regarding optimization. None of them looked at the possibility of integrating all these sources, thing that is not that easy to do (the PC points that there are not that many systems out in the market). So, I think Peter misses part of the point of the paper, the distribution of the system and the way of doing it. But he is right regarding the optimisations and the evaluation.\nAs a summary, I think all of them did not looked at the difficulty of the query regarding its distributed sources. They all went to two points: the extension of SPARQL, which should be a less important question and the optimisation + evaluation, which is indeed not good enough.\nThings to keep, the distribution. Things to improve: substitute the first query for something harder, like the one with bio2rdf, create a proper test suite and add more optimisations (or explain better the existing ones).\nOne good thing: nobody say anything about the theoretical foundations of the paper and the equivalence of SPARQL and SQL\nSummary:\nLa evaluación, que tiene que ser seria\nLa explicación de optimizaciones y análisis sobre estas optimizaciones.\nExplicar mejor por qué es buena idea usar WS-DAI related appraoches",
  "speaker": "SYSTEM",
  "uuid": "ada7ca44-3efb-4ebe-ad3a-0290ee96910f"
}