{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 81\n79\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nthat a given text is a decent translation (using corpora of high quality translations as a baseline for compar‐\nison). Humans, on the other hand, are much better at catching more subtle problems with word order, gram‐\nmar and word choice.\nSharing Language Data\nNow that virtually all systems are connected to the Internet, it is straightforward to create shared translation\nmemories that are continually updated as new translations are created.  This is particularly important for\nmachine translation and hybrid translation systems that require a large corpus of aligned texts to train the\ntranslation engines. \nLanguage service providers are an ideal source of texts, since they continually produce high quality, aligned\ntexts that, with client permission, can be fed into these systems. This process can be completely automated\nso that the language service provider incurs little or no cost to participate in the shared translation memo‐\nry. \nThe main cost associated with participating in shared translation memories is the cost of modifying the trans‐\nlation management systems used by language service providers to mirror, or copy, completed translations to\nthe translation memory’s web API. Since most LSPs use one of a few TMS platforms, such as Globalsight or\nSDL’s TMS, if these vendors do that system integration work, all LSPs using those platforms will have the\noption of participating in projects that share language data.\nCompanies that are using a home built translation management system, on the other hand, will need to do\nthe integration work themselves. Fortunately, the process of posting completed translations to a public web\nservice is about as complicated as submitting an HTML form. If an LSP is sophisticated enough to build their\nown TMS, they can add support for a public translation memory without much effort (probably a few days’\nworth of dedicated developer time).\nThe primary opportunity created by public translation memory will be for statistical and hybrid machine\ntranslation services, as these will serve as a high quality source of aligned texts to train these systems. This\nis particularly true for MT engines that focus on secondary languages for which aligned texts are difficult to\nsource, and also for translation engines that target a particular domain of expertise, such as the automobile\nindustry.\nThe risks of participating in public translation memories are pretty minimal. Their primary benefactors will\nbe statistical and hybrid machine translation projects, especially those dedicated to poorly resourced lan‐\nguages, such as Tilde, which focuses on the Baltic languages. The main issue LSPs will need to deal with is\ngetting permission from clients to share their translations with these projects. \nTranslation Technology Drivers and Inhibitors\nThe following table presents macroeconomics, global megatrends, specific market trends and labour supply\nfactors that might affect the translation market.\n",
  "speaker": "SYSTEM",
  "uuid": "b011e63b-0fb1-47a0-81c8-1687059143c4"
}