{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 36\nBÚSQUEDA \n \n36 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nque tiene un coste. Habitualmente en estos casos los problemas de búsqueda \naparecen bajo la forma de problemas de optimización. \nPara hablar de espacios de estados infinitos (todos los que aparecen en los \nproblemas anteriores son finitos) vamos a introducir toda una clase de sistemas de \nproducción que tienen un interés teórico (son una fuente de ejemplos para ilustrar \nlas diferencias entre distintos tipos de espacios de estados y distintas estrategias de \ncontrol), histórico (fueron introducidos por el lógico Post en los años 30 para estudiar \nproblemas de calculabilidad teórica y son la base matemática para los actuales \nsistemas de producción) y práctico (muchos sistemas importantes, en particular los \nrelacionados con el tratamiento del lenguaje natural, están directamente basados en \nellos). Nos refererimos a los sistemas (simbólicos) de reescritura. En ellos los \nestados son palabras (secuencias de caracteres) en un cierto alfabeto (los \nelementos del alfabeto son los caracteres) y las reglas son del tipo siguiente: \n<cadena1> --> <cadena2>. Una de estas reglas se activa sobre una cadena \ncuando ésta contiene como subcadena a <cadena1>; el nuevo estado obtenido por \naplicación de la regla es la cadena inicial en la que se ha reemplazado una \nocurrencia de <cadena1> por <cadena2>. \nPor ejemplo, en un sistema de reescritura con alfabeto {A,B} y reglas A --> AA, \nAB --> B, cualquier estado inicial que contenga una A tendrá una rama infinita. \nEsto puede producir problemas de no terminación de la búsqueda de una índole \ndiferente a los comentados en los casos de los grafos con ciclos. Pero que un \nespacio de estados sea infinito no significa que en él la búsqueda no pueda tener \néxito. En el ejemplo anterior, si el estado inicial es ABAB y los estados objetivos son \naquellos en los que no aparece el caracter A, es sencillo encontrar una secuencia de \naplicación de reglas que llevan del estado inicial al estado objetivo BB. \nEn el mismo ejemplo anterior puede verse que una misma regla puede estar \nsensibilizada sobre un mismo estado por varias razones distintas, lo que producirá \nvarios disparos distintos de la misma regla sobre el mismo estado. Así sobre ABAB la \nprimera regla está sensibilizada dos veces y los estados que se obtienen por los \ndisparos son, respectivamente, AABAB y ABAAB. En el caso anterior, los dos estados \nconstruidos son distintos pero puede también suceder que dos disparos distintos de \nla misma regla sobre el mismo estado produzcan un único estado. Es el caso de la \nprimera regla del ejemplo, que es sensibilizada tres veces sobre AABAB. Las dos \nsensibilizaciones correspondientes a las dos primeras ocurrencias de A producirán \ncomo resultado un solo estado: AAABAB. En este último caso (cuando entre dos \nvértices aparece más de una arista dirigida) se dice que el grafo de estados es no \n",
  "speaker": "SYSTEM",
  "uuid": "b0a5e3df-ab0e-426d-839f-677a93b97d0b"
}