{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 10\n8\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nsocial media has already replaced email. Soon, more than half of all retail transactions will be influenced by\nthe web. Ninety per cent of consumers now trust peer recommendations online, compared to only 14% who\ntrust advertising. This is driving social commerce in all areas of online business. The same dynamics are at\nplay in citizen‐facing systems for the public sector, even in the delivery of healthcare and other social serv‐\nices.\nSocial media yields social data, where customer conversations create an insight‐rich goldmine for business‐\nes, or any organisation that interacts with the public. New transformational customer‐centric organisations\nare emerging; capturing the full value of social data takes place across an entire organisation, often requir‐\ning cultural changes. Social data can drive change beyond marketing, impacting sales, customer service, and\nproduct development. Internal and external Enterprise social initiatives are designed and evaluated in rela‐\ntion to the larger context of business goals, and the new ICT ecosystem is affecting almost every type of busi‐\nness and organisation. \nThe rapid expansion of the Internet itself – with approximately 2.3 billion people online ‐ combined with the\nmobile/social/global paradigm shift, are driving digital information volumes off the map, growing by a fac‐\ntor of 9 in just five years. While 75% of digital information is generated by individuals, Enterprises have some\nliability for 80% of that information at some point in its digital life. The number of «files» or containers that\nencapsulate digital information is growing even faster than the information itself as more and more embed‐\nded systems generate digital data. The amount of information individuals create themselves — writing doc‐\numents, taking pictures, downloading music, etc. — is far less than the amount of information being creat‐\ned about them. \nIn this context of global growth in connectivity, the growth of digital information continues to outpace that\nof storage capacity, or at least of what is currently stored. A gigabyte of stored content can generate a\npetabyte or more of transient data that is typically not stored (e.g., digital TV signals we watch but don’t\nrecord, voice calls that are made digital in the network backbone for the duration of a call). The cost of cre‐\nating, capturing, managing, and storing information is one‐sixth of what it was in 2005, yet since then the\nannual investment by Enterprises in digital technology has increased 50%, spent on hardware, software,\nservices, and staff to create, manage, store, and derive revenues from digital data.\nNew capture, search, discovery, and analysis tools, almost all enabled with LT features, can help organiza‐\ntions gain insights from their unstructured data (text, voice recordings and transcriptions), which accounts\nfor more than 90% of digital information. These tools can create data about data, or metadata, which is\ngrowing twice as fast as the digital universe as a whole. Business Intelligence tools (a $35B global market)\nincreasingly are dealing with real‐time data, from charging auto insurance premiums based on where peo‐\nple drive, to routing power through the intelligent grid, or changing marketing messages on the fly based on\nsocial networking responses. \nThe ability to manage and process this tsunami of data across the world’s languages is one of the biggest\nchallenges in the new ICT ecosystem, and one for which LT is a critical enabling technology.\nThe explosive growth of mobile and social platforms is driving the consumerisation of ICT, as new technolo‐\ngies replace old and companies use them to gain competitive and process/performance benefits. The pro‐\nliferation of consumer devices is the biggest trigger for Enterprise adoption of unified communication solu‐\ntions. Wireless connectivity is replacing wired; mobile, multi‐modal devices are replacing desktop devices;\n“Dual Persona” mobile devices are replacing separate personal and business mobile devices; “BYOD” (bring\nyour own device) is becoming the norm. Text messaging and automated proactive notification/alerts are\nreplacing telephony. Process‐to‐person contacts are replacing person‐to‐person contacts; online self‐service\napps are replacing customer service phone calls; mobile apps are replacing online self‐service apps.\nNew generation products and services look for engagement by adding intelligence to the ICT infrastructure,\nemploying Language Technology as a core piece of the puzzle. Through intelligent interactivity using speech\n",
  "speaker": "SYSTEM",
  "uuid": "b24e263c-bc8a-4989-b2f1-2767bdb9c9a7"
}