{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 76\nPage 76 of 124\nNeOn Integrated Project EU-IST-027595\n– UF or USED FOR, the reciprocal relationship, which leads from the preferred term to the non-\npreferred term(s).\nAccording to the [ANS05] the equivalence relationship covers ﬁve basic types: (a) synonyms, (b) lexical\nvariants, (c) near-synonyms, (d) generic posting, and (e) cross reference to elements of compound\nterms.\n• Hierarchy. This relationship is based on degrees or levels of superordination and subordination, where\nthe superordinate term represents a class or a whole, and subordinate terms refer to its members or\nparts. Reciprocity should be expressed by the following relationship indicators: (a) Broader Term (BT),\na label for the superordinate (parent) term, and (b) Narrower Term (NT), a label for the subordinate\n(child) term. Hierarchical relationships cover three logically different and mutually exclusive situations:\n– Generic relationship.\nThis relationship identiﬁes the link between class and its members or\nspecies. The generic nature of a relationship may be identiﬁed by the following abbreviations:\n(a) BTG = Broader term (generic) and (b) NTG = Narrower term (generic).\n– Instance relationship. This relationship identiﬁes between a general category of things or events\nexpressed by a common noun, and an individual instance of that category, often a proper name.\nThe hierarchical instance relationship may be indicated by the following abbreviations: (a) BTI =\nBroader term (instance) and (b) NTI = Narrower term (instance).\n– Whole-part relationship. This relationship covers situations in which one concept is inherently\nincluded in another, regardless of context, so that the terms can be organized into logical hier-\narchies, with the whole treated as a broader term. The hierarchical whole-part relationship may\nbe indicated by the following abbreviations: (a) BTP = Broader term (partitive) and (b) NTP =\nNarrower term (partitive).\n• Association. This relationship covers associations between terms that are neither equivalent nor hier-\narchical. The most common associative relationship used in thesauri is symmetrical and is generally\nindicated by the abbreviation RT (related term).\nA thesaurus captures many relationships among terms, between terms and concepts, and among concepts.\nA term is a linguistic entity, a character string with meaning in a given language. A concept can be opera-\ntionally deﬁned as such a group of normalized terms.\n5.4\nTypes of Thesaurus\nSoergel [Soe95] identiﬁed two types of thesaurus: (1) term-based thesaurus, and (2) concept-based the-\nsaurus. Next, we will describe each one of them.\n5.4.1\nTerm-based Thesaurus\nThe term-based thesaurus is a collection of terms. Terms are the only type of entity considered. Terms\nmay be related to other terms traditionally using aforementioned relationships, such as: Broader Term (BT),\nNarrower Term (NT), Related Term (RT), Use For (UF), and Use (U/USE). The ISO 2788:1986 [ISO86]\nstandard proposes a term-based thesaurus structure. Based on ISO 2788:1986 [ISO86] we identify the\nfollowing thesaurus components (see Figure 5.2):\n• PreferredTerm, also known as descriptor, it is used consistently to represent concepts when indexing\ndocuments. It has the following elements: (1) LexicalValue, and (2) identiﬁer.\n• Term, which is not assigned to documents when indexing, but provided as user’s entry point. It has the\nfollowing elements: (1) LexicalValue, and (2) identiﬁer.\n",
  "speaker": "SYSTEM",
  "uuid": "b33ad342-25f5-485b-b678-bedfa00b958d"
}