{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 105\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 105 of 124\nsemantic desktop applications, and so on.\nOntology population is generally performed by means of some kind of ontology-based information extraction\n(OBIE). This consists of identifying the key terms in the text (such as named entities and technical terms)\nand then relating them to concepts in the ontology. Typically, the core information extraction is carried out by\nlinguistic pre-processing (tokenisation, POS tagging etc.), followed by a named entity recognition component,\nsuch as a gazetteer and rule-based grammar or machine learning techniques. Named entity recognition\n(using such approaches) and automatic term recognition are generally performed in a mutually exclusive\nway: i.e. one or other technique is used depending on the ultimate goal. However, it makes sense to use a\ncombination of the two techniques in order to maximise the beneﬁts of both. For example, term extraction\ngenerally makes use of frequency-based information, whereas typically named entity recognition uses a more\nlinguistic basis. Note also that a \"term\" refers to a speciﬁc concept characteristic of a domain, so while a\nnamed entity such as Person or Location is generic across all domains, a technical term such as \"myocardial\ninfarction\" is only considered a relevant term when it occurs in a medical domain: if we were interested in\nsporting terms then it would probably not be considered a relevant term, even if it occurred in a sports article.\nAs with named entities, however, terms are generally formed from noun phrases (though in some contexts,\nverbs may also be considered as terms).\n7.2\nPatterns for entity recognition\nTraditional NE recognition and even ontology-based information extraction applications in GATE rely on a\nfairly small set of patterns which aim to identify the relevant entities in text. These rely largely on gazetteer\nlists which provide all or part of the entity in question, in combination with linguistic patterns (see for example\n[MMG99] for a discussion of the importance of gazetteers in pattern-based NE recognition). For example,\na typical rule to identify a person’s name consists of matching the ﬁrst name of the person with an entry\nin the gazetteer (e.g. \"John\" is listed as a possible ﬁrst name), followed by an unknown proper noun (e.g.\n\"Smith\", which is recognised as a proper name by the POS tagger). Most patterns include some combination\nof proper noun or word with an initial capital letter (for English) and either some gazetteer entry or linguistic\nfeature.\nHowever, identifying ontological concepts and/or relations requires a slightly different strategy. While we can\nstill make use of known lists of terms (either via a gazetteer or by accessing the class, instance and property\nlabels in an existing ontology), this is often not sufﬁcient for a variety of reasons:\n• The concept may not be in the ontology already\n• The concept may exist in the ontology only as a synonym or linguistic variation (singular instead of\nplural, for example)\n• The concept may be ambiguous\n• Only a superclass of the concept may exist in the ontology\nWe therefore need to make more use of linguistic patterns and also contextual clues, rather than relying on\ngazetteer lists as with traditional recognition. Lexico-syntactic pattern-based ontology population has proven\nto be reasonably successful for a variety of tasks [ECD+04]. The idea of acquiring semantic infomration\nfrom texts dates back to the early 1960s with Harris’ distributional hypothesis [Har68] and Hirschman and\nSager’s work in the 1970s [HGS75], which focused on determining sets of sublanguage-speciﬁc word classes\nusing syntactic patterns from domain-speciﬁc corpora. A detailed description and comparison of lexical and\nsyntactic pattern matching can be found in [May00], In particular, research in this area has been used in\nspeciﬁc domains such as medicine, where a relatively small number of syntactic structures is often found, for\nexample in patient reports. Here the structures are also quite simple, with short and relatively unambiguous\nsentences typically found: this makes syntactic pattern matching much easier.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "b37f5742-cc0b-4591-87a0-f42463ad5d61"
}