{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/TramitesAdministrativos \n\n[1]\nTrámites\n\nNota.- De acuerdo a la normativa actual (Abril 2011)\nOpciones generales\n1. Si se hace doctorado europeo no se hace prelectura.\n2. Si tienes un artículo JCR no se hace prelectura.\nDocumentos para el depósito\ndocumentos boricles\nTrámites después del depósito y aceptación del tribunal\n1. Una vez fijada la fecha y hora de lectura por el Presidente(a),\néste(a) se lo comunicará al Secretario(a) y al secretario(a)\nadministrativo(a) del Programa de Doctorado.\n2. El secretario(a) administrativo(a) del Programa de Doctorado\nrealizará la reserva de la sala donde se llevará a cabo la defensa por\nel procedimiento habitual (correo electrónico a Jefatura de estudios) y\nuna vez obtenida dicha reserva se lo comunicará al Secretario(a).\n3. El Secretario comunicará, por indicación del Presidente, a los\nVocales, al Vicedecanato de Posgrado (v.investigacion@fi.upm.es) y a\nSecretaría de Alumnos del Centro (bego@fi.upm.es), la fecha, lugar y\nhora de la defensa de la Tesis, con al menos 15 días de antelación. Se\nsugiere como cuerpo del mensaje:\nEstimados compañeros,\nComo Secretario del Tribunal nombrado por la Comisión de Doctorado de la\nUniversidad Politécnica de Madrid que ha de juzgar la tesis doctoral\npresentada por D. XXXXXXXX titulada XXXXXXXXXX, le comunico por orden\ndel Presidente de dicho tribunal que el acto de defensa de la tendrá\nlugar el próximo día xxxxxxx,a las XXXXXXX, en la XXX de la Facultad de\nInformática de la Universidad Politécnica de Madrid.\nEl Secretario del Tribunal,\n4. El secretario(a) administrativo(a) del Programa de Doctorado enviará\na los Vocales del tribunal los impresos de liquidación de dietas y\ngastos de locomoción.\n(\nhttp://www.fi.upm.es/intranet_p/docs/tramites/2_gastos_tesis_doctorales.pdf\n).\n5. El día de la lectura, el Secretario deberá recoger las actas de la\nlectura de la Tesis en la Secretaría de Alumnos del Centro. Y el\nsecretario(a) administrativo(a) del Programa de Doctorado deberá\nolicitar a los Vocales los impresos de liquidación de dietas y gastos\nde locomoción, así como los correspondientes justificantes y tramitarlos\na Gestión Económica.\n6. El procedimiento que se debe seguir para la defensa de la tesis, está\nrecogido en el punto 11 del reglamento de elaboración y defensa de Tesis\nDoctoral de la Universidad Politécnica de Madrid\n(\nhttp://www.upm.es/normativa/academica/Reglamento_Elaboracion_Defensa_Tesi\n>s).\n7. Durante el acto de defensa y cuando se lo indique el Presidente, el\nSecretario deberá proceder a la lectura de la correspondiente normativa\nde defensa (RD 1393/2007).\n8. Al finalizar el acto de defensa, el Secretario se encargará de\nellenar las actas por cuadruplicado, en las que deben figurar la\ncalificación, fecha de lectura, nombre y firma de cada uno de los\nmiembros del tribunal.\n9. El Secretario deberá entregar las tres actas originales en la\nSecretaría de Alumnos y la copia al secretario administrativo del\nPrograma de Doctorado para su archivo.",
  "speaker": "SYSTEM",
  "uuid": "b4579fde-47b3-41d6-9e94-2c3c5bc81921"
}