{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 6\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n \n2. En el caso de que se solicite el anticipo de dichas cantidades para hacer frente a los gastos de viaje, \ndeberá entregarse  a José Alberto tanto la hoja previaje (como se venía haciendo hasta ahora), como la \nhoja posviaje en la que se desglosarán las distintas cantidades que integren el total a anticipar. \nIgualmente deberán adjuntarse las facturas/mails de los conceptos cuyo anticipo se solicita (ya que \nsólo se anticipan gastos ciertos), y entregarse dicha documentación con una antelación mínima de 15 \ndías respecto de la fecha de inicio del viaje,  periodo mínimo para que los miembros hayan podido \ncobrar el anticipo en la fecha de salida. \n \n3. No procederá solicitar anticipo de cantidades que posteriormente sean abonadas con tarjeta OTT o, \ndicho de otro modo, no procederá pagar con tarjeta OTT aquellos conceptos cuyo anticipo se haya \nsolicitado previamente.  \n \n4. Si se desea solicitar el anticipo de los gastos de alojamiento, y se desconoce el importe del mismo, \nel miembro se imputará la siguiente cantidad: 0,5 x dieta alojamiento x nº días que se pernocte en el \ndestino. \n \nB3. Utilizando la tarjeta OTT  \nAquellos miembros que viajen con más frecuencia tienen la posibilidad de contar con tarjeta Mastercard de \ninvestigador OTT, de forma que puedan pagar gastos de desplazamientos (avión, trenes, alquiler de coche, \ngasolina), alojamiento e inscripciones. Los miembros que soliciten (o bien ya posean) dicha tarjeta tendrán \nigualmente una serie de obligaciones, de forma que el incumplimiento en tres ocasiones de cualquiera de ellas, \ncomportará la cancelación de la tarjeta: \n1. Firmar un documento en el se comprometan a elegir una de las dos siguientes opciones: \na) Hacerse responsables de la consulta del extracto de movimientos de la tarjeta, de forma que \ncada vez que realicen un viaje (en el plazo de una semana), deberán facilitar junto con su \ndeclaración de gastos, el/los importe/s que efectivamente se hubieran cargado en la cuenta de \nla tarjeta, como consecuencia de los gastos pagados con ésta.  \n \nb) Delegar en el equipo de gestión del OEG dicha obligación, facilitando para ello el código \nPIN de su tarjeta, de forma que éstos puedan consultar el extracto de movimientos a fin de \nagilizar la tramitación de la declaración de gastos. Ello sin perjuicio de la obligación de cada \nmiembro de cumplimentar debidamente su declaración de gastos. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "b4cd6259-335e-43bf-b4fa-1200224eee52"
}