{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n. \nSe esta llevando acabo la evaluación del enfoque para crear ontologías a partir de folksonomías y datos enlazados.\nA continuación se presentan los resultados obtenidos hasta ahora discriminados por proceso:\nNotación: dbpr = recursos dbpedia, dbpo= ontología dbpedia\n- Terminology\n- Umbral=0.8\n- Términos obtenidos: 58\n- Precisión con respecto a Yahoo Glossary: 94,83%  y la evaluación manual 89.66%\n- Grounding a DBPedia\n- Términos relacionados con un dbpr: 55 (94% de todos los procesados)\n- Total de dbpr identificados: 42 (11 de los cuales fueron asociados a más de un tag, por ejemplo: investing, investment, Investing con\nhttp://dbpedia.org/resource/Investment\n)\n- Getting Ontology Classes\n- Numero de dbpr equivalentes a una clase: 23 (54% de los 42 identificados en la etapa anterior)\n- Numero de clases obtenidas: 37 tomadas de 3 ontologías diferentes (dbpo, umbel, opencyc)\n- Numero de clases locales creadas: 23 (agrupan las 37 clases usando sameAs)\n- Finding Relations and new clases\n- Nuevas clases descubiertas: 175\n- Relaciones descubiertas entre clases: 373 (8 relaciones distintas: subclassOf, Disjoint etc) \n- Clases locales creadas a partir de las descubiertas: 164\n- Relaciones locales creadas a partir de las descubiertas: 359\n- Estadísticas globales de la ontología\n- 187 clases enlazadas a 212 Clases de 3 Ontologías existentes\n- 359 relaciones creadas. \n- Solo 10 clases quedaron desconectadas (es decir no relacionadas con ninguna otra clase)\n- A continuación se despliega una parte de la ontología generada:\n-\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 2.3\n\n- Creación de las AMI para EC2:\n- Se ha escogido una AMI Ubuntu base sobre la que se instalará el software de procesamiento giscov y sus dependencias.\n- Implementación de las interfaces:\n- Se han instalado el entorno de desarrollo para implementar y dar soporte a los servicios web que conforman la arquitectura.\nTarea 1.4\n\nTarea 7.1\n\n- Carga en SameAs validator\n- Difusión en la 1ª reunión de la Red Temática de Linked Data\n- Redacción paper de revista",
  "speaker": "SYSTEM",
  "uuid": "b5616b0f-032f-41a9-8e20-c788695d2b0a"
}