{
  "message": "SYSTEM: Ontoterminology_a_new_paradigm_for_terminology.pdf: Página 1\nKEOD-International Conference on Knowledge Engineering and Ontology Development. Madeira October 5-8 2009 \nONTOTERMINOLOGY: A NEW PARADIGM FOR \nTERMINOLOGY \nChristophe Roche1, Marie Calberg-Challot2, Luc Damas1, Philippe Rouard3 \n \n1 Condillac “Knowledge Engineering” Research Group – LISTIC Lab. \nUniversity of Savoie – Campus Scientifique  \nF – 73 376 Le Bourget du Lac cedex \nchristophe.roche@univ-savoie.fr, luc.damas@univ-savoie.fr \n \n2 Ontologos corp. P.A.E. du Levray \n6 Route de Nanfray \n F – 74960 Cran Gevrier \nmarie.calberg-challot@ontologos-corp.com \n \n3 EDF CIH \nBâtiment Euclide \nSavoie Technolac \nF – 73373 Le Bourget du Lac cedex \nphilippe.rouard@edf.fr \nKeywords: \nontology, terminology, ontoterminology, knowledge representation, term definition, concept definition, \nhyper schema. \nAbstract: \nToday, collaboration and the exchange of information are increasing steadily and players need to agree on \nthe meaning of words. The first task is therefore to define the domain’s terminology. However, terminology \nbuilding remains a demanding and time-consuming task, even in specialised domains where standards \nalready exist. While reaching a consensus on the definition of terms written in natural language remains \ndifficult, we have observed that in specialised technical domains, experts agree on the domain \nconceptualisation when it is defined in a formal language. Based on this observation, we have introduced a \nnew paradigm for terminology called ontoterminology. The main idea is to separate the linguistic dimension \nfrom the conceptual dimension of terminology and establish relationships between them. The linguistic \ncomponent consists of terms (both normalised and non-normalised specialised words) linked by linguistic \nrelationships such as hyponymy and synonymy. The term definition, written in natural-language, is \nconsidered a linguistic explanation. The conceptual component is a formal ontology whose concepts are \nlinked by conceptual relationships like the is-a (kind of) and part-of relations. The concept definition, \nwritten in a formal language, is viewed as logical specification. An ontoterminology enables us to link these \ntwo non-isomorphic networks in a global and coherent system. \n1 INTRODUCTION \nBuilding terminology is a demanding and \nexpensive task. Writing definitions taking into \naccount the different meanings remains difficult, \neven in technical domains where standards already \nexist. \n \nWe have observed that although experts share \nthe same domain conceptualisation, they do not \nnecessarily agree on the definition of terms when \nwritten in natural language – we should bear in mind \nthat from the terminology point of view, a term is a \n“specialised linguistic unit” which denotes a concept \nof the domain called the meaning of the term. We \nhave also observed that each time communication \nproblems occur experts refer mainly to technical \ndiagrams or formulas rather than texts or standards. \nIn fact, experts agree on concept definitions when \nthey are written in a formal (logical) or semi-formal \n",
  "speaker": "SYSTEM",
  "uuid": "b5e75eba-7880-4da7-8d30-982b3643b1a4"
}