{
  "message": "SYSTEM: IntegratorDesignDocument.pdf: Página 2\nIntegrator Design Document\nMotivation\nIdentify use cases that exploit:\n●\nHorizontal integration of data sources. Sources provide the same type of information \nwith respect to the global schema. The data may overlap (redundancy) or be \ncomplementary (partitioned) and it can be seen as union of homogeneous information. \nThis is typically the case for sources with different spatial jurisdictions for instance.\n●\nVertical integration of sources. Sources provide different information with respect to \nthe global schema. In this case data of each source adds additional information to an \noriginal set. In this case the joins are between different kinds of information and finding \ntheir relationships is not always straightforward.\n●\nIntegration of different streaming sources. Answer queries including data from 2+ \nstreaming sources.\n●\nIntegration of streaming and stored data.\n●\nIntegration of streaming data in the past and current streaming  data\nSemSorGrid4Env flood use case \nIntegration storyboard. Proposal being refined with EMU/Soton.\n1.\nUser has their profile role linked to flood events in the area of South England.\n2.\nUser sees a map with data values for tide height. Heights and wind speed registered \nvalues are displayed in the user interface continuously generated charts.\n●\nValues generated by continuous query which merges data from several sources\n○\ntide height measurements\n■\nGet tide height measurements from CCO\n■\nGet tide height measurement from BODC\n■\nWave height measurements form WaveNet\n○\nwind speed measurements\n■\nGet data from CCO\n■\nGet from Met Office\n■\nwunderground RSS feed\n3.\nA Notification window pops up on the user display as a potential flood event in the area \nof interest has been detected. The pop-up indicates the place of potential danger, e.g. \nPortsmouth. In addition to the merge query, a query that identifies potential flood events \nhas been configured (data sources as in 2).\n●\nQuery detects if the wave height is higher than some threshold (e.g. See storm \nprediction).\n●\nQuery combines tide height and wind speed so that we get a flood warning on \ncertain conditions (See Flood prediction under discussion).\n4.\nUser clicks on Portsmouth to see more information about the place, so as to assess \nthe risks to infrastructure and services. The user is presented with a list of information \n",
  "speaker": "SYSTEM",
  "uuid": "b6f68650-e68b-436f-86e4-16e724f90bd0"
}