{
  "message": "SYSTEM: Wiki: DrInventor\n10-07-2014 Skype meeting UPF\n\nObjetivo: mirar un poco el tema de ontology learning para alinear trabajos\nUPF: trabajando ya en terminology extraction (slides available)\nUPF: Luis es quien está más metido en este tema. Usando los 80 docs de DrInventor. Primeras pruebas, basadas en feature linguistic ... processors. Experimento para adaptar al dominio de computer graphic. Se ordenan términos por importancia\nUPF: considerando cuatro subdomains (skinning, motion detection, ...)\nUPF: haciendo ranking con medidas habituales de terminology extraction\nACTION: Analizar si es posible hacer la sesión con domain experts durante el meeting. Meter un slot en el meeting\nUPF: El restulado de la anotación e expertos se usa para encontrar la mejor combinación de métricas para el dominio\nUPF: rest of steps available on the slideset\nUPM: ¿Qué medidas estáis utilizando concretamente?\nUPF: Luis lo sabe con detalle. Son n-value, c-value, etc...\nACCION (UPF): enviar a Rafa un artículo que ha hecho Luis con terminología en catalán, pero aplicable perfectamente\nUPF: Se utilizan sobre todo expresiones regulares (no sólo el output de GATE, más JAPE rules). También en el futuro se podrían usar análisis de dependencias\nUPM: ahora mismo terminando la implementación, sacando ahora n y c-value, más medidas probabilísticas que se usan ahora mismo en OntoLearn\nUPM: con respecto a la parte de dependencias, ¿es para determinar el contexto donde aparecen los términos?\nUPF: Ahora mismo no se está evaluando si el string que se extrae es correcto o no (quizás le mandamos al experto algo que no es muy relevante, un adjetivo que no es parte del término, etc.)\nACCION (UPM): preguntar a Andrés García-Silva sobre el software que utilizamos para hacer la evaluación de una de sus soluciones (puesto que consideraba términos y su relación con otros términos)\nUPF: ¿Para qué se utilizará la extracción de términos?\nUPM: La extracción de términos es el primer paso. Una vez identificados extraemos las definiciones, que son las que nos sirven para crear la ontología\nUPM: En el repositorio podemos mantener todas estas medidas para que en el futuro sea más fácil hacer todas estas evaluaciones para UPF y UPM, y también para otros dominios\nUPF: Luis también está buscando distintos tipos de definiciones (no sólo para buscar hiperónimos, etc., sino también forma composicional de los términos que se definen - una silla tiene normalmente cuatro patas, etc. -, definiciones funcionales, etc.)\nUPM: Esto podría ser muy útil para enriquecer las ontologías que se vayan creando\nUPM/UPF: intercambiar las presentaciones para el meeting, para alinearlas bien\nUPM/UPF: intentar ver si podemos proponer la evaluación incluso en el propio meeting (o al menos un mockup)\nUPF: trabajando ahora mismo en el deliverable\nUPM: podemos hacer QA sobre el deliverable\nUPM: Un tema muy concreto/técnico: ¿Por qué en la propuesta de anotaciones que mandasteis estáis usando un modelo propio en JSON y no la representación de GATE?\nUPF: por ejemplo, la idea es usar un JSON pequeño para facilitar visualización (para facilitarlo a los clientes).\nUPF: GATE genera muchísimo material, que luego no se utiliza. Podemos almacenar algo grande en el store, y luego filtrar para clientes\nUPM: usaremos la data structure de GATE para guardar todo. Luego se transforma/serializa lo que sea necesario para el cliente",
  "speaker": "SYSTEM",
  "uuid": "b70da12e-beeb-4247-beba-81dd9fed4cbb"
}