{
  "message": "SYSTEM: QRVocabulary.pdf: Página 10\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n92 / 103 \nModel Fragment Types \nStatic Fragments \nIn static fragments all ingredients may occur except agents and influences. Static \nfragments are used to describe parts of the structure of the system, and the \nproportionalities that exist between the quantities. \n \nProcess Fragments \nProcess fragments contain at least one influence, but no agents. These model \nfragments are used to describe processes that take place within the system.  \n \nAgent Fragments \nAgent fragments contain an agent and may contain one or more influences. Agent \nfragments are used to describe the influences agents (exogenous entities) have on the \nsystem. \nA.7.2 Scenarios  \nScenarios describe the actual state of a system, and can consist of all the ingredients \nthat can be used as conditions in model fragments, except for other model fragments \n(see table 1). The use of ingredients in scenarios differs from their use in model \nfragments, as in scenarios ingredients are incorporated as facts instead of as conditions \nor consequences. Obviously, this allows model fragments to match with scenarios. \nScenarios are used as input for the qualitative simulator and function as the starting \nstate from which the rest of the behavioural graphs are generated. \nA.7.3 Identity \nIdentity relations are used to specify that two model ingredients in different imported \nmodel fragments are the same. There are two possible applications. Firstly, they can be \nused to indicate that two entities in different imported model fragments are actually the \nsame one. Secondly, they can be used to specialise entities in child model fragments. \nFor example, the fish entity in a parent model fragment can be specialised to a salmon \nentity in the child model fragment. \nA.8: Simulation Vocabulary \nA.8.1 Simulation \nThe word simulation is ambiguous, as it is used to refer to two things. Firstly, it is used \nas a synonym for the output generated by the qualitative simulator in the simulation \nenvironment. Secondly, it is used to designate the process of qualitative reasoning \nitself, which is used to generate the simulation output. The simulation environment in \nthe Garp3 software provides control to the reasoning process to be able to follow each \nstep of the simulation, therefore distinguishing the concepts of full simulation, which \nrefers to the complete simulation with the resulting state-graph, from that of partial \nsimulation, which is an incomplete simulation and state-graph. \nA.8.2 Simulation Output \nSimulation output refers to the state-graph generated by the qualitative reasoning \nengine as a result of simulating a qualitative model by providing a scenario as input. \nA.8.3 The notion of State \n \n",
  "speaker": "SYSTEM",
  "uuid": "b744da72-56db-432c-8104-3a4bbc844f9f"
}