{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Charlas2010 \n\nDate\nPlace\nSpeaker\nTopic\n15 January (15:00)\nH-1002\nMichel Dumontier\nBio2RDF and Beyond! Large Scale, Distributed Biological Data Integration (\nhttp://www.dia.fi.upm.es/index.php?mact=News,cntnt01,detail,0&cntnt01articleid=69&cntnt01lang=es_Es&cntnt01returnid=83&hl=es_ES\n)\n4 February\nH-1002\nAsun\nNuevo protocolo de viaje para la OTT\n11 February\nH-1005\nJean-Paul\nSemSorGrid4Env: Semantic Integration of Streaming Data\npdf\n18 February\nH-1005\nIdafen SP\ngLite and Gridway Overview\n25 February\nSala Grados\nMiguel Angel, Freddy, Oscar Muñoz\nNeOn Toolkit demo\n4 March\nH-1005\nCarlos Moya\nIntroducción a Maven - Artifactory, un repositorio Maven - Instalación automática de un puesto de desarrollo (plugin DevTools)\n11 March\nH-1005\nCarlos Buil Aranda\nResumen evento\nDev8d\nen Londres. Clojure, Google API, Amazon EC2, Linked Data meetup, etc.\nlas transparencias\n18 March\nH-1005\nTobias Wunner\nTobias is working in the recently started Monnet project, and he will present the work that DERI-NUIG has carried out on the lexicalization of ontologies with LexInfo.\n25 March\nSEALS project presentation: Goals, work at UPM, etc.\n8 April\nErnesto Jimenez\n\"Logic based-support for Ontology Development: reuse, collaboration and\nintegration.\" Prominent examples of ontologies in the life sciences are the National Cancer\nInstitute (NCI) Thesaurus, the Systematised Nomenclature of Medicine\nand Clinical Terms (SNOMED CT), the Gene Ontology (GO), the Foundational Model\nof Anatomy (FMA), and GALEN. These ontologies are rather large and complex to\nmanage; for example, SNOMED currently describes more than 300,000 concepts\nwhereas NCI and FMA describe around 70,000 concepts. Thus, collaboration, reuse\nand integration arise as the three core challenges within the development tasks\nof both previous large biomedical ontologies and application ontologies.\nWe have implemented a set of logic-based methods to provide support to the\ndevelopment of ontologies. These methods are based on the use of \nontology modularization and ontology debugging techniques.  Ontology\nmodularization will provide us with a mechanism to both reuse knowledge\nand reduce scalability problems; wehreas ontology debugging techniques will\nanalyze the logic impact of ontology evolution and ontology integration.\n15 April\nSala de Grados\nEsther Nuñez, Raziel Valle, Daniel, Miguel García, María Poveda, Ghislain Atemezing, ...\nMaster students that plan to carry out a Ph.D. should make a 10 minutes presentation including: (1) work done in his/her MS.C thesis and (2) an open research problem to be solved in his/her potential Ph.D thesis.\nWork in OEG\n[1]\n,\nMaría's slides\n22 April\nSala de Grados\nÓscar Muñoz, Francisco Martin-Recuerda, Esther Lozano\n28 April\nH-1002\nBoris Villazón-Terrazas\nPrelectura de Tesis\n6 May\nH-1002\nBrenda Nguyen, Andrés García, José Mora\nBrief presentations of the ongoing theses. Files:\njmora\n,\nAndresGarcia\n13 May\nH-1002\nMaría Poveda y Oscar Muñoz\nTutorial\nbásico\nde NeOn Toolkit (\nPara descargar NTK\n).\nSe recomienda llevar el portátil para ir practicando durante la charla.\nSi necesitais regletas para el portátil enviad un correo a Raúl Alcazar.\nMini ejemplo\n20 May\nH-1002\nMariano Rico\n(Moveable from previous week) Brief (30 min.) presentation of his work on virtual worlds, specifically on the\nV-LeaF\nproject.\n27 May\nH-1002\nJosé Mora\n1\n, Carlos Buil\n2\n1\nEvaluation of the prototypes in the thesis (15mn),\n1\nWorkplan\nfor ISI stay (15mn),\n2\nThesis progress and future work (15mn)\nThe slides\n.\n3 June\n10 June\n1005\nManuel Salvadores (Universidad de Southampton)\nManuel presentará algunos resultados del proyecto enAKTing\n17 June\nH-1002\nIgor Boguslavsky\nAnálisis semántico de los textos utilizando una ontología. Resumen:\nSe presenta un proyecto que se está realizando junto con el Laboratorio de Lingüística Computacional del Instituto de Problemas de Transferencia de Información de la Academia de Ciencias de Rusia. El objetivo del proyecto es crear un analizador semántico de los textos que pueda utilizarse para la Extracción de Información, sistemas Pregunta-Respuesta, para la anotación semántica y otras aplicaciones.\nEl analizador semántico es un modulo del sistema ETAP-3 que es un procesador lingüístico multifacético y multilingüe capaz de analizar y generar textos en varias lenguas. El fundamento teórico del sistema ETAP-3 es la teoría “Sentido – Texto” (“Meaning–Text” Theory). Las opciones principales de ETAP-3 son: Traducción Automática, Conversión del texto en la interlingua UNL, Generación del texto desde la interlingua UNL, Paráfrasis basadas en las Funciones Léxicas, Anotación sintáctica y léxico-funcional del corpus.\nEl analizador semántico reutiliza los módulos del análisis morfológico y sintáctico del ETAP-3 y los complementa con un módulo del análisis semántico. Las estructuras semánticas construidas por el analizador interpretan el contenido de la oración en términos de la ontología. Se mostrarán ejemplos de las estructuras semánticas y se centrará en la interfaz entre el diccionario del lenguaje natural y la ontología.\n24 June\n6 July, Tuesday, 11:00\nH-1005\nMercè Lorente: Directora del IULA, Universidad Pompeu Fabra y Jorge Vivaldi:\nPresentación del IULA y las herramientas de PLN con las que cuentan: extractor de términos, analizadores, corpus, etc.\n8 July\nH-1005\nDirk Walther\nModularity in Description Logic Ontologies\n22 July\nH-1002\nISWC papers meeting\nUPnP (Mariano)\npdf\n,\nBorrador jmora\n,\nSemantic Techniques for Enabling Knowledge Reuse in Conceptual Modelling (draft)\n,\nEnabling Ontology-based Access to Streaming Data Sources\n,\nSemantic Annotation of Geospatial RESTful Services Using External Resources\n,\nSemantic Grounding of Cross-Lingual Folksonomies Andrés\n,\nA Catalogue of Recurrent Pitfalls in Ontology Modelling\n29 July\nH-1002\nBrainstorming session sobre geo.linkeddata.es\n1 October (Friday)\nH-1005\nAlex\nUsing Google App Engine for an RDF triple store (\nDraft paper\n)\n7 October\nH-1005\nJose Mora\nWork at ISI (USC) and possibilities ahead.\nFile\n14 October\nJorge Gracia\nDynaLearn: project presentation, current status, and future work.\n21 October\nH-1002\nEsther Lozano\nWork at HCS, UvA and ongoing research line on recommendation.\nESWC Paper discussion\n28 October\nH-100\nJean-Paul\nInternship at UNIMAN, Semantic Streaming Data Access.\npdf\n4 November\nH-1002\nCésar, Daniel\nTrabajo realizado // overview del trabajo que se realiza en el W3C incubator group y avances en el web n+1\n11 November\nH-1005\nCarlos Buil\nWork done in Santiago, Chile. SPARQL 1.1 Fed extension, well designed patterns, optimisation, ...\nslides\n18 November\nElena\nMonnet: project presentation, current status, and future work.\n25 November\nOscar\nCómo hacer evaluaciones y experimentaciones con sistemas de\ncrowd\n2 December\nH-1005\nBoris\nPresentación realizada en el Triplification Challenge de este año en Graz.\nSlides\n9 December\nDaniel\nOpen Provenance Model: Overview, examples and mapping between provenance vocabularies.\nSlides\n16 December\n23 December\nH-1005\nCésar\nAcceso multilingüe a ontologías y Linked Data",
  "speaker": "SYSTEM",
  "uuid": "b7b39c5f-d4fe-494a-bab4-f10769c7bb77"
}