{
  "message": "SYSTEM: Wiki: IDEKO - CENTRO TECNOLOGICO ESPECIALIZADO EN TECNOLOGIAS DE FABRICACIÓN\nOFERTA DE EMPLEO\nNOMBRE PUESTO DE TRABAJO:\nResponsable de equipo -Línea de Investigación: Software de Automatización Inteligente\nAMBITO DE NECESIDAD:\nLínea de Investigación: Software Inteligente\nDesarrollo de soluciones de automatización y software avanzado (incorporan los últimos avances en el entorno de las TICs) que utilizan técnicas de inteligencia artificial para mejorar los procesos productivos de diferentes máquinas.\nREQUISITOS PARA EL PUESTO:\nFormación: Doctor en Informática o Ingeniería Superior\nIdiomas: Inglés alto, hablado y escrito.\nExperiencia mínima:\n* 5 años gestionando proyectos y equipos de trabajo en temáticas de software, tanto en investigación como en aplicación.\n * Experiencia demostrable en proyectos con cliente en entornos de fabricación y automatización.\n * Experiencia en la gestión y liderazgo de proyectos de investigación de dimensión nacional e internacional y complejidad alta: preparación de propuestas y descargos, formación de consorcios, interlocución con las Administraciones Públicas.\n * Publicaciones en revistas indexadas y congresos internacionales.\nConocimientos:\n* Especialista en temáticas de investigación en tecnologías TIC aplicadas a entornos productivos: tratamiento de señal, inteligencia artificial, comunicaciones...\n * Conocimiento del sector de máquina herramienta, tecnologías de fabricación y automatización.\nOtros requisitos:\n* Contactos con Universidades, Centros y organismos de investigación a nivel europeo\nValorable:\n* Conocimientos de otros idiomas (alemán, francés..)\nObservaciones:\n* Se piensa en una persona dinámica, con capacidad de liderazgo y trabajo en equipo, con capacidad técnica y compromiso organizacional. Innovación y creatividad. Capacidad de trato con el cliente.\n * Coche propio y disponibiliad para viajar.\nPUESTO DE TRABAJO:\nFunciones:\n* Liderar el desarrollo profesional de sus colaboradores en la Línea y colaborar en la configuración de equipos de proyecto.\n * Definir el plan de desarrollo de la línea: proyectos genéricos, acciones de captación de tecnología o conocimiento.\n * En colaboración con el Rble. De Desarrollo Científico, determinar el nivel de conocimientos adecuado a la demanda existente, estableciendo los medios necesarios para el mantenimiento o impulso de la línea tecnológica / temática previsto desarrollar internamente ( según Plan Tecnológico de la organización, Plan de Inversiones y Plan de Formación)\n * Elaborar y ejectuar los objetivos y planes para la gestión cient´ficia, tecnológica y de explotación de la línea de investigación, asgurando los resultado.\n * Colaborar con otros responsables de la organización, en la captación de proyectos de interés para la línea (proyectos de investigación, de transferencia tecnológica...) participando en diferentes fases: relaciones con entidades y organismos públicos o privados, elaboración de propuestas de proyectos...\n * Proponer convenios / alianzas tecnológicas en su ámbito de actuación.\n * Colaborar en la optimización de los recursos disponibles para la ejecución de los proyectos, a fin de generar la satisfacción de los clientes y de las personas que participan en la actividad.\n * Realizar publicaciones científicas a partir de los resultados de las investigaciones desarrolladas, siendo referente científico/técnico en su ámbito de investigación.\nSE OFRECE:\nSe ofrece incorporación a un Centro Tecnológico referente en Tecnologías de Fabricación e intregración en un equipo altamente cualificado.\nRetribución: Según valía de candidatura\nTipo de contrato: indefinido ( Contrato Inicial: 1 año)\nPlazo incorporación: Inmediata\nEnviar CV. A:\nDpto. Recursos Humanos\nLourdes García Renilla (lgarcia@ideko.es) IDEKO S.Coop\nArriaga Industrialdea,2\nE-20870 Elgoibar- Gipuzkoa\nTlf. +34 943 74 80 00\nFax +34 943 74 38 04\nwww.ideko.es",
  "speaker": "SYSTEM",
  "uuid": "b820dd3f-b864-4167-bfaf-beeba87ee9e4"
}