{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 54\n52\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nSpeech Technology Drivers and Inhibitors\nThe following table presents macroeconomics, global megatrends, specific market trends and labour supply‐\nfactors that might affect the speech market.\nMarket Force\nAssumption\nImpact\nTime\nFrame\nAccelerator\n/Inhibitor/\nNeutral\nCertainty of\nAssumption\nMacroeconomics\nEconomic situation\nThere is a strong correlation between the economy\nand IT expenditures. The global economy situation is\nimpacting IT budgets, business and consumer confi-\ndence, the availability of credit and private investment,\nand internal funding.\nHigh\nShort-term\nInhibitor\n\n\nGlobal megatrends\nMobile\nSpending on mobile devices will grow 23%, driving\n43% of IT growth; a mobile strategy is priority number\none for all industry players in 2012. Consumers are\ninterested in personalised services which could be\nenabled through LT technologies.\nHigh\nShort-term\nAccelerator\n\n\nCloud Computing\nCloud as a new paradigm of computing that is reshap-\ning IT will help to evolve speech technologies. The key\nadvantage to cloud services should be the ability of IT\norganizations to shift IT resources from maintenance to\nnew initiatives. IDC estimates that cloud services (pub-\nlic cloud) increased 34% in 2010 to nearly $22 billion,\nor about 1.6% of IT spending, and that percentage\nshould increase to 3% by 2014.\nHigh\nMedium-\nterm\nAccelerator\n\n\nBig Data\nThe data growth is pushing the need for storage,\nanalysis and big data technologies. The latter has\nintersection with LT technologies and its growth will\npush new developments and  revenues for Lt vendors.\nHigh\nMedium-\nterm\nAccelerator \n\n\nSmart Verticals\nCloud, mobile, social and big data / analytics are the\nbase for the vertical industry evolution. Many organiza-\ntions have started the path to become a smart vertical:\nindustries generating new competitive advantages\nbased on the third platform pillars.\nModerate\nLong-term\nAccelerator\n\n\nOpen source\nNowadays, there are few speech open source projects.\nHowever, open source has the potential to transform\nthe speech services industry. For example, siri-based\nvirtual assistant for Android, a mobile open platform, is\nhelping to educate new potential customers.\nLow\nLong-term\nAccelerator\n\n\nPrivacy and secu-\nrity\nAs speech analytics, new services and data insights\nincrease, new concerns about the privacy and security\nof such data appears. Organizations must not only pro-\ntect against new threats but to respect the limits of the\nprivate lives of their employees, partners and cus-\ntomers.\nModerate\nMedium-\nterm\nInhibitor\n\n\nEmerging\nmarkets \nHigh\nMedium-\nterm\nAccelerator\n\n\nSpecific market trends\nMultilingual speech\nrecognition costs\nHigh quality voices requires high quality sources. The\nleast common is a language the more expensive and\ntime consuming will be the requires audio resources.\nThis barrier increases the multilingual speech recogni-\ntion costs.\nHigh\nShort-\nterm\nInhibitor\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "b899aac4-e80b-42da-8412-105d53e013e9"
}