{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 12\nTable 5. Pitfall “P9. Missing basic information” \nName \nP9. Missing basic information \nDescription \nThis pitfall entails not representing part of the information needed that should be included in the ontology.  \nSome of  cases in which this pitfall can appear are: \n \nTo create a relation and to miss its inverse relation (e.g., “hasDescendant” and “isDescendantOf”). \n \nTo create a relation and to miss its complementary relation if necessary (e.g., “startsIn” and “endsIn”).  \n \nTo miss an explicit taxonomy when it is known. \n \nTo miss the relation between classes and their instances. \nRecommendation \nIt is recommended to apply the following actions to develop a more complete ontology:  \n \nWhen a relationship is created, to check if any inverse relationship exists, and if so, then to add also \nthat relationship and create them as inverse. In this way, we could take advantage of the reasoning \npower of the inverse relationships.  \n \nWhen a property (relation or attribute) is created, to check if any complementary property exists, and if \nso, then to add also that property. \n \nWhen a class is included in the ontology, to check if it can be subclass or superclass of other existing \nclass in the ontology. In this way, we could take advantage of the reasoning power of the inheritance \ndue to make explicit taxonomical knowledge. \n \nWhen an instance is included in the ontology, to check if there are classes in the ontology to which the \ninstance can belong. In this way, we could take advantage of the reasoning power of the inheritance. \nExample \nThis example shows a particular situation that refers to the second case in the „description‟ slot. \nIn the non recommended scenario, we can observe that the relation “startsIn” is included in the ontology to \nrepresent that the routes have as starting point a location; however, the complementary relation (that is, \n“endsIn”) is not included in the ontology. \nIn the recommended scenario, the ontology contains both the relation “startsIn” and the relation “endsIn” \nwith its domain (“Route”) and its range (“Location”). \nNot Recommended \nRecommended \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "b8d1a26f-cba0-4e89-a1ed-815cb871a535"
}