{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 4\nParticipación en Proyectos de I+D financiados en Convocatorias públicas.  \n \n \n(nacionales y/o internacionales) \nTítulo del proyecto: “Geobuddies: servicios basados en comunidades de usuarios para dispositivos móviles en el Camino de \nSantiago” \nEntidad financiadora: Ministerio de Educación y Ciencia \nEntidades participantes: Universidad Politécnica de Madrid y Universidad de Santiago de Compostela. \nDuración,  desde: 2007 \n \nhasta: 2010 \nInvestigador responsable: del proyecto: A. Gómez Pérez \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “NeOn: Lifecycle Support for Networked Ontologies” \nEntidad financiadora: Comisión Europea \nEntidades participantes: Universidad Politécnica de Madrid, iSOCO, Open University (Reino Unido), Universidad de \nKarlsruhe (Alemania), Software AG (Alemania), Instituto Josez Stephan (Eslovenia), INRIA (Francia), Ontoprise (Alemania), \nLaboratorios KIN (España), Universidad de Sheffield (Reino Unido), Universidad de Koblenz Landau (Alemania), FAO, Atos \n(España). \nDuración,  desde: 2006 \n \nhasta: 2010 \nInvestigador responsable: del proyecto: A. Gómez Pérez \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “Generación Automática de correspondencias entre ontologías con aplicación al análisis de bases de \ndatos de genómica y proteómica” \nEntidad financiadora: Universidad San Pablo CEU \nEntidades participantes: Universidad San Pablo CEU con la colaboración del Centro Nacional de Biotecnología del CSIC \nDuración,  desde: 2005 \n \nhasta: 2007 \nInvestigador responsable: del proyecto: M. Fernández López \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “Infraestructura tecnológica de servicios semánticos para la Web Semántica” \nEntidad financiadora: Ministerio de Ciencia y Tecnología \nEntidades participantes: Universidad Politécnica de Madrid \nDuración,  desde: 2004 \n \nhasta: 2007 \nInvestigador responsable: del proyecto: A. Gomez-Perez \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “Descubrimiento dinámico de servicios en WebODE”. Proyecto Bilateral Hispano-Francés. 2003-2004. \nEntidad financiadora: Ministerio de Educación y Cultura \nDuración,  desde: 2003 \n \nhasta: 2004 \nInvestigador responsable: del proyecto: Asunción Gómez Pérez y Farouk Toumani \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “PIKON: Personal Information and Knowledge Organiser Network\" \n \nEntidad financiadora: Universidad Poltécnica de Madrid \nDuración,  desde: 2002 \n \nhasta: 2004 \nInvestigador responsable: del proyecto: Mariano Fernández López \nNúmero de investigadores participantes:     \n \nTítulo del proyecto: “Esperonto: Application Service Provision of Semantic Annotation, Aggregation, Indexing and Routing of \nTextual, Multimedia, and Multilingual Web Content” \n \nEntidad financiadora: Comisión Europea \nDuración,  desde: 2002 \nhasta: 2005 \nInvestigador responsable: del proyecto:  \nNúmero de investigadores participantes:     \n",
  "speaker": "SYSTEM",
  "uuid": "b91e605f-066d-4863-9cdd-c6b5357b48a2"
}