{
  "message": "SYSTEM: Neonglossaryofactivities.pdf: Página 3\n\u0001\u0002 Ontology Module Extraction refers to the activity of obtaining from an ontology \nconcrete modules to be used for a particular purpose (e.g. to contain a particular \nsub-vocabulary of the original ontology). \n \n\u0001\u0002 Ontology Partitioning refers to the activity of dividing an ontology into a set of \n(not necessary disjoint) modules that together form an ontology and that can be \ntreated separately. \n \n\u0001\u0002 Ontology Population is a knowledge acquisition activity that relies on (semi-) \nautomatic methods to transform unstructured (e.g. corpora), semi-structured (e.g. \nfolksonomies, html pages, etc.) and structured data sources (e.g. data bases) \ninto instance data (e.g. A-Box).  \n\u0001\u0002 Ontology Pruning refers to the activity of discarding conceptual structures (e.g., \npart of T-Box) of a given ontology that are not or no longer relevant. \nNote: Pruning is mostly used in combination with ontology learning methods to \ndiscard potentially irrelevant learned concepts/relations. \n\u0001\u0002 Ontology Quality Assurance refers to the activity of assuring that the quality of \neach and every process carried out and product built (ontology, software and \ndocumentation) is satisfactory.   \n\u0001\u0002 Non Ontological Resource Reengineering refers to the process of retrieving \nand transforming an existing non ontological resource (data bases, controlled \nvocabularies, etc.) into an ontology.  \n\u0001\u0002 Ontology Reengineering refers to the process of retrieving and transforming a \nconceptual model of an existing and implemented ontology into a new, more \ncorrect and more complete conceptual model which is reimplemented.   \n\u0001\u0002 Ontology Restructuring refers to the activity of correcting and reorganizing the \nknowledge contained in an initial conceptual model, and detecting missing \nknowledge.  \nNote: This process contains two phases: analysis and synthesis. The ''analysis \nphase goal'' is to evaluate the ontology technically, that is, to check that the \nhierarchy of the ontology and its classes, instances, relations and functions are \ncomplete (contain all the definitions required for the domain of chemical \nsubstances), consistent (there are no contradictions in the ontology and with \nrespect to the knowledge sources used), concise (there are no explicit and \nimplicit redundancies) and syntactically correct. The ''synthesis phase'' seeks to \ncorrect the ontology after the analysis phase and document any changes made. \n\u0001\u0002 Ontology Repair refers to the activity of resolving errors (incompleteness, \nincorrecteness) in the ontology and it is triggered by ontology diagnosis. \n \n\u0001\u0002 Non Ontological Resource Reuse refers to taking available non ontological \nresources (data bases, controlled vocabularies, etc.) for the development of \nontologies.  \n\u0001\u0002 Ontology Reuse refers to using an ontology or an ontology module in the \nsolution of different problems. Ontology reuse is the activity that allows employing \nan ontology or an ontology module in, for example, the development of new \nontologies, the development of different ontology-based applications, the activity \nof ontology aligning (as background knowledge), etc. \n\u0001\u0002 Ontology Reverse Engineering refers to the activity of outputting a possible \nconceptual model on the basis of the code in which the ontology is implemented. \n",
  "speaker": "SYSTEM",
  "uuid": "b96e7257-54d4-4e33-a678-ad268e96d57d"
}