{
  "message": "SYSTEM: Wiki: Research Assistant or Research Associate\nDepartment of Computing / Department of Primary Care and Public Health\nResearch Assistant salary: £26,860 – £29,850 per annum\nResearch Associate salary: £30,680 - £36,040 per annum\nFixed Term Appointment until 21 September 2013\nPreferred starting date May 2011 or as soon as possible thereafter\nThe Department of Computing is a leading department of Computer Science among UK Universities. It has consistently been awarded the highest research rating (5*) in Research Assessment Exercises (RAE), coming 2nd in the 2008 RAE, and was rated as \"Excellent\" in the previous national assessment of teaching quality.\nAn opportunity has arisen for either a Research Assistant or Research Associate to join an international/cross-discipline team creating a rapid learning healthcare system to improve patient safety and volume of clinical research in Europe. This is an exciting opportunity for an individual with a keen interest in data provenance who is looking to gain experience in medical informatics. The aim of the research is to design and develop an extensible provenance framework to be integrated into the decision support and data mining engines to ensure auditability and accountability.\nThis position will be responsible for building upon some initial provenance design work in the project to produce a reliable framework for the partners to use. Also, the person will contribute to the development of novel data mining models for translational data.\nTo apply for this position, it is essential that you have experience of provenance, databases, data mining and carrying out research.  For the Research Associate level post you must also have experience in the management and analysis of complex data, experience of applying relevant models, techniques and methods, and developing new ones and a record of publications in peer-reviewed journals.\nFor a Research Assistant position you will have a Masters degree (or equivalent) in Computing or Medical Informatics or a related subject.  For a Research Associate position you will have a PhD degree (or equivalent) in Computing or Medical Informatics or a related subject.\nYou must have excellent communication skills and be able to organise your own work with minimal supervision.  All applicants must be fluent in English.\nYou will be part of the Department of Computing and Department of Primary Care and Public Health based at the South Kensington campus with one day per week at the Charing Cross campus.\nFor further details of the Transform project please see: www.transformproject.eu/\nHow to apply:\nOur preferred method of application is online via our website at:\nhttp://www3.imperial.ac.uk/employment\n(please select “job search” then enter the job title or vacancy reference number EN20110045BD into “keywords”).\nApplications must include:\n- A college application form quoting job reference number Transform-JD-03-11\n- A full CV\n- A 2 page research statement indicating what you see are interesting research issues relating to the above post and why your expertise is relevant.\nShould you have any queries regarding the application process please contact Joanne Day by email to: research.officer@doc.ic.ac.uk\nPriority consideration will be given to staff at risk of redundancy.\nClosing Date: 8th April 2011\nCommitted to equality and valuing diversity. We are also an Athena Silver SWAN Award winner, a Stonewall Diversity Champion and a Stonewall Top 100 Employer 2011.",
  "speaker": "SYSTEM",
  "uuid": "bb5b479c-1076-41c0-bc65-2b3e5a617531"
}