{
  "message": "SYSTEM: Wiki: Titulo opcionales:\nModelos de Navegación y Composición de Vistas en aplicaciones Web. Aplicación a la Web Semántica.\nContenido\n\nEn esta tesis se estudia el estado actual de los desarrollo de aplicaciones web identificando carencias, estas son:\nFalta de formalismo en los modelos utlizados para expresar la nevegación\nOmision de expresar las restricciones implicitas de los modelos\nLas validaciones se hacen en la fase de implementación y no en fases previas\nEn muchos desarrollos no se tiene en cuenta ni los distintos tipos de usuarios ni los dispositivos de donde se visualizan\nFalta de reutilizacion para aplicaciones similares\nEn esta tesis intenta abordar estos problemas proponiendo unos modelos de navegación y composicion de vistas como objetivo principal de la tesis, y como estos modelos se pueden utilizar para pesronalizar visualizaciones y nevegaciones dependiendo del usuario y del dispositivo con el que se conecta.\nEstos modelos se expresean formalmente indicando las restricciones que son implicitas en el modelo, pudiendo asi evaluar estos modelos en la fases de diseño, anterior a la fase de implementacion de la aplicacion Web.\nSe ha aplicado estos modelos a las ontologias y se ha especificado como desarrollar una aplicacion Web utilizando esta representación de la informacion. Aprovechandose de que las ontologias es un conocimiento reutilizable, los modelos propuestos se enfocan para que sigan el mismo camino de la reutilización. De la misma forma que se elige una ontologia de un dominio y se aplica reingenieria para adaptarla a una aplicacion en caso de no ajustarse a las necesidades del usuario, tambien se puede reutilizar navegaciones y composiciones de vistas utilizas previamente bajo las mismas ontologias en otra aplicacion Web, aplicando tareas simalares a las ontologias en la reingeniera para adaptar estos modelos a la nueva aplicacion Web.\nComo resultado tecnologico de esta tesis se presenta la platforma para desarrollar aplicaciones Web basada en ontologias para la Web semantica\nODESeW\n. Esta plataforma se ha utiliza en varias aplicaciones compartiendo dominio de los datos, y reutilizando en su mayoria los grafos de navegacion y composicion de vistas.",
  "speaker": "SYSTEM",
  "uuid": "bb609171-3b97-4244-8371-a3bb8b46413e"
}