{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 19\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11168\nSubvenciones, para limitar el contenido de la cuenta justificativa en virtud de la naturaleza \nde estas ayudas, y dado el carácter estable de los beneficiarios y la prolijidad de la \ndocumentación justificativa propia de este tipo de subvenciones, contendrá con carácter \ngeneral la siguiente documentación:\na)  Memoria de actuación científico–técnica, justificativa del cumplimiento de las \ncondiciones impuestas en la concesión de la ayuda, con indicación de las actividades \nrealizadas y de los resultados obtenidos.\nb)  Memoria económica justificativa del coste de las actividades realizadas, que \ncontendrá:\n1.º  Fichas justificativas normalizadas, o cualquier otro medio que se habilite al efecto, \ny certificación de los gastos y pagos realizados. Los documentos acreditativos del gasto y \ndel pago quedarán en poder de los beneficiarios, a disposición de los órganos de \ncomprobación y control.\n2.º  En su caso, justificación de los costes indirectos imputados, con base en los \ncriterios de reparto de los mismos que se establezcan en las instrucciones de ejecución y \njustificación, que se encontrarán disponibles en la página web del MICINN.\n3.º  En su caso, relación detallada de otros ingresos o ayudas percibidas que hayan \nfinanciado la actividad incentivada, con indicación de su importe y procedencia.\n4.º  En su caso, acreditación del reintegro de remanentes no aplicados.\nLos plazos y la forma de presentación de la memoria de actuación científico-técnica se \nespecifican en el artículo 37.\nLa memoria económica justificativa deberá remitirse, con carácter anual, al órgano \nconcedente, antes del 1 de abril de cada año con los gastos efectuados hasta el 31 de \ndiciembre del año anterior, utilizando los modelos y medios telemáticos habilitados para \nello en la página web http://www.micinn.es.\nLa comprobación formal para la liquidación de la subvención se realizará de modo \nexhaustivo sobre las cuentas justificativas presentadas. Las facturas o documentos de \nvalor probatorio análogo que sustenten dichas cuentas serán objeto de comprobación en \nlos cuatro años siguientes sobre la base de una muestra representativa, a cuyo fin el \nórgano concedente podrá requerir a los beneficiarios la remisión de los justificantes que \ncompongan dicha muestra, así como realizar los controles recogidos en cada uno de los \nplanes anuales de actuación mencionados en el artículo 85 de la Ley General de \nSubvenciones.\n2.  En caso de extinción o de rescisión del contrato para el que se hubiese concedido \nfinanciación, los fondos no invertidos, así como los intereses de demora devengados, \ndeberán ser reintegrados al Tesoro Público. De manera general, el criterio para determinar \nel remanente no aplicado será la proporción del tiempo no ejecutado del contrato \nincentivado.\nArtículo 37.  Seguimiento y control.\n1.  El seguimiento científico-técnico del trabajo realizado por el personal investigador \nen formación corresponde al órgano concedente, que establecerá los procedimientos \nadecuados para ello y que podrá designar los órganos, comisiones o expertos que estime \nnecesarios para realizar las oportunas actuaciones de seguimiento y comprobación de la \naplicación de la ayuda y recabar la presentación de la información complementaria que \nconsidere oportuna.\n2.  Para la realización del mencionado seguimiento los Centros de I+D de adscripción \nde las ayudas deberán presentar a la Dirección General de Investigación y Gestión del \nPlan Nacional de I+D+i mediante los medios habilitados para ello:\na)  Durante el mes en el que finalice la fase de beca, un informe del personal \ninvestigador en formación con el visto bueno del investigador principal del proyecto de \nadscripción de la ayuda, sobre las actividades realizadas y sus resultados durante el \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "bb8bfdc9-c230-4ad4-be13-3e5ba729b38f"
}