{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 16\nReferences \n1. Aguado De Cea, G., Gómez-Pérez, A., Montiel-Ponsoda, E., and Suárez-Figueroa, M.C. \nNatural Language-Based Approach for Helping in the Reuse of Ontology Design Patterns. \nIn Proceedings of the 16th International Conference on Knowledge Engineering (EKAW), \npp. 32-47. (2008) \n2. Blomqvist, E., Gangemi, A., Presutti, V. Experiments on Pattern-based Ontology Design. In \nProceedings of the Fifth International Conference on Knowledge Capture (K-CAP), pp. 41-\n48. (2009) \n3. Clark, P., Thompson, J., Porter, B. W. Knowledge Patterns. In KR2000: Principles of \nKnowledge Representation and Reasoning. pp. 591-600. (2000). \n4. Gangemi, A., Catenacci, C., Ciaramita, M., Lehmann J. Modelling Ontology Evaluation and \nValidation. Proceedings of the 3rd European Semantic Web Conference (ESWC2006), \nnumber 4011 in LNCS, Budva. 2006 \n5. Gómez-Pérez, A., Fernández-López, M., Corcho, O. Ontological Engineering. November \n2003. Springer Verlag. Advanced Information and Knowledge Processing series. ISBN 1-\n85233-551-3. (2003) \n6. Gómez-Pérez, A. Ontology Evaluation. Handbook on Ontologies. Pages: 251-274. 2004. \nISBN: 3-540-40834-7. S. Staab and R. Studer Editors. Springer. International Handbooks on \nInformation Systems. (2004) \n7. Guarino. N., Welty. C. An overview of OntoClean. In The Handbook on Ontologies, (S. \nStaab and R. Studer, eds.). Berlin: Springer-Verlag, 2009. \n8. Noy, N.F., McGuinness. D. L. Ontology development 101: A guide to creating your first \nontology .Technical Report SMI-2001-0880, Standford Medical Informatics. (2001)  \n9. Poveda, M., Suárez-Figueroa, M.C., Gómez-Pérez, A. Common Pitfalls in Ontology \nDevelopment. In “Current Topics in Artificial Intelligence, CAEPIA 2009 Selected Papers”. \nSpringer LNAI 5988. Editors: P. Meseguer, L. Mandow, R. M. Gasca. Pp: 91-100 (2010) \n10. Poveda, M., Suárez-Figueroa, M.C., Gómez-Pérez, A. Ontology Analysis Based on \nOntology Design Patterns. WOP 2009 – Workshop on Ontology Patterns at the 8th \nInternational Semantic Web Conference (ISWC 2009). Proceedings of the WOP 2009. \nISBN: ISSN 1613-0073. CEUR Workshop Proceedings. pp: 155-162. Washington, DC. 25 \n(2009) \n11. Rector, A., Drummond, N., Horridge, M., Rogers, J., Knublauch, H., Stevens, R.,; Wang, \nH., Wroe, C. Owl pizzas: Practical experience of teaching owl-dl: Common errors and \ncommon patterns. In Proc. of EKAW 2004, pp: 63–81. Springer. (2004) \n12. Suárez-Figueroa, M.C. PhD Thesis: NeOn Methodology for Building Ontology Networks: \nSpecification, Scheduling and Reuse. Spain. Universidad Politécnica de Madrid. June 2010. \n13. Suárez-Figueroa, M.C., Gómez-Pérez, A., Villazón-Terrazas, B.. How to write and use the \nOntology Requirements Specification Document. In Proceedings of the 8th International \nConference on Ontologies, DataBases, and Applications of Semantics (ODBASE 2009). On \nthe Move to Meaningful Internet Systems: OTM 2009. (Robert Meersman, Tharam Dillon, \nand Pilar Herrero) (ISBN: 978-3-642-05150-0). LNCS 5871. Volume: Part II Pp: 966-982. \nVilamoura, Algarve-Portugal. November 2009 \n",
  "speaker": "SYSTEM",
  "uuid": "bc36c7d1-3bde-49fb-9e77-db6e7865b614"
}