{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 72\nPage 72 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n Outcomes: The principal output is an ontology network that represents the expected domain \nimplemented in an ontology language (OWL, F-Logic, etc.). Additionally, a broad range of \ndocuments including the requirements specification, the ontology documentation, the ontology \nevaluation, etc. will be generated as output of different activities. \nFurthermore, a merged ontology or ontology module, taken from those selected for reuse, and \na reengineered merged ontology or ontology module are generated. Alignments between the \nselected ontologies or ontology modules are also outputs of this scenario. \n4.7. Scenario 7: Building Ontology Networks by Restructuring Ontologies or \nOntology Modules \n Assumptions: It is supposed that software developers and ontology practitioners “want” to \nrestructure ontologies or ontology modules.  \n Prerequisite resources: Knowledge of the domain (general or specific) of the ontology \nnetwork to be developed should be available for building the ontology network. \n Sequence of activities: After the ontology conceptualization activity, software developers and \nontology practitioners could carry out the ontology restructuring activity (scenario 7 in Figure \n20). This activity can include different “sub-activities”, as shown Figure 27.  \n \nFigure 27. Ontology Restructuring Activity \nThe ontology restructuring activity can be performed in the following ways: \n \nModularizing the ontology in different ontology modules to facilitate their reuse. \n \nPruning the branches of the taxonomy not considered necessary. \n \nExtending the ontology including (in width) new concepts and relations. \n \nSpecializing those branches that require more granularity and including more \nspecialized domain concepts and relations. \nAfter this restructuring activity, the resulting conceptual model should be integrated in the \nconceptualization activity in scenario 1 (Section 4.1). \n Outcomes: The principal output is a conceptual model of the ontology network that represents \nthe expected domain.  \n",
  "speaker": "SYSTEM",
  "uuid": "bca3efc6-b3e8-4a19-8aaf-3d2d70e7cf36"
}