{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 4\n \n \n4\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \n3.2. Los períodos de disfrute de otras ayudas similares, según el criterio del Vicerrectorado \nde \nInvestigación, \nserán \ndescontados \ndel \ncómputo \ntotal \nde \nesta \nayuda \nproporcionalmente por el tiempo en que el solicitante hubiera disfrutado de aquella. \n3.3. Durante el período de beca, el personal investigador en formación tendrá derecho a la \ninterrupción temporal de la misma, únicamente en los siguientes supuestos: \nincapacidad temporal (enfermedad o accidente), riesgo durante el embarazo y \ndescanso por maternidad o paternidad debidamente acreditadas, de acuerdo con la \nnormativa vigente. Durante todo el tiempo de permanencia en dicha situación la UPM \ncomplementará la prestación económica de la Seguridad Social hasta alcanzar el \n100% de la cuantía mensual de la ayuda. En este caso, el tiempo interrumpido podrá \nrecuperarse siempre que este sea por períodos de, al menos, 30 días y que las \ndisponibilidades presupuestarias lo permitan. \nAsimismo, durante la fase de beca se podrá interrumpir la ayuda por causas \ndiferentes, aceptadas por el Vicerrectorado de Investigación, que las incluidas dentro \nde la cobertura de la Seguridad Social indicadas en el párrafo anterior. El período \ninterrumpido no podrá ser superior a seis meses, y en el mismo se suspenderán las \ncotizaciones a la Seguridad Social y no se realizará pago de dotación alguna, no \npudiendo recuperarse dicho período. \n3.4. Durante el período de contrato, la suspensión del contrato en virtud de las causas \nprevistas en los artículos 45 y 46 del Estatuto de los Trabajadores no comportará la \nampliación de la duración de la ayuda, salvo las situaciones de incapacidad temporal, \nmaternidad o paternidad y adopción o acogimiento durante el período de duración del \ncontrato que interrumpirán su cómputo, o por cualquier otra causa que legalmente \npudiera constituir motivo de licencia o baja temporal, o causa de fuerza mayor, \ndebidamente justificada, que sería valorada por el Vicerrectorado de Investigación. En \neste caso, el tiempo interrumpido podrá recuperarse siempre que este sea por \nperíodos de, al menos, 30 días y que las disponibilidades presupuestarias lo permitan. \nEn la fase contrato se podrá acordar la suspensión del contrato por la celebración de \nun contrato de colaboración temporal con una empresa de base tecnológica de la \nUPM, en base al artículo 17 de la Normativa sobre Empresas de Base Tecnológica y \nde Servicios Tecnológicos de la UPM.  \n3.5. Quienes accedan a la condición de beneficiario de una ayuda como consecuencia de \nlas renuncias, disfrutarán igualmente de los cuarenta y ocho meses de la ayuda.  \n \nCUARTO.-  DOTACIÓN Y ASEGURAMIENTO \n \n4.1. Durante el año 2010, para el período de beca la cuantía mensual será de 1.300,- euros \nbrutos en doce mensualidades. Durante el período de contrato la cuantía mensual será \nde 1.300.- euros brutos por catorce mensualidades. \n",
  "speaker": "SYSTEM",
  "uuid": "bcbfe6fa-5592-4b7e-bd16-0d4baa94267f"
}