{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 2\n48 \nO. Corcho \nsemantic web a reality (Benjamins et al., 2002).  \nAmong these projects and applications, we can cite the  \nEU projects Esperonto (http://www.esperonto.net/) and \nAcemedia (http://www.acemedia.org/) the EU network of \nexcellence SCHEMA (http://www.schema-ist.org/) or the \nUS MindSwap (http://www.mindswap.org/) project all of \nthem have in common the fact that they aim to provide tools \nor frameworks for annotating different types of content \n(HTML, databases, multimedia) and with different  \ndegrees of automation. A good URL where annotation \nprojects and tools are compiled is the following: \nhttp://annotation.semanticweb.org/. \nOntologies \nare \nnormally \ndefined \nas \n“formal,  \nexplicit \nspecifications \nof \nshared \nconceptualisations”  \n(Studer et al., 1998). However, neither do all ontologies  \nhave the same degree of formality, nor do they include all \nthe components that could be expressed with formal \nlanguages such as concept taxonomies, formal axioms,  \ndisjoint and exhaustive decompositions of concepts, etc. \nGiven \nthis \nfact, \nthe \nontology \ncommunity \nusually \ndistinguishes \nbetween \nlightweight \nand \nheavyweight \nontologies (Studer et al., 1998). Lassila and McGuinness \nproposed the classification presented in Figure 1,  \nwhich shows the different types of ontologies that can be \ndefined in a continuous line from the very lightweight, even \ninformal ontologies to heavyweight ontologies with a large \nnumber of formal axioms and constraints. \nFigure 1 Lightweight vs. heavyweight ontologies and their \nrelationship with Lassila and McGuinness \ncategorisation \n \nSource: Lassila and McGuinness (2001) \nMany of these types of ontologies have been used for \nannotating metadata in documents and general web \nresources. Let us see some examples of widely used \napplications of metadata annotation: \nThesauri and controlled vocabularies. Terms from a \nthesaurus or from a controlled vocabulary can be used to \nannotate documents. Since these vocabularies are not \ncompletely formal (for instance, the relationships between \nthe terms they include do not have a clear semantics), the \nannotations are normally pointers to those terms in the \nvocabulary, which can be used to improve search, for \ninstance. Examples of such vocabularies are MeSH, \n(Medical \nSubject \nHeadings \n(http://www.nlm.nih.gov/ \nmesh/meshhome.html) \nTGN, \n(http://www.getty.edu/ \nresearch/tools/vocabulary/tgn/index.html) etc. \nDublin Core (http://www.dublincore.org/) is an example \nof a lightweight ontology that is being widely used to \nspecify the characteristics of electronic documents. It \nspecifies a predefined set of document features such as \ncreator, date, contributor, description, format, etc. Dublin \nCore annotations can be implemented in languages like \nRDF and XML. For the RDF annotations, it specifies a RDF \nSchema with one class and a set of properties for such class, \nwithout adding formal constraints on their expected values \nor to the relationship between them (that is the reason why \nwe can consider it as a lightweight ontology). For instance, \nthe coverage property specifies a spatial location, temporal \nperiod or jurisdiction, and recommends using a term from \nan existing thesaurus, but it does not impose the value to be \nan instance of an actual location, period or jurisdiction, as \nproposed in its description. \nFriend of a Friend (http://www.foaf-project.org/) \n(FOAF). This initiative aims at creating an annotated Web \nof homepages for people, groups, companies, etc.  \nIt specifies a lightweight ontology that contains some basic \nclasses such as Agent, Person, Organisation, Group, Project, \nDocument, Image, etc., and some basic properties to \ndescribe the instances of these classes. This ontology is \nimplemented in RDF Schema. \nThe \nOntoWeb \n(http://www.ontoweb.org/) \nand \nKnowledgeWeb \n(http://knowledgeweb.semanticweb.org/) \nontologies, and the publication description ontology \n(http://annotation.semanticweb.org/iswc/iswc.owl). Similar \nto the FOAF initiative, these ontologies describe persons, \norganisations, projects, publications, etc. They are used to \ndescribe people and organisations inside those EU networks \n(OntoWeb and KnowledgeWeb) and to describe the \npublications of several international conferences and \nworkshops, such as the ISWC series, the SemAnnot \nworkshop series, etc. \nThe Esperonto (http://www.esperonto.net/) Cultural \nTour and Fund Finder applications. These applications show \nthe benefits of upgrading current Web content to the \nSemantic Web in two domains: culture and funding \nopportunities. In these applications, documents in both \ndomains \nare \nannotated \naccording \nto \ncorresponding \nheavyweight ontologies. \nFigure 2 shows the relationship between the previous \napproaches and the classification shown in Figure 1, where \ntwo groups can be clearly distinguished. \nFigure 2 Annotation approaches and their relationship with \nLassila and McGuinness categorisation \n \n2.1 Annotation approaches: examples \nTo better understand what different annotation approaches \nconsist in, in this section we illustrate how some of them \n \n",
  "speaker": "SYSTEM",
  "uuid": "bd9ca775-27d8-4fde-af79-3893c15f6ee2"
}