{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 7\nDynaLearn exercises  \n7 \n \n• The population may become extinct. Number_of and Biomass should thus go to \nzero in one of the behaviour paths. \n• How many states are generated? And how many behaviours are there? \n \n \nAn Alternative Representation \nThere are different ways in which ‘the same’ idea can be represented in a model. The \ngoal of this assignment is to take an alternative representation, by applying the following \nprinciples: \n• Introduce the quantities of interest as early as possible. Thus in addition to \nNumber_of and Biomass, also introduce Birth and Death as quantities in the \nstatic model fragment describing population features. \n• Make the processes conditional: the ‘Birth’ and ‘Death’ processes should only \nbecome active when: \no the static model fragment describing the population features has been \nfound and \no the population exists, that is: Number_of > zero. \n \nIn addition to the alternative representation, also add feedback to this model. The idea \nis that the Birth and Death rates increase (or decrease) following an increase (or \ndecrease) in the Number_of. This requires positive proportionalities between those \nquantities in the static model fragment describing the population features. One of the \nresults of this approach is that the rates will change, and among others, Birth and Death \nwill also go to zero when the Number_of goes to zero. \n \nAn Agent for Immigration \nIn the models created so far, a population cannot ‘recover’ from zero - from being \nextinct. The goal of this assignment is to add immigration. Consider the population \ndiscussed in the previous assignments as the system we are dealing with. Immigration \ncan then be seen as an external influence affecting that system, namely, individuals \nfrom a different area entering the area in which this population lives. External influences \nare modelled using model fragments of type agent. Thus: create an agent that causes \nimmigration to the system (population): \n• Define an agent (external influence) using the ‘agent hierarchy editor’ (e.g. \nNeighbour). \n• Define the quantity Immigration. \n• Adapt the structural details in the scenario. Introduce the idea of an area (e.g. an \nEcosystem) in which a population lives while another population (e.g. the \nNeighbour) lives outside of this area. \n• Create a model fragment (type: agent) in which (for the structural situation \nmentioned above) the quantity Immigration has a positive influence on the \nquantity Number_of and as such implements the idea of individuals immigrating \ninto the ecosystem. (Ignore the details of the neighbour population in terms it \nbecoming smaller due to individuals leaving). \n",
  "speaker": "SYSTEM",
  "uuid": "be0c6afb-d82c-4826-b9bb-eee87bd06ef1"
}