{
  "message": "SYSTEM: NeOn-Methodology-OntologySpecificationGuidelines.pdf: Página 8\nPage 8 of 18 \nNeOn Integrated Project EU-IST-027595 \n\u0001 Conciseness. Each and every requirement is relevant, and there are no duplicated or \nirrelevant requirements. \n\u0001 Realism. Requirement meanings must make sense in the domain. \n\u0001 Modifiable. We can say that a set of requirements is modifiable if its structure and style \nallow changing issues in an easy, complete and consistent way.  \n\u0001 Traceable. We can say that an ontology requirement is retraceable if its origin is known and \nit can be referred to in other documents during the ontology development. A necessary \ncondition to have retraceable requirements is that such requirements should be referred in \na unique way (normally using a kind of code).  \nTask 7. Prioritize requirements.  \nThe goal of this task is to give different levels of priority to the different groups of CQs, and within \neach group to the identified requirements (in the form of CQs). Users, domain experts and the \nontology development team carry out this task taking as input the groups of CQs written in natural \nlanguage (obtained in task 5) for obtaining the priorities for each group and for each CQs within a \ngroup.  \nThe task output is a set of priorities attached to each group of CQs and to each CQ in a group. \nPriorities in CQs will be used for planning the ontology development.  \nThis task is optional, but recommended. In fact, if no priorities are given to the groups of CQs, the \nontology development will model all requirements at the same time. \nTask 8. Extract terminology and its frequency. \nThe goal of this task is to extract from the list of CQs a pre-glossary to be used in the \nconceptualization activity. The ontology development team carries out this task taking as input the \nlist of identified CQs and their answers for obtaining a list of the most used terms in them, using \nterminology extraction techniques and tools supporting such techniques. \nFrom the requirements in form of competency questions, we extract the terminology (names, \nadjectives and verbs) that will be formally represented in the ontology by means of concepts, \nattributes and relations.  \nFrom the answers to the CQs we extract the objects in the universe of discourse that will be \nrepresented as instances. \n1.1. SEEMP Reference Ontology Specification \nThe main objective of the SEEMP2 project is to develop an interoperable architecture for public e-\nEmployment services (PES). The resultant architecture will consist of: a Reference Ontology, the \ncore component of the system, that acts as a common “language” in the form of a set of controlled \nvocabularies to describe the details of a job posting; a set of Local Ontologies, each PES uses its \nown Local Ontology, which describes the employment market in its own terms; a set of mappings \nbetween each Local Ontology and the Reference Ontology; and a set of mappings between the \nPES schema sources and the Local Ontologies. The SEEMP project relies on WSMO [6] that \npermits to semantically describe Web Services, ontologies and mediators. WSML [4] is the \nconcrete language used in SEEMP for encoding those descriptions. \nIn this section we present the specification of the SEEMP Reference Ontology following the \nproposed guidelines of the NeOn Methodology. This specification is not intended to be exhaustive, \n                                                \n2 http://www.seemp.org \n",
  "speaker": "SYSTEM",
  "uuid": "bea2d87d-8840-4af3-a5de-522725ecb2cb"
}