{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 2\n2\nMariano Rico, Óscar Corcho et al.\nIn home environments, the UPnP (Universal Plug and Play) protocol [14],\nde\u001cned by the UPnP Forum and supported by a large number of device manufac-\nturers, allows heterogeneous devices to share their multimedia content easily and\nseamlessly. Multimedia content stored in UPnP Media Servers can be streamed\nto any UPnP Media Renderer located in the same home through the use of\nsoftware applications running in PCs or set-top boxes, denoted UPnP Control\nPoints. This means that users do not need to copy their data from one device\nto another, but they can access it at any time from their Media Renderers or\nControl Points.\nHowever, users also demand access to their multimedia resources outside their\nhome environment, so that they can listen to a music track that a friend has\nin his computer or show the pictures or movies took on their last holidays in a\nmeeting outside home. Although UPnP is a \u001crst step forward into the provision\nof multimedia management and sharing tools in home environments, it has some\nimportant limitations that prevent its use to share content across homes:\n\u0015 The use of UPnP is restricted to LANs (Local Area Networks). There has\nbeen some previous work about extending UPnP outside LANs [1] and the\nUPnP Remote Access Committee is developing standards to enable UPnP\nMedia Servers, Renderers and Control Points outside the home network to\ninteract with the devices inside the LAN. However, this previous work of-\nfers only partial or di\u001ecult to use solutions. For example, the establishment\nof network connectivity with a remote home is usually not described, or it\nis made using ad-hoc VPNs (Virtual Private Networks) that require com-\nplicated handling of NATs (Network Address Translation) and overcoming\nother network problems.\n\u0015 UPnP does not provide native authentication and authorization mechanisms,\nand extensions to handle this are only partially described in ongoing e\u001borts.\nSecurity is crucial in a multi-home environment.\n\u0015 UPnP devices' search capabilities are rather limited: most of the navigation\nthrough these devices has to be done by directory hierarchy browsing, and\nthere are no advanced search capabilities. As a result, UPnP-enabled systems\nare not very usable especially considering that we may have a huge amount\nof heterogeneous multimedia resources in our UPnP devices.\nFurthermore, in many cases, the metadata associated to these resources is\nnot domain-dependent, but only general metadata stored in MPEG-7 descriptors\nor other similar formats. This fact makes it di\u001ecult to \u001cnd those resources\nassociated to searches like \u0010give me the photos or videos where my cousins were\non holiday\u0011.\nIn this paper we present: (1) an extension of the standard UPnP protocol,\n(2) a software architecture to create URIs supporting the concept of \u0010extended\nhome\u0011 or \u0010network of interconnected homes\u0011 and (3) a UPnP control point with\nsemantically-enabled capabilities. This allows the seamless sharing and semantic\nannotation of multimedia content between users in a social network, indepen-\ndently from their location. Furthermore, we improve the current search function-\nalities of existing UPnP Control Points so that search of multimedia resources\n",
  "speaker": "SYSTEM",
  "uuid": "bf3ce83e-0e44-487d-8469-c9d8cafe3ec3"
}