{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 75\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 75 of 111 \nThis section presents the following life cycle models for developing ontology networks: the waterfall \nlife cycle model (Section 5.1.1), the incremental life cycle model (Section 5.1.2), the iterative life \ncycle model (Section 5.1.3), the evolving prototyping life cycle model (Section 5.1.4), and the spiral \nlife cycle model (Section 5.1.5). For each model we present the requirements or outputs of each \nstage or phase. \n5.1.1. Waterfall Ontology Network Life Cycle Model \nThe main characteristic of the proposed waterfall life cycle model for the ontology network \ndevelopment (as that of its homonymous in Section 2.3.1) is the representation of the stages of an \nontology network as a sequential phases. This model represents the stages as a waterfall, from a \nparticular stage through the following one. In this model a concrete stage must be completed \nbefore the following stage begins.  \nThe main difference of this proposed model with respect to those presented in Section 2.3.1 is that \nin Software Engineering the waterfall model always includes a stage for testing the software \nsystem after its implementation, but in the case of ontology networks, the similar stage should be \ncovered by the evaluation and the assessment activities (that should be carried out in all the \nphases (except in the initiation phase) and not by a different stage in the model. \nAs in the case of that model presented in Section 2.3.1, the main assumption for using the \nproposed waterfall ontology network life cycle model is that the requirements are completely \nknown, without ambiguities and unchangeable at the beginning of the ontology network \ndevelopment. \nTaking into account the importance of knowledge resources reuse and reengineering and ontology \nmerging, we define and propose the following five significantly different versions of the waterfall \nontology network life cycle model. All these five versions maintain the aforementioned difference \nwith respect to the homonymous model in Software Engineering; that is, the five versions of the \nwaterfall ontology network life cycle model include the evaluation (from technical perspective) and \nthe assessment (from user and need perspectives) activities in all the phases of the model (except \nin the initiation phase) and not by a different stage in the model (as occurs in Software \nEngineering). \n Five-phase waterfall ontology network life cycle model.  \nThis proposed model represents the stages of an ontology network, starting with the initiation \nphase and going through the requirements definition phase, the design or modelling phase, the \nimplementation phase to the maintenance phase. \nIn this model a concrete phase must be completed before the following phase begins, and not \nbacktracking is permitted except in the case of the maintenance phase. \nThe proposed model is shown in Figure 28, and the main requirements and outputs for each \nphase in the model are the following: \n \nInitiation Phase. In this phase the approval or rejection of the ontology network \ndevelopment should be obtained. This phase has as requisit to identify the development \nteam and to establish the resources, responsibilities and timing once the development has \nbeen approved.   \n \nRequirements Definition Phase. In this phase it is necessary to produce a requirement \nspecification document, including the requisites that the ontology network should satisfy \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "bf3fc4cb-4484-4acf-8528-07c2920f8418"
}