{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 67\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 67 of 124\nPR-NOR-CLLO-03. Pattern for re-engineering a classiﬁcation scheme which follows the snowﬂake\ndata model\nThe pattern for re-engineering classiﬁcation scheme shown in Table 4.5 suggests a guide to transform a\nclassiﬁcation scheme into a lightweight ontology. The classiﬁcation scheme is modeled with a snowﬂake\ndata model. This pattern aims at creating a lightweight ontology from the classiﬁcation scheme, which the\nsemantics of the relations between classiﬁcation scheme items are subClassOf and ad-hoc relations.\nTable 4.5: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nsnowﬂake data model\nSlot\nValue\nGeneral Information\nName\nClassiﬁcation scheme to Lightweight Ontology (snowﬂake model)\nIdentiﬁer\nPR-NOR-CLLO-03\nType of Component\nPattern for Re-engineering Non-Ontological Resources (PR-NOR)\nUse Case\nGeneral\nRe-engineering a classiﬁcation scheme which follows the snowﬂake model to design a\nLightweight Ontology.\nExample\nSuppose that someone wants to build a lightweight ontology based on the ISO 3166 standard\nfor the representation of names of countries and their subdivisions. This standard is divided\nin ISO 3166-1 for countries, and ISO 3166-2 for subdivisions (regions).\nPattern for Re-engineering Non-Ontological Resources\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a classiﬁcation scheme which follows the snowﬂake\nmodel.\nA classiﬁcation scheme is a rooted tree of concepts, in which each concept groups entities\nby some particular degree of similarity. The semantics of the hierarchical relation between\nparents and children concepts may vary depending on the context.\nThe snowﬂake data model [MZ06] is a normalized structure for hierarchy representations. In\nthis case, the classiﬁcation scheme items are grouped by levels or entities. There are as\nmany groups as levels the classiﬁcation scheme has.\nExample\nThe ISO 3166 standard (codes for the representation of names of countries and their\nsubdivisions) is divided in ISO 3166-1 for countries, and ISO 3166-2 for country\nsubdivisions (regions).\nFor the example, ISO 3166-1 and ISO 3166-2 are holding on different entities. The relation\nsemantics between the sub-ordinate and the super-ordinate concepts is partOf.\nGraphical Representation\nGeneral\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "bf4cd3ee-e340-4535-81f7-1af08627829f"
}