{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 49\n47\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Password Reset\n• Secured Conferencing\n• Time and Attendance\n• Voice Portal Access\n4.5 Speech Dialogue/Interactive Speech\nSpeech interaction is a core feature of emerging unified interface and interactivity modes, where multiple\ninput modalities aim at compensating for the weaknesses of one modality, offset by the strengths of anoth‐\ner. For this purpose the Voice–user interface (VUI) is the interface of any speech application. It makes possi‐\nble the human‐computer/machine interaction trough a voice/speech platform as the primary interface is\naudio input and output and generates an automated service or process. \nApplications\nVoice Portal\nSystem that uses advanced speech recognition technology and provides access to information on the\nInternet. Key components of most voice portals are speech recognition, text to speech, information aggre‐\ngation, categorization software, telephony and Internet interfaces, and administrative interfaces. Optional\ncomponents include software to support context‐sensitive, personalized assistance (for example, an intelli‐\ngent assistant) and support for VoiceXML.\nHome appliances & Consumer electronics\nThe recent successes of new touch‐based user interfaces (iPod, iPhone, Wii, etc.), has opened the eyes of\nhome appliance and consumer electronics manufacturers to the benefits of giving customers new and bet‐\nter ways to control products and access information. Speech I/O is the perfect solution to give consumers an\neasier, more convenient, cleaner, and more fun way to control products in the home.\nSpeech synthesis output can be used for confirmations (“oven temperature set to 105 degrees”), queries\n(“Please say the device you would to control by voice”), or even fun and information purposes, like a refrig‐\nerator that tells a joke or a fun fact when it’s held open for more than 3 seconds.\nASR can substitute the controller that already exists in remote controls, microwaves, ovens, dishwashers and\nother home electronics, allowing the addition of speech I/O with very little incremental cost. Software solu‐\ntions are needed for low cost speech recognition, thus enabling customers to use the best platforms for their\nparticular applications. \nAutomotive\nThe increasing usage of cell phones, digital music players, and GPS units in automobiles distracts drivers and\ncreates potentially hazardous situations. Thus many countries and regions have already started requiring\ncompliance towards hands‐free operation of cell phones while driving, and it is foreseen to grow and further\ncover personal navigation devices and other potential in car distractions; for which ASR offers the opportu‐\nnity to trigger a user interface for accessing these devices safely, while on the road, with voice control and\ntruly hands free systems, without having to locate and look at panel buttons.\nDevelopment of ASR for vehicles is based in four areas:\n",
  "speaker": "SYSTEM",
  "uuid": "bfeea870-f7a3-4cb1-83ca-6b5cd227244a"
}