{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 15\n7   Conclusions and Future Lines of Work \nThis paper presents a catalogue of 24 recurrent pitfalls in ontology modelling. Such a \ncatalogue has been identified by manually analysing 26 ontologies in different \ndomains (e.g. art, architecture, football, vehicles, etc.). Such ontologies have been \ndeveloped by participants who have attended one semester course on ontologies and \nsemantic web foundations. It is worth mentioning that the participants were taught in \nthe theoretical foundations of ontologies, ontologies and terminologies, ontology \nlanguages (RDF(S) and OWL), and methodologies for building ontologies.  \nWe have also described in the paper a subset of the most recurrent pitfalls. These \ndescriptions are based on a template that includes (a) guidelines to avoid the pitfall \nwhen modelling ontologies and (b) examples of how to solve some pitfalls once they \nhave appeared. \nIt is worth mentioning that as a result of the analysis performed we have identified \nsome concurrences between pitfalls, which means that a particular pitfall might result \nin having simultaneously other pitfalls in the ontology. For example, let suppose an \nontology that contains (1) the relation “isLocatedIn”, whose domain is “Building” and \nwhose range is “Place” and (2) the relation “isLocationOf‟ with no domain and no \nrange. The omission of domain and range in the later relation refers to the \nabovementioned pitfall P11. This pitfall leads to make also pitfall P13; that is, to miss \nthe inclusion of the inverse construct between these two relations (“isLocatedIn” and \n“isLocationOf”). Since one of our research aims is to provide ontology developers \nwith guidelines to avoid common pitfalls in ontology modelling, we consider that \nhaving the knowledge about which pitfalls can be concurrent in an ontology would be \nuseful for our research. Therefore, as a future line of work, we propose to analyse in \ndepth the different possibilities of concurrences between the pitfalls identified in this \npaper. In this regard, it would be interesting to identify the groups of pitfalls that \nusually appear simultaneously so that, once the concurrence of a pitfall is identified, \nthe other pitfalls that could appear could also be identified and thus avoided.  \nIn the experiment reported in this paper, the participants did not know the set of \npitfalls when they modelled their ontologies. Therefore, our next step will be \nperformed experiments that involve two sets of participants: the first set will know the \ncatalogue of 24 pitfalls described in this paper before develop the ontology and the \nsecond set will built the ontology without knowing the catalogue in advance. Both set \nof participants will develop the ontologies based on the same requirements with the \naim of checking how useful is to know the list of pitfalls before develop an ontology.  \nFinally, as we have already mentioned, examples provided in the pitfalls \ndescription address only particular cases of how to solve a pitfall once it appears. \nTherefore, we are also working on collecting several cases of the same pitfall, on \ngeneralizing common points of all of them, and on dividing the pitfall in more \nspecific cases, with the aim of providing the guidelines to correct the pitfall in all the \nsituations.  \n \nAcknowledgments. This work has been partially supported by the Spanish projects \nmIO! (CENIT-2008-1019), GeoBuddies (TSI 2007-65677 C02), and BuscaMedia \n(CENIT 2009-1026).  \n",
  "speaker": "SYSTEM",
  "uuid": "c00efba1-b1e6-4313-879c-b67b8d5b0ad5"
}