{
  "message": "SYSTEM: Barzilay2004.pdf: Página 8\nElhadad, Luis Gravano, Julia Hirschberg, Sanjeev Khu-\ndanpur, Jon Kleinberg, Oren Kurland, Kathy McKeown,\nDaniel Marcu, Art Munson, Smaranda Muresan, Vin-\ncent Ng, Bo Pang, Becky Passoneau, Owen Rambow,\nVes Stoyanov, Chao Wang and the anonymous reviewers\nfor helpful comments and conversations. Portions of this\nwork were done while the ﬁrst author was a postdoctoral\nfellow at Cornell University. This paper is based upon\nwork supported in part by the National Science Founda-\ntion under grants ITR/IM IIS-0081334 and IIS-0329064\nand by an Alfred P. Sloan Research Fellowship. Any\nopinions, ﬁndings, and conclusions or recommendations\nexpressed above are those of the authors and do not nec-\nessarily reﬂect the views of the National Science Founda-\ntion or Sloan Foundation.\nReferences\nF. C. Bartlett. 1932. Remembering: a study in experi-\nmental and social psychology. Cambridge University\nPress.\nR. Barzilay, L. Lee. 2003. Learning to paraphrase: An\nunsupervised approach using multiple-sequence align-\nment. In HLT-NAACL 2003: Main Proceedings, 16–\n23.\nD. Beeferman, A. Berger, J. Lafferty. 1997. Text seg-\nmentation using exponential models. In Proceedings\nof EMNLP, 35–46.\nS. F. Chen, K. Seymore, R. Rosenfeld.\n1998.\nTopic\nadaptation for language modeling using unnormalized\nexponential models. In Proceedings of ICASSP, vol-\nume 2, 681–684.\nG. DeJong.\n1982.\nAn overview of the FRUMP sys-\ntem. In W. G. Lehnert, M. H. Ringle, eds., Strategies\nfor Natural Language Processing, 149–176. Lawrence\nErlbaum Associates, Hillsdale, New Jersey.\nP. A. Duboue, K. R. McKeown. 2003. Statistical acqui-\nsition of content selection rules for natural language\ngeneration. In Proceedings of EMNLP, 121–128.\nS. Fine, Y. Singer, N. Tishby. 1998. The hierarchical\nhidden Markov model: Analysis and applications. Ma-\nchine Learning, 32(1):41–62.\nR. Florian, D. Yarowsky. 1999. Dynamic non-local lan-\nguage modeling via hierarchical topic-based adapta-\ntion. In Proceedings of the ACL, 167–174.\nD. Gildea, T. Hofmann.\n1999.\nTopic-based language\nmodels using EM. In Proceedings of EUROSPEECH,\n2167–2170.\nZ. Harris. 1982. Discourse and sublanguage. In R. Kit-\ntredge, J. Lehrberger, eds., Sublanguage: Studies of\nLanguage in Restricted Semantic Domains, 231–236.\nWalter de Gruyter, Berlin; New York.\nM. Hearst. 1994. Multi-paragraph segmentation of ex-\npository text. In Proceedings of the ACL, 9–16.\nR. Iyer, M. Ostendorf. 1996. Modeling long distance\ndependence in language: Topic mixtures vs. dynamic\ncache models. In Proceedings of ICSLP, 236–239.\nD. R. Jones, C. A. Thompson.\n2003.\nIdentifying\nevents using similarity and context. In Proceedings of\nCoNLL, 135–141.\nR. Kittredge, T. Korelsky, O. Rambow. 1991. On the\nneed for domain communication language. Computa-\ntional Intelligence, 7(4):305–314.\nJ. Kupiec, J. Pedersen, F. Chen. 1999. A trainable doc-\nument summarizer. In I. Mani, M. T. Maybury, eds.,\nAdvances in Automatic Summarization, 55–60. MIT\nPress, Cambridge, MA.\nM. Lapata. 2003. Probabilistic text structuring: Exper-\niments with sentence ordering. In Proceeding of the\nACL, 545–552.\nW. C. Mann, S. A. Thompson. 1988. Rhetorical struc-\nture theory: Toward a functional theory of text organi-\nzation. TEXT, 8(3):243–281.\nD. Marcu. 1997. The rhetorical parsing of natural lan-\nguage texts.\nIn Proceedings of the ACL/EACL, 96–\n103.\nK. R. McKeown. 1985. Text Generation: Using Dis-\ncourse Strategies and Focus Constraints to Generate\nNatural Language Text. Cambridge University Press,\nCambridge, UK.\nW. H. Press, S. A. Teukolsky, W. T. Vetterling, B. P. Flan-\nnery. 1997. Numerical Recipes in C: The Art of Scien-\ntiﬁc Computing. Cambridge University Press, second\nedition.\nL. Rabiner. 1989. A tutorial on hidden Markov models\nand selected applications in speech recognition. Pro-\nceedings of the IEEE, 77(2):257–286.\nD. R. Radev, K. R. McKeown. 1998. Generating natu-\nral language summaries from multiple on-line sources.\nComputational Linguistics, 24(3):469–500.\nO. Rambow. 1990. Domain communication knowledge.\nIn Fifth International Workshop on Natural Language\nGeneration, 87–94.\nJ. Reynar, A. Ratnaparkhi. 1997. A maximum entropy\napproach to identifying sentence boundaries. In Pro-\nceedings of the Fifth Conference on Applied Natural\nLanguage Processing, 16–19.\nR. E. Schapire, Y. Singer.\n2000.\nBoosTexter:\nA\nboosting-based system for text categorization.\nMa-\nchine Learning, 2/3:135–168.\nR. Soricut, D. Marcu. 2003. Sentence level discourse\nparsing using syntactic and lexical information.\nIn\nProceedings of the HLT/NAACL, 228–235.\nM. White, T. Korelsky, C. Cardie, V. Ng, D. Pierce,\nK. Wagstaff. 2001. Multi-document summarization\nvia information extraction. In Proceedings of the HLT\nConference, 263–269.\nA. Wray. 2002. Formulaic Language and the Lexicon.\nCambridge University Press, Cambridge.\nJ. Wu, S. Khudanpur. 2002. Building a topic-dependent\nmaximum entropy language model for very large cor-\npora. In Proceedings of ICASSP, volume 1, 777–780.\n",
  "speaker": "SYSTEM",
  "uuid": "c028fda4-a89b-4d31-9b62-167c642e551d"
}