{
  "message": "SYSTEM: Wiki: This is one of the topics that I normally come across with when I start working with a new PhD student, and I think that it is worth to provide a simple schema that should be followed in any state of the art paper/technical report:\n1. Introduction\nProblem to be solved, possible applications, selection of elements for the analysis/synthesis, etc.\n2. Evaluation framework\nThis section contains characteristics, grouped in a manageable number of categories, that are of\n interest in our work, and will allow summarising our analysis work during the state-of-the-art activities.\n3. Description of analysed elements (systems, platforms, languages, tools, etc.)\nThese descriptions should be somehow short (less than half-a-page per element) and should follow the\n grouping of characteristics identified in section 2. Probably the idea of having one paragraph per\n group of characteristics, with natural language descriptions for the specific element, would be good.\n4. Summary table\nWith the analysed elements represented as rows and the characteristics represented as columns. This is the\n final outcome of the process of analysis (reading) and synthesis (proposal of the evaluation framework\n and application to the selected elements)\n5. Recommendations\nAfter having read so much about the area, you are the expert, so you can recommend using one element or \n another in different situations. In this section you have to make a manual data mining activity where you\n cluster elements according to characteristics that are the same or similar, and where you provide\n recommendations according to these results.\n6. Conclusions and future lines of research\nDescribe ongoing work, what this analysis will be used for, how the area is evolving, which are the \n weaknesses of the evaluation framework proposed (where it cannot be used), where it would be needed\n to use additional information, etc.\nFurthermore, I always recommend:\n- Contacting the authors/people in charge of the elements described and analysed, so that they can verify the information provided. They will always try to change their data or the sets of characteristics if their tool/system/platform does not present very good results, so you have to be careful to take only those new characteristics that really make sense. Normally, it is better to provide first an individual evaluation of their system/tool, rather than the complete paper.\nOne example of such a paper can be found\nhere",
  "speaker": "SYSTEM",
  "uuid": "c02f5733-eab9-4030-9165-0716b7ab8648"
}