{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 1\nReusing Human Resources Management Standards for \nEmployment Services  \nAsunción Gómez-Pérez1, Jaime Ramírez1 and Boris Villazón-Terrazas1 \n \n1 Facultad de Informática, Universidad Politécnica de Madrid, Campus Montegancedo s/n \n28860, Boadilla del Monte, Madrid, Spain \n{asun, jramirez, bvillazon}@fi.upm.es \nAbstract.  Employment Services (ESs) are becoming more and more important \nfor Public Administrations where their social implications on sustainability, \nworkforce mobility and equal opportunities play a fundamental strategic \nimportance for any central or local Government. The EU SEEMP project aims \nat improving facilitate workers mobility in Europe. Ontologies are used to \nmodel descriptions of job offers and curricula; and for facilitating the process of \nexchanging job offer data and CV data between ES. In this paper we present the \nmethodological approach we followed for reusing existing human resources \nmanagement standards in the SEEMP project, in order to build a common \n“language” called Reference Ontology. \nKeywords: Human Resources Management Standard, Human Resources \nOntologies. \n1   Introduction \nNowadays there is an important amount of investment in human capital for economic \ndevelopment. Human resources management refers to the effective use of human \nresources in order to enhance organisational performance [13]. The human resources \nmanagement function consists in tracking innumerable data points of each employee, \nfrom personal records (data, skills, capabilities) and experiences to payroll records \n[13]. Human resources management has discovered the Web as an effective \ncommunication channel. Although most businesses rely on recruiting channels such \nas newspaper advertisements, online job exchange services, trade fairs, co-worker \nrecommendations and human resources advisors, online personnel marketing is \nincreasingly used with cost cutting results and efficacy.  \nEmployment Services (ESs) are becoming more and more important for Public \nAdministrations where their social implications on sustainability, workforce mobility \nand equal opportunities play a fundamental, strategic importance for any central or \nlocal Government. The goal of the SEEMP1 (Single European Employment Market-\nPlace) project is to design and implement an interoperability architecture for public e-\nEmployment services which encompasses cross-governmental business and decisional \n                                                           \n1 http://www.seemp.org/ \n",
  "speaker": "SYSTEM",
  "uuid": "c05b0f9f-625e-4868-8e68-99eb8970029a"
}