{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 10\n \n \nPág. 12 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n“Europe's Languages in the Digital Age”9, señala que la carencia de recursos para el \nprocesamiento del lenguaje natural en una lengua particular son la barrera más importante para \nel desarrollo en Europa de aplicaciones de la industria del lenguaje, tales como: \n \nOptimización de procesos industriales de gestión lingüística de documentación: \ntraducción de documentos y herramientas de autor (correctores, generación de \ndocumentos, etc.) \n \nComunicación y asistencia personal (asistentes virtuales, comunicación hombre-\nmáquina para coches, atención al cliente e interacción con robots; buscadores \ninteligentes y respuesta automática de preguntas). \n \nProcesamiento inteligente de información y conocimiento (extracción y minería de \ninformación de textos y contenidos, clasificación de documentos, resumen automático, \netc.). \n \nAsistencia en el aprendizaje de lenguas. \nEn los programas europeos, no obstante, el suministro efectivo de recursos que constituyen la \ninfraestructura de apoyo para cada lengua no queda cubierta. Es necesario garantizar el \nsuministro de recursos para el español y las lenguas cooficiales porque, a pesar de que existe \nuna industria de las tecnologías del lenguaje, las características de la misma (las empresas son \nPyMEs en su gran mayoría) hacen imposible pensar que la industria se autoabastezca con la \nrapidez necesaria. \n2.3 \nElaboración del Plan de Impulso de las Tecnologías del Lenguaje \nLa iniciativa para elaborar un Plan de Impulso de las Tecnologías del Lenguaje parte de la \nSecretaría de Estado de Telecomunicaciones y para la Sociedad de la Información. Para ello, se \nconstituyó un Comité Directivo para la elaboración del Plan con la participación de los siguientes \nórganos: \n• \nSecretaría General de Industria y de la Pequeña y Mediana Empresa. \n• \nSecretaría de Estado de Investigación, Desarrollo e Innovación. \n• \nSecretaría de Estado de Cultura. \n• \nSubsecretaría de Educación, Cultura y Deporte. \n• \nSecretaría de Estado de Cooperación Internacional y para Iberoamérica. \n• \nSubsecretaría Ministerio de Presidencia. \n• \nDirección de Tecnologías de la Información y de las Comunicaciones de la \nAdministración General del Estado. \n• \nSecretaría de Estado de Turismo. \n                                                           \n9 http://www.meta-net.eu/ \n",
  "speaker": "SYSTEM",
  "uuid": "c0922c48-b44d-48c3-89bc-d20671e739af"
}