{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 12\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97737\n2.  No obstante, las ayudas objeto de la presente convocatoria serán compatibles con \nlas percepciones que procedan de:\na)  Tareas docentes e investigadoras directamente asociadas con la investigación o \nproyecto formativo desarrollado por el beneficiario de la ayuda, que no impliquen vinculación \ncontractual, tengan carácter no habitual y no menoscaben o interrumpan el proceso \nformativo objeto de la ayuda.\nb)  Ayudas para asistencia a congresos, reuniones o jornadas científicas.\nc)  Ayudas a estancias breves y traslados temporales concedidas por organismos \npúblicos o privados, nacionales o internacionales, por un período mínimo y máximo igual \nal que se establece en los apartados V y VI de la presente convocatoria y previa autorización \nde la Dirección General de Política Universitaria para la ausencia temporal. La percepción \nde estas ayudas será incompatible con el disfrute de estancias breves o traslados \ntemporales en el mismo año, previstas como beneficios complementarios en esta \nconvocatoria.\n3.  Los beneficiarios deberán comunicar a la universidad o centro de adscripción, si \nse produce el caso, la obtención de otras ayudas, subvenciones, ingresos o recursos que \nfinancien las actividades subvencionadas, que tan pronto tenga conocimiento de ello \ninformará al órgano gestor de esta convocatoria.\nArtículo 17.  Renuncias, bajas y finalización de las ayudas.\n1.  Se considerarán renuncias a las ayudas objeto de esta Orden, las que se produzcan \ndentro del plazo de incorporación, al que se refiere el artículo 14.2 de la presente \nconvocatoria.\n2.  Se considerarán bajas las no incorporaciones a los centros de adscripción tras una \ninterrupción, así como aquellas solicitadas a instancia de lo beneficiarios de las mismas en \nrégimen de beca o de contrato en prácticas.\n3.  Las bajas y renuncias deberán ser comunicadas al centro de adscripción de la \nayuda, que a su vez dará traslado de este hecho a la Dirección General de Política \nUniversitaria.\n4.  Los beneficiarios de las ayudas deberán presentar, en el plazo máximo de un mes \na partir de la fecha de finalización de la misma, una memoria con una extensión máxima \nde 3.000 palabras que exponga los resultados obtenidos, con especial énfasis en los \nobjetivos logrados relativos al proceso de formación. Además, adjuntarán un currículum \nvitae actualizado y un informe del director de la tesis. No será necesaria la presentación de \nesta memoria en el caso de transición de beca a contrato en prácticas.\n5.  Los efectos económicos de las bajas se producirán con la misma fecha en la que \nesta se produjera, sin perjuicio de los reintegros que deberán realizarse en el caso de \nhaberse producido pagos indebidos.\n6.  Las bajas voluntarias sin que los beneficiarios hayan alcanzado el objeto de la \nmisma, deberán acompañarse de la memoria a la que se refiere el punto 4 anterior, \nacompañada con un informe del Director.\nArtículo 18.  Seguimiento y control.\n1.  Corresponde a la Dirección General de Política Universitaria el seguimiento del \ntrabajo realizado por los beneficiarios de las ayudas en cumplimiento de sus obligaciones \npor la percepción de las mismas. Para ello establecerá los procedimientos adecuados en \ncolaboración con las universidades y organismos de los centros de adscripción de los \nbecarios. Así mismo, podrá designar los órganos, comisiones o expertos que estime \nnecesarios para realizar las oportunas actuaciones de seguimiento y comprobación de la \naplicación de las ayudas, así como recabar la información complementaria que se considere \nen cada caso.\n2.  Los beneficiarios de las ayudas estarán sujetos a las acciones de control que \nlleven a cabo las universidades y los centros a los que se encuentren adscritos, facultados \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "c0bd601f-349e-47b4-a461-d9c5a9f0f218"
}