{
  "message": "SYSTEM: D5.3.2.pdf: Página 14\nPage 14 of 48 \nNeOn Integrated Project EU-IST-027595 \n \no Ontology Design Pattern Reuse is defined as the activity of using available ontology \ndesign patterns in the solution of different modeling problems during the development of \nnew ontologies. \n \nFigure 2. Ontological Resource Reuse \nNon-Ontological Resource Reengineering was defined in deliverable D5.3.1 [ 10] as the process of \nretrieving and transforming an existing non-ontological resource (e.g., data bases, controlled \nvocabularies, etc.) into an ontology. This process could be compared with the ontology learning \nactivity, but in such an activity the knowledge is only transformed in conceptual structures, while in \nthe process of reengineering non-ontological resources the sources can be transformed into \nconceptual structures and instance data. Such a process can be divided in the following activities: \nnon-ontological resource reverse engineering, non-ontological resource transformation and \nontology forward engineering (defined in deliverable D5.3.1 [ 10]), shown in Figure 3, where:  \n\u0001 Non-Ontological Resource Transformation is defined as the activity of generating an \nontological model at different levels of abstraction from the non-ontological resource. \n\u0001 Non-Ontological Resource Reverse Engineering is defined as the activity of analyzing a non-\nontological resource to identify its underlying components and creating a representation of the \nresource at higher levels of abstraction. \n\u0001 Ontology Forward Engineering was defined in deliverable D5.3.1 [ 10].  \n \nFigure 3. Non-Ontological Resource Reengineering \nFigure 4 shows the whole NeOn Glossary of Processes and Activities, where the different types of \narrows have the following meanings: (1) arrows with dashed lines mean “a process is divided into \nactivities”, (2) arrows with solid lines mean “type of”, and (3) arrows with dotted lines mean \n“synonymy”. \n",
  "speaker": "SYSTEM",
  "uuid": "c11f4031-6cba-4880-b00f-7da755b90621"
}