{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 11\nIn a realistic usage scenario, the QR models are constructed on the basis of speciﬁc\ndomain vocabularies. Therefore, we have focused in our experiment on a set of domain\nglossaries in environmental science developed by several universities11. These vocabu-\nlaries have been speciﬁcally created to be used in the context of QR modelling, so that\nthey constitute very valuable material for our purposes. Each glossary consists of a set\nof English words which covers seven topics: Earth systems and resources, the living\nworld, human population, land and water use, energy resources and consumption, pol-\nlution, and global changes. We merged these glossaries and removed duplicated terms,\nobtaining a dataset of 1686 different words.\nThis uniﬁed dataset was used to explore the coverage of knowledge sources of dif-\nferent type: lexical resources such as WordNet [25], common knowledge ontologies\nsuch as DBpedia [2] and OpenCyc12, and the large amount of online ontologies acces-\nsible in Watson [13].\nThe ﬁrst step of the experiment consisted in searching each word of the input dataset\non each of the above external resources13, obtaining (if available) a set of ontology\nterms from each resource that semantically describe the input word. Table 1 shows the\ndifferent coverage degree obtained on each resource14.\nKnowledge Source Coverage\nDBpedia\n72%\nOpenCyc\n69%\nWordNet\n45%\nWatson\n47%\nTable 1. Coverage of Knowledge Sources\nThe immediate conclusion from the given results is that DBpedia has a better cov-\nerage than the other resources, closely followed by OpenCyc, for the utilized domain\nspeciﬁc vocabularies.\nWe have analysed the uncovered cases in the experiment, noticing that most of\nthem corresponded to complex multiword terms (e.g., “cultural habit”, “distributed wa-\nter governance”). There was also a reduced amount of misspelling errors in the glos-\nsaries (e.g., “ﬁter feeding” for “ﬁlter feeding”) and some terms that do exist in the\nresource however in other syntactic variation (e.g., “meandering” for “meander”). In\nsuch cases (misspelling errors and variations), the grounding could be assisted by ser-\nvices like Yahoo! spelling suggestion15. In order to measure that effect, we repeated\n11 University of Bras´ılia (Brazil), Tel Aviv University (Israel), University of Hull (United King-\ndom), Bulgarian Academy of Sciences (Bulgaria), and University of Natural Resources and\nApplied Life Sciences (Austria).\n12 http://www.opencyc.org\n13 The search mode was “exact match”.\n14 The experimental data can be found in\nhttp://delicias.dia.ﬁ.upm.es/∼jgracia/experiments/dynalearn/groundingcoverage.html\n15 http://developer.yahoo.com/search/web/V1/spellingSuggestion.html\n",
  "speaker": "SYSTEM",
  "uuid": "c159d94b-4ae7-4220-84fa-51f921472818"
}