{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 96\nBÚSQUEDA \n \n96 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nUna operación de construcción: \n(defun crea-nodo (estado padre g h) ...) --> nodo \nCuatro operaciones de acceso: \n(defun estado-de-nodo (nodo) ...) --> estado \n(defun padre-de-nodo (nodo) ...) --> nodo o Nil \n(defun g-de-nodo (nodo) ...) --> número >= 0 \n(defun h-de-nodo (nodo) ...) --> número >= 0 \nEstas cinco operaciones tienen el significado evidente. Además necesitaremos dos \noperaciones de modificación (que ya eran necesarias en la estrategia \"primero el \nmenos costoso\" en grafo del apartado 5.1): \n(defun modifica-padre (nodo nuevo-padre) ...) --> indefinido \n(defun modifica-g (nodo nuevo-g) ...) --> indefinido \nHemos especificado que los valores devueltos por las dos operaciones de \nmodificación quedan \"indefinidos\", porque estas dos operaciones deben ser \nutilizadas para obtener un efecto lateral: la modificación destructiva de la información \npadre (o g, respectivamente) que estaba asociada al nodo que aparece como \nprimer argumento. Obsérvese que no tiene sentido incluir operaciones de \nmodificación para el estado de un nodo (en esencia, el estado es lo que caracteriza \nal nodo) ni para la información h (puesto que estamos suponiendo que la función \nheurística sólo depende del estado y no del modo de llegar a él). \nCon esta estructura para los nodos, los cambios en los algoritmos son los siguientes: \na) En el esquema genérico de búsqueda (en grafo), CERRADOS tiene que ser \nuna lista de nodos (y no de estados). \nb) En reorganizar-nodos-a-expandir, ABIERTOS se ordena por el valor de \ng + h (= f, según la terminología habitual). Esta es la razón por la que CERRADOS \ndebe ser una lista de nodos: puesto que ABIERTOS es ordenada apoyándose en \nuna información que no es segura (la heurística h), podría suceder que un nodo \nfuese extraído de ABIERTOS antes de haber encontrado el mejor modo de llegar al \nestado correspondiente y, por tanto, que los costes deban ser revisados en \nCERRADOS además de en ABIERTOS. \nc) Por lo anterior, el algoritmo de expansión de un nodo queda como sigue: \nExpandir-nodo (n,ABIERTOS,CERRADOS) --> lista nodos \ne := estado-de-nodo (n) \n",
  "speaker": "SYSTEM",
  "uuid": "c1cef46f-fe85-4c98-8891-097771361bda"
}