{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Reporte_de_horas \n\nEsta página intenta aclarar dudas sobre qué son horas de trabajo reportables y qué no, y en caso de serlo, como qué se han de reportar mensualmente.\nContents\n[\nhide\n]\n1\nFinalidad del reporte de horas\n2\nInformación y formato del reporte\n3\nHoras de proyectos\n4\nHoras de tesinas y tesis\n5\nHoras de artículos y conferencias\n6\nHoras de viajes\n7\nHoras de Grupo\n8\nNo son horas\n9\nOtras horas\nFinalidad del reporte de horas\n\nHay que dejar una cosa clara desde el principio: Sí que sirven para algo. Y, por tanto, es obligatorio para todos los miembros y colaboradores del Grupo el reporte mensual de horas.\nLas horas reportadas no tiene la finalidad de controlar si se trabaja o no, sino en qué se trabaja y en qué medida. Esto vale para hacer asignación de esfuerzos a proyectos, para hacer previsión de esfuerzos para tareas que se iteran en el tiempo, para confeccionar reporte de esfuerzos, etc.\nInformación y formato del reporte\n\nEl reporte de horas ha de ser mensual y contener, como mínimo, el total mensual de horas por cada paquete de trabajo de cada proyecto y el total mensual de todo lo trabajado.\nNo existe un formato para el reporte de horas. Hay quien lo escribe en el cuerpo del mensaje, hay quien detalla en una hoja de cálculo por días y reparto (con los totales mensuales), hay quien lo envía en un texto (ya sea en un documento de texto plano, en formato Word, en formato PDF), etc. Mientras contenga la información mínima vale.\nLas horas se contabilizarán con la fracción mínima de cuarto de hora. Toda cantidad con precisión menor será redondeada a esta fracción.\nHoras de proyectos\n\nLas horas de trabajo en tareas de un proyecto se deberán reportar por paquete de trabajo. Ejemplo: NeOn. WP5 - 34 horas.\nEn caso de no ser trabajo específico de ningún paquete de trabajo (revisiones, reuniones UPM o plenarias, etc.), se meterán en el epígrafe \"General\". Ejemplo: ADMIRE. General - 3 horas.\nIgualmente se consideran paquetes de trabajo \"Propuesta\" y \"Negociación\".\nCada miembro del Grupo habrá de preocuparse de enterarse del paquete o paquetes de trabajo para los que realiza tareas, preguntando al jefe de proyecto en cada caso si lo desconoce. Así, \"Portal\" no es un paquete de trabajo, irá al paquete de gestión o de diseminación seguramente.\nSe consideran proyectos los proyectos vigentes y no vigentes. Ejemplo: DynaLearn. WP2 - 12 horas / SEMDATA. Propuesta - 7:15 horas.\nHoras de tesinas y tesis\n\nLos miembros del Grupo que tengan dentro de sus atribuciones el desarrollo de una tesina (TFC, tesis de máster o DEA) o tesis deberá reportar esta horas, pudiendo especificar si es de su gusto tareas dentro de este conjunto. Ejemplo: TM. Documentación - 22 horas / TM. Implementación - 18 horas / TM. Escritura - 4 horas.\nHoras de artículos y conferencias\n\nLos artículos, aunque sobre el trabajo desarrollado dentro de un proyecto y vayan con agradecimientos al proyecto en cuestión, no computarán como horas de proyecto, sino como horas de artículos. Se ha de especificar la conferencia, el\nworkshop\n, la revista o el libro para el que se escribe. Ejemplo: Artículo CAEPIA09 - 13 horas / Artículo DKE - 21 horas.\nSe considerarán también horas de trabajo las dedicadas a la confección de la presentación de los artículos. Ejemplo: DEXA09. Presentación - 4,5 horas.\nIgualmente se considerarán fuera de proyecto la asistencia a las conferencias. Las horas que computarán como trabajo en las conferencias serán las horas de las sesiones asistidas, incluyendo la de la presentación propia. Ejemplo: ESWC09. Asistencia - 17 horas.\nHoras de viajes\n\nLas horas de viaje no computarán como horas de trabajo si no se realiza durante el viaje tareas de trabajo (escritura de artículos, lectura de documentación, reuniones entre los miembros, etc.).\nHoras de Grupo\n\nEl Grupo supone una carga de hora de trabajo en su mayor parte mínima para los miembros del Grupo, pero que se ha de contabilizar y especificar. Así, aparecerán como horas en los reportes mensuales las dedicadas a las reuniones del Grupo (incluyendo preparación de presentación en caso de ser autor de presentación), al mantenimiento de los blogs personales-profesionales que exige el Grupo o las dedicadas a la administración (peticiones de becas, papeleo de contratos, postviajes, etc.). Ejemplos: OEG. Reuniones - 7 horas / OEG. Papeleo - 1:45 horas.\nNo son horas\n\nLa asistencia a defensas de tesinas y tesis. Aunque sea recomendación oficial ir para aprender de los buenos y malos hábitos, es aprendizaje individual y no computa como trabajo del Grupo.\nLos trabajos curriculares particulares no se consideran horas de trabajo del Grupo. Ejemplos: revisión de artículos para conferencias, docencia, preparación de plazas, etc.\nLa investigación no financiada ya sea individualmente o en colaboración con otro miembro del Grupo. También se considera trabajo curricular particular. Ejemplo: Artículo IF&GIS'09 de Vilches y Ramos que es de la tesis de Vilches (son horas suyas) pero no de la tesis de Ramos ni de ningún proyecto del Grupo.\nOtras horas\n\nPara cualquier duda en el reporte de horas, consultar previamente con José Ángel.",
  "speaker": "SYSTEM",
  "uuid": "c2c719f2-ca5f-4f19-9000-3b5337088fc5"
}