{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 6\nDynaLearn exercises  \n6 \n \nAssignment 2: Population Behaviour \nThe main goal of this assignment is to further familiarise the reader with the different \nkinds of building blocks that constitute a qualitative model.  \n \nBasic Population Growth \nThe goal is to create a model that captures the idea of a population and its growth due \nto birth. Essentially three ideas should be represented in the model: \n• Existing populations grow. \n• Growing means that the number of individuals increases. \n• When the number of individuals increases, the biomass increases. \nThe population is thus characterised by three quantities: Number_of, Biomass and Birth \nrate. Notice, the close resemblance between these three quantities and the quantities \ninvolved in the ‘Tree & Shade’ system discussed above. For both systems there is a \ncentral variable (Size and Number_of) that designates the typical situations in which the \nsystem can be. Such a quantity is sometimes called the state variable. Second, there is \na rate that directly (in this case positively) influences the state variable (Growth and \nBirth). Finally, there is a dependent variable that follows the changes in the state \nvariable (Shade en Biomass). In fact, the two systems can be represented following the \nsame general principles. As a result, the ‘Basic population growth’ model can be \nobtained by ‘editing’ the names of the model ingredients in the ‘Tree & Shade’ model. \nThe following changes are required to accomplish this: \n• Entity hierarchy: \no Entity type (1 change). \n• Scenario: \no Name (1 change), entity instance (1 change), quantities (2 changes). \n• Model fragments: \no Name (2 changes), entity type (2 changes), quantities (4 changes). \n \nThe model should consist of two model fragments: a static fragment that describes the \nrelationship between Number_of and Biomass, and a process fragment implementing \nthe influence of Birth. There can be multiple scenarios with varying initial values for the \nquantity Number_of. Simulating the model should produce results similar to those of the \n‘Tree & Shade’ model. Notice that the exact number of states that will be generated \ndepends upon the initial value set for the quantity Number_of. \n \nCompeting Processes \nPopulations not only grow. They may also shrink and become extinct due to dying. The \ngoal of this assignment is to include ‘Death’ as a second process affecting the \npopulation. This process is kind of analogous to the ‘Birth’ process. A quantity Death is \nintroduced, with a negative influence on Number_of. Whilst running the simulation take \nnotice the following: \n• ‘Death’ and ‘Birth’ are competing processes resulting in ambiguity. Given a \ncertain value for Number_of the population may increase, stay steady, or \ndecrease. \n",
  "speaker": "SYSTEM",
  "uuid": "c3b3276d-eaea-42d2-afba-826e0edc3e2b"
}