{
  "message": "SYSTEM: Wiki: La entrega de las prácticas para la convocatoria de junio de 2013 será, como muy tarde, el 1 de julio\nHere we include information for the students of the \"Máster Universitario en Inteligencia Artificial\".\nContents\n[\nhide\n]\n1\nObjectives\n2\nLectures structure\n3\nEvaluation\n4\nSchedule and Material\n5\nHands on activities\n6\nResearch topics\nObjectives\n\nThe aim of this module is to provide the theoretical and practical scientific,\nmethodological and technology basis involved in building ontologies, which will be\nused in building applications that integrate, combine and deduce distributed and\nheterogeneous information. In particular, we will present:\nthe concepts of ontology and annotation in the context of Semantic Web, Web of Data and corporate semantics,\nthe fundamental theory and best-known ontologies;\nlanguages RDF(S) and OWL,\nthe methodologies, methods and techniques used in its building that include guidelines for identifying the life-cycle, specification, planning, conceptualisation, correspondences, reuse, reengineering, etc.;\nmethods and techniques for the annotation of resources and significant applications.\nThroughout the entire module open research problems will be set that allow students to provide innovative solutions.\nSome initial reading to reflect on the objectives:\nhttp://iospress.metapress.com/content/p063121l16757521/fulltext.html\nLectures structure\n\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation\n\nEvaluation will be done on the basis of: RDF(S) and SPARQL work (15%), ontology building assignment (35%), Linked Data assignment (25%) and an optional research work (25%).\nSend your hands-on to the following email\nontologies@delicias.dia.fi.upm.es\nSchedule and Material\n\nLectures will be held every\nTuesday in lecture room 3202, from 17:00 to 19:00\n.\nWeek 1. 11/9/2012. Introduction (Oscar)\nSlides:\n[1]\nIndividual assignment (deadline: 17/09/2012 9pm): discuss and summarise any of the documents in the following reading/watching list in approximately half a page:\nArticles written by TBL in 1996 (\nhttp://www.w3.org/People/Berners-Lee/1996/ppf.html\n) and 2001 (\nhttp://www.scientificamerican.com/article.cfm?id=the-semantic-web\n)\nTED 2009 talk by TBL (\nhttp://www.ted.com/talks/tim_berners_lee_on_the_next_web.html\n)\nWeb and Linked Data design issues technical reports (\nhttp://www.w3.org/DesignIssues/\n,\nhttp://www.w3.org/DesignIssues/LinkedData.html\n)\nLinked Data Vision paper from Bizer et al., 2009 (\nhttp://tomheath.com/papers/bizer-heath-berners-lee-ijswis-linked-data.pdf\n)\nWeeks 2 and 3. 18/09/2012 and 25/09/2012. Ontology languages I - RDF(S) and SPARQL (Oscar)\nRecommended reading:\nChapter 4 of the book \"Ontological Engineering\", W3C documents on RDF, RDF Schema and SPARQL\nJ. Perez, M. Arenas, C. Gutierrez, The Semantics and Complexity of SPARQL. 5th International Semantic Web Conference, ISWC 2006, Athens, Georgia, USA, November 2006.\nhttp://www.dcc.uchile.cl/~cgutierr/papers/sparql.pdf\nComparisons among triple stores:\n[2]\n[3]\nSlides:\nRDF(S)\nSPARQL\nAdditional RDF(S) examples:\nEjemplos RDF(S)\nAssignment (deadline: 01/10/2012): Generate five queries in SPARQL1.1 that use data from several SPARQL endpoints. For example, the following endpoints can be used:\nhttp://geo.linkeddata.es/\n(this one contains several datasets),\nhttp://webenemasuno.linkeddata.es/\n,\nhttp://cultura.linkeddata.es/\nand\nhttp://aemet.linkeddata.es/\n.\nWeek 4. 02/10/2012. Theoretical Foundations of Ontologies (Asun)\nRecommended reading:\nChapter 1 and 2 of the book \"Ontological Engineering\". A. Gomez-Perez, M. Fernández, O. Corcho. Ed Springer. (2003)\nKnowledge representation in Frames and Semantic Networks. Book: Ingenieria del Conocimiento. Ed Ceura.\nSlides: [\nFoundations of ontologies\n]\nReadings:\nGuarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nSearch for ontologies in your favourite domain.\nWeek 5a. 09/10/2012 17:00-18:00. Selection of representative for the Master\n. Unfortunately, unless every single student registered in the master arrives early, we will have to spend the whole hour with this process.\nWeek5b. 09/10/2012 18:00-19:00. Discussion about SPARQL hands-on exercises (Oscar)\nWeek 6. 16/10/2012. Methodologies I. Lifecycle. Specification and planning  (Asun)\nSlides:\n[4]\nRecommended reading:\nChapter 3 of the book \"Ontological Engineering\". A. Gomez-Perez, M. Fernández, O. Corcho. Ed Springer. (2003)\nOntology Engineering in a Networked World. MC. Suarez-Figueroa; A. Gómez-Pérez; E. Motta; A. Gangemi (2012)\nChapter 1: Introduction\nChapter 2: The NeOn Methodology\nChapter 5: Ontology Requirement Specification\nChapter 14: Scheduling Ontologies using gOntt\nNeOn Book summaries:\nhttp://www.neon-project.org/nw/NeOn_Book\nWeek 7. 23/10/2012. Methodologies II. Conceptualisation, reuse and reengineering (Asun)\nRecommended Readings:\nNeOn Book. NeOn Methodology in a Nutshell:\nhttp://www.neon-project.org/nw/NeOn_Book\nA Pattern-Based Method for Re-engineering Non-Ontological Resources into Ontologies\ngOntt paper\nPhD Thesis:\nNeOn Methodology for Building Ontology Networks: Specification, Scheduling and Reuse\nPhD Thesis:\nMethod for Reusing and Re-engineering Non-ontological Resources for Building Ontologies\nOther interesting links:\nNeOn Toolkit:\nhttp://neon-toolkit.org/wiki/Download\nSlides:\n[5]\nAssignment: At the end of the methodology lectures you should deliver an ontology in a particular domain.\nWeek 8.  30/10/2012. OWL (Oscar)\nSlides:\n[6]\nAdditional material:\nPeople and pets example\nWeek 9. 6/11/2012. Methodologies III. Ontology design patterns (Asun)\n[7]\nWeek 11. 20/11/2012. Presentation of work made by students (Ontologies)\n. To be delivered by 19/11/2012 at 11pm\nWeek 12. 27/11/2012. Linked Data. Introduction and Methodology for Linked Data Generation and Publishing (Oscar)\nRecommended reading:\nBook \"Linked Data: Evolving the Web into a Global Data Space\", Bizer C., Heath T.\n[8]\nSlides:\n[9]\nWeek 13. 4/12/2012. Linked Data Vocabularies (Asun)\nSlides:\n[10]\nWeek 14. 11/12/2012. Linked Data Applications (Asun)\nInitially José Manuel Gómez, the R&D Director of iSOCO, was going to give a talk, but unfortunately, he could not make it. We will see whether it can be done in January.\nWeek 15. 18/12/2012. Linked Data Generation Tools (Oscar)\nSlides:\n[11]\nWeek 16. 08/01/2013. Presentation of research topics\nWeek 17. 15/01/2013. Presentation of work made by Students (Linked Data)\n. To be delivered by 14/01/2013 at 11pm\nHands on activities\n\nAll hands-on activities must be submitted by e-mail to ontologies@delicias.dia.fi.upm.es\nAdditional sources that have been recently proposed\nDetails about TVE programs:\nhttp://www.rtve.es/api/agrupadores/42170/programas.xml\nor\nhttp://www.rtve.es/api/agrupadores/42170/programas.json\nFor this data source, it may be useful to analyse what has been done at the project\nhttp://vista-tv.eu/\nData from EMT (bus company in Madrid). API details can be provided on demand for those interested on it.\nData from the census of business units in Madrid.\nhttp://www.madrid.es/portales/munimadrid/es/Inicio/Ayuntamiento/Estadistica/Censo-de-locales/Censo-de-Locales?vgnextfmt=detNavegacion&vgnextoid=4ba708e2a77bd210VgnVCM2000000c205a0aRCRD&vgnextchannel=2bd6eea8e3e5d210VgnVCM1000000b205a0aRCRD\nData from the Open Data portal of Zaragoza city council.\nhttp://www.zaragoza.es/ciudad/risp\nPress contact information from the Spanish Government:\nhttp://www.lamoncloa.gob.es/nr/rdonlyres/120271bf-7c97-422e-b6b0-3938b9be2e5f/0/agenda2012.pdf\nThe objective of this hands-on activity will be the design and implementation of a lightweight ontology network to be used for linked data generation, taking into account open and public data in Spanish, the transformation of some of the selected data sources into RDF according to such ontology network, and the linkage of these data sources with resources from the Web of Data (e.g., DBpedia [1], GeoLinkedData [2], GeoNames [3], etc.).\nEach team has to select one of the data sources made available in the following list (those are coming from\nhttps://datospublicos.jottit.com/\n,\nhttp://alarcos.esi.uclm.es/per/fruiz/pobesp/\n,\nhttp://datos.gob.es/\nand\nhttp://eufunds.ftdata.co.uk/\n):\nDirección General de Tráfico\nCenso Nacional de Instalaciones deportivas\n. Students must select at least 10 cities from there, which can be discussed with us, whose data should be transformed.\nOpen data\navailable at this site. Students can select the tables that they want to transform (Muncipios, Islas, Provincias, Population, etc.). At least 5 tables should be transformed by students, who have to discuss this with us, so that we can avoid overlaps between them.\nIncidencias de tráfico\n(traffic issues) in Spain. Students should select 5 tables, which can be discussed with us, so that we can avoid overlaps between them.\nFinancial Times EU Funds Database\n. Students can select one or several cities, companies, organisations, etc., from Spain, and obtain data from this online database. Once taken, as this data can be downloaded in CSV format, it has to be transformed.\nWe will value more those solutions that are more general and that allow regenerating the data without any manual intervention if there is a change in the data sources.\nThe ontology can be implemented with any of the following tools: Jena [4], NOR2O [5] and the NeOn Toolkit [6].\nFinally, once that you have selected the data sources that you want to publish, you must notify them by e-mail to us, so that we record your decision and can avoid overlaps with others.\n[1]\nhttp://dbpedia.org/\n[2]\nhttp://geo.linkeddata.es/\n[3]\nhttp://www.geonames.org/\n[4]\nhttp://jena.sourceforge.net/\n[5]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[6]\nhttp://www.neon-toolkit.org/\nResearch topics\n\nLinked Data lifecycle\nDistributed SPARQL querying\nSemantic sensor networks\nOWL Debugging\nOntology Design Patterns\nOntology Reuse\nTransformation of Knowledge-aware Resources\nRDF compression:\nhttp://www.rdfhdt.org/\nRecommended reading (Ontology Matching):\nJ.Euzenat \"Tutorial on Ontology Matching\" (at least the section titled \"Matching problem\").\n[12]\nJorge Gracia begin_of_the_skype_highlighting     end_of_the_skype_highlighting begin_of_the_skype_highlighting     end_of_the_skype_highlighting and Eduardo Mena, \"Web-based Measure of Semantic Relatedness\", Proc. of 9th International Conference on Web Information Systems Engineering (WISE 2008), Auckland (New Zealand), Springer Verlag LNCS, volume 5175, pp. 136-150, September 2008.\n[13]\nSlides: 2.\nSemantic Measures and Ontology Matching: an Overview and some Examples",
  "speaker": "SYSTEM",
  "uuid": "c3cd17e7-b936-49cf-b0f4-b2eb55da64ed"
}