{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 42\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 42 de 42 \n5. DCAI 2016. (13th International Symposium on Distributed Computing and Artificial \nIntelligence). Sevilla, España. Junio 2016. \n6. MIS4TEL 2016. (Methodologies and Intelligent Systems for Technology Enhanced \nLearning). Sevilla, España. Junio 2016. \n7. PAAMS 2016 (14th International Conference on Practical Applications of Agents and \nMultiagent Systems). Sevilla, España, Junio 2016. \n8. PACBB 2016. (10th International Workshop on Practical Applications of Computational \nBiology and Bioinformatics). Sevilla, España. Junio 2016. \n9. SAMI 2016. (7th International Symposium on Ambient Intelligence). Salamanca, \nEspaña. Junio 2016. \n10. Special Session on Agents and Mobility. PAAMS 2016 (14th International Conference \non Practical Applications of Agents and Multiagent Systems). Sevilla, España. Junio \n2016. \n11. 4th Workshop on Agents for Ambient Assited Living. PAAMS 2016 (14th International \nConference on Practical Applications of Agents and Multiagent Systems). Sevilla, \nEspaña. Junio 2016. \n12. “Datos Enlazados y Multilingüismo para la Lingüística y las Humanidades Digitales”, \nMadrid, Spain. Octubre 2015. \n13. 1st Summer Datathon on Linguistic Linked Open Data (SD-LLOD-15). Direction, tutoring \nand local organization. Junio 2015. \n14. 1st Summer School on Smart Cities and Linked Open Data (LD4SC-15). Direction, \ntutoring and local organization. Junio 2015. \n15. 13th International Semantic Web Conference (ISWC2014). Student Coordination Chair. \nOctubre 2014. \n16. Multilingual Web Workshop 2014. Local Organization. Mayo 2014. \n17. 6th International Workshop on Semantic Sensor Networks (SSN2013). Programme \nCommittee Chair. Octubre 2013. \n18. 10th European Summer School on Ontological Engineering and Semantic Web \n(SSSW13). Direction, tutoring and local organization. Julio 2013. \n19. 11th European Semantic Web Conference (ESWC2013). Programme Committee Chair. \nMayo 2013. \n20. 10th International Conference on Terminology and Artificial Intelligence. Paris, Octubre \n2013. Chair of the Conference \n21. 5th International Workshop on Semantic Sensor Networks (SSN2012). Programme \nCommittee Chair. Noviembre 2012. \n22. 9th European Summer School on Ontological Engineering and Semantic Web \n(SSSW12). Direction, tutoring and local organization. Julio 2012. \n23. 10th Terminology and Knowledge Engineering Conference (TKE2012). Conference \nChair and Local Organization. Junio 2012. \n24. Future Internet Symposium (FIS2012). Programme Committee Chair for Semantics. \nMayo 2012. \n25. PhD Symposium at the 10th European Semantic Web Conference (ESWC2012). \nProgramme Committee Chair for Semantics. Mayo 2012. \n26. Dagshtul Seminar on “Large Scale Semantic Data Management”. Co-Chair. Abril 2012. \n27. 8th European Summer School on Ontological Engineering and Semantic Web \n(SSSW11). Direction, tutoring and local organization. Julio 2011. \n28. 7th International Conference on Knowledge Capture (KCAP2011). Programme \nCommittee Chair. Junio 2011. \n29. 8th European Summer School on Ontological Engineering and Semantic Web. \nCodirección, vice-dirección, organización local, secretariado, tutorial. Julio 2011. \n30. 17th International Conference on Knowledge Engineering and Knowledge Management \n(EKAW2010). Poster and Demo Chair. Octubre 2010. \n31. 7th Extended Semantic Web Conference (ESWC2010). Sensor Network track chair. \nMayo 2010. \n \n",
  "speaker": "SYSTEM",
  "uuid": "c422597f-1fd4-4fc0-95d2-30c2e4adfe3a"
}