{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 30\n \n \nPág. 32 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nextraer mediante análisis automático de los grandes corpora documentales (historiales \nclínicos, solicitudes de ayudas, contratación pública, patentes, etc.). \nSiguiendo, además, las recomendaciones de la Comisión para la Reforma de las \nAdministraciones Públicas (CORA), la Administración española se plantea la necesidad de evitar \nduplicidades, simplificar, aplicar economías de escala y proporcionar servicios públicos comunes \nde calidad. En consecuencia, en esta línea se propone la creación de sendas plataformas \ncomunes de procesamiento de lenguaje natural y de traducción automática, basadas en \ncomponentes reutilizables de procesamiento del lenguaje natural y traducción automática para \nlas Administraciones públicas. \nAdemás, estas plataformas pueden fortalecer el papel tractor de la demanda de las \nAdministraciones Públicas y proporcionar servicios demostradores que muestren aplicaciones \nde las tecnologías de procesamiento de lenguaje natural y de la traducción automática. Así \nmismo, estas plataformas pueden ser de utilidad para los sectores innovadores e \ninvestigadores. \nObjetivos: \nLos objetivos de esta línea son los siguientes:  \n \nMejorar la calidad y capacidad del servicio público incorporando las tecnologías de \nprocesamiento de lenguaje natural y de la traducción automática. \n \nDotar de herramientas comunes para facilitar el procesamiento del lenguaje natural y la  \ntraducción automática a las Administraciones públicas. \n \nEn concordancia con las recomendaciones CORA, simplificar, lograr sinergias y aplicar la \neconomía de escala en la puesta en marcha de nuevos servicios basados en tecnologías \nde procesamiento de lenguaje natural y traducción automática. Se busca el ahorro de \ncostes mediante la compartición de recursos entre las Administraciones Públicas, y la \neliminación de duplicidades y redundancias; además de mediante la mejora de la \neficiencia de los procedimientos y la mejora del conocimiento. La plataforma se basará \nen el empleo de componentes reutilizables e interoperables, y, preferentemente, con \nlicencias no restrictivas de código abierto. \n \nDisponer herramientas comunes para la generación, evaluación y explotación de los \nrecursos lingüísticos. \n \nLos flujos de procesamiento se deberán ejecutar tanto en la plataforma física común \ncomo mediante su reproducción sencilla en plataformas locales, para atender a \nnecesidades de altos niveles de protección de la confidencialidad o casos de volúmenes \nmuy grandes de información difíciles de desplazar. \n \nCompartir infraestructuras y sistemas entre los proyectos innovadores que sean \napoyados desde las instituciones públicas. También podrán ser usados tras la \nfinalización de los proyectos como centros demostradores online. \n",
  "speaker": "SYSTEM",
  "uuid": "c45dbf48-2b3f-4b83-b950-9fcdd4ceab78"
}