{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 93\n91\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nAuthoring/Creation are systems to create, or re‐create text and documents. Authoring tools provide support\nwhen creating textual content, particularly in formal and technical communication authoring.\nAuthoring/Creation tools include checking tools (for spelling or grammar), controlled authoring environ‐\nments, author memory systems, summarization engines, and new applications that use text mining to\nenhance the writing or publishing process.\nAuthoring and creation applications include products for authoring any type of content. Authoring and cre‐\nation is only concerned with those that have specific features for facilitating the creation of customized con‐\ntent. Such customization features include the use of a content ontology that enables the description of con‐\ntent components for subsequent personalized selection, the direct assembly of customized documents from\npreviously defined components, and the embedding of customized content selection formulas within a doc‐\nument template. The range of technologies combined for authoring and creation applications go from NPL\nto statistical algorithms.\nSeveral markets have contributed to the evolution of authoring and creation: \n• Content management: These solutions cover a great deal of territory ‐ everything from document and\nWeb content storage to XML content management, digital asset management, and related workflow.\n• Output management. This technology focuses on improving the efficiency of generating and distribut‐\ning paginated documents through print job queuing, multichannel distribution, and delivery workflow.\n• Enterprise information portals. These products can already customize content based on user profile or\nother criteria. Because they currently focus almost exclusively on HTML output, they lack a paginated\npresentation model. \n• Content access tools. These products provide content search, document categorization, and question\nanswering capabilities so they already perform parameterized content processing.\nApplications\nThe motivation to adopt authoring and creation technologies stems from a desire to improve process effi‐\nciency and customer relationships by communicating more effectively.\nEfficient customization and personalization of documents is one means to improve this communication. A\ncustomized document can incorporate the timeliest data, eliminate extraneous information, and address the\nspecific needs of each target audience. These advantages deliver different benefits depending on the docu‐\nments business purpose:\n• Offers. Offers inform another party about the availability and conditions of a potential transaction.\nOffers include documents such as direct marketing letters, quotes, and proposals. Customizing these\ndocuments can make them more appealing, generate higher response rates, and accelerate the closing\nof business, especially in time‐based business (e.g., quote‐to‐cash).\n• Contracts. Contracts document the terms of a potential or past transaction or other business agree‐\nment between two or more parties. Contracts include documents such as subscriber agreements, soft‐\nware licenses, and insurance policies. Customizing these documents can reduce conflicts by making\nthem more comprehensible and can also allow enterprises to be more selective about when they offer\ncertain terms.\n• Products and publications. Documents can themselves be products. Externally‐focused products\n",
  "speaker": "SYSTEM",
  "uuid": "c46b6f42-4fb3-4145-a2c0-7c090cbfa12d"
}