{
  "message": "SYSTEM: Curriculum_abreviado_CVA_Proyectos_2016.pdf: Página 3\n \n3 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nVillata, S., Breslin, J., Faron-Zucker, C., Zimmerman, A. (Eds.) The Semantic Web: ESWC \n2015 Satellite Events (Vol. 9341), LNCS, Springer, pp. 283-294 (ISBN: 978-3-319-25638-2). \n \nVila-Suero, D., Gómez-Pérez, A., Montiel-Ponsoda, E., Gracia, J., Aguado-de-Cea, G. \n(2014). Multilingual Linked Data Life Cycle. En Buitelaar, P. and Cimiano, P. (Eds.), Towards \nthe Multilingual Semantic Web. Springer, pp. 31-47 (ISBN: 9783662435847). \n \nBuitelaar, P., Cimiano, P., McCrae, J., Montiel-Ponsoda, E. (2012). On the role of senses in \nthe ontology-lexicon. En A. Oltramari, L. Qin, P. Vossen, E. Hovy (Eds.), New Research \nTrends of Research in Ontologies and Lexical Resources. Springer, pp 43-61 (ISBN 978-\n3642317811). \n \nMeilicke Ch., García-Castro, R., Freitas, F., Robert van Hageb, W., Montiel-Ponsoda, E., \nRibeiro de Azevedoa, R., Stuckenschmidt, H., Šváb-Zamazal, O., Svátek, V., Tamilin, A., \nTrojahn, C., Wangb, S. (2012). MultiFarm: A benchmark for multilingual ontology matching. \nEn Journal of Web Semantics, 15, pp. 62-68. \n \nMcCrae, J., Montiel-Ponsoda, E., Cimiano, P. (2012). Integrating WordNet and Wiktionary \nwith lemon. En C. Chiarcos et al. (eds.), Linked Data in Linguistics, Springer, pp. 25-34 (978-\n3-642-28249-2). \n \nEspinoza Mejía, M., Montiel-Ponsoda, E., Aguado, G., Gómez-Pérez, A. (2012). Ontology \nLocalization. En M.C. Suárez-Figueroa, A. Gómez-Pérez, E. Motta, A. Gangemi. (Eds.), \nOntology Engineering in a Networked World. Springer, 171-191 (ISBN 978-3-642-24794-1). \n \nMcCrae, J., Aguado-de-Cea, G., Buitelaar, P., Cimiano, P., Declerck, T., Goméz-Pérez, A., \nGracia, J., Hollink, L., Montiel-Ponsoda, E., Spohr, D., Wunner, T. (2012). Interchanging \nlexical resources on the Semantic Web. En Language Resources and Evaluation, 46. \n \nGracia, J., Montiel-Ponsoda, E., Cimiano, P., Gómez-Pérez, A., Buitelaar, P., McCrae, J. \n(2011). Challenges for the multilingual Web of Data. En Journal of Web Semantics, pp.63-71. \n \nMontiel-Ponsoda, E., Aguado-de-Cea, G., Goméz-Pérez, A., Peters, W. (2010). Enriching \nOntologies with Multilingual Information. En Natural Language Engineering 17, pp 283-309. \n \nCimiano, P., Montiel-Ponsoda, E., Buitelaar, P., Espinoza, M., Gómez-Pérez, A. (2010). A \nNote on Ontology Localization. En Journal of Applied Ontology 2(5), pp 127-137.  \n \nC.2. Proyectos \nTítulo del proyecto: LIDER- Linked Data as an enabler of cross-media and multilingual \ncontent analytics for enterprises across Europe \nEntidad financiadora: Unión Europea \nEntidades participantes: UPM, Trinity College Dublin, Deutsches Forschungszentrum für \nKünstliche Intelligenz (DFKI), National University of Irland, Institut für Andgewante Informatik \nEv., Universität Bielefeld, Universita degli studi di Roma, La Sapienza.  \nDuración, desde: 01-12-2013    \nhasta: 01-12-2015  \nCuantía presupuesto Facultad de Informática: 693.775 € \nCuantía subvención Facultad de Informática: 476.858 € \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 25 \n \nTítulo del proyecto: Monnet-Multilingual Ontologies for Networked Knowledge (FP7-248458) \nEntidad financiadora: Unión Europea \nEntidades participantes: National University of Ireland, Deutsches Forschungszentrum für \nKünstliche Intelligenz GmbH DFKI, Universität  Bielefeld, Universidad Politécnica de Madrid, \nSAP AG, XBRL Europe, Be Informed. \nDuración, desde: 01-03-2010 \nhasta: 28-02-2013 \nCuantía subvención Facultad de Informática: 279.319 € \nInvestigador responsable: Paul Buitelaar \n",
  "speaker": "SYSTEM",
  "uuid": "c52d2d4c-dc3f-4c58-b977-c57931c3365d"
}