{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 11\n \n \n11\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n11.4.  Así mismo la UPM fomentará la visibilidad de la producción científica resultante de la \nactividad desarrollada proporcionando la integración, conservación y preservación de \nla misma en el Archivo Digital de la UPM como repositorio institucional, a través del \nacceso http://oa.upm.es/ \n \nDUODÉCIMO.-  RÉGIMEN DE INCOMPATIBILIDADES \n \n12.1. La percepción de una ayuda en régimen de beca o de contrato al amparo de esta \nconvocatoria es incompatible con cualquier otra beca o ayuda financiada con fondos \npúblicos españoles o comunitarios, salvo lo indicado en los artículos 10.9, 5.1 y 5.2 o \nayudas equivalentes de las administraciones públicas, y con sueldos o salarios que \nimpliquen vinculación contractual o estatutaria del adjudicatario. \nLos adjudicatarios de la ayuda suscribirán declaración responsable de no estar \nacogidos a un régimen de incompatibilidad que impida legalmente la adjudicación de \nla ayuda. \n12.2. El incumplimiento total o parcial de los requisitos y obligaciones establecidas en la \npresente convocatoria y demás normas aplicables, dará lugar a la apertura de un \nexpediente de incumplimiento, cuya resolución, previa audiencia del interesado, \npodrá dar lugar a la revocación de la ayuda concedida parcial o totalmente y a la \nobligación de reintegrar la cuantía que se establezca en función de los criterios \naplicables y los intereses de demora correspondientes conforme a lo dispuesto en la \nLey General de Subvenciones (Ley 38/2003, de 17 de noviembre) \n \n \nII. INSTRUCCIÓN, RESOLUCIÓN Y PUBLICACIÓN DE LAS AYUDAS  \n \nDECIMOTERCERO.-  FORMALIZACIÓN DE SOLICITUDES \n \n \n13.1.  Los modelos de solicitud telemática y el resto de documentos estarán a disposición \nde los interesados en la página web de la UPM en la siguiente dirección:  \nhttps://www.upm.es/investigadores/ayudas_doctorado \n13.2.  Las instancias deberán ser presentadas en cualquier Registro de las Escuelas o \nFacultades de la Universidad Politécnica de Madrid, antes de las 13.30 horas del día \n16 de noviembre de 2009. \n13.3.  La instancia de solicitud, que deberá contar con el aval del Director, deberá \nacompañarse de los documentos siguientes, formalizados según las instrucciones \ndetalladas en los formularios: \na) \nCurriculum vitae del solicitante. \nb) \nMemoria del proyecto de investigación a realizar durante el disfrute de la ayuda, \nincluyendo la disponibilidad de material necesario en laboratorios, otros medios y \nespacio puestos a disposición del beneficiario con el compromiso expreso del \nDirector de proporcionar éstos. \n",
  "speaker": "SYSTEM",
  "uuid": "c55629f9-a6d6-4bca-9e03-2367fcb84138"
}