{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 23\n \n \nPág. 25 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nTecnologías del Lenguaje. \n- Medida 1: Creación del Comité de Dirección: \nSe creará el Comité de Dirección del Plan de Impulso de las Tecnologías del Lenguaje con las \nsiguientes funciones: \n \nEstablecer un mecanismo de coordinación, colaboración, intercambio de experiencias \ny ayuda mutua entre los órganos competentes de la Administración General del \nEstado y de otras Administraciones, que evite el solapamiento de actuaciones y \nbusquen su complementariedad, en aras de la optimización conjunta del beneficio \nesperado, derivado de todas las actuaciones del Plan de Impulso de las Tecnologías \ndel Lenguaje. \n \nEvaluar de forma periódica la situación en los distintos ejes de actuación del Plan  \npara planificar en detalle (planificación operativa) y evaluar el avance del Plan.  \n \nNombrar y cesar a los miembros del Comité de Expertos que se define más adelante. \nEstablecer un proceso ágil de toma de decisiones. \n \nEl Comité de Dirección podrá crear grupos de trabajo para tareas específicas. \nEl Comité de Dirección del Plan de Impulso de las Tecnologías del Lenguaje estará \nconstituido inicialmente por: \n \nSecretaría de Estado de Turismo. \n \nSecretaría de Estado de Investigación, Desarrollo e Innovación. \n \nSecretaría de Estado de Cooperación Internacional y para Iberoamérica. \n \nSecretaría de Estado de Cultura. \n \nSecretaría de Estado de Telecomunicaciones y para la Sociedad de la Información. \n \nSubsecretaría de Educación, Cultura y Deporte. \n \nSubsecretaría de la Presidencia. \n \nSubsecretaría de Sanidad, Servicios Sociales e Igualdad. \n \nDirección de Tecnologías de la Información de la Administración General del Estado. \n \nSecretaría General de Industria y de la Pequeña y Mediana Empresa. \nEl desarrollo de las diversas fases del Plan de  Impulso de las Tecnologías del Lenguaje, y su \npropia evolución especialmente en relación con los proyectos verticales, determinarán qué \nórganos de la Administración General del Estado son competentes en cada momento.  \n- Medida 2: Creación del Comité de Expertos:  \n",
  "speaker": "SYSTEM",
  "uuid": "c57366d6-507a-4e1e-87e2-53864ea8edec"
}