{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 13\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \nhistoria, estética y educación. Está formado por más de 3.500 términos junto \ncientos de imagines, notas de pronunciación, citas y referencias cruzadas. \n- \nNúmero total de términos: 3.600. \n- \nTipos de relación: asociativa. \n- \nDisponible en la Web para consultas online. \n- \nEjemplo: \n9 music - Among all the arts, this is the art of arranging sounds in time, \nresulting in a composition that elicits an aesthetic response in the listener. \n2. Multilingual Glossary of Art Librarians \n- \nhttp://www.ifla.org/VII/s30/pub/mg1.htm \n- \nPublicado por: International Federation of Library Associations & Institutions \n- \nTipo: Lexicón \n- \nNúmero total de términos: 586 \n- \nTipos de relaciones: jerárquica \n- \nDescripción: Glosario de términos de arte. Las definiciones aparecen en ingles \npero los términos están disponibles en otros 6 idiomas (holandés, ingles, francés, \nalemán, italiano, español y sueco). \n- \nDisponible en la página web para consulta online. Archivo HTML descargado.  \n3. Words of Art \n- \nhttp://web.ubc.ca/okanagan/creative/links/glossary.html \n- \nPublicado por: Okanagan University Collage \n- \nTipo de documento: Lexicón. \n- \nDescripción: glosario de terminología referida a las artes. \n- \nNúmero total de términos: 1850 \n- \nTipo de relación: asociativa. \n- \nDisponible en la página web para consulta online. En inglés. \n4. WebRef \n- \nhttp://www.webref.org/ \n- \nPublicado porr: Iverson Software Co. \n- \nTipo: Lexicón \n- \nColección de glosarios referentes a ciencias físicas, sociales y biológicas. También \nincluye glosarios referentes al arte y un conjunto de biografías. En el dominio de \nciencias físicas se incluye acústica, química, electrónica, ciencias ambientales y \ngeología. Para ciencias sociales, antropologías, arqueología, ciencias políticas, \npsicología y sociología. En el ámbito de las ciencias biológicas, agricultura, \nbiología, biotecnología, cáncer, invertebrados y plantas. Para las artes estéticas, \narquitectura, danza y otros artes, así como, información biográfica, compositores y \ncientíficos. Muchos de los términos proceden de otras fuentes como el glosario de \n \n13\n",
  "speaker": "SYSTEM",
  "uuid": "c5978db1-8e5a-4921-b818-36773d92969b"
}