{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 90\nPage 90 of 124\nNeOn Integrated Project EU-IST-027595\nTable 5.3: Pattern for Re-engineering a Thesaurus(continued)\nSlot\nValue\nExample\n1. Create the Environment class.\n2. Create the Mineral resources class and assert that Mineral resources\nis subClassOf Environment.\n2.1. Create the Fossil fuels class and assert that Fossil fuels is sub-\nClassOf Mineral resources.\n2.2. Create the Mineralogy class and assert that Mineralogy is relatedClass\nMineral resources.\n2.3. Create the Minerals label and assert that Minerals is label of Mineral\nresources.\n2.4. Create the Mining class and assert that Mining is subClassOf Fossil\nfuels.\n2.5. Create the Coal label and assert that Coal is label of Fossiel fuels.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\nPR-NOR-TSLO-04. Pattern for re-engineering a concept-based thesaurus which follows the relation-\nbased data model\nThe pattern for re-engineering thesaurus shown in Table 5.4 suggests a guide to transform a thesaurus into\na lightweight ontology. The thesaurus is a concept-based one and it is modeled with a relation-based data\nmodel. This pattern aims at creating a lightweight ontology from the thesaurus, being the semantics of the\nBT/NT relations between terms the subClassOf relationship.\nTable 5.4: Pattern for Re-engineering a concept-based thesaurus which follows\nthe relation-based data model\nSlot\nValue\nGeneral Information\nName\nConcept-based Thesaurus to Lightweight Ontology (relation-based model)\nIdentiﬁer\nPR-NOR-TSLO-04\nType of Component\nPattern for Re-engineering Non-Ontological Resources (PR-NOR)\nUse Case\nGeneral\nRe-engineering a concept-based thesaurus which follows the relation-based model to design\na Lightweight Ontology.\nExample\nSuppose that someone wants to build a lightweight ontology based on the Art and Architec-\nture Thesaurus (AAT), which is used to describe art, material culture, and archival materials.\nPattern for Re-engineering Non-Ontological Resources\nINPUT: Resource to be Re-engineered\nGeneral\nA non-ontological resource holds a concept-based thesaurus which follows the\nrelation-based model.\nA thesaurus represents the knowledge of a domain with a collection of terms and a limited\nset of relations between them.\nThe relation-based data model [Soe95] is a normalized structure, in which relationship\ntypes are not deﬁned as ﬁelds in a record, but they are simply data values in a relationship\nrecord, thus new relationship types can be introduced with ease.\nExample\nThe Art and Architecture Thesaurus (AAT) is used to describe art, material culture, and\narchival materials.\nThe relation semantics between the sub-ordinate and the super-ordinate concepts is\nsubClassOf.\nGraphical Representation\n",
  "speaker": "SYSTEM",
  "uuid": "c5a1f76b-a52d-4d8b-9f5b-6363b6f13f33"
}