{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 9\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97734\ngenerar por los fondos librados por anticipado a los beneficiarios no incrementarán el \nimporte de la ayuda concedida.\n3.  En aquellos casos en los que sea legalmente exigible, las entidades colaboradoras \ncomo centros de adscripción de los beneficiarios de las ayudas, deberán presentar \ndeclaraciones responsables de estar al corriente de sus obligaciones tributarias y frente a \nla Seguridad Social, así como el pago de obligaciones por reintegro.\n4.  De acuerdo con lo establecido en el artículo 1 de la Ley 62/2003, de 30 de \ndiciembre, de medidas fiscales, administrativas y del orden social, estas ayudas para la \nformación de personal investigador en su período de beca están exentas del Impuesto \nsobre la Renta de las Personas Físicas.\n5.  Los organismos, centros o instituciones, realizarán en su caso las correspondientes \nretenciones fiscales e ingresos por los pagos que realicen al personal investigador en \nformación.\n6.  El pago de las ayudas que puedan corresponder por las ayudas a las que se \nrefieren los capítulos V, VI y VII de esta convocatoria, se abonarán directamente a \norganismos, centros o instituciones de adscripción de las ayudas o universidades de \nmatrícula, en el caso de los precios públicos.\nArtículo 13.  Justificación de las ayudas.\n1.  Los beneficiarios de las ayudas presentarán las memorias anuales de seguimiento \na las que se refiere el capítulo IV de la presente Orden.\n2.  De acuerdo con los artículos 69 y 75 del Real Decreto 887/2006, de 21 de julio, por \nel que se aprueba el Reglamento de la Ley 38/2003, de 17 de noviembre, General de \nSubvenciones, la modalidad de justificación de la subvención será la cuenta justificativa \nsimplificada, que incluirá certificación, a realizar por el organismo de adscripción de los \ngastos efectuados en la ejecución de cada una de las ayudas que le hayan sido concedidas, \nasí como en su caso, carta de pago de reintegro en el supuesto de remanentes no aplicados \nasí como de los intereses derivados de los mismos.\nEsta certificación, de carácter anual, deberá presentarse en la Dirección General de \nPolítica Universitaria antes del 31 de marzo de cada año con los gastos efectuados hasta \nel 31 de diciembre del año anterior y deberá realizarse de acuerdo con lo establecido en el \nartículo 30 de la Ley 38/2003, de 17 de noviembre, General de Subvenciones, el Convenio \nde colaboración suscrito y las disposiciones que se establezcan en las resoluciones de \nconvocatoria así como a las instrucciones que establezca la Dirección General de Política \nUniversitaria.\n3.  En caso de extinción o de rescisión de la ayuda para la que se hubiese concedido \nfinanciación, los fondos no invertidos deberán ser reintegrados al Tesoro Público. No se \naplicaran intereses de demora en los casos de reintegros cuyo origen tenga como causa \nsituaciones ajenas a los beneficiarios o a los organismos perceptores de las mismas.\nArtículo 14.  Características del desarrollo de las ayudas.\n1.  Los adjudicatarios de subvenciones de la presente convocatoria, se beneficiarán \nde los derechos que de ella se deriven, a partir de la fecha de alta que corresponda en \nfunción de la incorporación del becario y presentación de la documentación.\n2.  La incorporación de los beneficiarios a los respectivos centros de adscripción se \nproducirá a partir del primer día hábil al de la publicación en la página Web del Ministerio \nde Educación (http://web.educacion) de la Resolución de concesión de las ayudas. El \nplazo máximo de incorporación será de un mes contado a partir del día siguiente al de la \npublicación de la resolución de concesión en el Boletín Oficial del Estado. Si el beneficiario \nno se incorporara al centro de adscripción de la beca en el plazo indicado, se entenderá \nque renuncia a la misma.\nEn casos excepcionales y debidamente justificados, la Dirección General de Política \nUniversitaria podrá autorizar el aplazamiento de la incorporación hasta un máximo de seis \nmeses, contados desde la finalización del plazo máximo de incorporación. La solicitud de \naplazamiento deberá ser presentada en el impreso normalizado dentro del mes de plazo \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "c78c1d34-4e4d-4055-9b06-641466975d28"
}