{
  "message": "SYSTEM: Wiki: Open PhD Position at Freie Universitaet Berlin\nCorporate Semantic Web\nAG Corporate Semantic Web  (\nhttp://www.inf.fu-berlin.de/en/groups/ag-csw/\n) at the Freie Universitaet Berlin is currently seeking candidates for two  positions as a PhD student in a 2-year industrial research project in Semantic Patent Informatics. The project is aiming at the semantic representation and reasoning on patents and national patent laws.\nFreie Universitaet Berlin is a leading research institution. It is one of the nine German Elite universities successful in all three funding lines in the federal and state Excellence Initiative. The AG Corporate Semantic Web at the Freie Universitaet Berlin was founded in 2008 and has developed into a challenging and dynamic research group. Our major objective is to establish Semantic technologies as a core pillar of modern enterprise information technology and systems.\nWe offer\nA stimulating environment of a leading research group in the fields of Semantic Web, formal languages and reasoning, rule-based and ontology-based systems and services\nExcellent ties to research groups worldwide\nUp-to-date infrastructure and resources, including funding for  attending international conferences, PhD symposia, summer schools, etc.\nOpportunity to work with internationally established academic and industrial partners\nMulticultural working place with modern infrastructure and facilities\nWe expect\nThe ideal candidate holds a very good Master degree (or German diploma degree) in Computer Science or related field and is able to consider both theoretical and practical and implementation aspects in her/his work.\nFluent English communication and programming skills are fundamental requirements.\nA strong background in Computer Science or related disciplines\nWillingness to work in an international environment\nThe ability to take part in a large-scale international research  project with an industry partner\nWillingness to combine formal scientific work with  application-oriented research in order to solve real-world problems\nResearch interest and expertise in at least one of the areas:\nFormal languages and reasoning (Description Logics, Logic Programming, normative legal reasoning), rule and ontology languages, Semantic Web, formal logic-based patent informatics, logic-based natural language processing and knowledge representation.\nExcellent candidates are invited to apply to one of these positions with:\nCurriculum vitae and copies of degree certificates/transcripts,\nWriting samples/copies of relevant scientific papers (e.g. thesis, etc.),\nLetters of recommendation.\nThe university strives to increase the proportion of women in  scientific service and therefore particularly welcomes applications from women. Also handicapped applicants, if qualified, will be given preference.\nPlease send your application in a printed version indicating in the subject \"041950/CSW/SPI\" to the following contact. The application deadline is March 28th, 2011.\nContact and application:\nFreie Universität Berlin\nInstitut für Informatik\nAG Corporate Semantic Web\nMelanie Siering\nKönigin-Luise-Straße 24-26\nD-14195 Berlin\nsiering@inf.fu-berlin.de",
  "speaker": "SYSTEM",
  "uuid": "c8d5a1f7-a64d-44ce-9158-fb71b1b15b37"
}