{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 14\nAutores: De Diego R, Fernández-López M, Gómez-Pérez A, Ramos JA \nTítulo: OEGMerge: un modelo de mezcla de ontologías basado en casuísticas \nTipo de participación: Comunicación \nConferencia de la Asociación Española para la Inteligencia Artificial \nPublicación: \n \nLugar celebración: Santiago de Compostela \nFecha: 11/2005 \n \n \nAutores: Cañadas G, Fernández-López M, García-García R, Lama M, Sánchez-Alberca A, Sorzano COS \nTítulo: Framework for automatic generation of ontology mappings \nTipo de participación: Ponencia \nCongreso Jornadas Iberoamericanas de Ingeniería del Software e Ingeniería del Conocimiento (JIISIC’04) \nPublicación: \n \nLugar celebración: Madrid \nFecha: 11/2004 \n \n \nAutores: Fernández López, M.; Gómez-Pérez, A. \nTítulo: “Searching for a Time Ontology for Semantic Web Applications” \nTipo de participación: Ponencia \nCongreso: International Conference on Formal Ontology in Information Systems (FOIS’04) \nPublicación: \n \nLugar celebración: Turín \nFecha: 11/2004 \n \n \n \nAutores: Corcho, O; Fernández López, M.; Gómez-Pérez, A.; Lama, M. \nTítulo: “An Environment for Development of Semantic Web Services” \nTipo de participación: Comunicación \nCongreso: Workshop titulado Ontologies and Distributed Systems de la conferencia International Joint Conference for \nArtificial Intelligence (IJCAI’03) \nPublicación: Págs. 13 a 20 \n \nLugar celebración: Acapulco (Méjico) \nFecha: 08/2003 \n \nAutores: Corcho, O; Gómez-Pérez, A.; Fernández López, M.; Lama, M. \nTítulo: “ODE-SWS: A Semantic Web Service Development Environment” \nTipo de participación: Comunicación \nCongreso: The first International Workshop on Semantic Web Databases \nPublicación: Págs. 203 a 216 \n \nLugar celebración: Berlín (Alemania) \nFecha: 09/2003 \n \n \nAutores: Fernández López, M.; Gómez-Pérez \nTítulo: \"WebODE: an integrated workbench for ontology representation, reasoning and exchange\" \nTipo de participación: Comunicación (artículo ya mencionado en capítulos de libro) \nCongreso: 13th International Conference on Knowledge Engineering and Knowledge Management EKAW02 in cooperation \nwith the American Association for Artificial Intelligence (AAAI). \n \nPublicación: \n \nLugar celebración: Sigüenza (España) \nFecha: 10/2002 \n \n",
  "speaker": "SYSTEM",
  "uuid": "c8f669f9-6987-4703-93d4-5071f297c8b0"
}