{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nWP1\n2\nWP2\n3\nWP5\n3.1\nD5.4.1\n3.2\nD5.6.1\n3.3\nD5.5.1\n3.4\nD5.3.2\n4\nWP6\n4.1\nOWLDoc\n4.2\nScheduling\n4.3\nLabelTranslator\n4.4\nLSPatterns\n4.5\nOyster2 User Interface\n4.6\nR2O\n5\nWP9\n5.1\nExploitation plan\n6\nAd-hoc multilingual meeting\n7\nAd-hoc WP5-WP6\n8\nSAB\nWP1\n\nRaúl Palma has 2 presentations.\nWP2\n\nNo agenda has been sent.\nACTION\n: Mari Carmen sends an email telling if we need to present the work done by UPM.\nWP5\n\nThe meeting will be organized by deliverable.\nSlot 1: D5.4.1 + D5.6.1 + D5.5.1\nSlot 2: D5.3.2 + WP2-WP5 SAB + New planning\nD5.4.1\n\nACTION\n: Mari Carmen (24 min intro+spec+statements+patterns), Mariano (7 min), Boris and Andrés (7 min) prepare some slides (40 min).\nD5.6.1\n\nIn June (next meeting) we should have some results.\nBy the end of September ...\nBy December ...\nACTION\n: Raúl García prepares some slides (20 min.) with the planning for the next year (who will make the experiments, when, etc.).\nD5.5.1\n\nACTION\n: Óscar (15 min) prepares some slides.\nD5.3.2\n\nACTION\n: Mari Carmen prepares some slides including the scheduling plugin and a demo.\nWP2+WP5 SAB presentation\nNew planning for WP5.\nWP6\n\nNo agenda has been sent.\nOWLDoc\n\nWorks in Eclipse but has to be integrated with the NeOn Toolkit. It has to have the documentation integrated with the NeOn Toolkit.\nACTION\n: Raonne sends 5-10 slides to the mailing list this same week.\nACTION\n: Óscar installs the software in his computer.\nACTION\n: Óscar sends an email to Peter telling him to consider the OWLDoc plugin in the plugins presentation.\nScheduling\n\nACTION\n: Egidijus has to send 5-10 slides to the mailing list this same week.\nACTION\n: Óscar installs the software in his computer.\nLabelTranslator\n\nACTION\n: Mauricio has to send 5-10 slides to the mailing list this same week.\nACTION\n: Óscar installs the software in his computer.\nACTION\n: Mauricio installs the software in his computer.\nLSPatterns\n\nACTION\n: Yufei has to send 5-10 slides to the mailing list this same week.\nACTION\n: Óscar installs the software in his computer.\nOyster2 User Interface\n\nACTION\n: Raúl Palma has to send 5-10 slides to the mailing list this same week.\nACTION\n: Raúl Palma sends an email to Walter telling him that he wants to present the plugin in WP6.\nR2O\n\nACTION\n: Jan and Boris have to send 5-10 slides to the mailing list this same week.\nWP9\n\nExploitation plan\n\nACTION\n: Everyone reviews the exploitation plan from the previous year, including the new plugins, and sends it to Elena before Thursday.\nACTION\n: Elena merges the contributions in the document.\nAd-hoc multilingual meeting\n\nMauricio presents the new interface and alternatives to store multilinguality.\nAnalyse examples from FAO.\nACTION\n: Mauricio sends a message to the WP7 mailing list telling them that they have to provide examples to see of they can use the LabelTranslator.\nAd-hoc WP5-WP6\n\nTopics:\nCoupling the methodology and the NeOn Toolkit.\nNew plugins to cover new lifecycle activities (LSPatterns, Scheduling, Specification).\nHow methodology can be introduced in the NeOn Toolkit tutorial.\nExperiments using the NeOn Toolkit and the methodology.\nACTION\n: Óscar has to make the analysis of the coverage of the plugins to the glossary.\nACTION\n: Asun prepares the rest of the slides.\nSAB\n\nRaúl Palma presents the work done in Task 1.3.\nACTION\n: Asun sends an email to Aldo starting the preparation of the Methodological aspects slot.\nACTION\n: Raúl García sends some slides to Michael with the interoperability results.\nACTION\n: Mauricio sends 1-4 slides with a summary of the localization part this same week.",
  "speaker": "SYSTEM",
  "uuid": "c94a57ee-26f5-4213-b13c-5d2acd84c563"
}