{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Detalle \n\nHay que dejar claras y explícitas las políticas y responsabilidades sobre la nueva página web del Grupo. Para ello, creo que lo mejor es tratar de ir con una previsión a la reunión sobre los temas a tratar para decidir las políticas y asignar las responsabilidades.\nÉsta es una lista provisional y si queréis podeís añadir debajo argumentos o notas sobre las que basar decisiones:\nPolíticas\n\nPolítica de imputación de publicaciones al Grupo\nCuando se va alguien del Grupo y se publica con los de dentro de trabajo de cuando se estaba\nCuando se va alguien del Grupo y se publica con los de dentro de trabajo de ese momento\nCuando se va alguien del Grupo y se publica con los de fuera de trabajo de ese momento\nCuando se viene alguien al Grupo y se publica con los de fuera de trabajo de ese momento\nCuando se viene alguien al Grupo y se publica con los de fuera de trabajo de cuando no se estaba\nCuando estando dentro se publica con gente de fuera de trabajo no del Grupo\n[Raúl: Yo creo que para este primer caso hay que distinguir entre dos cosas diferentes: el contenido del portal y la visibilidad del contenido del portal. El portal puede contener toda la información del mundo, pero deberá proporcionar vistas distintas con subconjuntos de esta información (por grupo, por persona, por proyecto, etc.).]\nPolítica de accesibilidad a datos: datos internos, documentación interna, publicaciones con copyright\nPolítica de mantenimiento del servidor del portal\nActualizaciones\n\nActualización de publicaciones de investigación\nActualización de presentaciones de publicaciones de investigación\nActualización de PFC, TM y Tesis\nActualización de presentaciones de PFC, TM y Tesis\nActualización de presentaciones de charlas de Grupo\nActualización de solicitudes de becas\nActualización de proyectos\nActualización de documentación de proyectos\nActualización de máquinas\nActualización de personas: personal fijo, doctorandos, PFC/TM y visitantes\nActualización de software\nActualización de tutorías y cursos impartidos\nActualización de presentaciones de tutorías y cursos impartidos\nActualización wiki: charlas\nActualización wiki: tesis\nActualización wiki: CFP (L, SW, SG, GI)\nMejoras y sugerencias\nAunque muchas de las cosas puedan parecer obvias, creo que es mejor dejarlas explícitas.",
  "speaker": "SYSTEM",
  "uuid": "c94be0cc-20cf-4e33-907e-9d9b12660406"
}