{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Art%C3%ADculos_relacionados_con_el_data_provenance \n\nAutores :\nOlaf Hartig y Jun Zhao\nFecha :\nWWW 2010,(26-30 de Abril), Universidad de Berlin y universidad de Oxford.\nArtículo en donde se presenta un modelo de provenance para los datos en la Web, parecido al OPM pero con diferencias significativas. Basándose en dicho modelo, se propone además un método para evaluar la calidad de la información que podemos encontrar en la Web.\nEn primer lugar, tras una breve introducción donde se narran las intenciones del artículo, se hace una revisión del trabajo ya realizado por otros investigadores, en concreto en el área del análisis de la calidad de la información. El proceso no es nada simple, porque requiere identificar los Indicadores de Calidad (Quality Indicators) para obtener un criterio IQ con el que obtener la puntuación IQ.\nUn indicador de calidad puede ser la información misma, metadatos sobre la información y las circunstancias de su creación o acceso, o puntuaciones dadas por los propios usuarios.\nLa evaluación de la calidad basada en el contenido usa la propia información como indicador de calidad. Sin embargo, en casos de datos no estructurados necesitaremos una técnica precisa de procesado de la información, junto a un análisis de texto autómatico que no siempre es preciso.\nPor otro lado, el análisis de metadatos procedentes del provenance ha sido utilizado para evaluar otro tipo criterios-IQ, como la credibilidad y confianza.\nEl OPM propone un modelo común para el provenance, y contiene muchos conceptos parecidos a los que se presentan en el paper, como los artefactos. Sin embargo, este modelo fue diseñado para un mundo cerrado , como un workflow o base de datos, mientras que el sistema del artículo se ha pensado para un mundo abierto como la Web.\nModelo de provenance\nLos tipos de elementos que contiene son 3: actores, ejecuciones y artefactos. Los actores son los que realizan la ejecución de un proceso, que  la mayoría de las veces, desemboca en la creación de un artefacto como un objeto de datos único. Un ejecución puede haber incluido el uso de artefactos, que a su vez pueden haber sido resultado de otra ejecución.\nEn cuanto a la creación de datos, el elemento central es la ejecución de creación de datos, ejecutada por un creador de datos. Para la creación, datos fuente y guías de creación podrían haber sido utilizados.\nEl grafo resultante de todas las interacciones entre los datos es lo que se denomina el grafo provenance. Los nodos son elementos provenance. Las aristas corresponden a las relaciones entre elementos, y su nombre es su etiqueta.\nPublicando información Provenance:\nUn estudio reciente destaca la falta de metadatos relacionados con el provenance en Internet. En el artículo se propone el Provenance Vocabulary para solucionar esto. Este vocabulario permite a los proveedores redactar información acerca  la información que están aportando.\nBásicamente consiste en 3 bloques principales: términos generales, términos para la creación de datos y términos para el acceso de datos. Está implementado como una ontología OWL.\nEvaluación basada en provenane\nValores de Impacto:\nEl propósito de un método de evaluación que siga el método propuesto en el paper es evaluar el criterio IQ de un item. Muchos de los elementos que están asociados al item están influenciados por el criterio IQ. Algunas de estas influencias las podemos verificar fácilmente basándonos en nuestro conocimiento sobre ellas, pero hay otras donde esto no es evidente. (Por ejemplo, si un proveedor manipula la información que publica).\nDebemos ignorar estas influencias potenciales, y para ello se proponen los valores de impacto.\nSe trata de valores asociados a cada elemento provenance, y representan la probabilidad de que el proveedor haya manipulado la información asociada.\nProcedimiento general para la evaluación IQ:\n1.-Generar el grafo provenance para el elemento en cuestión:\n2.- Anotar el grafo con valores de impacto\n3.- Calcular la puntuación IQ de un grafo anotado.\n-Diseñando métodos de evaluación:\nEn cada paso debemos responder una serie de preguntas para seguir adelante:\nPaso 1: ¿Qué tipos de elementos provenance son necesarios para determinar un criterio IQ? ¿Qué nivel de detalle es necesario para describir el provenance en el escenario de la aplicación? ¿Cómo conseguimos construir el grafo a partir de la información provenance que disponemos?\nExisten dos opciones posibles: algunas partes se pueden grabar desde el propio sistema. Otras a partir de metadatos de terceras personas/entidades.\nPaso 2: ¿Cómo influencia el criterio IQ cada elemento del provenance? ¿Cómo representamos las influencias con los valores de impacto?¿Cómo determinamos los valores de impacto?\nLos valores de impacto los podemos determinar a partir de  la información provenance, (por ejemplo, creación de la información); mediante análisis del contenido, mediante análisis del contexto o con los datos que nos da el usuario.\nPaso 3: ¿Cómo podemos representar el criterio IQ con un valor? ¿Qué función usamos para calcular dicho valor a partir del grafo provenance?\nSe recomienda diseñar la función junto con la especificación de los valores de impacto. La función de evaluación debe ser capaz de tratar con un grafo incompleto y en ocasiones incierto.\nA continuación, los autores realizan una evaluación del procedimiento, dando un criterio IQ, evaluando su influencia y decidiendo los valores de impacto, (como por ejemplo, el de creación del elemento). Se evitan los valores de impacto que faltan buscando información de contexto en la página del que publicó la información.\nPor último, se concluye diciendo que con el provenance no se consigue obtener toda la información necesaria en muchos casos, y que necesitaremos probablemente el contenido de la información u otros metadatos para la evaluación. Además se intentará alinear el modelo propuesto con el Open Provenance Project.\nPrOM: A Semantic Web Framework for Provenance Mangement in Science",
  "speaker": "SYSTEM",
  "uuid": "c94c335c-959d-454a-a19c-6af90a84bca5"
}