{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/TheAMORManifesto \n\nIntroduction\n\nOntologies are becoming increasingly more important in many different domains. However, there are still plenty of barriers to the reuse of ontologies, being the main one the lack of open availability of existing ontologies.\nAgreeing on a common set of ontological commitments is costly and all this effort is wasted when others are forced to develop a similar ontology from scratch or to re-engineer an ontology from other available artefacts (documentation, figures, etc.).\nThe goal for the AMOR Manifesto is to articulate the vision of an ecosystem of Accessible, Machine-readable, Open, and Reusable ontologies that facilitates the reuse of these ontologies or parts of them. To this end, a set of principles have been distilled, based on the 5 star scheme defined for Linked Open Data.\nPrinciples\n\nOscar: Can we add, besides the example put as e.g., a URL to a document/ontology for each case?\n  Raúl G.: That would be nice, they problem may be to find examples for all the cases.\n★ The ontology is available on the web (whatever format) but with an open licence\nOscar: I do not agree with the open license part. This would rule out SNOMED? Directly? \n  Raúl G.: Yes. People should not need to pay for ontologies.\nMaria: whatever format? even a .png?\n  Raúl G.: Yes, if the ontology is completely represented in the information resource.\n★★ All the above, plus: available as machine-readable structured data (e.g., CycL instead of image scan of a table)\nOscar: I would call it \"formal language\", instead of structured data \n  Raúl G.: Formal language may be too restrictive and open to plenty of discussion. E.g., is Turtle a formal language? The point here is that the ontology must have some structure that a machine can process.\n★★★ All the above, plus: non-proprietary format (e.g., OBO instead of CycL)\n★★★★ All the above, plus: use open standards from the W3C (RDF Schema and OWL)\n★★★★★ All the above, plus: reuse other people’s ontologies in your ontology\nMaria: what about human readable information?\n  Raúl G.: One characteristic about the principles is that they are objective and easy to verify. There are other characteristics of ontologies (consensus, documentation, etc.) that are highly important but have a subjective aspect. It is out of the Manifesto to cover them.\nThese principles define a set of minimal restrictions to ensure that ontologies are accessible on the web using open standards. It is not in the scope of this Manifesto to impose further quality restrictions on ontologies (e.g., regarding the\nusability of Linked Data vocabularies\n).\nInvitation\n\nEveryone is invited to support the principles of the AMOR Manifesto and to find new ways to make this vision a reality.\nIf you support this manifesto and the principles included in it, please leave a comment below.",
  "speaker": "SYSTEM",
  "uuid": "c97dfccc-5059-497c-ab0b-79ce99f86405"
}