{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Propuestas \n\nShort CV Asun\nProf. Asunción Gómez-Pérez, PhD. (Female, H index: 46) is Full Professor at UPM (2007), Director of the Artificial Intelligence department (2008), Director of the Ontology Engineering Group (1995, 8th group in the UPM ranking), Director of the Master (2010) and Ph.D Program (2013) on Artificial Intelligence, Director of the Co-founder of the COM joint institute between Santander Bank and UPM (2012).PhD in Computer Science (1993) and Master on Business Administration (1992). Before joining UPM, she was visiting (1994-1995) as a postdoc the Knowledge Systems Laboratory at Stanford University. She has supervised 18 Ph.D thesis, she has coordinated 4 EU projects  SEALS, SemSorGrid4Env and Ontogrid and now she is coordinating LIDER. She has participated 21 EU projects (FP5, FP6 and FP7) as main researchers, and in more than 40 national projects funded by Spanish research agencies and companies. Her main research interests are ontologies, semantic technologies, linked data and the semantic Web. She has published more than 150 papers and two books on Ontological Engineering.  Her works on Ontological Engineering about Methontology and the NeON methodology are world-wide known.  She has been co-director of the summer school on Ontological Engineering and the Semantic Web since 2003 up to 2011. She acts as reviewers in journals and conferences related with semantic technologies\nShort CV Oscar (\nhttp://www.oeg-upm.net/index.php/en/teachers/11-ocorcho\n)\nOpen Government Data: Prof Oscar Corcho (m) is a Full Professor at Departamento de Inteligencia Artificial (ETSI Informáticos, Universidad Politécnica de Madrid). His research activities are focused on the application of semantic technologies in Open Science, Linked Data and Ontological Engineering. Oscar worked as a Marie Curie research fellow at the University of Manchester, and was a research manager at iSOCO. He holds a degree in Computer Science, an MSc in Software Engineering and a PhD in Artificial Intelligence from UPM. He was awarded the Third National Award by the Spanish Ministry of Education in 2001 and the López de Peñalver award to the best researcher in Engineering in Spain in 2016. He has published several books, including “Ontological Engineering\" and “The DATA Bonanza”, and more than 100 papers in journals, conferences and workshops. He has also being involved in two series of summer schools (on Grid Computing – ISSGC – and on Ontology Engineering and Semantic Web – SSSW), being both lecturer and in the latest editions serving as Director for them. Oscar has participated in several EU projects related to the application of semantic technologies to Government and on the definition of roadmaps for Open Government (CLARITY, Mobile-AGE, TheyBuyForYou), leads the Spanish thematic network on Open Data for Smart Cities, where joint guidelines and vocabularies are being proposed for the harmonisation of datasets across open data portals in Spain, and is the scientific coordinator of the Open Cities (Ciudades Abiertas) project, with the municipalities of Zaragoza, Madrid, Santiago de Compostela and A Coruña. He has been also involved in the creation of the Spanish technical norm UNE178301:2015 on Open Data for Smart Cities, which proposes a maturity model to assess and improve the quality of open data implementations for cities, and on the development of a guide for the adoption of open data by municipalities in the context of the Spanish Federation of Municipalities (FEMP).\nOpen Science: Prof Oscar Corcho (m) is a Full Professor at Departamento de Inteligencia Artificial (Facultad de Informática, Universidad Politécnica de Madrid). His research activities are focused on the application of semantic technologies in Open Science, Linked Data and Ontological Engineering. In the area of Open Science, he has participated in a number of EU projects (ACTION, STARS4ALL, GO-INTER, DrInventor, Wf4Ever, PlanetData, ADMIRE, OntoGrid), as well as a good number of Spanish R&D projects and privately-funded ones. At UPM, he is responsible for the Open Science task force at the CESAER consortium of Science and Technology universities, and participates in the Big Science initiative, focusing on the role of data management inside the university. He is currently leading the task force on Interoperability from the EOSC FAIR Working Group and is a member of the advisory board of the CHIST-ERA Open Science Working Group\n.  Previously, Oscar worked as a Marie Curie research fellow at the University of Manchester, and was a research manager at iSOCO. He holds a degree in Computer Science, an MSc in Software Engineering and a PhD in Artificial Intelligence from UPM. He was awarded the Third National Award by the Spanish Ministry of Education in 2001 and the López de Peñalver award to the best researcher in Engineering in Spain in 2016. He has published several books, including “Ontological Engineering\" and “The DATA Bonanza”, and more than 100 papers in journals, conferences and workshops. He has also being involved in two series of summer schools (on Grid Computing – ISSGC – and on Ontology Engineering and Semantic Web – SSSW), being both lecturer and in the latest editions serving as Director for them.\nShort CV de Raul García\nShort CV Mariano Rico\nMariano Rico is a postdoc researcher at the OEG research group, belonging to the Artificial Intelligence Department at Univ. Politécnica de Madrid. Mariano holds a PhD in Computer Science from UAM (2009) and a MSc Physics (UAM‐1992). From 1992 to 2003 he was a R&D engineer and project manager at private companies. For 8 years he held a teaching assistant position at the Escuela Politécnica Superior (UAM). He is responsible for the Spanish chapter of DBpedia (\nhttp://es.dbpedia.org\n). His research interests include Linked Open Data, Natural Language Processing, Semantic Web technologies and Human-Computer Interaction. He had two stays in the world leading Digital Enterprise Research Institute (DERI), in Galway, Ireland, where he worked on Interaction with Semantic Web Services and Wiki Technologies. He has participated in european research projects (e.g. Wf4Ever, LIDER) and national projects (e.g. e-Madrid, Upgrid, S5T) at the university.\nFoto de 200x200 (cambia el parámetro\ns\npara obtener otros tamaños)\nHis most relevant 5 publications are these:\n\"A Semantically Enhanced UPnP Control Point to Enhance Multimedia Content\";M. Rico,Ó. Corcho, V. Méndez, JM Gómez-Pérez; IEEE Internet Computing 15(6); 2011; Impact (JCR 2011)= 2.000 (Q1).\n\"A Contribution-based Framework for the Creation of Semantically-enabled Web Applications\"; Mariano Rico, David Camacho, Óscar Corcho; Information Sciences180(10), pp. 1850-1854; 2010; Impact (JCR 2010): 2.833 (Q1).\n\"A Tool Suite to Enable Web Designers,Web Application Developers and End-users to Handle Semantic Data\"; M. Rico, J.A. Macías, D. Camacho, and O. Corcho; International Journal On Semantic Web and Information Systems (IJSWIS); 2010; Impact (JCR 2010):1.678 (Q2).\n\"Symplifying Semantic Web Application Development and Semantic Data Usage\"; Mariano Rico; AI Communications 23(1), pp. 65-66; 2010; Impact (JCR 2010): 0.824 (Q3).\n\"A Programming Experience of High School Students in a Virtual World Platform\"; Mariano Rico, Gonzalo Martínez-Muñoz, Xavier Alaman, David Camacho and Estrella Pulido; International Journal of Engineering Education; 2011; Impact (JCR 2011): 0.418 (Q3).\nShort CV Emilio Serrano\nEnglish (\nhttps://emilioserra.oeg-upm.net/\n)\nEspañol (\nhttps://emilioserra.oeg-upm.net/inicio/9\nShort CV Maria S. Perez",
  "speaker": "SYSTEM",
  "uuid": "cada6f38-789e-4d56-b00f-9355e12cbdfb"
}