{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 93\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 93 of 111 \n6.2. Invoice Management Ontology Network Life Cycle  \n6.2.1. Use case description \nThe invoicing use case deals with the heterogeneity of the invoices emitted and received by \npharmaceutical organizations. Pharmaceutical organizations range from laboratories that provide \ndrugs and medicines to other companies to providers that supply any type of good that a laboratory \nmay need. In this range of companies pharmacies, wholesalers or the public administration can be \nalso included. Each organization uses its own invoice model and, therefore, they generate different \ninvoices (instances of its own model). On the other hand, the technologies used by the companies \nthat participate in the invoicing process to create the invoices are different. They can use comma \nseparated value (CSV), iDOC (format developed by SAP15), EDIFACT16, etc., each one with their \nown implementation (the format is a standard but not the use of it). A more detailed description of \nthe problem can be found in [30]. \nThe solution proposed in WP8 is that each company emits the invoices in its own format, and this \nis an instance of its own model generated from a customized ontology network. This customized \nontology network will be created from a reference ontology network which contains all the elements \nneeded for the invoicing process. This invoice reference ontology network will in turn be created \nfollowing the methodological guidelines specified by WP5. \nThe problem to be addressed when using a reference ontology network is that of the heterogeneity \nof the invoices generated and received by the different companies that participate in the invoicing \nprocess. This heterogeneity is planned to be solved by a network of federated ontologies with one \nreference ontology, which will contain all the concepts related with the electronic invoicing process. \nCompanies will emit invoices from a model that they have previously adapted and the receiving \nsystem will be able to process these incoming invoices. \nThe ontology network for the invoicing use case in WP8 must contain all the concepts related to \nthe invoice management in the pharmaceutical industry. These concepts shall reflect all the \ninteractions and elements that are included in the pharmaceutical invoicing process. These \nelements vary from the most common concepts included in every invoice and generated by a \ncompany to the technologies or the workflow that is followed by every invoice in the system. \n6.2.2. Selected ontology network life cycle model \nThe preliminary workplan for developing the Invoice Management ontology network included 4 \nmain tasks and followed a waterfall life cycle model. The tasks were the following: \n \nTask 1. Resource research. Here it is performed a research process over the existing \nresources related to the invoicing problem is done. \n \nTask 2. Design of the initial ontology network. During this task the initial invoice ontology is \ncreated using the resources previously gathered; then, an analysis of time representations \nin ontologies is performed; afterwards, a time ontology is designed; such ontology has to be \nintegrated into the invoice ontology. Finally, the analysis of the invoice workflow is carried \nout and an ontology, which represents such workflow, is built and integrated into the invoice \nontology. \n                                                 \n15 http://www.sap.com/index.epx \n16 http://www.edifactory.de/messages.php?s=D05A \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "cb135999-53c5-428e-9ad5-90c42793d9ee"
}