{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual22042010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n. \n1.) Traslado del servicio web y la aplicación web a una nueva maquina. \n2.) Planeación del articulo para la International Semantic Web Conference. En este articulo vamos a presentar un estudio detallado de folksonomias multilingues y su semantica. Pretendemos hacer una evaluación del servicio de asociación de semantica a etiquetas (de aqui en adelante Sem4Tags) masiva de unas 2000 fotos tomadas de flickr y contando con 15 o 20 evaluadores.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Paper ICEW2010.\n- Evaluación manual del proceso de anotacion semantica de fuentes RESTful.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nSe han encapsulado los procesos de ANNIE y TreeTagger y creado una aplicación independiente que se ha incorporado al servicio web con el fin de poder liberar memoria. Sin embargo, esta opción no ha funcionado. Además, se ha probado liberar uno por uno y por bloques los procesos, el corpus y demás elementos del proceso de anotación sin ningún éxito. Otra opción ha sido interrumpir el propio GATE y después volver a arrancarlo. El problema de la interrupción es la nula respuesta del sistema, devuelve nada.\nInterfaz Anotación Híbrida\n\n- Depuración del core de la interfaz de anotación para aligerar su carga.\n- Se construye aplicación social para la integración con el core de la interfaz de anotación.\n- Aun no se resuelven las cuestiones de RDF.\n- Se ha modificado el tagcloud para acceder a cada palabra dentro del documento anotado.\n- Se revisa la documentación de yii framework para implementar la web social.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el desarrollo de las interfaces del metaplanificador, terminando la implementación de la interfaz de recuperación de datos sobre tareas del Grid.\n- Se ha comenzado con el testeo del funcionamiento de las interfaces ya implementadas.\nTarea 1.4\n\nPT 4.4\n: Planteamiento del AEI año 2010.\nReplanteamiento del activo experimental.\nTras la evaluación de la relación explotabilidad/esfuerzo de la propuesta desarrollada en las anteriores semanas, se ha reconsiderado la idea de llevar a cabo el sistema propuesto. Finalmente se ha desechado el planteamiento realizado.\nEn pos de un mayor impacto a nivel de explotación y de una explotación más directa del desarrollo que se está realizando para el PT 1.4, se ha replanteado el Activo Experimental Integrado asociado. Así, se ha descrito, ilustrado y prediseñado un servicio integrable en la plataforma desarrollada por el consorcio que hace uso de la información contenida en los OEGMappings:\nGI Resource Searcher\n: Servicio localizador de recursos por fenómeno\nTarea 7.1\n\n- Redacción de paper para ICEW2010.\n- Preparación de paper para Workshop on Linked Spatiotemporal Data 2010\n- Linked Data.\n· Difusión",
  "speaker": "SYSTEM",
  "uuid": "cb4051d7-5b1d-47d2-a96c-76a86cea83a5"
}