{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 15\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n9 The Art & Architecture Thesaurus (AAT)®: vocabulario estructurado \njerárquicamente que cuenta con 133.000 términos de 33.000 conceptos que \ndescriben arte, arquitectura y otro conceptos relacionados. \n- \nhttp://www.getty.edu/research/conducting_research/vocabularies/aat/ \n- \nPublicado por: J. Paul Getty Trust \n- \nDescripción: AAT es un vocabulario estructurado, ordenado en 7 facetas y \n33 jerarquías. Diseñado para proporcionar terminología de arte por \nindexación y recuperación. Incluye información de arte, arquitectura, artes \ndecorativas, arqueología, material cultural y materiales archivados. ATT es \nun tesauro a nivel mundial. Este crecimiento se debe a la contribución de \nmuseos, librerías y otras instituciones culturales. Cada registro ATT es un \nconcepto (no un término).Actualmente hay alrededor de 33.000 registros. \nAunque cada registro no está traducido a todos los idiomas, el tesauro es \nmultilingüe en el sentido de que cada registro puede conceptos en múltiples \nlenguas. \n- \nNúmero total de términos: 133.000 \n- \nTipos de relación: asociativa, equivalencia, jerárquica. \n9 The Getty Thesaurus of Geographic Names Browser (TGN) ®: vocabulario \nestructurado jerárquicamente que cuenta con cerca de 900.000 lugares que \nrepresenta todas las naciones del mundo. Sus registros son utilizados para por \nejemplo la localización de objetos de arte o el lugar de nacimiento de un artista. \nProporciona nombre de lugares en inglés y en otras lenguas y, si es posible, \ninformación historica. \n- \nhttp://www.gii.getty.edu/tgn_browser \n- \nEl vocabulario Getty cuenta con derechos reservados por lo que la institución que \npretenda utilizarlo debe adquirir una licencia (required fees). Se puede obtener en \nformato XML, tablas relacionales o texto. Se puede descargar de forma libre un \nconjunto de muestra. \n2. Thinkmap: Tesauro visual. \n- \nhttp://www.visualthesaurus.com/ \n- \nEste tesauro visual accede a Wordnet para presentar gráficamente las relaciones \nentre palabras. Haciendo clic en cualquiera de las palabras se mueve hacia el \ncentro y muestra sus relaciones (contexto. Árboles hiperbólicos de Xerox). \nMedios gráficos para ajustar varios parámetros. P. ej.: qué tipo de términos \nrelacionados se quiere ver. Inconvenientes: Lento. \n \n15\n",
  "speaker": "SYSTEM",
  "uuid": "cb790469-9a4c-490d-96d9-b9b1b905328b"
}