{
  "message": "SYSTEM: D5.3.2.pdf: Página 9\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 9 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n1.1. Main Contributions \nWe have included the following results in this deliverable: \n\u0001 The NeOn Glossary Version 2, including the NeOn Glossary of Processes and Activities \nand the NeOn Resource Glossary.  \n\u0001 The revision and update of the collection of ontology network life cycle models and of the \nidentified scenarios; and the relationship between the identified scenarios in the NeOn \nmethodology for building ontology networks [ 11] and the collection of ontology network life \ncycle models.  \n\u0001 The guidelines for scheduling an ontology network project, including the guidelines for \nobtaining the ontology network life cycle for a concrete ontology network. \n\u0001 The description of the main requirements and functionalities of the gOntt plug-in.  \n1.2. Deliverable Structure \nThe deliverable is structured as follows: \n\u0001 Chapter 2 presents the progress done with respect to the NeOn Glossary of Activities.  \n\u0001 Chapter 3 provides the revision of the identified scenarios for building ontology networks, the \nrevision of the existing collection of ontology network life cycle models, and the relation \nbetween the identified scenarios for building ontology networks collaboratively and the ontology \nnetwork life cycle models.  \n\u0001 Chapter 4 provides enhanced guidelines for obtaining the concrete life cycle for an ontology \nnetwork and the scheduling of the ontology network project, described in the style proposed in \n[ 11] for methodological guidelines.  \n\u0001 Chapter 5 presents the main requirements and functionalities of the gOntt plug-in. \n\u0001 Chapter 6 presents the conclusions and future work.  \n1.3. Relation with the Rest of WPs within Project \nThe relation between this deliverable and the other parts of WPs in the NeOn project is briefly \ndescribed below: \n\u0001 The NeOn Glossary of Activities includes activities related to the research being carried out in \nWP1 (e.g., ontology evolution, ontology modularization), WP2 (e.g., ontology localization), WP3 \n(e.g., ontology aligning), and WP4 (e.g., ontology customization).  \n\u0001 The main outcomes produced in this deliverable are being evaluated in task T5.6. \n\u0001 The gOntt plug-in that helps to schedule an ontology network development will be released in \nthe next version of the NeOn Toolkit. \n\u0001 FAO, iSOCO, and ATOS as leaders of the use case WPs (WP7 and WP8, respectively) \nreviewed the NeOn Glossary of Activities from their practical point of view.  \n",
  "speaker": "SYSTEM",
  "uuid": "cb91c326-b110-4152-88e0-763af42ca1d2"
}