{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/INSEMTIVES2010 \n\nPhD-Researcher in EU FP7 Project INSEMTIVES\nINSEMTIVES is an EU FP7 project starting April 2009 with a duration of 3 years and seven academic and industrial partners. In the project, we will develop process methodologies and tools for the creation of semantic data for different types of Web sources jointly exploiting human intelligence, community effects and automatic machine processing.  The findings will be validated in three use cases in real-world settings. For more information go to www.insemtives.eu\nWe offer\n* The opportunity to take part in an innovative European research project focusing on several hot topics in to date’s Web and Semantic Web research:  incentives, Web 3.0, social applications,  lightweight knowledge engineering and semantic annotation.\n* A stimulating environment of a leading research group in the fields of semantic technologies, with excellent ties worldwide.\n* An up-to-date infrastructure and resources, including funding for attending international conferences, PhD symposia, summer schools.\n* A multicultural working place with modern infrastructure and facilities in a location with high life quality.\nWe expect\n* A strong background in Computer Science or related disciplines.\n* Willingness to work in an international environment and to take actively part in large-scale international research projects.\n* Willingness to combine formal scientific work with application-oriented research in order to solve real-world problems.\n* Research interest and expertise in the following areas: ontologies, ontology engineering, ontology languages, Web 2.0, social Web, social applications, collaborative applications, games, incentives.\nWe kindly invite you to submit your application to:\nUniversität Innsbruck\nChiffre MIP-6196 / Chiffre 6184\nPosteinlaufstelle der Zentralen Dienste\nInnrain 52\nA-6020 Innsbruck\nPlease include a current resume, a list of publications (if applicable), and digital versions of your most relevant works (e.g., graduation thesis).\nIn case of any questions regarding this position please contact Katharina Siorpaes at katharina (dot) siorpaes (at) sti2.at.",
  "speaker": "SYSTEM",
  "uuid": "cc236656-b9b3-40e8-aea6-47746af69395"
}