{
  "message": "SYSTEM: CV-Cicyt_Charo_enero2009.pdf: Página 4\n \nParticipación en Proyectos de I+D financiados en Convocatorias públicas.  \n \n \n(nacionales y/o internacionales) \nTítulo del proyecto: Geobuddies: Anotación Semántica colaborativa con dispositivos móviles en el camino de Santiago \nTSI2007-65677-C02-01 \nEntidad financiadora: Ministerio de Educación y Ciencia \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 01-10-2007 \nhasta: 03-08-2010 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:  \n \nTítulo del proyecto: OntoGrid: Paving the way for Knowledgeable Grid Services and Systems (FP6-511513) \nEntidad financiadora: Unión Europea \nEntidades participantes: Universidad Politécnica de Madrid; University of Liverpool; University of Manchester; Intelligent \nSoftware Components S.A., Ackin B.V., Technical University of Crete, DEIMOS Space S.L., Boyd International B.V.i.o \nDuración, desde: 01-09-2004 \nhasta: 31-08-2007 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 36 \n \nTítulo del proyecto: Knowledge Web (FP6-507482) \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Innsbruck, Institut für Informatik; École Polytechnique Fedérale de Lausanne; France \nTelecom; Freie Universität Berlin; Free University of Bozen-Bolzano; Institut National de Recherche en Informatique et en \nAutomatique; Informatics and Telematics Institute; Learning Lab Lower Saxony; National University of Ireland Galway; The \nOpen University; Universidad Politécnica de Madrid; University of Karlsruhe; University of Liverpool; University of \nManchester; University of Sheffield; University of Trento; Vrije Universiteit Amsterdam; Vrije Universiteit Brussel \nDuración, desde: 01-01-2004 \nhasta: 31-12-2007 \nInvestigador responsable: Dieter Fensel \nNúmero de investigadores participantes: 32 \n \n \nTítulo del proyecto: Infraestructura Tecnológica de Servicios Semánticos para la Web Semántica (TIN-2004-02660) \nEntidad financiadora: Ministerio de Ciencia y Tecnología. Dirección General de Investigación. Subdirección General de \nProyectos de Investigación. \nEntidades participantes: Universidad Politécnica de Madrid y Universidad de Santiago de Compostela \nDuración, desde: 13-12-2004 \nhasta: 13-12-2007 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes:  \n \nTítulo del proyecto: Esperonto Services. Application Service Provision of Semantic Annotation, Aggregation, Indexing and \nRouting of Textual, Multimedia, and Multilingual Web Content (IST-2001-34373) \nEntidad financiadora: Unión Europea \nEntidades participantes: Intelligent Software Components, Universidad Politécnica de Madrid, Vrije University, DFKI, \nUniversity of Liverpool, Biovista, Fundación Residencia de Estudiantes, CIDEM \nDuración, desde: 01-08-2002 \nhasta: 01-02-2005 \nInvestigador responsable: Richard Benjamins \nNúmero de investigadores participantes: 25 \n \n \nTítulo del proyecto: Plataforma  tecnológica para la Web semántica: Ontologías, Análisis del lenguaje natural y comercio \nelectrónico: CONTENTWEB (TIC2001-2745) \n \nEntidad financiadora: CICYT \nEntidades participantes:  Dpto de Inteligencia Artificial (UPM), Dpto. de Lingüística Aplicada (UPM) \nDuración,  desde: 2001 \n \nhasta: 2004 \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 7 \n",
  "speaker": "SYSTEM",
  "uuid": "ccaf5ba7-4d98-4862-a967-1f10a149d5b0"
}