{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 1\n \n \nTerminological Principles used for \nOntologies  \n \n \n \nBodil Nistrup Madsen, Hanne Erdman Thomsen \n \nAbstract \n \nDesigners of IT systems, such as database applications, information retrieval \nsystems and natural language querying systems, very often talk about using \nontologies as a foundation for these systems. Topics such as development of \nontologies and formats for ontologies are found in many presentations in con-\nferences, e.g. in conferences that deal with the Semantic Web. However, very \noften it becomes clear that people have very different understandings of what \nan ontology is, and many different classifications and definitions of ontolo-\ngies exist. The aim of our paper is to contribute to concept clarification, and \nto argue that this may be obtained by using principles of terminology work. \n \nIntroduction \n \nSystematic terminology work has for many years included the elaboration of \nconcept systems, which may be characterized as a kind of domain specific \nontologies. The ‘father’ of terminology, Eugen Wüster, started describing \nconcept systems at least 50 years ago (see e.g. Wüster 1979), and the German \nstandardization organization, DIN, published a standard on concept systems, \nDIN 2331, already in 1980. The Technical Committee TC 37 Terminology \nand other Language Resources of the International Standardization Organiza-\ntion, ISO, has published guidelines on the establishment of concept systems \n(ISO 704:2000). These guidelines are currently under revision to reflect new \ndevelopments within this field. \nIn 2007 ISO TC 37 set up an Ontology Task Force with the aim of propos-\ning a strategy for the work on ontologies within TC 371. As a basis for this \nstrategy the Task Force will develop an overview of related ongoing projects, \nexisting standards and proposals for future projects within TC 37 as well as \nan overview of examples of ontologies and projects 'outside' TC37. The first \nstep in the work of the Ontology Task Force is to describe different types of \nknowledge representation resources, and to clarify the differences between \n1. The authors of the present abstract are both engaged in the work of this Task Force. \n",
  "speaker": "SYSTEM",
  "uuid": "ccc1235d-583f-45eb-ad92-2b80bc78b2f5"
}