{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/BellLabsIrelandOct2009 \n\nBell Labs Ireland has vacancies for researchers in Semantic Web and related disciplines to lead and participate in a new long-term project involving semantic access to telecommunications data and services.  The project is focussed on the modelling of, integration of and reasoning about heterogeneous data sources in a scalable and adaptive manner and will be based in Blanchardstown, near Dublin, Ireland.\nProject members will lead, define and conduct groundbreaking research into semantic access to, and transport of, telecommunications data, as well as semantic description of, and access to, telecommunications and hybrid services.  Project members will as well lead and perform advanced development on research outputs.  Project members will disseminate results of the project as appropriate, including publication in internationally recognized research conferences and journals.  Project members will create and maintain strong collaborative associations other Bell Labs researchers, with university-based researchers, other leading research bodies, product business units and government agencies.\nThe project leader will also be responsible for recruiting and developing the research team to deliver this research program; leading the definition of technical foundations for research programs, project objectives and work plans; and partnering with Alcatel-Lucent business units to ensure the successful transfer of the research output to the product portfolio of Alcatel-Lucent.\nProject members are expected to have a PhD in Computer Science, Electrical Engineering, or Mathematics with experience in Semantic Web technologies or a related area with a strong publication record in high quality research venues.  Experience with RDF, RDFS and OWL and associated tools is very desirable, as is expertise in web services architecture and infrastructure especially RESTful.  Experience with advanced development activities is also desirable.\nThe project leader is expected to have experience in building and leading team oriented projects, and in conducting independent research.\nA proven track record in a research arena or strong industrial experience is essential.\nApplicants should contact Julie Byrne (juliebyrne@alcatel-lucent.com,\n+353-1-8864453), Bell Labs Ireland.  Complete applications are to\ninclude a CV and research interests.",
  "speaker": "SYSTEM",
  "uuid": "ccd51b13-1907-45ec-98ee-c10e9e2f3851"
}