{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 18\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97743\nc)  En el caso de estudios de Grado del EEES de 180 créditos deberá ser posterior \nal 1 de enero de 2005.\nd)  En el caso de estudios de Grado del EEES de 240 créditos deberá ser posterior \nal 1 de enero de 2006.\ne)  La fecha de terminación de estudios podrá ser anterior a las señaladas anteriormente \ny con el límite de hasta 1 de enero de 2003 en los siguientes casos:\ne.1)  Los licenciados en Medicina, Farmacia, Biología, Química o Psicología que en \nel momento de solicitar la beca estén en posesión del título Oficial de Especialidad Médica \n(MIR) o Farmacéutica (FIR) o cuenten con el Certificado Oficial de Especialidad en Biología \n(BIR), Química (QUIR) o Psicología (PIR).\ne.2)  Los titulados cuya fecha de fin de estudios sea posterior al 1 de enero de 2003 \ny que acrediten que entre esta fecha y el 1 de enero de 2007, se hayan dedicado a la \natención y cuidado de hijos menores de seis años.\n3.  En el plazo de presentación de solicitudes, haber sido admitido en el curso 2009-2010 \nen un programa de doctorado regulado bien por el Real Decreto 778/1998, por Real \nDecreto 56/2005 o por el Real Decreto 1393/2007 o en su caso, en el máster que constituya \nla parte formativa del doctorado.\n4.  Contar con un expediente académico con una nota media igual o superior a 1,60 \npuntos, obtenida por la aplicación del baremo siguiente: Aprobado = 1, Notable = 2, \nSobresaliente = 3, Matrícula de Honor = 4, de conformidad con lo establecido en el Real \nDecreto 1497/1987, modificado parcialmente en el párrafo segundo del apartado uno 5 del \nanexo I, por el Real Decreto 1044/2003, de 1 de agosto.\n5.  No podrán participar en la convocatoria quienes ya estén en posesión del título de \nDoctor.\n6.  Los estudiantes extranjeros no comunitarios que no estén en posesión del NIE, \ndeberán acreditar tener su domicilio en España.\nArtículo 28.  Requisitos de los directores de tesis.\n1.  Los directores de tesis de los beneficiarios de las ayudas de este programa, que \nactuarán como tutores académicos durante el período de ejecución de la beca y del \ncontrato en prácticas, serán doctores vinculados permanentemente a la universidad o al \ncentro de investigación en el que se adscriba el beneficiario de la beca.\n2.  En el supuesto de vinculación contractual del director de la tesis, el contrato debe \ncontemplar una duración superior a la del período máximo de la ayuda, establecido en \ncuarenta y ocho meses en el artículo 6 de la presente convocatoria. En el caso de que el \ndirector de la tesis no cumpliera con este requisito, será obligatoria la colaboración de un \ncodirector o cotutor que lo cumpla.\n3.  Ningún director podrá figurar como tal en más de una solicitud de beca en esta \nconvocatoria. La presentación de más de una solicitud avalada por el mismo Director de la \ntesis será motivo de exclusión de todas las solicitudes afectadas.\nArtículo 29.  Requisitos de las entidades de adscripción de los beneficiarios de las \nayudas.\n1.  Los organismos o entidades para los que se solicite la adscripción de la beca, \ndeberán reunir las condiciones señaladas en el artículo 5 de la presente convocatoria y \nfirmar el convenio de colaboración al que se refiere el artículo 10.2 de la presente \nconvocatoria, salvo que ya lo tengan firmado y se encuentre en vigor.\n2.  En el caso de que la entidad no tenga suscrito el convenio deberá acreditar que \nreúne los requisitos a los que se refiere en punto anterior, mediante la presentación del \nimpreso de datos de la entidad y los siguientes documentos: estatutos o registro de la \nentidad o, en su caso, publicación en el Boletín Oficial de la correspondiente comunidad \nAutónoma y acuerdo o convenio firmado con una universidad para realizar la actividad \nformativa del doctorado. Dicha documentación se aportará junto a la solicitud del candidato \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "cd942560-cdab-49b5-8ef6-ea4aa2cbfcc7"
}