{
  "message": "SYSTEM: Science-2015-HirschbergManning-NLP.pdf: Página 5\nlanguage in bilingual speech), hedging behavior\n(words and phrases indicating lack of commitment\nto a proposition such as “sort of”), and hate speech\nor bullying behavior. Social media exist in a wide\nvariety of languages, including both HRLs and\nLRLs. These data can be invaluable for enriching\nASR language models and developing TTS synthe-\nsizers without the need to create costly special-\npurpose corpora. In turn, these technologies can\nbe useful in producing SDSs in LRL areas. Such\nsystems can provide millions of people with the\nability to obtain information over their cell phones\n(which are ubiquitous, even among populations\nwith low literacy rates or whose languages or\ndialects have no standard written form), similar to\nthe residents of HRL countries. The development\nof tools for LRLs from found LRL data, by adapt-\ning HRL tools, is another important way to use\nfound text data. A particular application of data\nmining in LRLs is the mining of data collected\nfrom Twitter or blogs to provide valuable infor-\nmation for disaster relief organizations, identify-\ning the most serious problems, where they occur,\nand who is experiencing them.\nThere are also some drawbacks to social media\ndata mining. There is an increasing concern for\nprivacy issues, particularly for an individual’s con-\ntrol over their own data versus researchers’ desire\nto mine it. Sites such as Twitter severely limit a\nresearcher’s ability to download data, which im-\npedes speedy corpus collection. There is also a\nmajor issue with discovering “ground truth” in\nonline postings, because there is no clear way of\nvalidatinganindividual’sdemographicinformation;\nthe validity of posts concerning events; and most\nreviews of hotels, restaurants, and products. Aggre-\ngating information from multiple sources at similar\ntimes can address some validity issues, and sites do\nattempt to identify spurious reviews, but this issue\nremains perhaps the most difficult one for those\nworking with social media data.\nAnalysis and generation of speaker state\nSpeaker states (54), also termed “private states”\n(55), include opinions, speculations, beliefs, emo-\ntions, and any other evaluative views that are\npersonally held by the speaker or writer of a\nlanguage. Much of the work in NLP has focused\non sentiment analysis (identification of positive\nor negative orientation of textual language) and\nidentification of belief states (committed belief,\nuncommitted belief, or neutrality of a sentence)\non the basis of lexical and syntactic information.\nBoth sentiment and belief constitute attitudes to-\nward events and propositions, although sentiment\ncan also concern attitudes toward objects such as\npeople, organizations, and abstract concepts. De-\ntection of sentiment and emotion in text requires\nlexical and sentence-level information. Sentiment\ncan be signaled by words conveying positive or\nnegative orientation: For example, “sad,” “worried,”\n“difficult,” and “weak” are all words with negative\norientation, whereas “comfortable,” “important,”\n“successful,” and “interesting” convey a positive\nsentiment. Online sentiment dictionaries, such as\nWhissel’s Dictionary of Affect (56), and systems\ncreated from subject-ranked terms, such as Tausczik\nand Pennebaker’s LIWC (Linguistic Inquiry and\nWord Count) (57), can be used to assess positive\nand negative sentiment in a text. More sophis-\nticated approaches to sentiment analysis also seek\nto identify the holder (source) as well as the object\nof the sentiment: for instance, who is positive about\nwhat person, country, activity, or concept (55).\nThe speech community has also studied pos-\nitive and negative attitudes by focusing more\ngenerally on the identification of positive and neg-\native emotions, primarily using acoustic and pro-\nsodicinformation.However,moreworkiscurrently\nbeing done to identify particular emotions, such\nas Ekman’s classic six basic emotions (anger, dis-\ngust, fear, happiness, sadness, surprise), which\nmay be reactions to events, propositions, or objects.\nThere has also been considerable research using\nfeatures that have proven important in recog-\nnizing classic emotions to identify other speak-\ner states (such as deception), medical conditions\n(such as autism and Parkinson’s disease), speaker\ncharacteristics (such as age, gender, likeability,\npathology, and personality), and speaker conditions\n(such as cognitive load, drunkenness, sleepiness,\ninterest, and trust). Corpora collected for such\nstudies have been used in the Interspeech Para-\nlinguistic Challenges, which have been conducted\nsince 2009. Emotion generation has proven a\nmoredifficult challengeforTTSsynthesis. Although\nthere are some systems (e.g., MARY) that at-\ntempt to generate emotions such as depression,\naggression, or cheerfulness (58), the best synthe-\nsized emotion still comes from corpora recorded for\nparticular emotions by voice talent imitating those\nemotions.\nSentiment classification is widely used in opin-\nion identification (positive or negative views of\npeople, institutions, or ideas) in many languages\nand genres. Particular applications abound, such\nas identifying positive and negative movie or pro-\nduct reviews (59, 60) and predicting votes from con-\ngressional records (61) or Supreme Court decisions\nfrom court proceedings. Figure 5 illustrates a typical\nrestaurant review, annotated for positive, negative,\nand neutral sentiment, as well as basic emotions.\nMining socialmedia forsentiment or classicemo-\ntions has been a particularly popular topic for the\npurposes of assessing the “public mood” from Twit-\nter, predicting stock market trends, or simply eval-\nuatingacommunity’smentalstate(62).Socialmedia\nsuch as Twitter, blog posts, and forums also provide\nresearchers with very large amounts of data to use in\nassessing the role of sentiment and emotion in\nidentifying other linguistic or social phenomena\n[e.g., sarcasm (63), power relationships, and so-\ncial influence (64)], as well as mental health is-\nsues [e.g., depression (65)].\nConclusion and outlook\nMany times during the past 50 years, enthusi-\nastic researchers have had high hopes that the\nlanguage-understanding ability of robots in sci-\nence fiction movies was just around the corner.\nHowever, in reality, speech and language under-\nstanding did not work well enough at that time\nto power mainstream applications. The situation\nhas been changing dramatically over the past five\nyears. Huge improvements in speech recognition\nhave made talking to your phone a commonplace\nactivity, especially for young people. Web search\nenginesareincreasinglysuccessfulinunderstanding\ncomplex queries, and MT can at least yield the gist\nof material in another language, even if it cannot\nyet produce human-quality translations. Com-\nputer systems trade stocks and futures auto-\nmatically, based on the sentiment of reports about\ncompanies. As a result, there is now great com-\nmercial interest in the deployment of human\nlanguage technology, especially because natural\nlanguage represents such a natural interface\nwhen interacting with mobile phones. In the\nshort term, we feel confident that more data\nand computation, in addition to recent advances\nin ML and deep learning, will lead to further\nsubstantial progress in NLP. However, the truly\ndifficult problems of semantics, context, and\nSCIENCE sciencemag.org\n17 JULY 2015 • VOL 349 ISSUE 6245\n265\nBreakfast on Broadway is a new place focusing on, you guessed \nit, breakfast/brunch. Went there last Sunday around 1. The food \nwas not bad but the service was pretty terrible. We had to wait 15 \nminutes just to get menus and another 30 to get something to \neat. And there were only a few tables occupied! If you don’t mind \nthe wait though, the price is right. I’ll probably give it another try. \nMaybe they need time to get their act together.\nBreakfast on Broadway is a new place focusing on, you guessed it, \nbreakfast/brunch. Went there last Sunday around 1. The food was \nnot bad but [Anger: the service was pretty terrible]. [Disgust: We \nhad to wait 15 minutes just to get menus and another 30 to get \nsomething to eat. And there were only a few tables occupied!] If \nyou don’t mind the wait though, the price is right. I’ll probably give \nit another try. [Uncertainty: Maybe they need time to get their act \ntogether.]\nFig. 5. Manually annotated text analysis on a sample restaurant review. Sentiment analysis is shown on the left (blue, positive sentiments; red, negative; gray,\nneutral). In the emotion analysis on the right, emotions are shown in bold type and delineated by square brackets. Note in particular the importance of going beyond\nsimple keyword analysis; for example, “not” has scope over “bad,” which might mislead simple systems. Also, the presence of “hedge” words and phrases, which muddle\nthe intended meaning (e.g., “pretty,” which has a positive connotation, modifying the negative word “terrible”), somewhat decreases the negative score of the next clause.\n",
  "speaker": "SYSTEM",
  "uuid": "cdaf470f-2ecf-4a6e-84f8-5a6d2c020624"
}