{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SEALS-EvaluatingClassifiers \n\nContents\n[\nhide\n]\n1\nCaso de Uso\n2\nPlan de Trabajo\n3\nEjecución\n3.1\nPreliminares\n3.2\nInstalación local de repositorios de datos de prueba y de resultados\n3.2.1\nDesplegar el repositorio de pruebas\n3.2.2\nDesplegar el repositorio de resultados\n3.2.3\nPruebas del repositorio de datos de prueba y de resultados\n3.3\nDefinición de datos de prueba\n3.3.1\nPROBLEMAS ENCONTRADOS:\n3.3.2\nConsultas al repositorio de pruebas:\n3.3.3\nMejoras:\n3.4\nDefinición de ficheros de resultados\n4\nDefinición de tipo de herramienta en SEALS para el clasificador\n4.1\nClasificador desde la linea de comando\n4.2\nClasificador desde Java\n4.3\nWrapper para incluirlo en un SimpleTool de SEALS\n4.4\nInstalación del wrapper en la plataforma SEALS\n4.4.1\nInstalación de la plataforma SEALS\n4.4.2\nDeploy del wrapper simpleTool en el RES Worker\n4.5\nBPEL\n4.5.1\nResultados de la ejecución del Bpel\n5\nTiempos Reales de Ejecución\nCaso de Uso\n\nObjetivo\n: Usar la plataforma Seals para evaluar los algoritmos de clasificación de tweets basados en tópicos latentes descubiertos en la colección de mensajes.\nLos datos de entrada se componen de dos ficheros, uno con datos para entrenar el clasificador y otro con datos para su validación. Ambos ficheros contienen registros de la forma: <id, mensaje, evento, clase>, donde id es el identificador numérico, mensaje es el tweet, evento es el evento relacionado con el tweet, y clase es el tipo asignado manualmente por un usuario.\nLos datos de salida se almacenarán en un único fichero que se corresponde con el fichero de validación al que se le ha adicionado una columna con la clase asignada por el clasificador.\nPara evaluar un clasificador se utilizan métricas como precisión,\nrecall\ny la medida f. Algunas veces se define un umbral que se usa para decidir si el resultado del clasificador se acepta o no. En estos casos se suele reportar los mejores resultados de evaluación, de acuerdo a una de las medidas, usando un determinado umbral.\nVariaciones\n:\nUsualmente los algoritmos de clasificación son evaluados con una técnica conocida como\ncross-validation\n. Esta técnica sirve para evaluar como los resultados del clasificador se pueden generalizar a un conjunto de datos independiente.  Los datos son divididos en k subconjuntos, k-1 subconjuntos son usados como datos de entrenamiento y 1 un subconjunto como datos de validación. El clasificador es entrenado y validado con estos conjuntos de datos. El proceso se repite k veces, de tal forma que cada subconjunto sea usado al menos una vez como datos de validación. Finalmente los resultados de las k ejecuciones son promediados. Así al usar cross-validation se tendrían dos posibilidades:\nGenerar automáticamente todas las evaluaciones con sus respectivos datos de entrenamiento y datos de validación.\nQue el clasificador se encargue de hacer el cross-validation con lo cual se  tendría una única evaluación, con un único conjunto de datos prueba.\nLos algoritmos de clasificación pueden recibir parámetros que modifican su comportamiento. En procesos de evaluación sería interesante ver que versión del clasificador definida por los parámetros de entrada tiene un mejor desempeño.\nPlan de Trabajo",
  "speaker": "SYSTEM",
  "uuid": "ce328691-213e-4da9-a318-324d77ea4696"
}