{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 43\n41\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n4. Speech overview\n4.1 Background\nSpeech technology is no longer the stuff of science fiction. Adoption of new IT platforms and hardware, cou‐\npled with unforeseen increases in the processing power, lower IT prices, and miniaturization of electronic\ncomponents have supported to make speech technology nearly ubiquitous, commercially viable for speech\nsuppliers and service providers. In fact, speech recognition is widely recognized and used not only as a cost‐\ncutting mechanism to provide cost‐effective customer care and self‐service in business, but also providing to\nconsumers an easier, more convenient, cleaner, and more fun way to control products and personal devices,\nsuch as home appliances or cell phones. \nSpeech technologies are human‐to‐computer interfaces providing multimodal and natural spoken interac‐\ntion (e.g. human computer dialogue) thus human and computers or devices can interact in both directions,\nthus texts and speeches generated by machines could be readable, processed and understood by humans,\nand those generated by humans, could be readable, processed and understood by machines. \nSpeech interaction technology aims at enabling people to communicate with machines and devices (every‐\nthing from phones to cars, e.g. PCs, cell phones, GPS, etc.) using spoken language (through natural inter‐\nfaces), requiring very little training and in a cost‐effective way. Thus they comprise the specification of the\ninteraction between a user and a computer system, where the primary interface is audio input and/or out‐\nput. This goal has increased importance in as mobile world grows; voice is becoming an essential interface\nmode for smartphones and any mobile device.\nSignificant milestones in speech technologies were achieved in the 1950`s and 1960`s, where research in this\ntechnology paved the way to commercially feasible designs, hardware and applications, providing not only\ngreater understanding of speech as it related to human behavioural and conversational patterns, but also\ndevelopments of artificial and synthetic sounds. \nDespite increase of Interactive Voice Response (IVR) technology in the 1970s to automate tasks in call cen‐\ntres, it was still expensive and complex. During the 90`s first large commercial applications were deployed in\ndifferent areas, for example: Dragon brings the first dictation application, AT&T launches and automatic call\ncollection operating system.\nMilestones in the history of Speech Technology\n1952\nCreation of a small vocabulary recognizer for digits over the phone, by Bell Labs.\n1962\nIBM developed Shoebox ‐ a 16‐word speech 16‐word speech recognizer, used to interface with\na calculator.\n1972\nIntroduction of stochastic processing with Hidden Markov models to speech recognition.\nMid‐1970s\nCreation of a small vocabulary recognizer for hands‐free industrial applications, by NEC and\nThreshold Technology.\nLate‐1970s\nVerbex launches a speech application based on a small vocabulary recognizer, which is useful\nfor telephone toll management and financial services.\n1990\nIntroduction of a general‐purpose dictation application, by Dragon Systems.\n1992\nAT&T unveiled automated operator system, which is capable to understand spoken utterances\nthat include ‘operator’ and ‘collect call’.\nLate‐1990s\nLarge‐scale deployment of commercial speech recognition solutions.\n",
  "speaker": "SYSTEM",
  "uuid": "cf16e243-4b50-4ac5-ba9a-196fb705d289"
}