{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual25022010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nEscritura del entregable para el hito 5.\nActividad: Desambiguación usando Dbpedia local en Español e Ingles\nSubActivdad: Adaptación del servicio de desambiguación en Español\nSe ha incluido el uso de términos relacionados (keyTerms) recuperado desde el API de yahoo! en los casos donde la etiqueta no se encuentra en la wikipedia. Por ejemplo si un usuario etiqueta una foto con\nmuseoPrado\n, el servicio de sugerencias de yahoo! solo divide la etiqueta en \"\nmuseo prado\n\" y al buscarla en la Wikipedia en español no existe una página relacionada directamente. Sin embargo, si consultamos yahoo! por los términos relacionados nos devolvería entre otros \"\nprado\n\" \"\nmuseo del prado\n\" \"\nel prado\n\". Después aplicamos una medida de similitud entre cadenas de caracteres llamada\ndistancia de Needleman-Wunch\nentre la etiqueta y cada uno de los keyterms y se selecciona aquellos keyTerm cuyo nivel de similitud sea mayor a 0.7. Se ordenan los keyTerms de mayor a menor similitud y se realiza la búsqueda para cada uno de ellos.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nSe han realizado dos cambios: uno para disminuir el tiempo de respuesto y otro condicionado por las codificaciones. Para tratar el primer punto se ha decidido ejecutar solamente la primera vez la llamada a la aplicación de GATE; del mismo modo se pretende disponer del conjunto de procesos que realizarán la anotación. Es cierto que la primera invocación será más lenta pero se espera que el resto de veces el tiempo sea menor. El servicio tenía dificultades para comunicarse con el servidor, y el contexto necesario para disminuir el tiempo de ejecución no se encontraba.Al realizar modificaciones de la aplicación para soportar las diferentes codificaciones, se ha producido un cambio en la creación del servicio web, y actualmente se está en estudio utilizar librerías distintas.\nInterfaz Anotación Híbrida\n\n- Se Añadió el efecto de \"loading...\" a la pagina de resultados anotados.\n- Se esta buscando API en php y AJAX para tratamiento de HTML a RDF.\n- Se investigan todos los productos de Anotación de la WEB y de Escritorio.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con la implementación del adaptador Fura. Se ha completado una primera prueba en la que el servicio web es capaz de, partiendo de dos parámetros con el nombre de la tarea y el grupo cola, lanzar dicha tarea al grid. A continuación se ha empezado a desarrollar una interfaz mas compleja capaz de aceptar un fichero JSDL a partir del cual lanzar la tarea.\n- Correción del entregable H5.\nTarea 1.4\n\nCorrecciones a Entregable 1.4.5.\nTarea 7.1\n\n- Linked Data. Difusión de la generación de Linked Data\n- RDF. Continuación de generación de mappings\n- Entregable Hito 5. Redacción del documento",
  "speaker": "SYSTEM",
  "uuid": "cf3ef6ba-707c-431a-b152-34b50ac3089e"
}