{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ExperimentosMultilingualidad \n\nEsta página contiene una descripción del trabajo sobre los experimentos de multilingüalidad.\nLos experimentos deben cubrir dos metas diferentes. Es posible que un experimento cubra los dos metas y es posible que no:\nExperimento práctico para la clase de máster.\nExperimento de validación de la solución propuesta.\nEn la reunión se han propuesto varios experimentos a realizar:\nComparación de métodos automático y manual de traducción\nAnálisis de la calidad que proporciona cada recurso lingüistico.\nDefinir ¿Qué entendemos por calidad?\nDeterminar ¿Cuándo un recurso tiene más calidad que otro?\nTareas\n\nLas tareas que hay que realizar para el experimento en la clase del master son:\nCrear golden standard  (sin utilizar el sistema)\nLos evaluadores usarán WordReference (\nhttp://www.wordreference.com/es/\n) como soporte para traducir las etiquetas\nTraducir la ontología a otro(s) idioma(s) usando LabelTranslator\nRealizar el experimento: Accuracy\nUsado para medir la exactitud del sistema.  Contamos el número de veces que una traducción correcta está en la primera posición.\nRealizar el experimento: Precision / Recall\nprecision = (número de traducciones correctas proporcionadas por el sistema) / (número de traducciones que han sido sugeridas)\nrecall = (número de traducciones correctas proporcionadas por el sistema) / (número de traducciones posibles --> gold standard)\nRealizar el experimento: Adequacy and Fluency\nAdequacy: mide si el significado expresado en la traducción del gold standard está expresado en la traducción provista por el sistema\nFluency: mide que tan fluida es la traducción\nHerramientas necesarias\n\nDocumento explique el experimento\nTécnico: Explica el objetivo de la evaluación\nManual experimentador: Muestra paso a paso las actividades que tiene que realizar el evaluador\nInfraestructura de ejecución (instalación de neontoolkit)\nInfraestructura definición gold standard\nCronología\n\n18 de octubre. Propuesta de experimentos y revisión de literatura.\n25 de octubre. Documento técnico.\n1 de noviembre. Experimentos definidos y Manual del experimentador.\n5 de noviembre. Experimento de prueba.\n15 noviembre. Práctica en la clase de máster (19:15-21:00).\n22 noviembre. Tutoría sobre la práctica en la clase de máster (18:15-19:15).\n30 de noviembre. Experimentos de validación incluidos en el paper del ESWC.",
  "speaker": "SYSTEM",
  "uuid": "cf44f8a0-3c38-4507-823c-53c83b1d9516"
}