{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 16\nva consolidada durante siglos, sino incorporando alternativas y sistemas más ágiles y fle-\nxibles de organización y gestión, frente a la rigidez y burocratización de la Administración\ntradicional. Esta modernización se ha venido gestando desde los años noventa teniendo en\ncuenta los siguientes componentes23:\n1. Incorporación de técnicas de organización de la empresa privada, tales como los\nprincipios de eficiencia y eficacia, control y evaluación de los servicios.\n2. Desarrollo de los sistemas de información, confiriendo a ésta una importancia fun-\ndamental para la toma de decisiones y la prestación de los servicios públicos.\n3. Descentralización territorial y funcional de autoridad y responsabilidad, lo que per-\nmite una gestión más ágil y flexible.\n4. Introducción de tecnologías para proporcionar agilidad y aumentar la calidad del\nservicio.\n5. Formación continua del empleado público, para conseguir la profesionalización de\nla Administración.\n6. Racionalización en la toma de decisiones, mediante la aplicación de nuevas técni-\ncas de gestión pública.\nMINISTERIOS Y ORGANISMOS PÚBLICOS\nLa organización administrativa del Estado descansa en los ministerios. La composición\nde cada una de estas instituciones es jerárquica y piramidal. Actualmente su función “es\nmás reguladora y reglamentista que gestora, más supervisora que controladora y más coor-\ndinadora y cooperadora que ejecutora”24. \nPara conseguir la flexibilización de la organización administrativa que requiere la cre-\nciente complejidad y especialización de las funciones administrativas, por un lado, y por\notro la mayor eficacia en su gestión y prestación, los ministerios han de adaptarse a la\nnueva situación y para ello se ha desarrollado la denominada Administración instrumen-\ntal. En palabras de Fernández Farreres, consiste en “desgajar a la Administración de sec-\ntores orgánicos completos a los que se les da personalidad jurídica propia que les habilita\npara desarrollar esa actividad”25. \nSe configuran así los organismos públicos estatales que se definen como los creados\nbajo la dependencia o vinculación de la AGE para la realización de cualquier actividad de\nejecución o gestión tanto administrativa de fomento o prestación como de contenido eco-\nnómico, cuyas características justifiquen su organización y desarrollo en régimen de des-\ncentralización funcional; gozan de personalidad jurídica pública diferenciada, patrimonio\ny tesorería propios y autonomía de gestión26. De esta forma los ministerios, a los cuales\nles corresponde las tareas de planificación y control, en la ejecución de las actividades\nde fomento y provisión de servicios públicos, cuentan con toda una serie de organis-\nmos: agencias estatales, organismos autónomos, entidades públicas empresariales, orga-\nLA ADMINISTRACIÓN GENERAL DEL ESTADO Y SUS BASES DE DATOS\n21\n23 BAUZÁ MARTORELL, Felio J. Aproximación, pp. 87-88.\n24 ZATARAÍN DEL VALLE, Reyes. Configuración de las grandes Administraciones Públicas. En Estudios para la\nreforma de la administración pública / Fernando Sáinz Moreno (dir.). Madrid, MAP: 2004, p. 266.\n25 FERNÁNDEZ FARRERES, Germán. Administraciones Instrumentales. En Estudios para la reforma de la admi-\nnistración pública / Fernando Sáinz Moreno (dir.). Madrid, MAP: 2004, p. 341.\n26 LOFAGE, arts. 41 y 42.1.\nBASES DE DATOS  1/1/04  03:39  Página 21\n",
  "speaker": "SYSTEM",
  "uuid": "cf65c5bf-36b4-4e0f-9e2d-ba007cc1ed61"
}