{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 16\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13924\n[6]  Recursos humanos.\nDescripción de los equipos de investigación y profesorado, detallando la \ninternacionalización del programa.\nDescripción de los mecanismos habilitados para colaboraciones externas.\nLíneas de investigación del programa con indicación de los equipos investigadores \nasociados a las mismas.\nProducción científica del personal investigador en los últimos 5 años y contribuciones \nconjuntas con investigadores extranjeros.\nExperiencia del personal investigador en la dirección de tesis doctorales.\nMecanismos de cómputo de la labor de tutorización y dirección de tesis como parte de \nla dedicación docente e investigadora del profesorado.\n[7]  Recursos materiales y apoyo disponible para los doctorandos.\nDescripción de los medios materiales y servicios disponibles (laboratorios y talleres, \nbiblioteca, acceso a bases de datos, conectividad, etc.).\nPrevisión para la obtención de recursos externos que sirvan de apoyo a los doctorandos \nen su formación.\n[8]  Revisión, mejora y resultados del programa.\nÓrgano, unidad o persona responsable del sistema de garantía de calidad.\nDescripción de los mecanismos y procedimientos de seguimiento que permitan analizar \nel desarrollo y resultados del programa de doctorado para su mejora.\nDescripción de los procedimientos que aseguren el correcto desarrollo de los programas \nde movilidad y mecanismos para publicar información sobre el programa, su desarrollo y \nresultados.\nEn el caso de programas en los que participen más de una universidad, se deberán \ndescribir los mecanismos y procedimientos que aseguren la coordinación entre las \nuniversidades participantes.\nDescripción del procedimiento para el seguimiento de doctores egresados.\nDatos relativos a los últimos 5 años o estimación prevista en los próximos 6 años (en \nel caso de programas de nueva creación) sobre: tesis producidas, tasa de éxito en la \nrealización de tesis doctorales, calidad de las tesis y contribuciones resultantes. Justificación \nde los datos aportados.\nANEXO II\nCriterios de evaluación para la verificación de los programas de doctorado a que se \nrefiere el artículo 10.5 de este real decreto\n[1]  Descripción del programa de doctorado.\nSe valorará:\nQue la denominación del programa de doctorado sea coherente con las líneas de \ninvestigación en propuestas en el mismo.\nLa participación en el programa de otras instituciones participantes.\nLa imbricación del programa en la estrategia de I+D+i de la universidad o, en su caso, \nde otras instituciones. Este aspecto quedará plasmado en su inscripción en el seno de una \nEscuela Doctoral, sea propia de la universidad que propone el programa de doctorado, \ninteruniversitario o bien en colaboración con otros organismos e instituciones.\nLa existencia de redes o convenios internacionales.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "cfb6286b-f232-4ebb-b0b2-6470f308cb07"
}