{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 3\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13911\nactores y aliados en la formación doctoral y después en la inclusión de los doctores en sus \nactuaciones cotidianas.\nEn consonancia con las recomendaciones europeas, es determinante enfatizar el \nimportante, adecuado y necesario papel que la supervisión y el seguimiento de las \nactividades doctorales, en términos de los objetivos de los programas de doctorado y de \nlas Escuelas de Doctorado. Aunque se enfatizan las responsabilidades personales en este \naspecto, son compartidas por las propias instituciones que gestionen el programa, a través \nde las correspondientes Comisiones Académicas, y, en su caso, por las Escuelas de \nDoctorado a través de diversos mecanismos.\nDe acuerdo con todo lo expuesto, este real decreto persigue el objetivo de colaborar en \nla formación de aquellos que han de liderar y cooperar en el trasvase del conocimiento hacia \nel bienestar de la sociedad coordinadamente con la incorporación de las principales \nrecomendaciones surgidas de los distintos foros europeos e internacionales. Todas ellas se \nrefieren a la estructura y organización de doctorado, las competencias a adquirir, las \ncondiciones de acceso y el desarrollo de la carrera investigadora en su etapa inicial, el \nfundamental papel de la supervisión y tutela de la formación investigadora, la inserción de \nesta formación en un ambiente investigador que incentive la comunicación y la creatividad, \nla internacionalización y movilidad esenciales en este tipo de estudios y la evaluación y \nacreditación de la calidad como referencia para su reconocimiento y atractivo internacional.\nDe conformidad con lo anterior la presente norma prevé la creación de Escuelas de \nDoctorado y establece comisiones académicas de los programas de doctorado, así como \nla figura del coordinador del programa. Introduce como novedad el documento de \nactividades del doctorando previendo un régimen de supervisión y seguimiento del mismo \ny establece por vez primera un plazo máximo de duración de los estudios de doctorado \ncon la posibilidad de dedicación a tiempo parcial y a tiempo completo.\nPor otro lado la nueva ordenación establece una regulación de estas enseñanzas que \npropicia una más clara distinción entre el segundo ciclo de estudios universitarios, de \nMáster, y el tercero, de doctorado, determinando asimismo los criterios específicos para la \nverificación y evaluación de los programas de doctorado.\nEntre las principales novedades se incluye asimismo la previsión de que los tribunales \nencargados de evaluar las tesis doctorales deberán estar conformados en su mayoría por \ndoctores externos a la Universidad y a las instituciones colaboradoras. También se recogen \naspectos relativos a la protección de datos confidenciales y garantías de eventuales \npatentes de los trabajos de investigación y se establece la posibilidad de incluir en el título \nla mención de «Doctor Internacional».\nEl carácter básico de esta norma reglamentaria se justifica, conforme a la doctrina del \nTribunal Constitucional, en la propia naturaleza de la materia regulada, que constituye un \ncomplemento indispensable para asegurar la completa ordenación de las enseñanzas \nuniversitarias oficiales establecida mediante el Real Decreto 1393/2007, de 29 de octubre, \nmodificado por el Real Decreto 861/2010, de 2 de julio.\nDe este modo, la regulación de las enseñanzas oficiales de doctorado acometida en \neste real decreto resulta, por la naturaleza de la materia y de acuerdo con la doctrina del \nTribunal Constitucional, complemento necesario para garantizar la consecución de la \nfinalidad objetiva a que responde la competencia estatal, sin que dicho cumplimiento \nresulte un obstáculo al ejercicio de las competencias de desarrollo normativo que \ncorresponden a las comunidades autónomas.\nEste real decreto ha sido informado por el Consejo de Universidades, por la Conferencia \nGeneral de Política Universitaria y por el Ministerio de Política Territorial.\nEn su virtud, a propuesta del Ministro de Educación, con la aprobación previa de la \nVicepresidenta Primera del Gobierno y Ministra de la Presidencia, de acuerdo con el \nConsejo de Estado y previa deliberación del Consejo de Ministros en su reunión del día 28 \nde enero de 2011,\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "cfcb5016-4cca-4c60-88d6-ffac880b5266"
}