{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 17\n5.  Gómez-Pérez, A., Fernández-López, M., Corcho, O. “Ontological Engineering”. Springer \nVerlag. Advanced Information and Knowledge Processing series. ISBN 1-85233-551-3. \nNovember 2003. \n6.  Gómez-Pérez, A., Ortiz-Rodriguez, F., and Villazón-Terrazas, B. Legal Ontologies for the \nSpanish e-Government. Current Topics in Artificial Intelligence.Springer Berlin / \nHeidelberg.301-310, 2006. \n7. Gómez-Pérez, J.M., Pariente, T., Buil-Aranda, C., Herrero, G., Baena, A.: NeOn Deliverable \nD8.3.1. Ontologies for pharmaceutical case studies. 2007. \n8. Grüninger, M., Fox, M. “Methodology for the design and evaluation of ontologies”. In \nSkuce D (ed) IJCAI95 Workshop on Basic Ontological Issues in Knowledge Sharing, pp \n6.1–6.10. (1995). \n9. IEEE Recommended Practice for Software Requirements Specifications. IEEE St 830-1993. \n10. IEEE Recommended Practice for Software Requirements Specifications. IEEE Std. 830-\n1998. \n11. SEEMP Consortium. SEEMP D3.1a. Supporting the State of the Art. July 2006.  \n12. SEEMP Consortium. SEEMP D4.1. Components Design. March 2007.   \n13. Sommerville, I. “Software Engineering”. 8th edition. International Computer Science \nSeries. 2007. \n14. Staab, S., Hans, P., Studer, R., Sure, Y. “Knowledge Processes and Ontologies”. IEEE \nIntelligent Systems 16(1):26–34. (2001).  \n15. Suárez-Figueroa, M. C., Fernández-López, M., Gómez-Pérez, A., Dellschaft, K., Lewen, \nH., Dzbor, M. NeOn D5.3.2. Revision and Extension of the NeOn Development Process and \nOntology Life Cycle. NeOn project. http://www.neon-project.org. November 2008 \n16. Suárez-Figueroa, M.C., Aguado de Cea, G., Buil, C., Dellschaft, K., Fernández-López, M., \nGarcía, A., Gómez-Pérez, A., Herrero, G., Montiel Ponsoda, E., Sabou, M., Villazón-\nTerrazas, B. and Yufei, Z.. “NeOn D.5.4.1. NeOn Methodology for Building Contextualized \nOntology Networks”. February 2008.  \n17. Uschold, M. “Building Ontologies: Towards A Unified Methodology”. In: Watson I (ed.) \n16th Annual Conference of the British Computer Society Specialist Group on Expert \nSystems. Cambridge, United Kingdom. (1996). \n18. Wiegers, E. “Software Requirements 2: Practical techniques for gathering and managing \nrequirements throughout the product development cycle”. 2nd ed., Redmond: Microsoft \nPress. ISBN 0-7356-1879-8. 2003. \n19. Wiering, R. “Requirements Engineering: Frameworks for Understanding”. New York: John \nWiley & Sons, 1996. \n",
  "speaker": "SYSTEM",
  "uuid": "d01ac416-d925-4e73-8a68-31626c474065"
}