{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nDe acuerdo al cronograma de trabajo se ha estado trabajando en la siguiente actividad:\nProcesamiento lingüístico páginas wikipedia en Español\nSub-actividades:\n- Servicio de acceso a las paginas Wikipedia:\n1) Acceso vía HTTP al código fuente de las páginas wikipedia asociadas a una etiqueta.\n2) Parsing de las páginas Wikipedia de desambiguación para obtención de los enlaces relacionados a una etiqueta. Se utilizo el MozillaParser como html parser para java. Este parser es el mismo que utiliza el navegador Firefox para analizar páginas html.\n- Procesamiento lingüístico usando GATE\n1) Extracción de términos de las páginas Wikipedia\n2) Filtrar y limpiar términos: a) Eliminar caracteres no alfanuméricos del principio y del final de los términos. b) Eliminar números excepto años con el formato AAAA. c) Eliminar términos que incluyan alguno de los siguientes caracteres: =/$[]{}-?*¿()\n3) Creación de una lista de stopwords (términos a descartar) en español por ejemplo: a, acá, aca, además, etc.\n4) Eliminar términos que formen parte de la lista de stopwords.\n- Creación de repositorio de información lingüística\n1) Implementación en postgres del repositorio de información lingüística asociado a las paginas wikipedia.\nEsta actividad se ha completado en un 80%. Actualmente se acceden las páginas Wikipedia y se han extraído los términos de estas paginas. Además, se creado el repositorio de información lingüística en una base de datos Postgres. Queda pendiente el almacenamiento de la información extraída de las paginas Wikipedia en el repositorio creado.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\n- La creación del servicio web anotador ha sufrido modificaciones en el fichero de configuración puesto que GATE no era escapaz de entrar correctamente en dicho fichero de configuración, daba un error y su consecuente paralización. Actualmente se ha solucionado el problema y se puede utilizar sin dificultad.\n- Los parámetros del servicio de anotación han sido modificados para mejorar la usabilidad del propio servicio. Un requisito en la entrada de los parámetros es que estén separados por coma y espacio. Este sistema es màs intuitivo para el usuario.\n- Se ha creado un servicio web para entrar a buscar información adicional mediante Sig.ma, donde toda la información en RDF, si es el tipo de lenguaje requerido, se puede obtener del SOAP Response. Se están buscando alternativas de acceso más eficientes y un almacenamiento adecuado.\n- Se está en proceso de creación de un servicio de verificación de URL independiente del servicio de anotación.\nInterfaz Anotación Híbrida\n\n- Se han realizado pruebas entre una aplicacion php utilizando API nusoap, para comunicacion con cualquier servicio Web, por el momento no son completamente exitosas, hay comunicación con el servicio Web (en maquina Local), pero no se reciben los resultados, estamos en proceso de verificación de esta dificultad.\n- Se ha testeado YII framework para la creación de la nueva versión de la interfaz, se codificará completamente en PHP con el patron MVC, ademas el framework cuenta con facilidades para la gestión de usuarios, generación de las traducciones de la interfaz y comunicación con webservices.\n- Existe una nueva propuesta de modelo de datos aun a validar, (no hay un modelo formal propuesto y aceptado).\n- Fecha de liberación tentativa del primer release de la aplicación Web funcionando para pruebas, sería el Lunes 1 de Febrero 2010.\nTarea 2.4\n\n- Finalizados los requisitos del metaplanificador semántico\n- Comienzo del diseño del metaplanificador semántico\nTarea 1.4\n\nPersonal de baja por enfermedad.\nTarea 7.1\n\n- Evaluación del RDF generado procedente de las siguientes bases de datos: EGM, DMA e ICA.\n- Primera conclusión obtenida, necesario refinar las condiciones (fundamentalmente, match-regexp) de los mappings R2o de ICA. Esta revisión es resultado de la forma de codificación de las instancias (instancia, fenómeno).",
  "speaker": "SYSTEM",
  "uuid": "d076deab-cd99-4780-9d9c-0113de5e6694"
}