{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/BNELinkedData \n\nIr a LinkedData\nContents\n[\nhide\n]\n1\nOverview Material\n2\nData sources\n3\nVocabularies / Ontologies\n4\nTransformation tool (MARC2LOD)\n5\nMeetings\n5.1\n25 Enero 2011\n5.2\n2 Marzo 2011\nOverview Material\n\nData sources\n\nInicialmente, se va a trabajar con todos los registros de Miguel de Cervantes:\n- Cervantes_autoridades.xml contiene 550 registros de autoridad en formato MARCXML.\n - Cervantes_bibliograficos.xml contiene 8.512 registros bibliográficos en formato MARCXML.\nLos ficheros se encuentran en el\nftp://mccarthy.dia.fi.upm.es/\nport 21\nVocabularies / Ontologies\n\nInicialmente se van a valorar para su uso:\n1.\nFRAD\n(Functional Requirements for Authority Data)\n[1]\n2.\nFRBRer\n(Functional Requirements for Bibliographic Records)\n[2]\n3.\nFRSAD\nmodel (Functional Requirements for Subject Authority Data)\n[3]\n4.\nISBD\nelements (Este es el que engloba todos, es el estándar por excelencia)\n[4]\nTodos ellos se encuentran en calidad de borrador.\nPor otro lado, es interesante estudiar la experiencia de la Deutsche National Bibliothek:\n- Report en PDF de la versión 3.0 (15-01-11):\n[5]\n- Info general del servicio de Linked Data:\n[6]\nTransformation tool (MARC2LOD)\n\nSe van a usar las siguientes librerías:\n- MARC4J: Para manejar los registros MARC (Bibliográficos y Autoridades)\n- Jena: Para modelar y transformar a RDF\n- Log4J: Para registrar todos los eventos del proceso de transformación (registros transformados, problemas de transformación)\nTODO\n: Reunión con Boris para discutir la arquitectura\nMeetings\n\n25 Enero 2011\n\nParticipantes:\nAna, Elena, Asun, Daniel, Boris\nObjetivo:\nIdentificar los datasets, y vocabularios con los que vamos a trabajar.\nResultados:\nEn la reunión se acordó lo siguiente:\n- Modelos a utilizar inicialmente: ISBD, FRBR-er, FRAD, FRSAD (Todos ellos disponibles en el Open Metadata Registry). (Hecho)\n- Alcance de los datos iniciales: Todos los registros relacionados con Miguel de Cervantes en formato MARCXML. (Hecho)\n- Tener un ejemplo de la aplicación de MARC21 en los registros de la BNE. (Hecho)\n- Traducción de los modelos utilizados:\n1. Extracción de rdfs Labels de los modelos antes mencionados por parte del OEG para la traducción. (Hecho) \n    2. Traducción de Labels por parte del equipo de BNE. (Pendiente)\n    3. Propuesta a IFLA (Gordon Dunsire) del modelo de LIR como solución al multilingüismo en los modelos antes mencionados. (Hecho)\n- Lectura del documento del proyecto de Linked Data en la DNB (Deutsche National Bibliothek)\n- Volvernos a reunir el 2 de Marzo a las 09:15.\n2 Marzo 2011\n\nParticipantes:\nElena Escolano, Ana Manchado, Pascual Jiménez, Ricardo Santos, Asun Gómez-Pérez, Elena Montiel Ponsoda, Boris Villazón-Terrazas, Daniel Vila\nObjetivo:\n- Realizar un overview del status del proyecto\n- Presentar prototipo\n- Discutir cuestiones abiertas\n- Comentar las cuestiones abiertas y el feedback recibido en la reunión con Gordon Dunsire (Elena Escolano).\n- Aclarar el Spanish Use Case para colaborar en el Library Linked Data W3C Incubator Group\nResultados:\n- Definición del proceso a seguir para la primera fase de generación de Linked Data:\n1- Escenario actual: Escenario 2 @\nhttp://www.rda-jsc.org/docs/5editor2.pdf\n2- Escenario a construir: Escenario 1 @\nhttp://www.rda-jsc.org/docs/5editor2.pdf\n3- Vocabularios a utilizar: \n         - ISBD Elements: Datos descriptivos de los registros de Manifestación \n         - FRBRer y FRAD: Datos descriptivos, relaciones y propiedades de los registros de Expresión, Obra, Persona y EntidadCorporativa\n- Discusión acerca de la URI de Base a utilizar, propuesta:\nhttp://cultura.linkeddata.es/BNE/\n- Aclaración de los identificadores únicos para cada recurso generado:\n1- Manifestación --> campo 001 del Registro Bibliográfico\n  2- Persona --> campo 001 del Registro de autoridades\n  3- Obra --> campo 001 del RA\n  4- Expresión --> campo 001 del RA\n  5- Entidad Corporativa --> campo 001 del RA\n  6- Materias --> campo 001 del RA\n- Analizar las posibilidades para la Interfaz de Usuario, centrándose sobre todo en la mejora de la navegación y en proporcionar información agregada.\n- Posibilidad de valor agregado al proyecto: Identificar registros con errores tipográficos (mediante el análisis de las cadenas de caracteres en el campo 245) (Definir mejor el proceso en el siguiente encuentro)\n- Escribir el Spanish Use Case incluyendo dos puntos de vista:\n1- Multilingüismo en España\n  2- Elaboración y visualización de las bibliografías locales\nTareas:\n1- Envío de los mappings de Marc a ISBD, FRBR y FRAD (BNE).\n[Pendiente]\n2- Envío de aclaración de conceptos básicos sobre registros bibliográficos, de autoridad y del escenario que se persigue con el proyecto (BNE).\n[Hecho]\n3- Envío de informe de la reunión (UPM).\n[Hecho]\n4- Envío de información sobre bibliografías locales para el Use Case. (BNE)\n[Pendiente]\n5- Análisis de incorporación de MADS/RDF (Metadata Authority Description Schema in RDF) para la modelización de los registros de autoridades(BNE)\n[Pendiente]\n6- Confirmación de fecha del próximo encuentro para la semana siguiente. (UPM)\n[Hecho]\n7- Mejorar el Overview y los diagramas presentados en el status del proyecto, en base a las matizaciones y aclaraciones de Elena Escolano (UPM).\n[Pendiente]",
  "speaker": "SYSTEM",
  "uuid": "d1e32752-2cea-426a-893d-083f904e0da9"
}