{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ElViajeroLinkedData \n\nNuevo artefacto del perfil opmopviajero: Trip (Viaje). Subclase de \"Container\" de SIOC (puesto que un viaje es un contenedor de posts , fotos, videos y anotaciones). Un viaje posee los siguientes metadatos descriptivos: Nombre (id, obligatorio, automático), título (opcional), creador (opcional), fecha de creación (opcional).\nNombre: identificador de la instancia \"Viaje\". Ej: VIAJ17_03_11_1223\nTítulo: Título ideado por el usuario. Es un literal. Ejemplo: Viaje Brasil 2011. Se relaciona mediante la propiedad sioc:hasTitle con el contenedor del viaje, (como si de un blog se tratase).\nCreador: se trata de la cuenta del usuario creador. La nomenclatura que se ha seguido hasta ahora es la de poner ACC+el nombre del agente. Se relaciona con la propiedad has_creator de sioc, aunque quedará registrado con el rol adecuado con el opm también.\nFecha (de creación): análogo a los anteriores. Convendría que fuera un xsd:Date, pero como no se qué formatos se van a utilizar, en el prototipo se manejarán literales.\nRelaciones con otros artefactos:\nItinerario y contenidos agregados posteriormente (fotos, videos, posts).\nItinerario: Nueva clase que se ha de añadir a la ontología, bien como parte de la ontología opmopviajero o bien extendiendo/reutilizando otras de geoes. Se relaciona con un viaje con una de las 2 relaciones (a discutir el nombre):Trip123  <has_itinerary/ has_route> Itinerary1123.\nNota:\nquizá no para el prototipo, pero si los itinerarios se pueden cambiar, convendría ponerlos como artefactos y registrar parte de su provenance.\nFotos videos y posts. No son los mismos los que se agregan que los que se utilizan como referencia para el viaje, lo ideal es distinguirlos para poder hacer un \"time line\" del propio viaje. Cada vez que se añaden se puede considerar que el viaje ha sufrisdo una modificación, y por lo tanto ha sufrido un nuevo proceso que desemboca en una nueva versión. Discutir el problema de la identificación y el versionado: ¿Cómo sabemos la versión actual si el componente de ingreso siempre se refiere al mismo identificador?\nPropuesta Dani:\nCada vez que se realiza una nueva  modificación, se busca cuál es la última versión del viaje/recurso, se crea el id de la nueva versión y se genera. Requiere una consulta al repositorio por inserción, pero a cambio se mantiene todo el provenance y reproducibilidad.\nItinerario: (Por ahora) No es un nuevo artefacto, sino un contenedor de puntos en orden para ser dibujados. ¿Cómo se establece el orden? Un itinerario puede contener varios puntos (\nnueva relación has_point\n), y para saber por cuál empezar a dibujar, contiene la relación (\nfirst point\n). Entre los puntos tienen una relación\nnext_point\npara saber el orden.\nNota:\nEsto es mejorable y discutible.\nUn viaje surge de un proceso de creación por parte de un usuario. Para ello utiliza una serie de referencias a guías, posts, videos, fotos y otros viajes que forman parte de su provenance. Este proceso finaliza con la primera versión del viaje.\nCuando un usuario modifica un viaje añadiendo contenidos, hay que especificar el proceso de creación de cada contenido y luego especificar que se usa para una nueva versión del viaje. Por ejemplo: si un usuario sube una foto, a la que ha puesto un título, hora, etc. Hay que especificar su creación, añadir sus metadatos asociados y por último crear la nueva versión del viaje en el que se añade como referencia.\nCuando otros usuarios se refieran al viaje para usarlo como referencia, se refieren al identificador único sin pensar en versiones. Suponemos que siempre se refieren a la última versión del viaje, ya que suponemos que el componente de ingreso no soporta versiones.\nPropuesta a implementar\n\nBasado en el modelo de geometrías de geolinked data. Un viaje tiene itinerarios (por ahora no guardamos los cambios a itinerarios).\nLos itinerarios tienen pathElements. Cada path Element tiene un orden y un punto asociado.\nEjemplo\n\nEjemplo de modelado de un viaje creado a partir de otro como referencia y que sufre una modificación añadiendo una foto (creando una nueva versión del viaje).\nNo he representado itinerario, nombre, etc. para no complicar más la figura.\nLeyenda\nRojo: Artefactos\nAzul: Agentes\nVerde: Procesos\nGris: Aristas (opm)\nErrata: la arista \"Later Generation Than\" no debería ir al Process, sino al artefacto resultante. La arista de later gen than de la foto es Used, y la de was controlled de la guía es Used también\nTO DO List",
  "speaker": "SYSTEM",
  "uuid": "d1e542e4-3e38-4d4b-a422-d3123c4d050d"
}