{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 4\nmechanic fellows were disgustingly young when they did their best work. Most mathematicians, theoretical\nphysicists, and astrophysicists do what we consider their best work when they are young. It is not that they\n\u000f\ndon't do good work in their old age but what we value most is often what they did early. On the other hand,\n \nin music, politics and literature, often what we consider their best work was done late. I don't know how\n\u001e\nwhatever field you are in fits this scale, but age has some effect.\n\nBut let me say why age seems to have the effect it does. In the first place if you do some good work you\n\u0002\nwill find yourself on all kinds of committees and unable to do any more work. You may find yourself as I\n\nsaw \n\u0006\nBrattain when he got a Nobel Prize. The day the prize was announced we all assembled in Arnold\nAuditorium; all three winners got up and made speeches. The third one, Brattain, practically with tears in\nhis eyes, said, ``I know about this Nobel-Prize effect and I am not going to let it affect me; I am going to\n\u001a\nremain good old Walter \n\u0018\nBrattain.'' Well I said to myself, ``That is nice.'' But in a few weeks I saw it was\n\u0002\naffecting him. Now he could only work on great problems.\n\t\nWhen you are famous it is hard to work on small problems. This is what did Shannon in. After information\n\u0019\ntheory, what do you do for an encore? The great scientists often make this error. They fail to continue to\n\f\nplant the little acorns from which the mighty oak trees grow. They try to get the big thing right off. And\n\u000f\nthat isn't the way things go. So that is another reason why you find that when you get early recognition it\n\f\nseems to sterilize you. In fact I will give you my favorite quotation of many years. The Institute for\n\u0006\nAdvanced Study in Princeton, in my opinion, has ruined more good scientists than any institution has\n\u0004\ncreated, judged by what they did before they came and judged by what they did after. Not that they weren't\n\u0007\ngood afterwards, but they were superb before they got there and were only good afterwards.\n\u0017\nThis brings up the subject, out of order perhaps, of working conditions. What most people think are the best\nworking conditions, are not. Very clearly they are not because people are often most productive when\n\nworking conditions are bad. One of the better times of the Cambridge Physical Laboratories was when they\n\nhad practically shacks - they did some of the best physics ever.\nI give you a story from my own private life. Early on it became evident to me that Bell Laboratories was\nnot going to give me the conventional acre of programming people to program computing machines in\nabsolute binary. It was clear they weren't going to. But that was the way everybody did it. I could go to the\n\t\nWest Coast and get a job with the airplane companies without any trouble, but the exciting people were at\n\u0019\nBell Labs and the fellows out there in the airplane companies were not. I thought for a long while about,\n\u0002\n``Did I want to go or not?'' and I wondered how I could get the best of two possible worlds. I finally said to\nmyself, ``Hamming, you think the machines can do practically everything. Why can't you make them write\nprograms?'' What appeared at first to me as a defect forced me into automatic programming very early.\n\u000f\nWhat appears to be a fault, often, by a change of viewpoint, turns out to be one of the greatest assets you\n\u0019\ncan have. But you are not likely to think that when you first look the thing and say, ``Gee, I'm never going\n\u0007\nto get enough programmers, so how can I ever do any great programming?''\n\f\nAnd there are many other stories of the same kind; Grace Hopper has similar ones. I think that if you look\ncarefully you will see that often the great scientists, by turning the problem around a bit, changed a defect\n\u0007\nto an asset. For example, many scientists when they found they couldn't do a problem finally began to study\n\f\nwhy not. They then turned it around the other way and said, ``But of course, this is what it is'' and got an\n\nimportant result. So ideal working conditions are very strange. The ones you want aren't always the best\n\u001e\nones for you.\n\u000e\nNow for the matter of drive. You observe that most great scientists have tremendous drive. I worked for ten\n\u0011\nyears with John Tukey at Bell Labs. He had tremendous drive. One day about three or four years after I\n!\njoined, I discovered that John Tukey was slightly younger than I was. John was a genius and I clearly was\n\u0003\nnot. Well I went storming into Bode's office and said, ``How can anybody my age know as much as John\nTukey does?'' He leaned back in his chair, put his hands behind his head, grinned slightly, and said, ``You\n$\nwould be surprised Hamming, how much you would know if you worked as hard as he did that many\n\nyears.'' I simply slunk out of the office!\n!\nWhat Bode was saying was this: ``Knowledge and productivity are like compound interest.'' Given two\n\u0019\npeople of approximately the same ability and one person who works ten percent more than the other, the\n\u000f\nlatter will more than twice outproduce the former. The more you know, the more you learn; the more you\n%\nlearn, the more you can do; the more you can do, the more the opportunity - it is very much like compound\n",
  "speaker": "SYSTEM",
  "uuid": "d1e764d6-ad4f-4760-87b7-65a44c453c26"
}