{
  "message": "SYSTEM: CV-Cicyt_Elena_Noviembre2013_v1_.pdf: Página 21\nDOCTORADO: \n \nEnero 2011: Obtención del nombramiento de Doctor Europeo \n \nJunio 2007: Obtención de la Suficiencia Investigadora (Diploma de Estudios Avanzados) \n \nEnero 2007: Obtención de una beca de investigación de la Universidad Politécnica de Madrid, cofinanciada con \nel proyecto europeo Lifecycle support for networked ontologies (NeOn) (FP6-027595). \n \nCurso 2006-2007: Segundo curso del Doctorado en “Lenguas para Fines Específicos: un enfoque \nmultidisciplinar” del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la UPM. Periodo de \ninvestigación.  \n \nCurso 2005-2006: Primer curso del Doctorado en “Lenguas para Fines Específicos: un enfoque \nmultidisciplinar” del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la UPM. Realización \nde cursos de doctorado. \n \n \nREVISIONES EN REVISTAS Y CONFERENCIAS: \n \nSeptiembre 2013: miembro del comité de programa del workshop NLP & DBpedia, celebrado en el marco de la \nconferencia ISWC2013 \n \nSeptiembre 2013: miembro del comité de programa de la conferencia internacional TIA2013 – Terminology and \nArtificial Intelligence \n \nJulio 2013: revisora de la revista española IBERICA \n \nEnero 2013: revisora de la revista internacional Semantic Web Journal, en su edición especial sobre Multilingual \nLinked Open Data \n \nAbril 2012: miembro del comité de programa de la segunda edición del workshop Linked Data in Linguistics 2013 \n(LDL 2013) \n \nOctubre 2012: miembro del comité de programa de la conferencia internacional COLING 2012  \n \nSeptiembre 2012: miembro del comité de programa de pósters y demostraciones de la conferencia internacional \nExtended Semantic Web Conference – ESWC 2013 \n \nAgosto 2012: miembro del comité de programa del 3er Workshop sobre Multilingual Semantic Web celebrado en el \nmarco de la conferencia ISWC 2012 \n \nJulio 2012: revisora de la revista International Journal on Artificial Intelligence Tools – IJAIT \n \nFebrero 2012: miembro del comité de programa de la conferencia internacional TKE 2012 – Terminology and \nKnowledge Engineering  \n \nFebrero 2012: miembro del comité de programa de pósters y demostraciones de la décimo octava conferencia \ninternacional Knowledge Engineering and Knowledge Management -EKAW 2012 \n \nJulio 2011: revisora de la revista International Journal of Web Semantics - JWS \n \nAgosto 2011: miembro del comité de programa de pósters y demostraciones de la conferencia internacional \nInternational Semantic Web Conference – ISWC 2011 \n \nAbril 2011: revisora de propuestas en el XXIX congresso de la Asociación Española de Lingüística Aplicada – \nAESLA 2011 \n",
  "speaker": "SYSTEM",
  "uuid": "d1eab982-96e3-42e6-ad6a-5326a8a9d263"
}