{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nModificaciones al proces de asociación de semántica a etiquetas. Adición de información semantica tomada de la dbpedia para etiquetas que se refieren a: 1) localizaciones geograficas, 2) tiempo, 3) nombres propios, 4) camaras o marcas de camaras.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Implementación de una cache para almacenar sinonimos, sugerencias y datos de la dbpedia. Con esto se logrará mejorar la eficiencia.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: RDF/RDFa\nPara poder escribir las anotaciones en tripletas acordes a los estándares se estima conveniente utilizar RDF/RDFa. Introducción a RDF/RDFa: estudio, ejemplificación básica y modificación de las estructuras actuales.\nTarea: Incorporación de jerarquías recursos 2\nSe continúa el trabajo sobre OWLIM.\nInterfaz Anotación Híbrida\n\n-- Se viene trabajando en el desarrollo de la web social para integrar el core de anotación. el Desarrollo es solo php jquery y webservices, con el framework YII.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el desarrollo de la funcionalidad de transferencia de ficheros mediante GridFTP.\n- Se ha continuado con el testeo del funcionamiento de las interfaces ya implementadas.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nDiseño del evaluador automático de conjuntos de mappings respecto a los conjuntos de referencia.\nEstudio de acoplamiento entre módulos IGNMapDiscover y OEGMappingDiscover.\nTarea 7.1\n\n- Preparación de paper para Workshop on Linked Spatiotemporal Data 2010\n- Finalización del paper para 1st Workshop on Service Web Engineering (SWEng)\n- Linked Data.\n· Difusión\n      · Actualización web\n- RDF.\n· Iniciación del pintado RDF en mapa\n      · Iniciación de generación de RDF para otros dominios",
  "speaker": "SYSTEM",
  "uuid": "d24a649c-2219-4b2e-9695-47bb1469f662"
}