{
  "message": "SYSTEM: DynaLearn_exercises2.pdf: Página 2\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n102 / 103 \nbetween the two containers (via the pipe by which they are connected). The flow \nchanges the amount of liquid in the containers. The container with the highest liquid \ncolumn (and thus, the highest pressure), will loose liquid, whereas the amount of liquid \nin the other container will increase. The changes in the amount will eventually change \nthe pressures at the bottoms of the two containers: they will become equal. That is, \nthere is no pressure difference and thus no flow. \n \nProceed as follows \n• Construct the model ingredients using paper + pencil. \n• Define the expected states of behaviour and transitions. This is to illustrate how \nyou think the simulator will simulate behaviour using your specifications. \n• Implement the model using the Garp3 software. Your model should at least \ninclude: \no A scenario with unequal liquid column heights. \no A static model fragment describing the behaviour of a 'contained liquid' \n(the features of a container containing liquid). \no A process model fragment describing a liquid flow process between two \n'contained liquids'. \no When simulating the model the unequal column heights should become \nequal in one of the successor states. Notice that the simplest model will \nonly produce two states of behaviour, but more complex state-graphs are \nalso possible. \nB.4: Heating & Boiling \nConstruct a model of a heater that heats a container containing water. Different options \nexist: \n• Open or closed container: The container can be open at the top allowing the \nwater to evaporate without seriously affecting the pressure of the container. Or \nthe container can be closed and heating causes the pressure inside the container \nto increase, which may lead to the container exploding. \n• Relative temperatures: The temperature of the heater may differ with respect to \nthe boiling point of the water. The temperature can be below, equal or higher \ncompared to this boiling point. \n• Kind of heat source: The heat source could be another object with a certain \ntemperature and a certain amount of heat that exchanges energy with the \ncontainer containing water. Alternatively, the heat source could be a kind ‘infinite’ \nresource (e.g. a furnace) that keeps on generating energy. \n \nSections 4.5 and 4.6 present both models with an open container. In Section 4.5 the \nheat source is considered an external and ‘endless’ source of energy with a \ntemperature higher than the boiling point of the water. In Section 4.6 the heat source is \nconsidered an object with a finite amount of energy, while the relative temperatures are \nunknown (that is: all options are taken into account during simulation). \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "d2cc3200-4f6d-42a4-93b7-2b1b8efe86a1"
}