{
  "message": "SYSTEM: Wiki: Formularios para el registro de software\nJunto con los formularios se debe entregar una memoria\nUna memoria que contenga\nUna breve descripción del programa de ordenador\nEl lenguaje de programación\nEl entorno operativo\nUn listado de los ficheros que contiene\nEl diagrama de flujo\nEn caso de ejemplares múltiples, el número de depósito legal .\nLa totalidad del código fuente y un ejecutable del programa (en un CD-ROM)\nRegistros\n\nTítulo\nIdentificador\nAutores (%)\nDescripción\necReport\nM-008803/2009\nocorcho (), bvillazon (), asun (), alopez (), asiles ()\n1. Descripción:\necReport es una aplicación Web para la generación y la monitorización de los informes de progreso de un proyecto europeo de investigación. \necReport tiene las siguientes funcionalidades:\n¿ Introducción de los informes de progreso. Estos informes cubren:\no Informe de progreso de los paquetes de trabajo.\no Informe de los gastos de esfuerzos en cada paquete para cada socio.\no Informe de los elementos de diseminación.\n¿ Monitorización de los informes de progreso.\n¿ Envío de mensajes a los socios del inicio del periodo de reporte y notificación de retrasos.\n¿ Generación de los informes en formato legible para MSWord.\n2. Lenguaje de programación:\nEl software está desarrollado íntegramente en lenguaje java, en concreto utilizando la versión 5.0 de la plataforma J2SE y la versión 5.0 de la plataforma J2EE.\n3. Entorno operativo:\nAl estar desarrollado en Java, podrá ejecutarse en cualquier sistema que cuente con la máquina virtual java en su versión 5.0 o posteriores, aunque solamente ha sido probado sobre los sistemas operativos Windows XP.\necReport v1 se ejecuta soportado por varios software:\n¿\tPlataforma de Desarrollo de Aplicaciones Web basadas en Ontologías. ecReport es una aplicación construida sobre la plataforma de desarrollo ODESeW v3 desarrollada dentro del mismo grupo de investigación, OEG de la Universidad Politécnica de Madrid. Se incluye en la distribución las librerías de esta plataforma.\n¿\tServidor Web. El servidor web en el que ecReport se puede ejecutar es sobre cualquiera que de soporte a la especificación Servlet 2.4 y JSP 2.1. Se ha utilizado el servidor web Resin 3.1.9. Se incluye en la distribución este servidor Web. La licencia se incluye en la sección 5.5.\n¿\tServicio de Mensajeria JMS 1.1. ecReport utiliza OpenJMS 0.7.6.1 como servicio de mensajería JMS 1.1. La licencia se incluye en la sección 5.20.\n\"GeoBuddies-Camino de Santiago\"\nM-000413/2009\nasun (), ocorcho (), vsaquicela ()\n1. Definición del sistema\nEl objetivo de este proyecto consiste en el desarrollo de una infraestructura tecnológica que permita a los peregrinos del Camino de Santiago la consulta de información a través de dispositivos móviles. Para ello se creará una comunidad virtual de usuarios del Camino de Santiago en la que sus miembros (a través de sus dispositivos móviles) introducirán y consultarán información relevante sobre diferentes aspectos del Camino de Santiago: manejarán información geográfica y podrán anotar semánticamente dicha información para almacenarla en la comunidad virtual, de modo que sus miembros puedan hacer uso de dicha información. Además de la comunidad virtual se desarrollará una Arquitectura Orientada a Servicios que permitirá a los usuarios acceder a toda la información disponible en cualquier momento y en cualquier lugar.\n2. Descripción de las funcionalidades del sistema.\nGeoBuddies agrupa el siguiente grupo funcionalidades:\nl. Búsqueda de recursos. Entendemos por recursos los descritos en el apartado de Especificación de requisitos. Los usuarios buscan activamente recursos anotados geográficamente.\n2. Recomendación de recursos. El sistema genera recomendaciones para los usuarios, en base a su perfil y a las contribuciones que haya hecho este al sistema.\n3. Introducción de recursos. Todo usuario puede crear recursos con los que contribuye a enriquecer el sistema, agregando nuevos datos.\n4. Anotación de recursos. Los usuarios valoran, comentan y anotan (con tags) los recursos del sistema contribuyendo también a enriquecer el sistema, esta vez desde un punto de vista semántico.\n5. Gestión de usuarios. Los usuarios pueden identificarse para acceder a los servicios de la plataforma. El sistema de gestión de usuarios permite elaborar para estos un tratamiento individualizado.\n6. Navegación y posicionamiento geográfico. El software cliente representa mapas a través de los cuales los usuarios pueden navegar y ver representados todo su historial de recursos (buscados, creados y recomendados). El sistema les ofrece mecanismos para posicionarse en el mapa (posicionamiento por GPS, GPS asistido, triangulación de señal portadora y localización por topónimo). \n¿\tGZipFilter: servicio de compresión de datos.\n¿\tGBMapas: servicio de acceso a mapas.\n¿\tGBUpload: servicio de subida de información.\nIBSE\nM-004546/2009\nasun (), rgarcia ()\nEl programa IBSE (Interoperability Benchmark Suite Executor) es una infraestructura de evaluación que ejecuta automáticamente experimentos de interoperabilidad entre tecnologías semánticas utilizando RDF(S) y OWL como lenguajes de intercambio. La herramienta permite, de una forma simple, tanto ejecutar los experimentos como incluir nuevas herramientas en la infraestructura.\nAdemás, IBSE incluye dos conjuntos de pruebas para evaluar la interoperabilidad de las tecnologías semánticas. La RDF(S) Import Benchmark Suite, que sirve para evaluar la interoperabilidad utilizando RDF(S) como lenguaje de intercambio, y la OWL Lite Import Benchmark Suite, que sirve para evaluar la interoperabilidad utilizando OWL como lenguaje de intercambio.\nPor cada una de las ontologías incluidas en los conjuntos de pruebas, la ontología es importada por la herramienta origen, es exportada al lenguaje de intercambio, es importada a su vez por la herramienta destino, y es exportada de nuevo. Los resultados de los experimentos se obtienen mediante la comparación de las ontologías resultantes en cada paso.\nLenguaje de programación:\nEl software está desarrollado íntegramente en lenguaje java, en concreto utilizando la versión 5.0 de la plataforma J2SE.\nEntorno operativo:\nAl estar desarrollado en java, podrá ejecutarse en cualquier sistema que cuente con la máquina virtual java en su versión 5.0 o posteriores, aunque solamente ha sido probado sobre los sistemas operativos Windows XP y Mac OSX. IBSE utiliza la librería de manejo de ontologías Jena (versión 2.3) y los programas Pellet (versión 1.5.2), KAON2 OWL Tools (0.27) y rdf-utils (0.23b) como soporte a la comparación de las ontologías.\nODESeW v 3.0\nM-001192/2009\nasun (), alopez (), ocorcho ()\n1. Descripción\nODESeW es una plataforma de desarrollo para aplicaciones Web basada en ontologías. Esta plataforma ofrece las siguientes funcionalidades para el desarrollo de aplicaciones Web:\n¿\tGestión de ontologías utilizadas en la aplicación Web.\n¿\tGestión de usuarios y perfiles de usuario.\n¿\tControl de acceso de lectura y escritura a las instancias y conceptos de la ontología.\n¿\tServicios de exportación de las instancias en RDF.\n¿\tServicios de búsqueda de instancias.\n¿\tGestión de grafos de navegación y composición de vistas.\n¿\tUna biblioteca de etiquetas JSP [JSP2.1] [JSP2.1][JSP2.l]para facilitar al desarrollador Web unas primitivas de acceso a la información basada en ontologías para generar visualizaciones y formularios.\n2. Lenguaje de programación:\nEl software está desarrollado íntegramente en lenguaje java, en concreto utilizando la versión 5.0 de la plataforma J2SE.\nOntología de currículos y ofertas de empleo\nM-000404/2009\nasun (), bvillazon (), jramirez ()\nLa Ontologia de currículos y ofertas de empleo que se presenta en este documento actúa como un lenguaje común en forma de vocabulario controlado para modelar el dominio de las ofertas de empleo y los currículos de demandantes de empleo. Gracias al vocabulario que incluye, esta ontologia permite definir instancias que representen currículos y ofertas de empleo con información relativa a datos personales, objetivos profesionales, historial académico, experiencia profesional, competencias y habilidades, etc.\nEsta ontología está expresada en el lenguaje de definición de ontologías WSML'.\nEsta ontología ha sido desarrollada utilizando el proceso de desarrollo de METHONTOLOGY y con las herramientas de ingeniería ontológica WebODE y WSMT. La ontología está compuesta por 13 ontologías modulares:\n¿\tCompetente Ontology (almacenada en el fichero Competence0ntology.wsml). Esta ontología define el concepto Competence como super-concepto de los conceptos importados: Skill, Language Proficiency y Driving License. \n¿\tCompensation Ontology (almacenada en el fichero Compensation0ntology.wsml). Esta ontología está basada en el estándar ISO 4217. \n¿\tDriving License Ontology (almacenada en el fichero DrivingLicenseOntology.wsml). Esta ontología está basada en los niveles reconocidos por la Legislación Europea. \n¿\tEconomic Activity Ontology (almacenada en el fichero EconomicActivity0ntology.wsml). Esta ontología está basada en el estándar NACE Rev. 1.1. \n¿\tEducation Ontology (almacenada en el fichero Education0ntology.wsml). Los campos de educación están basados en el estándar FOET y los niveles de educación está basados en el estándar ISCED97. \n¿\tGeography Ontology (almacenada en el fichero Geography0ntology.wsml). Esta ontologia está basada en el estándar ISO 3 166.\n¿\tJob Offer Ontology (almacenada en el fichero JobOfferOntology.wsm1). Esta ontología ha sido desarrollada tomando como punto de partida las recomendaciones de HR-XML. \n¿\tJob Seeker Ontology (almacenada en el fichero JobSeekerOntology.wsml). Esta ontología ha sido desarrollada tomando como punto de partida las recomendaciones de HR-XML.\n¿\tLabour Regulatory Ontology (almacenada en el fichero LabourRegulatory0ntology.wsml). Esta ontología está basada en las clasificaciones de LE FOREM para tipos de contrato.\n¿\tLanguage Ontology (almacenada en el fichero LanguageOntology.wsm1). Está ontología está basada en el estándar ISO 6392 y en el Common European Framework of Reference (CEF).\n¿\tOccupation Ontology (almacenada en el fichero OccupationOntology.wsml). Está ontología está basada en el estándar ISCO-88 (COM) de clasificación de ocupaciones.\n¿\tSkill Ontology (almacenada en el fichero Skill0ntology.wsml). Esta ontología modela el dominio de las habilidades (skills).\n¿\tTime Ontology (almacenada en el fichero TimeOntology.wsml). Esta ontología está basada en la DAML ontología de tiempo.\nEsta ontología va un paso más allá que los esquemas XML propuestos por el consorcio HR-XML' para representar currículos y ofertas de trabajo. Los esquemas XML mencionados sólo proporcionan una especificación sintáctica de los datos relativos a currículos y ofertas de empleo. En cambio, esta ontología no sólo proporciona una especificación sintáctica, sino también semántica para los distintos campos de información utilizados en los currículos y las ofertas de empleo. Esto significa que esta ontología no sólo especifica que, por ejemplo, un currículo debe incluir información sobre los datos personales, historial académico, experiencia profesional, etc. (al igual que un esquema XML), sino que también proporciona conjuntos de términos organizados en taxonomías para rellenar los apartados de un currículo. Por ejemplo, esta ontología incluye una taxonomía de todas las áreas de conocimiento que pueden cubrir las titulaciones académicas.\nDocenDIA\nM-2801/2011\nocorcho (), asun (), asiles (), ajimenez (), rriera (), amontes ()\nAplicación web para la gestión de los másteres enmarcados en la UPM.\nGeo-DSI\nM-20692011, M-20732011\ngramos (), mperez ()\nSolución para la optimización de la transferencia de contenido multilmedia para dispositivos móviles haciendo uso de la tecnología GRID y de los sistemas de codificación de imágenes, audio y video más populares.\ngOntt\nM-006071/2011\nasun (), mcsuarez (), omunoz (), mvigo ()\n\"gOntt es un plug-in para el entorno de desarrollo de ontologías llamado NeOn Toolkit. Permite identificar, mostrar, interactuar y planificar los distintos procesos y actividades que forman parte del desarrollo de una ontología; mostrando la planificación mediante diagramas Gantt. Como meta-tool para el NeOn Toolkit, gOntt proporciona guías metodológicas para cada proceso y actividad planificada, información sobre los NeOn plug-ins que se pueden utilizar en cada proceso y actividad, y además facilita el uso de dichos plug-ins.\ngOntt permite planificar ciclos de vida para el desarrollo de ontologías e integra los plugins necesarios para la realización de las tareas de las actividades y procesos pudiendo utilizar estos directamente desde el gOntt.\"\nGeometry2RDF\nM-002491/2012\nvsaquicela (), lmvilches (), magarcia (), ocorcho (), bvillazon (), asun (), aleon ()\nGeometry2RDF permite generar información en formato (Resource Descriptión Framework) a partir de información geométrica almacenada en bases de datos geoespaciales\nMap4RDF\nM-002493/2012\nvsaquicela (), lmvilches (), magarcia (), ocorcho (), bvillazon (), asun (), aleon ()\nMap4RDF es una herramienta para explorar y visualizar conjuntos de datos RDF enriquecidos con información geométrica en el contexto de la Web de los Datos.\nMARiMba\nM-002489/2012\nasun (), dvila (), bvillazon ()\nMARiMba es una herramienta orientada a bibliotecas para transformar sus registros en formato MARC (MAchine-ReadableCataloging) a RDF, siguiendo las mejores prácticas de Linked Data.\nNOR2O\nM-001914/2012\nasun (), bvillazon ()\nEs una librería para transformar recursos no-ontológicos en ontologías.\nOOPS! - Ontology Pitfall Scanner\nM-009445/2012\nasun (), mpoveda (), mcsuarez ()\nHerramienta orientada al a validación de ontologías. En concreto OOPS! permite analizar ontologías para detectar algunos de los errores que se suelen dar durante el desarrollo de ontologías. En este sentido OOPS! realiza un diagnóstico de la ontología de manera independiente al dominio o los requisitos modelados en la misma. A partir de dicho diagnóstico OOPS! genera una serie de notificaciones indicando en qué elementos se podrían estar cometiendo errores.\nHerramientas para la visualización 3D de entornos laborables simulados\n00/2013/1156\njbajo\nPrograma de ordenador\nInterfaces móviles para la monitorización a través de servicios Web\n00/2013/1154\njbajo\nPrograma de ordenador\nMonitorización de una flota de vehículos comerciales y generación de rutas de reparto\n00/2013/1158\njbajo\nPrograma de ordenador\nPlataforma multiagente para la recuperación y catalogación de recursos educativos\n00/2013/1155\njbajo\nPrograma de ordenador\nPlataforma para la simulación y visualización de Agentes Inteligentes (MISIA)\n00/2013/1157\njbajo\nPrograma de ordenador\nTecnologia Grid aplicada a la genómica comparada\n00/2013/1153\njbajo\nPrograma de ordenador\nPendiente de registrar\n\nLDP4j (Apache 2)",
  "speaker": "SYSTEM",
  "uuid": "d33709e8-0c02-4bc7-a5f6-4b550ca03858"
}