{
  "message": "SYSTEM: Wiki: Este es un ejemplo bueno...\nhttp://externalidades.net/2012/04/en-ducksboard-buscamos-un-frontender-js/\nEn Ducksboard buscamos un ingeniero para liderar el frontend de nuestra aplicación. Actualmente, todo el equipo técnico tiene principalmente experiencia en backend, y se empieza notar el bottleneck en el desarrollo del frontend. Y debido a que la mayor parte de nuestro código de frontend es JS, nos gustaría ampliar el equipo con alguien que tenga interesantes experiencias que contar (o cicatrices que mostrar) luchando contra JS.\nLa oferta es para BCN… pero si no vives por allí (o mudarte te supone un problema), no nos importa que teletrabajes si ya lo has hecho anteriormente.\nSobre Ducksboard\nEn Ducksboard desarrollamos dashboards que permiten a las empresas ir monitorizando el estado de su actividad. Y los ofrecemos -asaService.\nAcabamos de cumplir un año de existencia y llevamos ya 2 meses facturando. Quien se incorpore sería el séptimo empleado (tras 4 devs y 2 biz). Además, acabamos de cerrar una ronda de financiación con los principales fondos seed españoles.\nRequisitos:\nDominio de HTML/CSS/JS (buscamos a alguien con experiencia)\nApproach serio al desarrollo de aplicaciones en JS [modularidad & tests] (JS es para nosotros un núcleo importante de nuestro código y como tal hemos de tratarlo)\nExperiencia con SVGs o voluntad para aprender el mismo (hemos desarrollado nuestra propia librería gráfica para mantener un diseño cuidado)\nBuen nivel de inglés (trabajamos en inglés internamente, y nos gustaría que pudieses viajar para mostrar el producto si es necesario)\nCapacidad comunicativa (tendrás equipo trabajando en remoto y les encanta entender y discutir todo)\nMostrar código o proyectos que demuestren lo anterior\nOfrecemos:\n37k brutos anuales\nPlan de stocks\nSeguro médico\nProductive computer gear (portátil + monitor + periféricos)\nLibertad para escoger horarios y trabajar desde donde decidas\nCultura:\nNuestra principal metodología de desarrollo es (principalmente) Hack&Ship.\nTrabajamos para poder sentirnos orgullosos del resultado. Siempre.\nNo tenemos secretos ni jerarquía. Pide cualquier dato y opina si hay algo que no ves claro.\nCada vez deciden más los números que nosotros. Y no nos va mal así :)\nEstá bien visto internamente trabajar desde Ibiza. Está mejor visto que nos lleves contigo.\nSi nunca has jugado al FIFA12, tendrás que practicar en tus ratos libres para integrarte. Y serás más respetado si juegas con defensa táctica :D\nTenemos una única norma de vestuario: ven vestido\nY tenemos una única norma para las vacaciones: tomátelas\n… sobre todo, queremos que todos los días colabores creando la empresa en la que siempre has soñado trabajar.\nSi tienes la experiencia que necesitamos, te interesa la oferta y crees que encajarías con nosotros, puedes contactarnos en jobs_at_ducksboard.com",
  "speaker": "SYSTEM",
  "uuid": "d352993d-acc1-40b1-a26c-fb564ac13d8e"
}