{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ProgresoEspa%C3%B1aVirtual \n\nTareas 7.2\n\nTarea 1 (DEIMOS). Mecanismo de extracción semántica a partir de anotaciones\n• Realizar una revisión del estado del arte en la evolución de ontologias a partir de información de las folksonomias.\n• Desarrollar una versión inicial de un enfoque que permita realizar tareas tales como ontology population (creación de instancias), ontology learning (adición de nuevas clases a la ontología) y ontology update (Modificaciones a la ontología incluyendo borrar o mover clases) a partir de la información de las folksonomias, reutilizando el trabajo realizado en la desambiguación de los significados de las etiquetas.\n• Incluir en este procedimiento el manejo de versiones de la ontología para poder identificar los cambios realizados en la ontología por cada cambio realizado.\n• Incluir en este procedimiento la posibilidad de manejar más de un idioma (Multilingualidad).\n• Analizar la posibilidad de enriquecer la folksonomia a partir de la información semántica de las ontologías.\nTarea 2 (CNIG). Procesado de fuentes de información no semántica ya existentes\n• Desarrollo y depuración constante del registro e invocación de fuentes.\no Revisión constante de los métodos que permiten registrar e invocar fuentes como: REST, WSDL, RSS, KML, geoRSS.\no Analizar la posibilidad de permitir el registro de fuentes semánticas que soporten consultas SPARQL.\n• Recolección de fuentes de datos del dominio geográfico.\no Para realización de pruebas acerca del registro e invocación de fuentes.\n• Mejorar la descripción de las fuentes de datos.\no Describir semánticamente los parámetros de entrada/salida de las fuentes.\no Utilizar una ontología de dominio en el registro de una fuente para especificar los tipos semántico de datos de las entradas y salidas.\no Creación de una interfaz para que el usuario registre ejemplos del tipo semántico,\no Estudio de la extracción de relaciones de la ontología de dominio.\no Estudio de la estructuración de los tipos semánticos en una jerarquía para su utilización en un algoritmo de inducción\n• Análisis de las diferentes propuestas de aprendizaje de definiciones semánticas de fuentes de datos.\no Revisión del estado de la cuestión de Inductive Logic Programming (ILP) (FOIL)\n• Adaptación de los algoritmos existentes como FOIL a la plataforma.\no Revisión del software de inducción ILP.\no Adaptación del algoritmo seleccionado a la plataforma.\no Realización de pruebas de inducción de una nueva fuente.\n• Estudio de posibles mejoras al algoritmo seleccionado de inducción.\n• Despliegue de servicios web que permita a los usuarios utilizar los algoritmos implementados.\n• Evaluación\nTarea 3 (DEIMOS). Modelo de anotación híbrido\n.\n• Continuación del desarrollo de la interfaz.\n• Continuación del estudio de herramientas que permiten anotaciones (por ejemplo, GATE).\n• Análisis y desarrollo de patrones lingüísticos aplicables a textos en inglés y español.\n• Utilización de ontologías para realizar anotaciones.\no Uso de ontologías existentes\no Desarrollo de ontologías conforme a los dominios del proyecto\n• Utilización de etiquetas para la anotación\n• Conexión de los resultados parciales de las anotaciones (solución al uso de varias anotaciones conjuntas)\n• Enriquecimiento de recursos (anotaciones) con información adicional (Linked Data)\nTarea 2.3 (DEIMOS)\n\nMaría Pérez tiene que completar el plan de trabajo\n• Implementación del primer prototipo del metaplanificador semántico.\no Implementación del adaptador semántico.\no Implementación del módulo del metaplanificador.\n• Análisis y diseño del segundo prototipo del metaplanificador semántico con mejoras sobre el uso de la metainformacion.\nTareas 1.4 y 4.1 (CNIG)\n\n• Mejora del descubrimiento de mappings: Evaluación técnicas existentes.\no Evaluación de las técnicas existentes mapeando PhenomenOntology con los WFS.\no Evaluación de las técnicas de mappings I: P/R de mappings entre HPhenom3.5 y fuentes IGN (NC y NGN).\no Evaluación de las técnicas de mappings II: P/R de mappings entre hydrOntology y fuentes IGN.\n• Mejora del descubrimiento de mappings: Propuestas de mejora.\no Técnica 10 (de evaluación con WFS).\no Mejoras en técnicas existentes (de evaluación con fuentes IGN).\no Técnicas de descubrimiento multilingüe.\n• Aumento del sistema integrado.\no Mapeo de PhenomenOntology con otras fuentes (WFS y catálogos de fenómenos de Comunidades Autónomas).\n• Explotación de los mappings.\no Resolución de consultas mediante información contenida en los mappings.\no Composición de resultados de consultas según relaciones de los mappings.\nTarea 7.1 (CNIG)\n\n• Continuación del establecimiento de correspondencias (mappings) entre ontología y diferentes bases de datos que componen el proceso de integración.\n• Depuración del RDF resultante del establecimiento de mappings\n• Detección de instancias duplicadas\no Análisis de los problemas de los conjuntos de datos en RDF.\no Abstracción de los diversos problemas (bases de datos y RDF) con el objetivo de establecer diferentes enfoques heurísticos para la detección de instancias (topónimos) duplicadas en las fuentes de información estudiadas.\no Formalización e implementación de los diversos enfoques heurísticos.\n• Evaluación de resultados\n• Publicación de Linked Data de calidad (con resultados de tareas anteriores)\no Estudio de las características requeridas para la publicación de Linked Data.\no Estudio de fuentes de información relacionadas con el dominio geoespacial.\no Publicación y conexión al cloud de Linked Data\nInterfaz Anotador Híbrido\n\nPlan de trabajo\nLecciones aprendidas\n\nGATE\nInterfaz\n, enlace a la versión 1.0 de la interfaz Web\nhttp://regulo.dia.fi.upm.es/anotador\nDescripción y pruebas de Meaningtool:\nhttp://www.meaningtool.com/\n[\n[1]\n]\nA partir del paper Automatic Web Page Annotation with Google Rich Snippets: [\n[2]\n]\n- Anotador:\nhttp://annotator.lfms.nl/\n- Rich Snippets Testing Tool Beta:\nhttp://www.google.com/webmasters/tools/richsnippets?url=&view=\nRecursos\n\n- Este es el link del video juego que reconoce voz, imágenes, etc.\nhttp://www.youtube.com/watch?v=CvjEJkZi8bw\n- Inspiraciones para la ampliación en Linked Data y referencias.\nGenerate RDFa with Epiphany\nCurrently, the underlying Linked Data model is a subset of DBpedia covering German politics.\nEpiphany runs at:\nhttp://projects.dfki.uni-kl.de/epiphany/\nOn the top right you'll find an example.\nUnder\nhttp://projects.dfki.uni-kl.de/epiphany/form\n, you can write your own text and receive RDFa content.\n- Realidad aumentada (5 mejores aplicaciones)\nhttp://alt1040.com/2010/01/las-5-mejores-aplicaciones-de-realidad-aumentada-para-celulares\n- Herramienta para generar tag clouds, hacer text mining y otros\nhttp://seasr.org/documentation/text-mining-overview/\n- The Natural Language Software Registry -\nhttp://registry.dfki.de/\n(Tienen registradas 292 herramientas para NLP).\n- tOKo -\nhttp://www.toko-sigmund.org/about.html\n-\nhttp://www.semanticsoftware.info/tools-and-resources\n- MuNPEx -\nhttp://www.semanticsoftware.info/munpex\nInformes enviados a Deimos y CNIG/IGN",
  "speaker": "SYSTEM",
  "uuid": "d3b5c3af-b3aa-44a1-8cce-175a546c1af8"
}