{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 79\n77\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n• Accessible across broad range of devices and operating systems, including mobile\n• Generally improved user interface and usability compared to enterprise client/server software\nWhile there are a few situations where customer premise software makes sense, these use cases are gener‐\nally limited to corporations and government agencies that have stringent security and data protection\nrequirements (e.g. intelligence agencies), although in most situations, the case can be made that a cloud\nbased solution can be every bit as secure as on site software. Therefore, we expect this migration away from\nclient/server software (thick client) solutions to continue, and expect most new products to be designed\naround cloud computing.\nCrowdsourcing\nCrowd‐sourcing has been a by‐product of web 2.0. Crowd translation is becoming an increasingly important\nmode of translation, and has been widely used by popular web services to localize all or part of their offer‐\ning. While pure crowd translation is relatively rare, most web companies that are expanding internationally\nare using crowd translation to some extent, typically by recruiting their users to contribute to their transla‐\ntion and localisation efforts.\nThe ideal solution combines crowd and professional translation in a way that enables large scale user partic‐\nipation while using professional translators in the background to score and vet new users (to prevent bad\nactors and incompetent translators from getting into the labour pool). This approach enables large scale, low\ncost translation while guaranteeing quality levels.\nTranslation management systems are beginning to incorporate support for crowd translation, so that crowd\ntranslators can work alongside professional translators, albeit with different access rights on the system.\nTransifex, a localisation management system, is a good example of this, as they allow any combination of\nmachine, crowd/user and professional translation. We expect that support for crowd translation, and tools\nto manage crowd translators; will become a standard feature in translation and localisation management\nsystems. Lingotek is one on the most established providers in this space.\nBig Data\nTools to manage and query large data sets, such as map/reduce, enable developers to build applications that\nwould have been prohibitively expensive to create otherwise. Statistical machine translation is one example,\nas these translation engines require millions to billions of aligned texts for training purposes.\nMobile\nWith most people shifting to laptop, tablet and mobile devices, translation technology vendors have to\ndevelop a mobile strategy to remain competitive. Translation management systems, for example, should\nenable translators to work on projects from tablets and smartphones. Small form factor devices, of course,\nhave limited real estate, so this is not a trivial problem. The companies that develop an intuitive mobile inter‐\nface will have a distinct advantage in the marketplace compared to platforms that only work with conven‐\ntional computers. This is particularly true for systems that enable crowd translation, since crowd translation\noften involves large numbers of people doing individually small amounts of work (a perfect use case for casu‐\nal translation via a mobile device).\nMobile also represents an opportunity for language service providers. Localisation to multiple languages is\nbecoming a de facto requirement for mobile app and service developers. Companies that provide simple,\nhigh quality localisation solution for popular mobile environments and frameworks will put themselves in a\nposition to capture other translation business as these companies expand internationally. \n",
  "speaker": "SYSTEM",
  "uuid": "d3dd8d5b-2a51-4cec-9599-99ceaccfaf91"
}