{
  "message": "SYSTEM: FormularioCPM_asun2.pdf: Página 6\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n1.6. Coste estimado del desarrollo de su solución propuesta\n€\n1.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n1.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n1.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n1.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 1.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­6­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n#\n#\n24\n139.992,00\nLa propuesta aquí descrita permite la creación de un ciclo virtuoso de identificación de \ntextos, preanotación y extracción de terminología que recuperará la información \nespecializada de los distintos dominios a los que el Plan se dirige, y en distintas lenguas, \nsu representación de acuerdo con los estándares más reconocidos de la web semántica, \npara hacer posible una posterior explotación por las aplicaciones de tecnología del \nlenguaje que requieran de una cobertura especializada.  \n \nEl hecho de contar con una terminología de dominio curada y representada siguiendo \nmodelos semánticos estándar supondrá además una mejora evidente de la comunicación \nentre los distintos actores de la administración pública involucrados en un dominio de \nconocimiento o área de actividad concretos.  \n \nOtro beneficio evidente de las tecnologías semánticas es el aumento en la capacidad de \nrecuperación de la información, para su posterior gestión, análisis y uso en la toma de \ndecisiones, así como la integración y compartición con la información que manejen otros \nactores de la administración pública, en entornos distribuidos (geográficamente).  \n \nSi tenemos en cuenta el hecho de que en España tres lenguas comparten cooficialidad \ncon el castellano en sus correspondientes comunidades autónomas, unas terminologías \nmultilingües que permitan la identificación de equivalentes en documentos producidos en \ndistintas lenguas agilizarán en gran manera la recuperación de la información relevante y \npertinente sin que la lengua suponga ningún obstáculo. De la misma forma, al poder \nestablecer enlaces con otros recursos, se facilita la recuperación de datos de fuentes \ndiversas y de distinta naturaleza, con las que sea necesario establecer una relación en un \ndeterminado momento.  \n \nEl poder recuperar y compartir de forma eficiente la información con la garantía de que \nesa información es fiable, permitirá a la administración pública llevar a cabo análisis y \nestudios precisos, obtener conclusiones, y poder tomar medidas de previsión o de \nactuación en menor tiempo ahorrando costes y con mayores garantías de éxito\nMuchas aplicaciones de procesamiento de lenguaje natural como la extracción automática \nde términos, el reconocimiento de entidades nombradas (nombres de personas, \norganizaciones, lugares,...), la desambiguación de términos, el cálculo de la similitud \nsemántica entre documentos, la clasificación de textos, etc., requieren del uso de \nterminologías específicas del dominio de interés. En ese sentido una solución tecnológica \ncomo la propuesta en este documento resolvería el problema de la transferencia del \nconocimiento especializado generado por la administración pública, o por organismos \ndependientes, poniendo a disposición de la industria de la tecnologías del lenguaje una \ncolección de terminologías y ontologías multilingües de dominio capaces de cubrir esas \nnecesidades en una gran medida, así como un ecosistema para el desarrollo colaborativo \ny validación de dichas terminologías y ontologías.  \n \nDicho  ecosistema colaborativo estará formado por expertos de dominio de diferentes \náreas, administraciones públicas, empresas y organismos en España, con el fin de \ngarantizar su alto grado de reusabilidad y adopción. Su naturaleza abierta permitirá que \ndichas ontologías se autoabastezcan y enriquezcan reduciendo los problemas de \nescalabilidad derivados del trabajo manual paulatina e iterativamente, a medida que su \nuso se vaya extendiendo por parte de los diferentes actores de la comunidad en \ndiferentes proyectos de tecnologías del lenguaje.  \nLos beneficios de esta propuesta apuntados en las secciones anteriores, tanto en lo \nrelativo al servicio público con su impacto en las tecnologías del lenguaje, se propagarán \ncon el tiempo a un ámbito más amplio. Dado que las terminologías extraídas servirán de \npilar a muchos proyectos de innovación basados en tecnologías del lenguaje, la solución \npropuesta tendrá un impacto crítico en áreas como salud, justicia, turismo, educación, \nvigilancia tecnológica, etc.  Tanto las técnicas como las metodologías en las que se apoya \nesta propuesta son fácilmente adaptables a una gran diversidad de dominios y entornos \nlingüísticos.  \n \nLos estándares seguidos tanto en la respresentación del meta-modelo como de los \n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "d49fa327-f4bb-4786-a4d3-7e805252b4e5"
}