{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Plenary_Meeting_-_Indra_17_Febrero_2009 \n\nEntregable E1.1 Análisis de la Innovacion.\nSe dijo q hay que recalcar la forma de estandarización, formatos.\nDespués de describir los proyectos y herramientas, añadir una sección de conclusiones, donde se identifiquen los \"lacks\" actuales en el área. Estos \"lacks\" se corresponden con los objetivos del componente que se propone.\nRequerimientos del Sistema\nSeccion 2. Cada partner incluye una breve descripción de los componentes en los que va a trabajar. Incluir alcances y limitaciones.\nDeadline: Siguiente Miércoles 24 de Febrero\nACTION POINT: César, Daniel, Alexander incluyen esta información en el doc.\nSe enviará un fichero excel con los requisitos identificados hasta ahora.\nCada partner debe identificar que requisitos se corresponden con los componentes q se van a desarrollar.\nEl fichero excel lo tienen que enviar hasta hoy viernes.\nDeadline: Siguiente Miércoles 24 de Febrero\nACTION POINT: César, Daniel, Alexander rellenan el excel.\nDefinición del idioma.\nSe discutió al respecto, PRISA.com insistió que el idioma tiene que ser el español.\nDe todas maneras, no se llegó a un acuerdo final.\nDefinición del \"movil flavour\" a trabajar.\nMucha discusión, al final PRISA.com informará que móvil se usará para los casos de uso y los de Exente desarrollarán un cliente (inicilamente Web) para esa plataforma.\nÓscar sugirió crear una página donde se pongan explícitamente las cosas que NO se van a realizar en el proyecto.\nDeadline: no especificado\nACTION POINT: César, Daniel, Alexander decir qué cosas consideran que no harán sus componentes.\nPROVENANCE\nAntonio (INDRA) sugirió incluir a los usuarios como \"fuente\" para el provenance.\nDESAMBIGUADOR DE ETIQUETAS\niSOCO muestra interés en trabajar conjuntamente para definir el \"contexto\" de las etiquetas que anotan los recursos.\nIDEA: Contexto histórico (reducción de la importancia que va teniendo el contexto según van cambiando las cosas en el tiempo) --> ej: alguien cambia de empresa y todos los metadatos de la anterior empiezan a tener menos importancia\nINTEGRADOR SEMÁNTICO\nNo hubo comentario relevante\nReunión PT3 - PRISA.COM\n\nPendiente de que Boris pase sus minutas.",
  "speaker": "SYSTEM",
  "uuid": "d5470da1-6c94-4b48-8e70-4b1e965862f9"
}