{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 3\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \nque el viaje implique la presentación de un artículo será obligatorio entregar el mismo junto con la \nhoja previaje, o bien remitirlo por correo electrónico en formato digital. Existe orden de no pagar los \nviajes, en tanto no tenga lugar la presentación del artículo correspondiente. \n \nA2. Desplazamientos al aeropuerto  \nSe utilizará la forma más económica de transporte al aeropuerto. Esto implica que, en caso de disponer de \nvehículo particular, el desplazamiento al aeropuerto únicamente se realizará en taxi cuando resulte más \neconómico que haciéndolo en el propio vehículo, es decir, cuando la tarifa del desplazamiento en taxi de ida y \nvuelta al aeropuerto sea inferior, que el precio del kilometraje con el vehículo particular más la tarifa del \nparking en Barajas. Para tomar la decisión seguiremos los siguientes pasos:  \n \n1. \nPrevisión \ncoste \ntaxi: \npinchando \nen \nel \nsiguiente \nenlace \n[http://www.taxicity.net/index.php/component/option,com_estimate/Itemid,108/lang,es/] \npodéis \ndeterminar aproximadamente el precio del taxi desde cualquier punto de origen, hasta el aeropuerto de \nBarajas. Para obtener la tarifa total, simplemente la multiplicamos por dos. Al hacer  el cálculo en el \nenlace nos mostrará la distancia en kilómetros del desplazamiento. Lo apuntamos.  \n \n2. Previsión coste parking barajas: las tarifas del parking del aeropuerto de barajas son las siguientes: \nDuración  \nPrecio parking larga estancia  Precio parking normal \n1 día \n \n \n10,60€  \n \n \n18€ \n2 días \n \n \n21,20€  \n \n \n36€ \n3 días \n \n \n30,80€  \n \n \n54€ \n4 días \n \n \n40,40€  \n \n \n72€ \n5 días \n \n \n50€ \n \n \n \n86,4€ \n6 días \n \n \n55,60€  \n \n \n100,8€ \n7 días \n \n \n61,20€  \n \n \n115,2€ \n8 días \n \n \n66,80€  \n \n \n129,6€ \n9 días \n \n \n72,40€  \n \n \n144€ \n10 días  \n \n78€ \n \n \n \n158,4€ \n \n",
  "speaker": "SYSTEM",
  "uuid": "d54f8ba5-e964-4af8-ab4e-bd48f6873546"
}