{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 26\n24\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nChallenges in the European market\nTechnological Barriers\nLT is a highly complex technological domain that represents the intersection of several disciplines, including\nthe many sub‐domains of linguistics, mathematics, and information science. LT functionality remains (and\nmay always remain) a work in progress, with few genuine technological breakthroughs. The most significant,\nfor current technology, was the combination of NLP and computational linguistics with statistical modelling,\nwhich began more than thirty years ago, and is now a feature of many LT implementations including both\nspeech and text.\nMost improvements using today’s technologies are incremental and rely particularly on the ability to access\nand maintain ever larger and more finely tuned linguistic data. Lack of access to that data will constrain the\ntechnological development of LT. Acquiring and using it may rely on cooperation between the LT industry\nand the different constituencies that own, need and use it. Collaboration between the industry and data\nowners will be needed. Also regulation of the use of such data should be made much more open, and core\ndata (such as terms, concepts, ontologies) should be standardised and shared in an open environment\nCopyright Issues\nThis news item was published on 15 November 2012 by the Dutch newspaper de Volkskrant:\nThe French president François Hollande demanded that the Dutch return all the borrowed words\nfrom the French language as of the year 2015. The Dutch people will then no longer be allowed to\nuse many words – such as ‘dossier’, ‘portefeuille’, ‘ordinair’ – that have become commonly used\nwords in the Dutch language. \nIt was, of course, published as a parody ‐ who would seriously think that anyone can claim ownership over\nthe individual words that people use. But the intellectual property rights regarding terminology and transla‐\ntions imply that publishers, authors and translators can own words. Moreover, people in the language indus‐\ntry encounter daily conflicts between the principles of intellectual property law, corporate policies, business\npractices, and the pragmatic use of data, particularly (but not exclusively) in translation systems.\nThe principles of today’s Intellectual Property (IP) legislation all stem from a last‐century definition of trans‐\nlation whereby translation memories (stored pairs of previously translated sentences) were merely intend‐\ned as a personal aid to translators and were protected by the same rules that apply to complete texts. Now\nfocus has shifted from translation memories to massive amounts of translation data in the cloud, in the form\nof parallel text corpora (see the discussion of Translation Technology trends above). These translation data\nmay be accumulated from translation memories, or from online translation service platforms or harvested\n(‘crawled’ and aligned) from localized versions of web sites and other sources. In addition, these data are\noften usefully annotated with attributes for domain, content type and source.  In this way translation data\nare becoming the key to quantum leaps forward in translation efficiency. (Google has demonstrated this in\nthe past five years by training new machine translation engines for 100,000 different language pairs using\nnothing but translation data.) But who owns data collected and created in this way?\nIn North America this use of accumulated translation data may be allowed under the exception of fair use\nand fair dealing; Europe tends to interpret copyright law on a much stricter basis. Yet the translation inno‐\nvators are ubiquitous, and they range from very large global IT companies in the US to small start‐ups in any\npart of the world. This creates at least the impression of unfair competition both inside and outside the\ntranslation industry. \nClarification of the copyright laws regarding such key language data, and establishing open principles for\ntheir use, would remove ambiguity and encourage more innovative use of language data, especially in\nEurope. Principles might include:\n",
  "speaker": "SYSTEM",
  "uuid": "d5c40c04-539f-43fe-afb3-63867e81b219"
}