{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual01042010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n1. Implementación de un programa para extraer etiquetas multilingues desde Flickr.\n2. Implementación de un programa de asociación masiva de semántica a etiquetas.\n3. Escritura del articulo para el EKAW 2010. Fecha de entrega el 18 de abril.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n1. Experimento de descripcion de fuentes REST\n2. Escritura del artículo sobre Descripcion de fuentes REST.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nSe ha instaurado en la arquitectura el módulo de reglas JAPE para realizar anotaciones sobre URL de entrada. Actualmente la información obtenida no se introduce en los ficheros HTML de salida, sino que se comprueba su eficacia por pantalla.\nPara el problema del consumo de memoria de estas últimas semanas se ha creado un conjunto de aplicaciones GATE iniciales que provocan un retardo inicial pero, a cambio, se libera memoria del sistema al finalizar un trabajo. Actualmente está en fase de prueba.\nInterfaz Anotación Híbrida\n\n- Se ha reconstruido el codigo de highligth.\n- Se esta migrando la nueva versión.\n- Se sigue investigando con RAP (Rdf api for PHP), para mostrar información en los widgets.\n- Se realizará un pequeño analisis de GWT (google web toolkit) para ver la factibilidad de desarrollo con dicha herramienta.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se han terminado de implementar las interfaces de notificación de tareas y recursos.\n- Se ha comenzado con el desarrollo de las interfaces del metaplanificador.\nTarea 1.4\n\nSubtarea 2.2.4. Técnica 11\n: Implementación dentro de IGNMapDiscover 2.0 de la Técnica 11.\nSe ha implementado una nueva opción en la obtención de elementos mapeables de la ontología de modo que se pueden ottener los valores enumerados de los atributos de los conceptos de PhenomenOntology como elementos mapeables. Estos nuevos elementos mapeables se suman al conjunto de elementos mapeables con anterioridad.\nCon esta nueva opción activada de PhenomenOntology 3.6 se ha pasado de\nobtener 107 elementos mapeables a 388 elementos mapeables.\nTarea 7.1\n\n- RDF.\n· Generación de conjuntos de datos con URI armonizadas\n      · Adición del rdf:label en la generación de RDF\n      · Adición del idioma en la geneación de RDF\n- Linked Data.\n· Continuación de página web\n      · Generación de Endpoints\n      · Metadatos VoID",
  "speaker": "SYSTEM",
  "uuid": "d688b0c2-82ea-4eff-8c1d-b048b4d58748"
}