{
  "message": "SYSTEM: NeOn-Methodology-OntologySpecificationGuidelines.pdf: Página 3\nNeOn Methodology for Building Ontology Networks: Ontology Specification \nPage 3 of 18 \n1. Ontology Specification  \nAs we mentioned before, the goal of the ontology specification is to state why the ontology is being \nbuilt, what its intended uses are, who the end-users are, and what the requirements the ontology \nshould fulfil are. For specifying the ontology requirements we will use the competency questions \ntechniques proposed in [7]. Before identifying the set of competency questions, we will identify the \npurpose and scope of the ontology, its level of formality, its intended uses and its intended users.  \nThe NeOn methodology proposes the filling card, presented in Table 1, for the ontology \nspecification activity, including the definition, goal, inputs and outputs, who carry out the activity \nand when the activity should be carried out. \nOntology Specification \n \nDefinition \nOntology Specification refers to the activity of collecting the requirements that the \nontology should fulfill, e.g. reasons to build the ontology, target group, intended uses, \npossibly reached through a consensus process. \n \n \nGoal \nThe specification activity states why the ontology is being built, what its intended uses are, \nwho the end-users are, and what the requirements the ontology should fulfill are. \n \n \nInput \nOutput \nA set of ontological needs. \n \nOntology Requirements Specification Document \n(ORSD). \n \n \n \nWho \nSoftware developers and ontology practitioners, who form the ontology development team \n(ODT), in collaboration with users and domain experts. \n \n \nWhen \nThis activity must be carried out in parallel with the knowledge acquisition activity. \n \n \n \n \nTable 1. Ontology Specification Filling Card \nThe tasks for carrying out the ontology specification activity can be seen in Figure 1. The result of \nthis activity is the Ontology Requirements Specification Document (ORSD). \nThe NeOn methodology proposes a template for writing the ORSD that have the following slots, \nand that is shown in Table 2: \n",
  "speaker": "SYSTEM",
  "uuid": "d708984a-0ae5-4090-81e8-9eb433aeee14"
}