{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 97\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 97 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n¾ Ontology Reuse. Ontologies are more common and available everyday. Ontologies can be \nreused and imported as modules into the ontology network to be built. Upper ontologies are a \nkind of ontology that contain a generic description of concepts. These descriptions will be used \nin the invoicing case study by reusing some of them, which are included in upper ontologies \nsuch SUMO [22], CyC17 or DOLCE [27]. Additionally, specific ontologies related to the invoicing \nprocess that the companies follow and pharmaceutical ontologies are reused. \nThe purpose of the reference ontology for invoicing is to be instantiated for different sectors of \nthe industry. The first instantiation is for the pharmaceutical sector, laboratories mainly, but it \nwill also be extended for providers of these laboratories or wholesalers. These providers supply \nfrom chemical products to clean products so they need different instantiations of the invoice \nreference ontology. \nTwo are the upper level ontologies considered in this use case: DOLCE and SUMO. The \nreasons of choosing these two upper level ontologies is that both are in OWL and their scope \nfits into the use case. The iSOCO team want to highlight SUMO because there are projects18 \nthat address the extension of SUMO with invoice concepts. These two upper level ontologies \nwere analysed before they are extended for the pharmaceutical invoicing use case and finally \nonly the most relevant concepts are been used. \nAlso identified from the competency questions was the need of using time ontologies. A set of \ntime ontologies and its reuse study is presented in [24].  \n¾ Non Ontological Resource Reuse and Reengineering. From the competency questions the \niSOCO team also identified the need to use invoicing technologies vocabularies. Resources \nabout specific invoice technologies will be reused and included in the final invoice ontology \n(presented in [31]). \n \nThese invoicing resources are mainly technologies for electronic invoicing. One of these \ntechnologies is the Universal Business Language (UBL) which is a common XML library of \nbusiness documents, such invoices, purchase orders, etc. The vocabulary provides the user a \nlibrary of XML schemata for reusable components like Address or Company and also common \nschemata for documents, such as “Invoice”, “Order”, or “Despatch Advice”. UBL has been \nadopted by the Scandinavian governments as a legally required standard for sending invoices \nto governments. \nAnother technology is Electronic Data Interchange for Administration, Commerce and \nTransport (EDIFACT), which is a set of syntax rules to structure data. The main difference with \nUBL is that EDIFACT is not based on XML, though it has its own vocabulary and structure. \nEDIFACT is a standard developed under the United Nations and has been adopted by the \nInternational Organization for Standardization (ISO) as the ISO standard ISO 9735. EDIFACT \nprovides a set of syntax rules to structure data, an exchange protocol (I-EDI) and standard \nmessages. \nOther electronic invoicing vocabularies considered are Electronic Business XML (ebXML) and \nXML Common Business Library (xCBL). These two vocabularies are also based on XML but \nseldom used in the industry. The last version of xCBL dates from March of 2003; ebXML is the \nprecursor of UBL. These technologies are not as important as the first two described before but \nthey should be taken into account. \n                                                 \n17 http://www.cyc.com/cycdoc/vocab/merged-ontology-vocab.html \n18 http://ontolog.cim3.net/ \n",
  "speaker": "SYSTEM",
  "uuid": "d70a262f-d6ad-422d-a978-767019bf16af"
}