{
  "message": "SYSTEM: Ejercicios.pdf: Página 17\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n17 \nEjercicio 9: Conferencia \n \nSe desea construir un SBM que represente los siguientes conocimientos. \n Los investigadores escriben artículos y los publican en conferencias. \n Las conferencias son un tipo de evento científico, que se realizan en un lugar \nconcreto y que tienen una fecha de inicio y otra de finalización. Otros eventos \ncientíficos son los seminarios. \n A las conferencias asisten personas que pueden, o no, tener aceptado un artículo \naceptado. \n Una persona es el organizador principal de una conferencia \n Los estudiantes de doctorado son un tipo de investigador \n Los profesores pueden ser, o no,  investigadores. \n Los investigadores pueden ser, o no, profesores. \n Hay distintos tipos de profesores: Catedráticos, Titulares, Interinos y Asociados. \nLos catedráticos y los titulares son funcionarios y los interinos y los asociados \nno lo son. \n Las conferencias pueden ser nacionales e internacionales. Las internacionales \nson ingles. \n Las personas que asisten a la conferencia deben pagar un registro que depende \nde cuándo se registren. Si se registran dos meses antes de la conferencia, un mes \nantes, o si el registro es en la propia conferencia. Si el registro se realiza un mes \nantes de la conferencia, entonces se incrementan la cuantía base en un 30%. Si el \nregistro se realiza en el lugar de la conferencia, se incrementa la cuantía base en \nun 50%. \n \nLa siguiente tabla presenta las cuantías que deben pagar si el registro se realiza dos \nmeses antes de la conferencia en una conferencia  internacional llamada EKAW-02, que \nse celebra en España del 1 al 4 de octubre del 2002. \n \nSe dispone de la siguiente información: \n \n \n2 meses \nantes \n \nConferen\ncia \nEstudiant\ne \n300 euros \nNo-\nestudiante \n500 euros \n \nSe pide: \n \na) Construir la taxonomía de marcos, indicando todas las  relaciones ad-hoc, las \npropiedades de clase y las de instancia de cada marco clase.  \nb) Describir con el máximo nivel de detalle el marco raiz de la taxonomía que clasifica \na las personas. \nc) Realizar el valor activo del enunciado que calcula la cantidad en euros que debe \npagar una persona. \nd) Supóngase que Oscar es un estudiante de doctorado. Desea asistir a la conferencia y \npaga antes de dos meses. ¿Qué cantidad debe abonar? \n",
  "speaker": "SYSTEM",
  "uuid": "d861053d-76fe-4508-bc33-6acaafeada77"
}