{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 84\nPage 84 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nd) Select the ONLCM that best satisfies the ontology network development characteristics and \nconstraints. Based on the previous substeps, software developers and ontology \npractitioners should select an ONLCM for the ontology network. \nIf none of the evaluated ONLCM satisfies the ontology network development characteristics \nand constraints, it is also possible for the software developers and ontology practitioners to \ndefine a new ontology network life cycle model for the ontology network, based on those \npresented in Section 5.1 and adapted for the concrete development and/or organization. \n3. Select activities to be carried out from the “Required–if Applicable” table. \nRequired activities, identified in the “Required-if Applicable” table (Section 3.3), plus all others \napplicable to the ontology network development should be selected to be carried out during the \nontology network life cycle. The result of this step is the table of selected activities. \nFor this step, we propose to differentiate between two different kind of software developers and \nontology practitioners: \n Software developers and ontology practitioners that have developed more than 5 \nontologies. In this case, we assume that software developers and ontology practitioners, \nbased on their experience, are able to select the activities to be carried out during the \nontology network life cycle from the “Required-if Applicable” table.   \nActivities identified as “required” in the “Required-if Applicable” table are selected \nautomatically in the table of selected activities. Software developers and ontology \npractitioners should only select those “if applicable” activities needed for their ontology \nnetwork development. \nTable 4 shows a short example of possible selected activities for a concrete project. \nTable 4. Example of Table of Selected Activities \n \nRequired \nIf Applicable \nSelected \nOntology Annotation \nX \n \nX \nOntology Assessment \nX \n \nX \nOntology Conceptualization \nX \n \nX \nOntology Customization \n \nX \n \nOntology Forward Engineering\n \nX \nX \nOntology Reengineering \n \nX \nX \nOntology Restructuring \n \nX \nX \nOntology Reverse Engineering\n \nX \nX \n \n Software developers and ontology practitioners that have developed less than 5 ontologies. \nIn this case we propose a list of “yes/no” natural language questions (version 1) for those “if \napplicable” activities (identified in Section 3.3) to be answered by software developers and \nontology practitioners. Based on the responses obtained, “if applicable” activities will be \nthen automatically selected or not. \nAs in the previous case, activities identified as “required” in the “Required-if Applicable” \ntable are selected automatically in the table of selected activities. Taking into account \n",
  "speaker": "SYSTEM",
  "uuid": "d8d23b7f-27ae-4370-b0c9-816ea8aaf3c1"
}