{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 12\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n3.6. Coste estimado del desarrollo de su solución propuesta\n€\n3.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n3.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n3.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n3.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 3.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\nOtro(s) Retos(s):\n­12­\n(*) Campos obligatorios\nversión 1.2.\n#\n#\nLa disponibilidad de ontologías multilingües   facilita la creación   de conjuntos de datos \n(datasets) a partir de datos públicos   en diferentes lenguas co-oficiales. Esto supone una \nayuda al estado en su obligación   de proteger el patrimonio lingüístico \ndel país y, como \nconsecuencia, de proteger aquellas lenguas con más   dificultad para tener presencia en la \nWeb en general y en la Web Semántica   en particular. \n  \nLas mismas ontologías multilingües   que sirven como esquema para los datasets también   \nse pueden utilizar para anotar fuentes de datos disponibles en cada una de las lenguas \nco-oficiales. Así, se permite el acceso a tales fuentes de forma, no sólo automatizada, sino \ntambién adaptada a ciudadanos que no sean hablantes de las lenguas en que estaban \ninicialmente disponibles las fuentes de datos. \n  \nPor otra parte, las ontologías multilingües   pueden servir de base, en aquellas \ncomunidades autónomas   donde convivan diferentes lenguas co-oficiales, para sistemas \nque procesan, mediante análisis   computacional de lenguaje natural, peticiones de \nciudadanos a la administración pública.   Además,   la localización   de ontologías   garantiza \nque los modelos semánticos   estén   disponibles en el mismo idioma que hablan los \nciudadanos y el personal de las administraciones públicas, lo que facilita su uso en \naplicaciones de diversa índole (integración de datos, búsqueda y clasificación   de datos, entre \notras). Por último, se reduce el entrenamiento necesario para el entendimiento y uso de \nmodelos semánticos   gracias a que los usuarios pueden trabajar con dichos modelos en \nsu lengua de origen. \nEl hecho de disponer de ontologías localizadas en las diferentes lenguas del estado amplía \nel rango de instituciones privadas que pueden hacer uso de las tecnologías del lenguaje \nbasadas en semántica.   Las empresas de países que tienen una sola lengua oficial \ngeneralmente están   obligadas a cooperar con empresas de otros países para desarrollar \naplicaciones que manejan diferentes idiomas. Sin embargo, en el caso de España,   el \ndisponer de una serie de ontologías multilingües   facilitará   la cooperación de empresas del \npropio país de diferentes comunidades autónomas.   En consecuencia, incentivará   el \ndesarrollo de empresas con más   dificultades a la hora de abrirse al extranjero. \n  \nAsimismo, hay que tener en cuenta que las ontologías multilingües   no sólo   abarcarán \nidiomas oficiales en España,   sino que también pueden incluir idiomas oficiales en otros \nlugares del mundo, particularmente en la Unión   Europea. Esto facilitará   la cooperación   de \nlas empresas españolas   con otras del resto del mundo. \n  \nAl mismo tiempo, un catálogo  de ontologías  multilingües   colocará   en una posición   de \nprivilegio a las empresas tecnológicas   españolas   a la hora de adentrarse en el mercado \nlatinoamericano. \nEn general, se facilita la explotación de la riqueza lingüística   \ndel país   para el desarrollo \ntecnológico   de las empresas españolas, y para proporcionar servicios más   eficaces y \neficientes a los ciudadanos. Al mismo tiempo, la propia tecnología ayuda a proteger esta \nriqueza. \n",
  "speaker": "SYSTEM",
  "uuid": "d980d8db-148c-470e-b9b2-c7ddb257081f"
}