{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 28\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 28 de 42 \n22. Bajo. Virtual Organizations of Agents for Monitoring Elderly and Disabled People in \nGeriatric Residences.  ISBN: 978-605-86311-1-3. Istanbul, Turkey. July 9-12, 2013. \n23. Bajo. Wireless Sensor Networks, Real-Time Locating Systems and Multi-Agent \nSystems: The Perfect Team. ISBN: 978-605-86311-1-3. Istanbul, Turkey. July 9-12, \n2013. \n24. Belhajjame K, Zhao J, Garijo D, Garrido A, Soiland-Reyes S, Alper P, Corcho O. A \nworkflow PROV-corpus based on Taverna and Wings. In Proceedings of the Joint \nEDBT/ICDT 2013 Workshops, page 331-332, Genova, Italy, 2013. ACM. \n25. Bernardos S, Aguado de Cea G. Integración de un corpus de textos bilingüe y un \nglosario del campo de la informática. XXXI  Congreso AESLA, La laguna. Abril 2013. \n26. Blázquez L , Villazón-Terrazas B, Corcho C, Gómez-Pérez A. Integrating geographical \ninformation in the Linked Digital Earth. International Journal of Digital Earth (ISSN: \n1753-8947). Abril 2013 \n27. Bredeweg B, Liem J, Beek W, Linnebank F, Gracia J, Lozano E, Wissner M, Bühling R, \nSalles P, Noble R, Zitek A, Borisova P. DynaLearn - An Intelligent Learning \nEnvironment for Learning Conceptual Knowledge. Artificial Intelligence Magazine, ISSN \n0738-4602. Vol. 34. AAAI, California (USA). Diciembre 2013. Pp: 46-65. \n28. Buil-Aranda C, Arenas M, Corcho O, Polleres A. Federating Queries in SPARQL1.1. \nQuery: Syntax, Semantics and Evaluation. Journal of Web Semantics (ISSN: 1570-\n8268). 2013 \n29. Chihoub H, Ibrahim S, Antoniu G, Pérez MS. Consistency in the Cloud: When Money \nDoes Matter! 13th IEEE/ACM International Symposium on Cluster, Cloud, and Grid \nComputing. IEEE Computer Society Press, 352-359. Delft, Netherlands, May 2013. \n30. Corchado, Bajo, López, de Paz. Intelligent Biomedic Organizations: an Intelligent \nDynamic Architecture For Kdd. Information Sciences. ISSN 0020-0255. 2013 \n31. De paz, Tapia, Alonso, Pinzón, Bajo, Corchado. Mitigation of Theground Reflection \nEffect in Real-Time Locating Systems By Using Artificial Neural Networks. Knowledge \nand Information Systems, An International Journal. ISSN: 0219-1377. 2013 \n32. Esteban-Gutiérrez M, García-Castro R, Mihindukulasooriya N. RDF Validation in a \nLinked Data World – A vision beyond structural and value range validation. RDF \nValidation workshop. Practical Assurances for Quality RDF Data (RDFVal 2013). \nBoston, MA, USA. 10-11 septiembre 2013. \n33. Fernández-López M, Gómez-Pérez A. Methodological Guidelines for Reusing General \nOntologies. Data & Knowledge Engineering. ISSN 0169-023X. Elsevier. Julio 2013. \n34. Fraile, de Paz, Bajo, de Paz, Corchado. Context-Aware Multiagent System: Planning \nHome Care Tasks. Knowledge And Information Systems. Issn: 0219-1377. 2013. \n35. García-Castro R, Stuckenschmidt H, Wrigley S, Heflin J. On a steady ath to semantic \ntechnology evaluation. Web Semantics: Science, Services and Agents on the World \nWide Web. Editors: T. Finin, R. Mizoguchi, S. Staab. Vol. 21. Pp: 1-2. Elsevier. Agosto \n2013. \n36. García-Castro R, Gómez-Pérez A. The Object with States Ontology Design pattern. 4th \nInternational Workshop on Ontology and Semantic Web Patterns (WOP2013). Sydney, \nAustralia. 21 octubre 2013. \n37. García-Castro R, Esteban-Gutiérrez M, Mihindukulasooriya N. A Coreference Service \nfor Enterprise Application Integration using Linked Data. 7th International Workshop on \nApplications of Semantic Technologies (AST 2013). Koblenz, Germany. 16 septiembre \n2013. \n38. García-Silva A, Rodriguez-Doncel V, Corcho O. Semantic Characterization of Tweets \nUsing Topic Models: A Use Case in the Entertainment Domain. Int. Journal on \nSemantic Web and Information Systems (IJSWIS), 9(3), 1-13 (2013). \n39. Garijo D, Alper P, Belhajjame K, Corcho O, Gil Y, Goble C. Common motifs in scientific \nworkflows: An empirical analysis. Future Generation Computer Systems, 2013. \n40. Garijo D, Corcho O, Gil Y. Detecting common scientific workflow fragments using \nexecution provenance. In Proceedings of of the seventh international conference on \nKnowledge capture, page 33-40, Banff, 2013. ACM. \n41. Garijo D, Kinnings S, Xie L, Xie L, Zhang Y, Bourne PE, Gil Y. Quantifying \nReproducibility in Computational Biology: The Case of the Tuberculosis Drugome. PLoS \nONE, 8(11). 2013. \n42. Giraldo O. Using nanopublications to model laboratory protocols. The Future of \nResearch Communications and e-Scholarship (FORCE11). March 30th, 2013. \n",
  "speaker": "SYSTEM",
  "uuid": "daa487af-1043-4924-ba3f-fd7910c61be7"
}