{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 26\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 26 de 42 \n2012: \n1. Aguado G, Montiel E. Term variants in ontologies. AESLA: XXX Congreso Internacional \nAESLA \"Lingüística. Aplicada en la era de la Globalización\". Lleida. España. Abril 2012. \n2. Egaña M, Fernández-Breis JT, Antezana E. OPPL-Galaxy: Enhancing ontology \nexploitation in Galaxy with OPPL. 4th International Workshop on Semantic Web \nApplications and Tools for the Life Sciences, SWAT4LS 2011, pages 12–19, ACM \n2012. \n3. Fernández-López M, Suárez-Figueroa MC, Gómez-Pérez A, Ontology Development by \nReuse p 147-170. Febrero 2012 Springer ISBN 978-3-642-24793-4. \n4. García HA, Corcho O, Alani H, Gómez-Pérez A. Review of the state of the art: \nDiscovering and Associating Semantics to Folksonomies. Elsevier, 2012. ISSN: 0269-\n8889. \n5. García-Silva HA, Hyung-Kang J, Lerman K, Corcho O. Characterising Emergent \nSemantics in Twitter lists. ESCW2012. Heraklion, Grecia. Mayo 2012. \n6. Gómez-Pérez A, Vila-Suero D. What is the current state of the Multilingual Web of \nData? Dagstuhl Seminar. Saarbrucken, Alemania. Septiembre 2012. \n7. Gracia J. Cross-lingual ontology matching as a challenge for the Multilingual Semantic \nWeb. Dagstuhl Seminar. Saarbrucken, Alemania. Septiembre 2012. \n8. Gracia J, Montiel-Ponsoda E, Cimiano P, Gómez-Pérez A, Buitelaar P, McCrae J. \nChallenges for the Multilingual Web of Data. Journal of Web Semantics. ISSN 1570-\n8268. Vol. 11, pp: 63-71. Marzo 2012. \n9. McCrae J, Aguado de Cea G, Buitelaar P, Cimiano P, Declerck T, Gómez-Pérez A, \nGracia J, Hollink L, Montiel-Ponsoda E, Sphor D, Wunner T. Interchanging lexical \nresources on the semantic web, Language Resources and Evaluation ISSN 1574-020X. \n2012. \n10. Miñarro JA, Egaña M, Matínez-Béjar R, Fernández-Breis JT, Madrid M. Semantic \nintegration of information about orthologs and diseases: The OGO system. Journal of \nBiomedical Informatics 2011, 44, 1020-1031. \n11. Poveda M. A Reuse-based Lightweight Method for Developing Linked Data Ontologies \nand Vocabularies. ESWC2012. Heraklion, Grecia. Mayo 2012. \n12. Poveda-Villalón M, Suárez-Figueroa MC, Gómez-Pérez A. Did you validate your \nontology? OOPS! ESWC2012. Heraklion, Grecia. Mayo 2012 \n13. Radulovic F, García-Castro R. Semantic Technology Recommendation Based on the \nAnalytic Network Process. SEKE2012 Software Engineering and Knowledge. San \nFrancisco, EEUU. Junio 2012 \n14. Santana I, Pérez-Hernández MS. A semantic scheduler architecture for federated \nhybrid clouds. CLOUD 2012. Hawaii, EEUU. Junio 2012 \n15. Suárez-Figueroa MC, Gómez-Pérez A, Fernández-López M. The NeOn Methodology \nfor Ontology Engineering, p 9-34. Febrero 2012 Springer ISBN 978-3-642-24793-4. \n16. Suárez-Figueroa MC, Gómez-Pérez A, Motta E, Gangemi A. Introduction: Ontology \nEngineering in a Networked World. P. 1-8. Febrero 2012 Springer ISBN 978-3-642-\n24793-4. \n17. Suárez-Figueroa MC, Gómez-Pérez A, Motta E, Gangemi A. Ontology Engineering in a \nNetworked World 2012, 2012, XII, 444 p. 148 illus. ISBN 978-3-642-24793-4. \n18. Suárez-Figueroa MC, Gómez-Pérez A, Muñoz-García O. Scheduling Ontology \nEngineering Projects Using gOntt p 303-318. Febrero 2012 Springer ISBN 978-3-642-\n24793-4. \n19. Vilches-Blázquez LM, Ramos JA. Conflación semántica: un estudio sobre la integración \nde información geoespacial basada en ontologías. GeoFocus - International Review of \nGeographical Information Science and Technology (ISSN 1578-5157). Vol. 12. Pp: 147-\n171. \n20. Vilches-Blázquez LM, Saquicela V, Corcho O. Interlinking Geospatial Information in the \nWeb of Data. International AGILE'2012 Conference. Avignon France. Abril 2012. \n \n2013: \n",
  "speaker": "SYSTEM",
  "uuid": "db1a5fe5-8073-46e3-88ed-1479525ea2a0"
}