{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 6\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 6 of 21\n \nCQ17. What is the employer information? \nCQ18. What kind of job does the employer offer? \nCQ19. What kind of contract does the employer offer? \nCQ20. How much salary does the employer offer? \nCQ21. What is the economic activity of the employer? \nCQ22. What is the description of the job offer? \nCQ23. What is the work condition of the job offer? \nCQ24. What is the required education level for the job offer? \nCQ25. What is the required work experience for the job offer? \nCQ26. What is the required knowledge for the job offer? \nCQ27. What are the required skills for the job offer? \n \nSpecific Competency questions related to date management: \nCQ28. When the job seeker completed his/her first degree? \nCQ29. Is the job seeker older than 30 years? \nCQ30. How much time did the job seeker spend completing his/her first degree?  \nCQ31. How long is the duration of the contract? \nCQ32. Which job offers were posted in last 24 hours? \nCQ33. Which job offers were posted in last 7 days? \nCQ34. Which job offers were posted in last month? \n \nSpecific Competency questions related to currencies: \nCQ35. Is the job offer’s salary greater than 14000 zlotes?  \nCQ36. Is the job offer’s salary lower than 25000 kroner?  \nCQ37. The offered salary is given in US dollars? \nCQ38. The offered salary is given in Euros? \n \nCompetency questions in each group and between groups could be composed into more \ngeneral questions. The following non-exhaustive list presents some examples. \nComposed competency questions that use job seeker’s information for obtaining a job offer: \nCQ39. Given the personal information (name, nationality, birth date, contact information) \nand the objectives (desired contract type, desired job, desired working conditions, \ndesired salary) of the job seeker, what job offers are the most appropriate? \nCQ40. Given the personal information (name, nationality, birth date, contact information) \nand the profile (current job, education level, work experience, knowledge, expertise, skill) \nof the job seeker what job offers are the most appropriate? \n",
  "speaker": "SYSTEM",
  "uuid": "db4c1420-e0a6-4c0b-8080-612efaafc3b9"
}