{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 118\nPage 118 of 124\nNeOn Integrated Project EU-IST-027595\nBibliography\n[ABM05]\nY. An, A. Borgida, and J. Mylopoulos. Constructing Complex Semantic Mappings Between\nXML Data and Ontologies. In International Semantic Web Conference, pages 6–20, 2005.\n[AM99]\nD. Appelt and D. Martin. Named entity extraction from speech: Approach and results using\nthe TextPro system. In Proceedings of DARPA Broadcast News Workshop, pages 51–54,\n1999.\n[AM05]\nY. An and J. Mylopoulos. Translating XML Web Data into Ontologies. In OTM Workshops,\npages 967–976, 2005.\n[ANS05]\nANSI/NISO. Documentation – Guidelines for the construction, format, and management of\nmonolingual controlled vocabularies., 2005. Report ANSINISO Z3919.\n[ASC07]\nR. Abbasi, S. Staab, and P. Cimiano. Organizing resources on tagging systems using t-org.\nIn In proceedings of Workshop on Bridging the Gap between Semantic Web and Web 2.0\nat ESWC 2007, June 2007.\n[ASSM07]\nS. Angeletou, M. Sabou, L. Specia, and E. Motta. Bridging the gap between folksonomies\nand the semantic web: An experience report. In 4th European Semantic Web Conference,\npages 30–43, Innsbruck, Austria, 2007.\n[ATBC05]\nN. Aswani, V. Tablan, K. Bontcheva, and H. Cunningham. Indexing and Querying Linguistic\nMetadata and Document Content. In Proceedings of Fifth International Conference on Re-\ncent Advances in Natural Language Processing (RANLP2005), Borovets, Bulgaria, 2005.\n[Bar07]\nJ. Barrasa. Modelo para la deﬁnición automática de correspondencias semánticas entre\nontologías y modelos relacionales. PhD thesis, Facultad de Informatica, Universidad Po-\nlitecnica de Madrid, Madrid, Spain, March 2007.\n[BCGP04]\nJ. Barrasa, O. Corcho, and A. Gómez-Pérez. R2O, an Extensible and Semantically Based\nDatabase-to-Ontology Mapping Language. In Second Workshop on Semantic Web and\nDatabases (SWDB2004), 2004.\n[Ber94]\nJ. Berge. The EDIFACT Standards. Blackwell Publishers, Inc., Cambridge, MA, USA, 1994.\n[BH06]\nS. Brockmans and P. Haase. A Metamodel and UML Proﬁle for Networked Ontologies. A\nComplete Reference. Technical report, Universität Karlsruhe„ 2006.\n[BON03]\nOliver Bender, Franz Josef Och, and Hermann Ney. Maximum entropy models for named\nentity recognition.\nIn Walter Daelemans and Miles Osborne, editors, Proceedings of\nCoNLL-2003, pages 148–151. Edmonton, Canada, 2003.\n[Bra05]\nD. Brandon. Recursive database structures. Journal of Computing Sciences in Colleges,\n2005.\n",
  "speaker": "SYSTEM",
  "uuid": "db6c0845-4ad7-418e-8536-948560f40ec3"
}