{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ProgresoEspa%C3%B1aVirtual \n\nContents\n[\nhide\n]\n1\nSituación Año 1 (hasta Hito 4)\n1.1\nTareas 7.2 y 8.4\n1.2\nTarea 2.3 (DEIMOS)\n1.3\nTareas 1.4 y 4.1 (CNIG)\n1.4\nTarea 7.1 (CNIG)\n2\nPlanes de trabajo (año 2)\n2.1\nTareas 7.2\n2.2\nTarea 2.3 (DEIMOS)\n2.3\nTareas 1.4 y 4.1 (CNIG)\n2.4\nTarea 7.1 (CNIG)\n3\nInterfaz Anotador Híbrido\n4\nLecciones aprendidas\n5\nRecursos\n6\nInformes enviados a Deimos y CNIG/IGN\nSituación Año 1 (hasta Hito 4)\n\nTareas 7.2 y 8.4\n\nTarea 1 (DEIMOS). Mecanismo de extracción semántica a partir de anotaciones\n. Hemos categorizado todas las aproximaciones existentes en el estado del arte para la extracción de semántica a partir de anotaciones Web2.0 (tags), que también se puede llamar propuesta de anotación de folksonomías, y hemos propuesto un primer borrador del experimento que tenemos pensado realizar en los próximos meses en esta área. Este experimento se realizará sobre el repositorio RDF de la Universidad de Southampton donde se cruza información de varias folksonomías, así como la ontología de tagging que han definido para almacenar esta información. En esta tarea hemos terminado la escritura de un artículo de revisión que tenemos pensado enviar a una revista. Hemos implementado el primer prototipo de extracción semántica a partir de anotaciones, utilizando DBPedia como recurso semántico.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Implementación de un servicio web para permitir acceder al servicio de desambiguación de etiquetas de manera independiente al lenguaje de desarrollo del mencionado servicio.\n• Trabajo en los comentarios recibidos (primera revisión) a un artículo enviado a la revista Knowledge Engineering Review.\n• Revisión del concepto de contexto activo que va a ser integrado en el servicio de\ndesambiguación y que permitirá mejores resultados.\nTarea 2 (CNIG). Procesado de fuentes de información no semántica ya existentes\n. Hemos desarrollado servicios Web para acceder a distintas fuentes de datos (wsdl, rss, georss, rest -- con algunas restricciones de registro --), e introducimos estos datos de manera unificada utilizando el modelo SDO propuesto por IBM. Asimismo, hemos realizado una revisión del estado del arte correspondiente a la descripción automática de fuentes desconocidas, utilizando en general programación lógica inductiva.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Continuación del proceso de integración intentando comprender la definición de la fuente. Para esto se están utilizando recursos semánticos como Geonames, DBpedia para definir significados de las entradas y salidas de las fuentes.\nTarea 3 (DEIMOS). Modelo de anotación híbrido\n. Tenemos hasta ahora diseñada una base de datos que permite almacenar anotaciones procedentes de parsers lingüísticos de una manera unificada, teniendo en cuenta las características principales que la mayoría de los parsers proporcionan, y tenemos su implementación correspondiente en SQL. Esto permitirá en el futuro referirse de manera unificada a los distintos tokens que pueden aparecer en un texto introducido por el usuario, de acuerdo con la interfaz multimodal que se propone en el documento. Se han identificado distintos modelos de anotación híbrida (lingüística y semántica) y las interacciones entre ellas, aunque aún queda trabajo de refinamiento de los mismos.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Diseño de la interfaz.\n• Inicio del desarrollo de la interfaz.\n• Evolución de la funcionalidad del anotador. Se han realizado una serie de experimentaciones basadas en las anotaciones proporcionadas por la herramienta GATE y se han desarrollado las más relevantes.\n• Análisis de diferentes repositorios para el almacenamiento de los datos (Badele3000).\nTarea 2.3 (DEIMOS)\n\nInstalación y configuración del servidor Fura en un equipo Linux.\nComprobación del funcionamiento del servidor Fura.\nLectura de la documentación de programación de Fura.\nAnálisis de las características más interesantes de Fura para el desarrollo del planificador semántico.\nComienzo de la redacción del borrador sobre el planificador semántico.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Estudio de S-OGSA para adaptarlo al metaplanificador.\n• Mejora de la ontología de planificación de recursos grid.\n• Mejora del algoritmo de razonamiento.\nTareas 1.4 y 4.1 (CNIG)\n\nR2O+ y ODEMapster+\n. Este trabajo da multiplicidad a la hora de realizar alineamientos BD-Ontologías y de su ejecución (los mappings R2O y R2O+ son ejecutables al representar transformaciones). Trabajo realizado para el H3.\nSe ha pasado documentación a GridSystems para intentar gridificar este software.\nAnálisis y mejora de técnicas de descubrimiento de mappings ad hoc para el dominio geográfico\n. En una primera fase (julio 2009) se van a analizar los resultados de las técnicas que se hicieron en el Convenio bilateral OEG-IGN en 2008. En la segunda fase (octubre 2009) se van a proponer mejoras.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\nMapeo de catálogos externos\n. A petición del IGN, se prueba a mapear con PhenomenOntology 3.5 los fenómenos de fuentes de información externa a partir de consultas a servicios web de fenómenos (WFS, Web Feature Services). Se han realizado pruebas en julio de 2009. Estas pruebas sirven como base para el planteamiento de mejoras para las técnicas existentes y para el diseño e implementación de nuevas técnicas. Esta tarea forma parte de la anterior del análisis de las técnicas de descubrimiento.\nSe ha revisado el estado de los catálogos de fenómenos que los WFS permiten obtener, analizando la accesibilidad y la descriptividad de los listados de fenómenos que estos servicios contemplan. De este trabajo se ha escrito una comunicación que ha sido aceptada para su presentación dentro de las VI Jornadas Técnicas de la IDE de España (JIDEE2009) y que se celebran del 4 al 6 de noviembre, donde se presentará este trabajo.\nEvaluación de técnicas descubrimiento de\nmappings\n. Se están evaluando las técnicas existentes en el IGN MapDiscover 1.0.\nPropuesta de nuevas técnicas de descubrimiento de\nmappings\n. A partir del trabajo de mapeo con FWS se está desarrollando la técnica 10, de comparación de cadenas previa eliminación de partículas sintácticas no descriptivas del fenómeno (información de escala, de representación, etc.).\nTarea 7.1 (CNIG)\n\nEn esta tarea también teníamos progreso que realizar en filtrado colaborativo, pero aún no hemos hecho nada en este área.\nÚltimas actividades realizadas (Agosto-Octubre 2009)\n• Estudio de la problemática de las diversas fuentes de datos (bases de datos & RDF) para la generación de un listado exhaustivo de problemas.\n• Identificación y solución de algunos problemas en ODEMapster para la generación de información en RDF procedente de bases de datos de gran tamaño.\nPlanes de trabajo (año 2)\n\nTareas 7.2",
  "speaker": "SYSTEM",
  "uuid": "db935cc6-099a-449b-a5db-d16e157f05d5"
}