{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Linguistic_Linked_Data:_Introductory_References \n\nThis aims to be a short list of links and references useful for those who are new to the Semantic Web and Linguistic Linked Data (LLD). Many of these references are extracted from the material of introductory courses at the Facultad de Informática (\nIntroduction to Ontologies\n,\nSemantic Web and Linked Data\n,\nSistemas Inteligentes\n, etc.).\nContents\n[\nhide\n]\n1\nOverview\n2\nRDF and OWL\n3\nQuerying RDF triples: SPARQL\n4\nAdditional learning material\n5\nLinguistic Linked Data\n5.1\nKey References\n5.2\nFurther Reading\n5.3\nLLD-related Initiatives and Groups\n6\nOntology Engineering\n6.1\nIntroductory Readings\n6.2\nBuilding Ontologies\nOverview\n\nhttp://www.ted.com/talks/tim_berners_lee_on_the_next_web\nhttp://www.theregister.co.uk/2004/04/24/w3c_semantic_web_framework/\nIntroduction to Linked Data\nhttp://mediastandardstrust.org/blog/a-dummys-introduction-to-linked-data-me-being-the-dummy/\n,\nhttp://www.onzientzia.tv/bideoa-ikusi.asp?Kodea=332&lang=ES\n,\nhttp://www.youtube.com/watch?v=4x_xzT5eF5Q\nMetaweb\nhttp://www.youtube.com/watch?v=TJfrNo3Z-DU\nRDF and OWL\n\nhttp://www.w3.org/TR/rdf11-primer/\nW3C Documents:\nRDF1.1 Concepts and Abstract Syntax\n,\nRDF 1.1 Semantics\n,\nRDF XML Syntax\n,\nRDF Turtle\nW3Schools Tutorials:\nIntroduction to RDF\n,\nIntroduction to OWL\nQuerying RDF triples: SPARQL\n\nIntroduction to SPARQL in SlideShare\nTutorials:\nhttp://www.w3.org/2009/Talks/0615-qbe/\n,\nhttp://www.cambridgesemantics.com/semantic-university/sparql-by-example\nAdditional learning material\n\nMaterial from the 2014 ESWC Summer School\nhttp://videolectures.net/\n(Search by eg. “linked data\", \"linguistic linked data\", etc.)\nLinguistic Linked Data\n\nKey References\n\nlemon - The Lexicon Model for Ontologies\nLinguistic Linked Open Data Cloud\nThe Lemon Cookbook\nMontiel-Ponsoda, Elena, et al. \"Representing translations on the semantic web.\" (2011).\nBuitelaar, Paul, et al. \"Ontology lexicalisation: The lemon perspective.\" (2011).\nCimiano, Philipp, et al. \"LexInfo: A declarative model for the lexicon-ontology interface.\" Web Semantics: Science, Services and Agents on the World Wide Web 9.1 (2011): 29-51.\nMcCrae, John, et al. \"Interchanging lexical resources on the Semantic Web.\" Language Resources and Evaluation 46.4 (2012): 701-719.\nChiarcos, Christian, et al. \"Towards open data for linguistics: Linguistic linked data.\" New Trends of Research in Ontologies and Lexical Resources. Springer Berlin Heidelberg, 2013. 7-25.\nFurther Reading\n\nVertan, Cristina. \"Language resources for the Semantic Web: perspectives for machine translation.\" Proceedings of the Second International Workshop on Language Resources for Translation Work, Research and Training. Association for Computational Linguistics, 2004.\nFrancopoulo, Gil, et al. \"Lexical markup framework (LMF).\" International Conference on Language Resources and Evaluation-LREC 2006. 2006.\nEspinoza, Mauricio, Asunción Gómez-Pérez, and Eduardo Mena. Enriching an ontology with multilingual information. Springer Berlin Heidelberg, 2008.\nNavigli, Roberto, and Simone Paolo Ponzetto. \"BabelNet: The automatic construction, evaluation and application of a wide-coverage multilingual semantic network.\" Artificial Intelligence 193 (2012): 217-250.\nWindhouwer, Menzo, and Sue Ellen Wright. \"Linking to linguistic data categories in ISOcat.\" Linked Data in Linguistics. Springer Berlin Heidelberg, 2012. 99-107.\n[Book] Chiarcos, Christian, Sebastian Nordhoff, and Sebastian Hellmann. Linked Data in Linguistics. Heidelberg: Springer, 2012.\nChiarcos, Christian, and Maria Sukhareva. \"OLiA–Ontologies of Linguistic Annotation.\" Semantic Web (2013).\nde Melo, Gerard. \"Lexvo. org: Language-related information for the linguistic linked data cloud.\" Semantic Web (2013): 7.\nMcCrae, John Philip, and Philipp Cimiano. \"Mining translations from the web of open linked data.\" Joint Workshop on NLP&LOD and SWAIE: Semantic Web, Linked Open Data and Information Extraction. 2013.\nHellmann, Sebastian, et al. \"Integrating nlp using linked data.\" The Semantic Web–ISWC 2013. Springer Berlin Heidelberg, 2013. 98-113.\nGracia, Jorge, et al. \"Enabling Language Resources to Expose Translations as Linked Data on the Web.\" 9th International Conference on Language Resources and Evaluation, LREC. Vol. 14.\nProceedings of the 3rd Workshop on Linked Data in Linguistics\nLewis, David, et al. \"Global Intelligent Content: Active Curation of Language Resources using Linked Data.\"\n[Apertium project, Draft]: Gracia, J. Guidelines for Linguistic Linked Data Generation: Bilingual Dictionaries:\nhttp://bpmlod.github.io/report/bilingual-dictionaries/index.html\nGracia, J., Montiel-ponsoda, E., Vila-suero, D., & Aguado-de-cea, G. (n.d.). Enabling Language Resources to Expose Translations as Linked Data on the Web.\nUnger, Christina, André Freitas, and Philipp Cimiano. \"An Introduction to Question Answering over Linked Data.\" Reasoning Web. Reasoning on the Web in the Big Data Era. Springer International Publishing, 2014. 100-140.\nLLD-related Initiatives and Groups\n\nLIDER\nCLARIN\nCLARIN-D\nMETA-SHARE\nFLaReNet\nOpen Knowledge Foundation’s Working Group on Open Data in Linguistics\nThe Ontology-Lexicon community group\nBest Practices for Multilingual Linked Open Data Community Group\nLinked Data for Language Technology Community Group\nOntology Engineering\n\nIntroductory Readings\n\nGómez-Pérez, A., Fernández-López, M., & Corcho, O. (2004). Ontological Engineering: with Examples from the Areas of knowledge Management, e-Commerce and Semantic Web. Springer.\nGruber, T. (1993). A translation approach to portable ontology specifications. Knowledge Acquisition, 5(April), 199–220.\nRoussey, C., Pinet, F., Kang, M., & Corcho, O. (2011). An Introduction to Ontologies and Ontology Engineering.\nLassila, O., & McGuinness, D. L. (2001). The Role of Frame-Based Representation on the Semantic Web. Review of Accounting Studies, 12, 369.\nBuilding Ontologies\n\nThe NeOn Book\nThe NeOn Glossary of Terms",
  "speaker": "SYSTEM",
  "uuid": "dc035bdc-7bdb-425a-a5ee-d76846f0e5d5"
}