{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Procesamiento linguistico paginas wikipedia en Español\n- Sugerencias de ortografía y palabras compuestas. \nPara realizar sugerencias de escritura y de división de cadenas concatenadas se está utilizando el servicio BOSS de Yahoo!. Este servicio actualmente es gratuito y no tiene límite de consultas. Sin embargo, Yahoo! deja en claro que pronto lo limitará y para uso intensivo establecerá un pago.\nEl servicio web se encuentra disponible en la dirección:\nhttp://boss.yahooapis.com/ysearch/spelling/v1/\nActividad: Adaptación del servicio de desambiguación en Español\n- Se empezó con la integración del servicio de desambiguación al nuevo repositorio de significados.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\n- Los servicios Web se han puesto en funcionamiento sobre un servidor independiente al entorno de desarrollo. Durante estos últimos días se han intentado minimizar las incidencias que se producen al realizar varias tareas a la vez sobre el propio servidor. Estas incidencias se producen por varias causas, como por ejemplo, limitación de la capacidad de procesamiento de la máquina servidor, trabajo en paralelo sobre la misma máquina, procesamiento pesado de trabajos, etcétera. Actualmente se trata de reducir la carga en el procesamiento de los trabajos y se está a la espera de mejorar el servidor.\nSubtarea:Gazetteers\n- Se avanza en los subtareas abiertas la semana anterior gracias al resolución de los problemas. Han aparecido nuevos problemas relacionados con la cantidad de información que se le debe proporcionar al procesador de recursos. Concretamente son destacados los problemas con la incorporación de los parámetros de runtime, treeBinaryCode, etcétera. Se están buscando las soluciones oportunas.\nInterfaz Anotación Híbrida\n\nComunicación con Web Services.\n- Ya se realiza la tarea principal de la interfaz, anotar cualquier pagina Web con los entitys names que se seleccionen, utilizando el servicio Web y mostrando los resultados. Falta insertar un efecto de esperar mientras carga con jquery.\n- Ahora se empezará a mejorar los detalles de interfaz, como las validaciones, drag and drop, y diseños en general.\n- También se esta trabajando con yii framework para permitir el manejo de usuarios y el manejo de idiomas en la interfaz.\nTarea 2.4\n\nDiseño del primer prototipo\nSe continúa implementando la ontología de para el metplanificador y los adaptadores. Finalmente se ha desechado el uso de las ontologías de\nunigrids\npara este primer diseño dada su complejidad y la introducción de términos y estructuras que no se adecuan a la descripción de nuestro problema.\nSe ha optado por desarrollar una ontología mas simple y cercana al problema, que en un futuro podría adaptarse a las ya existentes mediante ontology matching.\nTarea 1.4\n\nSubtarea 2.2.1. Técnica 10\n: Implementación del filtro que elimina de las cadenas el conjunto de partículas estudado en el informe sobre la técnica 10.\nTarea 7.1\n",
  "speaker": "SYSTEM",
  "uuid": "dc367529-a96e-477f-919a-326f1a9853f6"
}