{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual31122009 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción semántica a partir de anotaciones\n.\nPersonal en vacaciones\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n. \n- Busqueda de servicios que permitan sinonimos de palabras. Conexion al servicio e implementación en la plataforma.\nTarea 3. Modelo de anotación híbrido\n.\n- La potencia de la herramienta Gate reside el poder incluir código java. En dicho código se pretende incluir verificaciones y patrones de diseño lingüísticos. Así pues, hay que comprobar si ciertas oraciones cumplen ciertos patrones y aplicar una o varias reglas que ofrezca la categoría en la que esté dicha oración. Dichas reglas se llaman reglas Jape, durante esta semana he comenzado a ver qué son y cómo trabajan. Para ello, me he reunido con una lingüista que ha trabajado en el tema.\n- Instalación del TreeTagger: versión gráfica y versión sobre Gate. Esta última versión requiere la instanciación del idioma y los parámetros de uso, en cuanto a las notaciones que se especifiquen según las necesidades del usuario, (pre y post procesamiento de URL, parámetros de ejecución, niveles de anotación, etcétera). Esta instalación no está resultando sencilla ya que la instanciación y los parámetros no están siendo recogidos por la herramienta de tal modo que generan un error.\n- La incorporación de ontologías en el servicio para el uso de la herramienta con no está resultando una labor trivial. Primero, al necesitar instancias en las ontologías hay que poblarlas y guardar los nuevos cambios para su posterior utilización. Este proceso produce inconsistencias, no siempre se guarda todos los cambios realizados.  Se trata incluir por código el manejo de repositorios tanto de las aplicaciones esenciales como anotar los nombres propios, como  las ontologías utilizadas y sus cambios. Hoy por hoy, no está operativo por dificultades en la comprensión de las librerías/códigos.\nInterfaz Anotación Híbrida\n\nTarea 1. Modelo Orientado a Objetos\n.\n- Modelo UML de la interfaz en 3 Capas con el patron MVC para PHP.\n- Inicio de la Codificación OO en PHP con de la version 1.2 de la interfaz HTML.\n- Modeloción de objetos del Cliente Web Service en PHP. Aun inconclusa y por porbar.\nTarea 2. Web Service GATE\n.\n- Estudio del código JAVA, de la aplicación GATE con el servicio ANIE.\n- Evaluación de la Tecnología JAVA para montar un servidor de prueba con SERVICIOS WEB JAVA.\n- Falta tarea por hacer punto critico de la interfaz.\nTarea 3. Mejora JQUERY\n.\n- Falta Realizar Tarea de ingresar al IFRAME donde se muestra la pagina anotada por GATE para permitir DRAG and DROP. Se esta investigando como realizarlo satisfactoriamente.\n- Propuesta nueva acerca de WIDGETS. posición y muestra. Nuevas Ideas como mostrar información (Aun no es una propuesta formal)\n- Realización Video Muestra Interfaz V1.2 HTML\n.\nTarea 2.4\n\nPrimera versión no refinada de los requisitos del metaplanificador semántico.\nTarea 1.4\n\nSubtarea 2.2.1. Estudio de implementación de la técnica 10.\nTarea 7.1\n\n- Continuación del proceso de mejora - Refinamiento de la condición \"match-regexp\" en la codificación de los mappings R2o.\n- Generación de RDF final para las siguientes fuentes: BTN25, BCN200 y Atlas Nacional.",
  "speaker": "SYSTEM",
  "uuid": "dca87de3-f0b9-47d1-a81f-b06f568d2e4c"
}