{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 10\nyou can do single-handedly, you can go just that far and no farther than you can do single-handedly. If you\n!\nwill learn to work with the system, you can go as far as the system will support you.'' And, he never went\n\nany further. He had his personality defect of wanting total control and was not willing to recognize that you\n\t\nneed the support of the system.\n&\nYou find this happening again and again; good scientists will fight the system rather than learn to work\nwith the system and take advantage of all the system has to offer. It has a lot, if you learn how to use it. It\n\ntakes patience, but you can learn how to use the system pretty well, and you can learn how to get around it.\n\f\nAfter all, if you want a decision `No', you just go to your boss and get a `No' easy. If you want to do\nsomething, don't ask, do it. Present him with an accomplished fact. Don't give him a chance to tell you `No'.\n\u0006\nBut if you want a `No', it's easy to get a `No'.\n\u0002\nAnother personality defect is ego assertion and I'll speak in this case of my own experience. I came from\n\u0004\nLos Alamos and in the early days I was using a machine in New York at 590 Madison Avenue where we\nmerely rented time. I was still dressing in western clothes, big slash pockets, a bolo and all those things. I\nvaguely noticed that I was not getting as good service as other people. So I set out to measure. You came in\n\u0005\nand you waited for your turn; I felt I was not getting a fair deal. I said to myself, ``Why? No Vice President\n\t\nat IBM said, `Give Hamming a bad time'. It is the secretaries at the bottom who are doing this. When a slot\n\t\nappears, they'll rush to find someone to slip in, but they go out and find somebody else. Now, why? I\n\t\nhaven't mistreated them.'' Answer, I wasn't dressing the way they felt somebody in that situation should. It\n\u001a\ncame down to just that - I wasn't dressing properly. I had to make the decision - was I going to assert my\n\u0007\nego and dress the way I wanted to and have it steadily drain my effort from my professional life, or was I\n\b\ngoing to appear to conform better? I decided I would make an effort to appear to conform properly. The\n\u0017\nmoment I did, I got much better service. And now, as an old colorful character, I get better service than\n\u0014\nother people.\n\u000e\nYou should dress according to the expectations of the audience spoken to. If I am going to give an address\nat the MIT computer center, I dress with a bolo and an old corduroy jacket or something else. I know\n\t\nenough not to let my clothes, my appearance, my manners get in the way of what I care about. An\n\b\nenormous number of scientists feel they must assert their ego and do their thing their way. They have got to\n\b\nbe able to do this, that, or the other thing, and they pay a steady price.\n\u001d\nJohn Tukey almost always dressed very casually. He would go into an important office and it would take a\n\u0001\nlong time before the other fellow realized that this is a first-class man and he had better listen. For a long\n%\ntime John has had to overcome this kind of hostility. It's wasted effort! I didn't say you should conform; I\n\f\nsaid ``The \n\u0006\nappearance of conforming\n.\n gets you a long way.'' If you chose to assert your ego in any number\nof ways, ``I am going to do it my way,'' you pay a small steady price throughout the whole of your\n\u000e\nprofessional career. And this, over a whole lifetime, adds up to an enormous amount of needless trouble.\n\u000f\nBy taking the trouble to tell jokes to the secretaries and being a little friendly, I got superb secretarial help.\n\u0002\nFor instance, one time for some idiot reason all the reproducing services at Murray Hill were tied up. Don't\nask me how, but they were. I wanted something done. My secretary called up somebody at Holmdel,\n\t\nhopped the company car, made the hour-long trip down and got it reproduced, and then came back. It was a\npayoff for the times I had made an effort to cheer her up, tell her jokes and be friendly; it was that little\n\u000f\nextra work that later paid off for me. By realizing you have to use the system and studying how to get the\n\b\nsystem to do your work, you learn how to adapt the system to your desires. Or you can fight it steadily, as a\n\u0006\nsmall undeclared war, for the whole of your life.\n\u0006\nAnd I think John Tukey paid a terrible price needlessly. He was a genius anyhow, but I think it would have\nbeen far better, and far simpler, had he been willing to conform a little bit instead of ego asserting. He is\n\u001d\ngoing to dress the way he wants all of the time. It applies not only to dress but to a thousand other things;\n\u0017\npeople will continue to fight the system. Not that you shouldn't occasionally!\n\u000f\nWhen they moved the library from the middle of Murray Hill to the far end, a friend of mine put in a\n\u0019\nrequest for a bicycle. Well, the organization was not dumb. They waited awhile and sent back a map of the\ngrounds saying, ``Will you please indicate on this map what paths you are going to take so we can get an\n\u0017\ninsurance policy covering you.'' A few more weeks went by. They then asked, ``Where are you going to\nstore the bicycle and how will it be locked so we can do so and so.'' He finally realized that of course he\n\u0006\nwas going to be red-taped to death so he gave in. He rose to be the President of Bell Laboratories.\n\n",
  "speaker": "SYSTEM",
  "uuid": "dd45de23-d87f-4554-8d6f-e0d5f231d768"
}