{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 10\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11159\nArtículo 20.  Transición de la fase de beca a la de contrato.\n1.  Cuando el beneficiario de la ayuda en periodo de beca, transcurridos los 24 \nprimeros meses de ayuda, cumpla los requisitos para pasar a contrato en prácticas, este \ndeberá formalizarse de forma inmediata sin que exista interrupción en la actividad.\n2.  Si al término del periodo de beca el investigador en formación no cumpliera los \nrequisitos establecido en el artículo 19.1.b) para formalizar el contrato en prácticas, tendrá \nun plazo máximo de cuatro meses para poder acreditarlos y durante el mismo el beneficiario \nno percibirá ninguna de las dotaciones de la ayuda. Dicho periodo no será recuperable en \nel periodo de contrato.\n3.  El transcurso de dicho plazo de cuatro meses sin que el investigador en formación \ncumpla los requisitos indicados para formalizar el contrato en prácticas, supone un \nincumplimiento de la actividad que dará lugar a la pérdida del derecho al cobro y, en su \ncaso, al reintegro de la subvención.\nArtículo 21.  Suspensión de las ayudas.\n1.  Durante el periodo de beca, el personal investigador en formación tendrá derecho a \nla interrupción temporal de la misma, únicamente en los supuestos de baja por incapacidad \ntemporal (enfermedad o accidente), riesgo durante el embarazo, descanso por maternidad \no paternidad y adopción o acogimiento, de acuerdo con la normativa aplicable. Durante todo \nel tiempo de permanencia en dicha situación, se complementará la prestación económica de \nla Seguridad Social hasta alcanzar el 100% de la cuantía mensual de la beca. En estas \nsituaciones, el tiempo interrumpido podrá recuperarse siempre que este sea por periodos de, \nal menos, 30 días y que las disponibilidades presupuestarias lo permitan.\n2.  Durante el periodo de contrato, la suspensión del contrato en virtud de las causas \nprevistas en los artículos 45 y siguientes del Estatuto de los Trabajadores no comportará \nla ampliación de la duración de la ayuda, salvo las situaciones de incapacidad temporal, \nmaternidad o paternidad y adopción o acogimiento durante el período de duración del \ncontrato, que interrumpirán su cómputo, de conformidad con lo establecido en el artículo \n17.1.b) de la Ley 13/1986, de 14 de abril, de Fomento y Coordinación General de la \nInvestigación Científica y Técnica.\nArtículo 22.  Derechos del personal investigador en formación.\n1.  De manera general, el personal investigador en formación tendrá los siguientes \nderechos:\na)  Obtener de los Centros de I+D a los que se incorporen la colaboración y apoyo \nnecesario para el desarrollo normal de sus estudios y programas de investigación, de \nacuerdo con las disponibilidades de aquellos.\nb)  Percibir la ayuda económica que corresponda en la forma establecida en el \nsubprograma.\nc)  Los restantes derechos establecidos en el artículo 5 del Real Decreto 63/2006, de \n27 de enero, por el que se aprueba el Estatuto del personal investigador en formación.\n2.  Durante el periodo de contrato, tendrán del mismo modo derecho a todos los \nbeneficios laborales y sociales inherentes al contrato laboral que suscriban.\nAdemás, quienes desarrollen su labor en una universidad podrán colaborar, con fines \nformativos y hasta un máximo de 60 horas anuales, en las tareas docentes de un \ndepartamento universitario, previa autorización del departamento implicado y, en su caso, \ndel Investigador Principal del proyecto de I+D al que se ha incorporado el investigador en \nformación. En el caso de los beneficiarios con adscripción a centros no universitarios, \npodrán realizar dichas tareas en la Universidad con la que el centro tenga convenio de \nvinculación al respecto.\nEn ningún caso las tareas docentes podrán desvirtuar la dedicación a la finalidad \ninvestigadora y formativa de las ayudas. La docencia impartida le será reconocida por la \ncorrespondiente certificación.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "dd5ae336-f641-4af1-90de-24f7a89b728e"
}