{
  "message": "SYSTEM: Curriculum_abreviado_CVA_Proyectos_2016-MCSF2.pdf: Página 2\n \n2 \n \nCURRÍCULUM ABREVIADO (CVA) – Extensión máxima: 4 PÁGINAS \nLea detenidamente las instrucciones disponibles en la web de la convocatoria para rellenar correctamente el  CVA \nParticipación en diversos proyectos de investigación europeos y nacionales. \nParticipación en la escritura de más de 50 documentos técnicos en el contexto de proyectos \nde investigación europeos y nacionales. \n \nParticipación en diferentes comités de programa de revistas, conferencias y workshops \ninternacionales de prestigio en el área de Ontologías y Web Semántica.  \nOrganización de diferentes eventos internacionales (conferencias, sesiones especiales, \ntutoriales y workshops) en el área de Ontologías y Web Semántica. \n \nProfesora asociada y profesora ayudante en la Facultad de Informática de la Universidad \nPolitécnica de Madrid (UPM) impartiendo diferentes asignaturas. \nProfesora ayudante doctora en la Escuela Técnica Superior de Ingenieros Informáticos \n(UPM) impartiendo diferentes asignaturas. \n \nImpartición de diferentes cursos (tanto en inglés como en castellano) en el ámbito de la \nInteligencia Artificial y de la Ingeniería Ontológica. \n \nAsistencia a diferentes cursos de formación, uno de ellos centrado en la formación del \nprofesorado universitario. \n \nTutora y co-tutora de diferentes tesis de master, proyectos de fin de carrera, y tesis fin de \ngrado en la Facultad de Informática y en la Escuela Técnica Superior de Ingenieros \nInformáticos (UPM). \n \nCo-directora de una tesis doctoral presentada en Febrero de 2016. \n \nFormadora en un curso englobado dentro del Plan FIP 2002 de la Comunidad de Madrid. \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nC.1. Publicaciones \n \n \nM.C. Suárez-Figueroa, A. Gómez-Pérez, M. Fernández-López. Scheduling ontology \ndevelopment projects. Data & Knowledge Engineering (journal). Volumen: 102. Páginas: \n1-21. March 2016. Elsevier  \n \nM.C. Suárez-Figueroa, A. Gómez-Pérez, M. Fernández-López. The NeOn Methodology \nframework: A scenario-based methodology for ontology development. Applied Ontology \n(journal). Volumen: 10, Nº.2. Páginas: 107-145. 2015. IOS Press \n \nA. Gómez-Pérez, M. Poveda-Villalón, M.C. Suárez-Figueroa. Ontologías, Datos \nEnlazados (Linked Data) y Web Semántica. Big intelligence. Nuevas capacidades big \ndata para los sistemas de vigilancia Estratégica e Inteligencia Competitiva. Páginas: 112-\n131. 2015. ISBN: 978-84-15061-61-8    \n \nC.M. Keet, M.C. Suárez-Figueroa, M. Poveda-Villalón. Pitfalls in Ontologies and TIPS to \nPrevent Them. Knowledge Discovery, Knowledge Engineering and Knowledge \nManagement. \nVolumen: \n454. \nPáginas: \n115-131. \n2015. \nSpringer-Verlag. \nDOI: \n10.1007/978-3-662-46549-3 8 \n \nM. Poveda-Villalón, A. Gómez-Pérez, M.C. Suárez-Figueroa. OOPS! (OntOlogy Pitfall \nScanner!): An On-line Tool for Ontology Evaluation. International Journal on Semantic \nWeb and Information Systems (IJSWIS). Volumen: 10(2). Páginas: 7-34. 2014. IGI \nPublishing.  \n \nA. Jimenez, M.C. Suárez-Figueroa, A. Mateos, A. Gómez-Pérez, M. Fernández-López. \nA MAUT Approach for Reusing Domain Ontologies on the Basis of the NeOn \nMethodology. International Journal of Information Technology & Decision Making. \nVolumen:12(5). Páginas: 945-968. 2013. World Scientific Publishing Company \n \nM.C. Suárez-Figueroa, G. Aguado de Cea, A. Gómez-Pérez. Ligths and shadows in \ncreating a glossary about ontology engineering. Terminology. International Journal of \nTheoretical and Applied Issues in Specialized Communication. Volumen: 19(2). Páginas: \n202-236. 2013. John Benjamins Publishing Company  \n",
  "speaker": "SYSTEM",
  "uuid": "dd9c1f8b-0f64-4d2e-b291-b7141831ded6"
}