{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 4\nservice, national and local governments; and European commission and the \ngovernments of EU countries. \n• \nCompetency Questions. These questions and their answers are both used to \nextract the main concepts and their properties, relations and formal axioms of the \nontology. We have identified sixty competency questions; they are described in \ndetail in [14]. An example of the competency questions is: Given the personal \ninformation (name, nationality, birth date, contact information) and the \nobjectives (desired contract type, desired job, desired working conditions, \ndesired salary) of the job seeker, what job offers are the most appropriate?. \n• \nTerminology. From the competency questions, we extracted the terminology that \nwill be formally represented in the ontology by means of concepts, attributes and \nrelations. We have identified the terms (also known as predicates) and the objects \nin the universe of discourse (instances); they are described in detail in [14]. \n3.2 Standards selection. \nIn order to choose the most suitable human resources management standards for \nmodeling CVs and job offers, the following aspects have been considered: The degree \nof coverage of the objects identified in the previous task, this aspect has been \nevaluated taking into account the scope and size of the standard. However, a too wide \ncoverage may move us further away from the European context; therefore we have \ntried to find a tradeoff between this aspect and the following one: the current \neuropean needs, it is important that standard focuses on the current European reality, \nbecause the user partners involved in SEEMP are European, and the out coming \nprototype will be validated in European scenarios; and the user partners \nrecommendations, in order to asses the quality of the standards, the opinion of the \nuser partners is crucial since they have a deep knowledge of the employment market.  \nBesides, when choosing the standards, we also took into account that the user \npartners of SEEMP selected the ICT domain for the prototype to be developed in \nSEEMP. Hence, the chosen standards should cover the ICT domain with an \nacceptable degree. In the case of the occupation taxonomy, as it will be shown, we \nhave chosen one standard, but then we have taken some concepts coming from other \nclassifications, in order to obtain a richer classification for the ICT domain. \nWhen specifying job offers and CVs, it is also necessary to refer to general purpose \ninternational codes such as country codes, currency codes, etc. For this aim, the \nchosen codes have been the ISO codes, enriched in some cases with user partners’ \nclassification. \nFinally, the representation of job offers and CVs also require temporal concepts \nsuch as interval or instant. So, in order to represent these concepts in the final \nReference Ontology, the DAML time ontology3 was chosen.  \n                                                           \n3 http://cs.yale.edu/homes/dvm/daml/time-page.html \n",
  "speaker": "SYSTEM",
  "uuid": "decbcbb7-3557-4f89-beea-e79779a7db21"
}