{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 98\nPage 98 of 124\nNeOn Integrated Project EU-IST-027595\nFigure 6.3: Merging Strategy with threshold 0.5\nsimLexical(e1, e2) is the similarity between the lexical information of two entities, i.e., their labels and lo-\ncalnames, computed with the Levenshtein distance metric. simGraph(e1, e2) is the similarity of the entities’\nneighbourhoods, where the similarity of each neighbourhood element is computed based on string similarity.\nBecause we consider the similarity of the semantic neighbourhoods more important than the similarity of the\nlabels, we set the weights as Wl = 0.3 and Wg = 0.7. Note that these weights will be ﬁne-tuned through\nsystematic experiments.\nIf the similarity between two entities is higher than a threshold we merge them in one entity by integrating\ntheir neighbourhoods into one. Then we repeat the process until all entities are sufﬁciently different from\neach other, i.e., their similarity falls under a chosen threshold.\nConsider for example Fig. 6.3 where ﬁve SWEs e1,5 are compared against a threshold value of 0.5. We start\nby performing their pair-wise comparison and observe that the pairs (e1, e4), (e1, e5), (e2, e3) and (e2, e5)\nhave a similarity equal or above the set threshold. We proceed by merging the ﬁrst two entities with the\nhighest similarity, e1 and e5, to one entity e1+e5 and compute the similarities between the new entity and the\nremaining ones. This process continues until all similarities are lower than the set threshold, which implies\nthat the obtained entities are sufﬁciently different.\nOnce the merged entities are created we enrich the tag with the relevant entities. This is done by comparing\nthe ontological parents of the merged entity with the hypernyms retrieved from WordNet. The ontological\nparents are the superclasses of classes, the superproperties of properties and the classes of individuals.\nFor example, as shown in Fig. 6.4, the tag moon is enriched with two entities. The superclasses of both the\nentities have as localname one of the hypernyms extracted from the WordNet sense of moon. Also, apart\nfrom the semantic deﬁnition of the tag with the respective entity, we further enrich the tag with the information\ncarried by the entity, EarthsMoon TypeOf Moon.\nAs depicted in Fig. 6.1 Phase 3 of FLOR includes also the Relation Discovery Step. This is done by the\nSCARLET 3 Relation Discovery tool. SCARLET is able to take as input any two SWEs and identify the\nrelations between them by searching in online ontologies. At the moment SCARLET and FLOR haven’t been\nintegrated yet in order to provide an interconnected semantically enriched tagset as a proper ontological\nstructure. This is part of our future work. Currently the output of FLOR is a tagset enriched with a set of\nSWEs describing it as depicted in Fig. 6.1.\n6.1.4\nExample: FLOR Enrichment\nIn this section we present a full cycle of the FLOR semantic enrichment method for the tag lake, which was\nfound in the following ﬁve tagsets:\n• {rush, lake, pakistan, rakaposhi, mountain, asia, kashmir, snow, glacier, green,\n3http://scarlet.open.ac.uk/\n",
  "speaker": "SYSTEM",
  "uuid": "def27938-6c45-4cb4-b937-3a5d3e583fec"
}