{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ARL_Issues \n\nARL Ontology Issues\n\nN\nReported Date\nSubOntology\nDescription\nStatus\nAction\nAction Date\nDeveloper\n1\nJuly 1, 2007\nJob Seeker\nEl concepto candidacy tiene una propiedad llamada “has_objective ofType ICT_Objective”. MI duda es si el tipo debería ser Objective en lugar de ICT_Objective? Como esta ahora solo se podría asociar instancias de ICT_Objective y no de Objective (eso creo debido a que Objective es superclase de ICT_Objective)\nSolved\nCambiar el tipo ICT_Objective por Objective\nJuly 1, 2007\nAndres\n2\nJuly 1, 2007\nJob Seeker\nCual es la cardinalidad de has_objective?\nSolved\n(0 n)\nAndres\n3\nJuly 1, 2007\nJob Seeker\nEn el concepto offered_work_experience los datos years_in_sector y years_in_occupation están en el tag professione y este pertenece a la lista professioni_lst,  los demás datos se encuentra en el tag esperienza que pertenece a la lista esperienze_lst, no hay ninguna relación entre los datos de professione y esperienza asi que no se como asignar valores a los dos campos en cuestión. Por ahora me limitare a los valores que puedo obtener de esperienza.\nSolved\nEstos datos pasan a hacer parte del concepto objective que se relaciona con el elemento professione\nAndres\n4\nJuly 1, 2007\nJob Seeker\nEl concepto worker_state, creo que debería llamarse worker_status\nSolved\nAndres\n5\nJuly 1, 2007\nJob Seeker\nLas instancias de worker_state no tienen el memberOf asi que les añadiré al final memberOf Worker_state (o status)\nSolved\nAndres\n6\nJuly 1, 2007\nJob Seeker\nEn el concepto Objective tenemos las propiedades has_work_time, has_contract_type, has_location  con cardinalidad (0 1) en los xmls pueden venir mas de una instancia para estos atributos.\nTomo solo el primer valor para cada una de las propiedades?\nSolved\nSe crea un objetivo para cada horario de trabajo, tipo de contrato, ubicación, profesion y sector\nAndres\n7\nJuly 1, 2007\nJob Seeker\nLos conceptos objective y Offered_Work_Experience tienen las propiedades has_job_category y has_activity_sector, si tuviéramos que por ejemplo una instancia de bll_occupation que fuera un objetivo y una experiencia de trabajo, tendría dos declaraciones de la misma instancia, me entiendes? Esto es soportado o es un error?\nSolved\nBoris queda de averiguar con Mick acerca de este caso. NO hay problema\nAndres\n8\nJuly 1, 2007\nJob Seeker\nEn el concepto candidacy tenemos la propiedad has_education de tipo BLL_Education y este concepto (BLL_education) tiene a su vez las relaciones has_education_field y has_education_level que se corresponde con los tags formazione_lst(Opcional) e istruzione_lst(Obligatorio). estos dos tags son independientes asi que no hay forma de relacionar una formacion con una instrucción. En los XMLs que envían de ejemplo nunca viene el tag formazione_lst.\nLa pregunta es, solo tengo en cuenta el tag istruzione_lst y establezco el nivel con el que se ha definido como default?\nSolved\nCrear ua instancia de bll_education para formazion y otra para instruzione\nAndres\n9\nJuly 1, 2007\nJob Offer\nCon respecto a los conceptos Vacancy y RequestedWorkExperience\nencuentro que ambos tienen una propiedad llamada has_activity_sector.\nEn los xmls q tengo de ejemplo asi como en los documentos donde se \nexplican los campos que vienen en los XMLs de ARL solo se tiene esta \ninformación en la etiqueta professione id xx.xx.xx.xxx.xxx Me \nsurgen dos preguntas:\n1.      tomo esta profesión como la relación has_activity_sector en \nlos dos conceptos? O en cual de los dos conceptos vamos a dejar la \nrelación?\nPasaría lo mismo con has_job_category.\nRespuesta Jaime:\nAhora mismo sería redundante, pq el xml representa años de exp en el mismo sector y en la misma profesión para la q se solicita a alguien. \nFíjate q la RO es más expresiva q el xml de BLL pq permite representar años de exp en un sector o en una prof distinta de la q se solicita gente.\nCon vistas a q en el futuro, el xml de BLL permita afinar más al representar la exp, decidí mantener la redundancia.\nLo q habría q hacer es definir un axioma q fuerce a q ambas instancias sean iguales. Lo q faltaría entonces sería el axioma. Gracias al axioma, sólo tienes q definir el mapping para una de las dos, pq la otra la va a deducir el razonador. Para definir el axm, fíjate en como están definidos los axiomas para las relaciones invs.\nSolved\nBoris y Andres quedan de hacer el axioma.\nAndres\n10\nJuly 1, 2007\nJob Offer\nParece que la relación entre Vacancy y\nRequestedWorkExperience es uno a uno, en la ontologia aparece con \ncardinalidad (0..2)\nSolved\nRespuesta Jaime\nPonla como (0 1). Al principio pensé utilizar (0 2) para aprovechar más la RO, pero luego cambié de opinión y decidí hacerlo de otra manera y se me olvidó cambiar la card\nAndres\n11\nAugust 7, 2007\nJob Seeker\nEn el concepto Candidacy no hay forma de establecer cual es la lengua madre (Mother tongue)\nSolved\nBoris: cambiar la cardinalidad de la relación de (1 n) a (0 n)\nAndres\n12\nAugust 7, 2007\nJob Seeker\nEn el concepto Candidacy la propiedad speaks esta duplicada con la información de Competence\nSolved\nBoris: Quitar speaks y dejar solo la de competence\nAndres\n13\nAugust 7, 2007\nJob Seeker\nEn el concepto Candidacy las propiedades disponibilidad de coche y disponibilidad de viajar hacen parte\nde la lista <professione> que a su vez hace parte de la lista <professioni_lst>, se debe tomar solamente la primera ocurrencia?\nSolved\nEstos datos pasan a hacer parte del concepto objective que se relaciona con el elemento professione\nAndres\n14\nAugust 7, 2007\nJob Seeker\nEl nombre de la instancia de job seeker deberia incluir el id del documento?\nSolved\nBoris: Si\nAndres\n14\nAugust 7, 2007\nJob Offer\nen vacancy la relación has_education tiene cardinalidad (0 1), resulta que este concepto se compone de dos relaciones, has_education_field y has_education level que se corresponden con dos elementos xml diferentes y no relacionados, istruzione y formazione, debido a esta correspondencia independiente se decidio crear dos instancias de bll_education pero esto no seria posible por la cardinalidad de la relación has_education.\nSolved\nBoris: Si\nAndres\n15\nAugust 24, 2007\nJob Seeker\nla propiedad has_objective en Candidacy se basa en el elemento <professioni_lst><professione>, por cada uno de sus elementos se crea un objetivo, y alguno de estos elementos puede ser una lista, por ejemplo <orari_lst>. En el momento de reconstruir el xml a partir de la ontologia aparece el problema, si originalmente habia mas de un <professione> se deben haber creado objetivos independientes, por tanto es imposible de reconstruir todos los elementos <professione>, se reconstruiria uno solo.\nSolved\nSe crea una instancia de objetivo por cada elemento professione y se cambian las cardinalidades de las relaciones a (0 *) para las relaciones has_work_time,has_contract_type y has_location\nAndres",
  "speaker": "SYSTEM",
  "uuid": "df471226-dd01-4431-bc6b-a7c71aceede7"
}