{
  "message": "SYSTEM: Ejercicios.pdf: Página 15\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n15 \nEjercicio 7    (3 puntos, 45 minutos) \n \nUna tienda de coches tiene un portal que aconseja a sus clientes qué coche comprar en función \nde sus preferencias.  Se tiene información de los siguientes modelos: \n \n \nPrecio  \n \nTamaño \nMaletero \nNúmero \ncaballos \nABS \nConsumo \nModelo-1 \n12.000 \npequeño \n65 \nno \n4,7 \nModelo-2 \n12.500 \npequeño \n80 \nsí \n4,9 \nModelo-3 \n13.000 \nmediano \n100 \nsí \n7,8 \nModelo-4 \n14.000 \ngrande \n125 \nsí \n6 \nModelo-5 \n15.000 \npequeño \n147 \nsí \n8,5 \n \n \n El portal proporciona  a los clientes un formulario con las siguientes preguntas: \n \n1. ¿qué cantidad en euros desea gastarse? \n2. ¿busca un maletero pequeño, mediano o grande? \n3. Como mínimo, ¿Cuántos caballos debe tener el coche? \n4. ¿Desea ABS? \n5. Como máximo, ¿Cuánto debe consumir el coche a los 100 km? \n \nEl usuario puede responder a todas las preguntas del formulario, pero también puede dejar \nalgunas preguntas sin responder. En este caso,  por defecto se considera: \n \nQue el precio del coche no es superior a 13.000 euros \n \nQue el maletero del coche es grande \n \nQue el coche tiene 80 caballos, o más. \n \nQue tiene ABS \n \nQue el consumo a los 100 km  debe ser, como máximo de 8 litros. \n \nUna vez rellenado y enviado el formulario a la tienda virtual,  el sistema introduce las \npreferencias del cliente en su base de conocimientos e infiere qué coche comprar.  \n \n \n1)  Dibujar un  Sistema Basado en Marcos que represente el problema, indicando todas las \nrelaciones, propiedades de clase y de instancia de cada marco clase. (1 punto) \n \n2.) Representar de forma tabular  el marco Cliente  y el marco coche modelo1  (1  punto) \n \n3) Desarrollar el valor activo que infiere el tipo de coche que compra el cliente e indicar en qué \nfaceta de qué propiedad va incluido. ( 1 punto) \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "df6b9607-edc0-4a5b-8d09-8f16920efbd8"
}