{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle EG1: Generación de mapas de contaminación lumínica\n- Description EG1: En este proyecto el alumno deberá construir una API REST y un pequeño formulario web responsive que permita el envío de un fichero con mediciones realizadas por el fotómetro  (\nTESS-P\n) o SQM. Una vez recibido el fichero, el sistema deberá generar el mapa de forma automática mediante un script que se le proporcionará al alumno. El sistema deberá permitir gestión de usuarios, de forma que se puedan visualizar los mapas generados por cada uno de ellos. Para más información\nNIXNOX Project\n- Funding schema: not funded\nTitle EG2: Caracterización de mapas de contaminación lumínica\n- Description EG2: En este proyecto el alumno deberá,  partiendo de mapas de contaminación lumínica generados en el proyecto\nNIXNOX Project\n, identificar las fuentes que están produciendo dicha contaminación, especialmente ciudades y polígonos industriales. Para ello hará uso de fuentes externas tal como DBPedia, Wikidata u Open Street Map.\n- Funding schema: not funded\nTitle EG3: Plataforma para homogeneizar la información de elementos urbanos\n- Description EG3: El objetivo de este proyecto es desarrollar una plataforma que permita analizar y visualizar la información disponible de un elemento urbano desde distintas fuentes de información. El caso de uso se centrará en las farolas y la información disponible de ellas en OpenStreetMap, Portales de Datos Abiertos y Epicollect5.\n- Funding schema: not funded\nTitle EG4: Generador de informes medioambientales\n- Description EG4: El objetivo de este proyecto es crear una serie de plantillas para generar informes medioambientales en PDF de forma automática. Para ello, se hará uso de los datos procedentes de una red de sensores de contaminación lumínica disponibles en la plataforma (\nTESS\n)).\n- Funding schema: not funded\nTitle EG5: Bot de telegram para caracterizar farolas.\n- Description EG5: El objetivo de este proyecto es desarrollar un bot para telegram que permita registrar observaciones de los usuarios sobre un determinado elemento urbano. El usuario podrá adjuntar imágenes a dichas observaciones. El ámbito de aplicación serán fuentes de iluminación. Con la ayuda del bot, el usuario será capaz de identificar las farolas y proporcionar información relevante sobre ella como color, horas de funcionamiento, estado, altura, etc ...\n- Funding schema: not funded\nMaría Poveda-Villalón\n\nTitle MP1: Ontology visual representation analysis and library generation\n- Description MP1: El objetivo de este proyecto es analizar las distintas formas de visualización de ontologías comúnmente utilizadas analizando su adecuación al lenguaje de representación de ontolgoías OWL.  A partir de dicho análisis se generará una librería de plantillas de vidualización de ontologías siguiendo distintos sistemas de representación gráfica de conocimiento. Finalmente, estas librerias se integrarán para su ejecución y generación de documentación en el sistema de gestión colaborativa para el desarrollo de ontologías OnToology.\n- Funding schema: not funding available so far\nMaría Poveda - Pablo Calleja\n\nTitle MP2: Explotation of Semantic Graphs for Entity Linking and Word Sense Disambiguation\n- Description MP2: El objetivo de este proyecto es desarrollar un algoritmo capaz de explotar grafos semánticos para tareas de Entity Linking y Word Sense Disambiguation. El proyecto partirá de los grafos BabelNet y WordNet para dichas tareas pero el objetivo final es que dicho algoritmo pueda ser exportado y adaptado (con cambios mínimos) a otros grafos semánticos (e.g., SNOMED-CT). El proyecto parte de algoritmos ya implementados para ambas tareas y se pretende mejorar su precisión y adaptabilidad mediante nuevas técnicas para el procesamiento del lenguaje natural y navegación por grafos que han aparecido en los últimos años.\n- Funding schema: not funding available so far\nCarlos Badenes-Olmedo\n\nTitle CB1: Unsupervised Cross-lingual Conceptualization\n- Description CB1: Most text mining algorithms represent documents in a common feature space that abstracts away from the specific sequence of words used in them. Probabilistic Topic Models reduce that feature space by annotating documents with thematic information. However, this information is expressed as probability distributions over the complete vocabulary, making it more difficult to interpret. This TFM will design an algorithm that summarizes the meaning of a topic through multi-lingual concepts.\n- Funding schema: perhaps TheyBuyForYou\nTitle CB2: Measuring the Human Perception of Textual Similarity\n- Description CB2: Finding or synthesizing value from a subset of closely related documents can be especially difficult when navigation between documents is based on metadata such as a timestamp of last update, rather than topics contained within the documents. Many of topic-based technologies depend on measures of similarity between documents without clear validation that the algorithmic measures being used match human perceptions of similarity. This TFM will build a benchmark to measure how well various similarity measures match human perceptions when they are being used to help humans navigate through a large set of documents.\n- Funding schema: perhaps TheyBuyForYou\nTitle CB3: Semantic-based Navigation through Documents\n- Description CB3: Searching for similar documents and exploring major themes covered across groups of documents are common actions when browsing collections of scientific papers. This TFM will provide a web-based solution to explore large collections of documents from their semantic annotations.\n- Funding schema: perhaps TheyBuyForYou\nOscar Corcho\n\nTitle OC1: \"Characterisation of senior citizen mobility in the region of Madrid\".\n- Description OC1: The public transport card is used widely in the region of Madrid. The data about card validations is managed by CRTM (Consorcio Regional de Transportes de Madrid), with a predefined structure and data attributes that ensure anonimicity and at the same time may allow for further exploitation. One of the interests of the accessbility office at CRTM is to understand the behaviour of senior citizens with respect to their usage of public transport. Therefore, they provide us data to make this analysis, which has already been translated to a TFM in the course 2018-2019. The objective of this master thesis is to continue with the work done in that thesis and apply new techniques plus reproduce already done experiments with new data from this year.\n- Funding schema: not funded\nTitle OC2: \"Ontology modelling from XML Schema documents and/or UML models\"\n- Description OC2: There are several situations where the ontology development process may be done almost directly from other existing models, such as XML Schema or UML models. While the automatic translation from one model to another may seem simple and intuitive (a UML class will be normally transformed into an OWL class, or an XML Schema complexType will probably be transformed also as a class) there are lots of cornercases that need to be considered when performing such translation so that the final result is clean enough to be provided to an ontology engineer to continue working on the ontology development process. This TFM will focus on analysing the outputs of existing tools that perform this activity, identifying the errors and situations where this does not work, based on real developments done in the context of the transport domain, and design and implement algorithms for a more robust and clean transformation process. The work done may have the opportunity to be published in a knowledge engineering conference like EKAW.\n- Funding: SPRINT\nDavid Chaves",
  "speaker": "SYSTEM",
  "uuid": "dffe24b7-638f-434d-a63a-0a8ff8e79ec5"
}