{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Wache_et_al-survey \n\nContents\n[\nhide\n]\n1\nOntology-based Integration of Information -- A Survey of Existing Approaches\n1.1\nPaper scope\n1.2\nCriterions for evaluation\n1.3\nHeterogeneity problem\n1.4\nRole of ontology\n1.4.1\nContent explication\n1.4.1.1\nSingle ontology approaches\n1.4.1.2\nMultiples Ontologies\n1.4.1.3\nHybrid Approaches\n1.4.2\nAdditional Roles of Ontologies\n1.4.2.1\nQuery Model\n1.4.2.2\nVerification\n1.5\nOntology Representation\n1.6\nUse of Mappings\n1.6.1\nConnection to information sources\n1.6.1.1\nStructure Resemblance\n1.6.1.2\nDefinition of Terms\n1.6.1.3\nStructure Enrichment\n1.6.1.4\nMeta-Annotations\n1.6.2\nInter-Ontology Mapping\n1.6.2.1\nDefined Mappings\n1.6.2.2\nLexical Relations\n1.6.2.3\nTop-Level Grounding\n1.6.2.4\nSemantic Correspondence\n1.7\nOntology Engineering\n1.7.1\nDevelopment Methodology\n1.7.2\nOntology Evolution\n1.8\nOpen Questions\nOntology-based Integration of Information -- A Survey of Existing Approaches\n\nH. Wache, T. V ̈ gele, U. Visser, H. Stuckenschmidt, G. Schuster, H. Neumann and S. Hubner\nhttp://www.let.uu.nl/~Paola.Monachesi/personal/papers/wache.pdf\nPaper scope\n\nsurvey of exiting approaches on ontology-based information integration,\nanalyses 25 approaches including: SIMS, TSIMMIS, OBSERVER, CARNOT, Infosleuth, KRAFT, PICSEL, DWQ, Ontobroker and SHOE.\ndoes NOT consider integration of knowledge bases.\nCriterions for evaluation\n\nUse of ontologies: role and architecture of ontologies\nOntology representation\nUse of Mappings\nOntology engineering: development and reuse of ontologies.\nHeterogeneity problem\n\nstructural and semantic heterogeneity [Kim and Seo, 1991][Kashyap and Sheth, 1996a]\nthree causes of semantic heterogeneity : confounding conflicts, scaling conflicts, naming conflicts [Goh, 1997]\nused of ontologies to achieve semantic interoperability [Uschold and Gruniger, 1996]\nRole of ontology\n\ndescribe the semantics of the information sources to achieve correspondance.\nhowever, in some projects ontologies take over additional tasks.\nContent explication\n\nthree different ways of how ontologies are used to make explicit the semantics of the info source:\nsingle ontology.\nmultiple ontologies.\nhybrid approaches.\nSome approaches provide general framework where all three can be implemented (DWQ [Calvanese et al., 2001])\nSingle ontology approaches\n\none global ontology providing a share vocabulary for the specification of the semantics.\nthe global ontology can also be the combination of several specialized ontologies (modularization)\nthe combination is supported by the ontology representation formalism.\nsingle ontology approach can be applied when all information sources provide nearly the same view on a domain.\nhowever, when they have different view on a domain (e.g. different level of granularity), finding the minimal ontological commitment becomes a difficult task.\nMultiples Ontologies\n\neach information source is described by its own ontology.\nin OBSERVER sources are described by a \"source ontology\".\nIt is not assumed that different \"source ontologies\" will share the same vocabulary.\nthe advantage is that no minimal ontological commitment is needed.\nthis approach also simplifies adding and removing sources\nthe disadvantage is that, in reality, the lack of common vocabulary makes it extremely difficult to compare different source ontologies.\nto overcome this problem a formalism for inter-ontology mapping is provided.\nthis mapping define semantically corresponding terms of different source ontologies.\nhowever, this mapping has to also consider different views of the domain. The authors believe that this inter-ontology mapping is very difficult to define.\nHybrid Approaches\n\nsource ontologies are build upon a global shared vocabulary [Goh, 1997][Wache et al. 1999]\nshared vocabulary provides primitive terms.\nshared vocabulary is sometimes an ontology [Stuckenshmidt et al 200b]\nin COIN [Goh, 1997] description of local information is given by a attribute value vector using the terms from the global voc.\nin MECOTA [Wache et al. 1999] each source information is annotated with labels that indicates the semantics of the information.\nthe label combines terms of the global ontology using operator similar to those in DL, but extended with integration specific operators.\nIn BUSTER [Stuckenshmidt et al. 2000b] shared voc. is an ontology.\nsource ontology is a (partial) refinement of the general ontology.\nThe advantage of the hybrid approach is that new sources can easily be added without the need of modification of existing mappings.\nThe use of the shared voc. makes the sources ontologies comparable avoiding the disadvantages of multiple ontologies.\nAdditional Roles of Ontologies\n\nQuery Model\n\nSome integration approaches use the ontology as a global query shema. (e,g, SIMS)\nAdvantages of using the ontology as query model is that it should be easier for the user to express queries, given that the ontology correspond more the user's appreaciation of the domain.\nVerification\n\nIt is ideal to be able to automatically verified that mappings are correct.\nquery containment can be used for such verification.\nIn DWQ [Calvanese et al. 2001] each source is assumed to be a collection of relational tables.\nEach table is described in terms of its ontology using conjunctive queries.\nA global query and the decomposed sub-query can be unfolded to their ontology concepts.\nHence, the sub-query is correct if it is contained in the global query (i.e if its ontology concept is subsumed by the global ontology concept)\nPICSEL [Goasdoue et al. 1999] can also verify mappings and it can geneate mapping hypotheses automatically which are validaded with respect to the global ontology.\nThe quality of the verification taks strongly depends on the completeness of an ontology.\nSince the completeness cannot be measured it is impossible to make any statement about the quality of the verification.\nOntology Representation\n\nDL variants is largley the most used formalicim for ontology representation between the evaluated systems.\nthese include CLASSIC [Borgida et al., 1989] used by OBSERVER, SIMS, and the work of Kashyap and Sheth.\nother terminological languages used are: GRAIL[Rector et al., 1997] (the Tambis Approach [Stevens at al. 2001], LOOM [MacGregor, 1991] and OIL [Fensel et al., 2000] used in BUSTER [Stuckenschmidt and Wache, 2000]\nPICSEL used CARIN, a DL extended with function-free horn rules [Goasdoue et al., 1999].\nDWQ [Calvanese et al., 2001 used AL-log, a convination of a simple description logics with Datalog is also used [Donini et al., 1998]\nthe Logic DLR a description logic with n-ary relations is used for information integration in the same project.\nThe integration of DL with rue-based reasoning makes it necessary to restrict the expressive power of the terminological part of the language in order to remain decidable [Levy and Rousset, 1996]\nFrame-based languages are also used by systems such as COIN[Goh, 1997], KRAFT[Preece et al., 1999], Infosleuth[Woelk and Tomilinson, 1994], and Infomaster[Genesereth et al., 1997].\nLanguages used are: Ontolingua[Gruber, 1993] and OKBC[Chaudhri et al. 1998], F-Logic[Kifer et al., 1995]\nUse of Mappings\n\nMappings are entities that serve as glue between the ontology and other parts of the application system.\nTwo uses of mappings: mappings between ontologies and the information they describe, and mappings between different ontologies used in a system.\nConnection to information sources\n\nrelates ontologies and the actual contents of an information source.\nmay relate to the database schema but also to single terms used in the database.\nthe following approaches are used:\nStructure Resemblance\n\nproduce a one-to-one copy of the structure of the database and encode it in a language that makes automated reasoning possible.\nintegration is performed on the copy of the model and can easily be tracked back to the original data. (?????????)\nused by SIMS and TSIMMIS[Chawathe et al., 1994]\nDefinition of Terms",
  "speaker": "SYSTEM",
  "uuid": "e0506eef-94e4-482d-8a2f-ea36b40c5e40"
}