{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nDocumentos de trabajo\n2\nServicios disponibles\n3\nReuniones\n4\nProyectos relacionados\n5\nPublicaciones\n6\nIndicadores informe segundo año\nDocumentos de trabajo\n\nLibros sobre Web Services\nhttp://rodrigo.lagomanteiga.googlepages.com/geobuddies\nServicios disponibles\n\nCobertura 3G:\nOrange\nEjemplos de integración de clientes ligeros sobre varios servidores de mapas\n- openlayers (WMS):\nhttp://vsaquicela.googlepages.com/\n- mapbuilder y openlayers (WMS,WFS):\nhttp://castor.dia.fi.upm.es:8080/mapbuilder/examples/geobuddies/\n- mapbuilder (WMS,WFS-T local):\nhttp://castor.dia.fi.upm.es:8080/mapbuilder/examples/geobuddies-wfs-t/\n- mapbuilder (flickr):\nEjemplos de servidores de mapas\n- Geoserver raster y vectorial (postgis y shapefile) :\nhttp://castor.dia.fi.upm.es:8080/geoserver/mapPreview.do\n- Web Map Service con ortofotos:\nhttp://localhost:8080/mapbuilder/examples/geobuddies/\nUsar\nhttp://www.idee.es/wms/PNOA/PNOA?SERVICE=WMS&VERSION=1.1.1&REQUEST=GetCapabilities\ncomo servidor de mapas\n- Web Map Service del proyecto CartoCiudad (Callejero urbano de ámbito nacional) del IGN\nUsar\nhttp://www.cartociudad.es/wms/CARTOCIUDAD/CARTOCIUDAD\nClientes moviles para visualizar mapas\n- JVNmobileGis (probado en blackberry 8220 con mapas del IGN)\nhttp://code.google.com/p/jvnmobilegis/\nReuniones\n\nReunión plenaria 1\nMadrid, 23 Octubre 2007\nReunión plenaria 2\nMadrid, 15 Enero 2008\nReunión bilateral UPM-IGN\nMadrid, 28 Enero 2008\nReunión plenaria 3\nSantiago, 4 Abril 2008\nReunión técnica\nSantiago, XXX\nAudioconferencia\n14 Noviembre 2008\nReunión plenaria 4\nMadrid, 16 Enero 2009\nProyectos relacionados\n\nhttp://www.cewe-photobook.com\n,\nhttp://www.smilebooks.es/\nA good application for creating the photobook\nhttp://www.mobiexplore.com/\nhttp://www.mobots.org/\nhttp://www.ctmd.deusto.es/dsg/\nRedes sociales: facebook, myspace, Tuenti (\nhttp://www.tuenti.com/\n)\nViajes Web 2.0:\nhttp://www.dopplr.com/\n,\nhttp://www.minube.com/\nTop 40 Free Downloadable Open Source Social Networking Software:\nhttp://www.vivalogo.com/vl-resources/open-source-social-networking-software\nPublicaciones\n\nAtelier Construction d'Ontologies. Tunisia\nIndicadores informe segundo año\n\n3.1   Personal en formación  (x doctores, z másters, w ingenieros)\nSe están dirigiendo X tesis doctorales:\n•\tD. Hector Andrés García Silva (UPM), becario FPI (BES-2008-007622) desde el 1 de octubre de 2008, siendo la temática de la tesis Asociación Semántica de Etiquetas y Evolución de Ontologías, y los codirectores: Dña A. Gómez-Pérez y D. Oscar Corcho García\n•\tD. Victor Saquicela Galarza(Contratado temporal, UPM) desde el 1 de mayo de 2008, siendo la temática de la tesis la integración de información, basada en ontologías, de fuentes de datos heterogéneas y desconocidas a priori, y el Director de la tesis D. Oscar Corcho García\n•\tD. Luis Manuel Vilches Blázquez (UPM), becario OTT desde el 1 de enero de 2008, siendo la temática de la tesis la generación de una metodología de integración de información, basada en ontologías, de fuentes de datos geográficas, y los codirectores: D. Oscar Corcho García y D. Miguel Angel Bernabé Poveda.\n•\tD. Antonio Pareja Lora (Profesor Colaborador, UCM) desde el de septiembre de 2001, siendo la temática de la tesis anotación semántica, y las codirectoras de la misma Dª. Guadalupe Aguado de Cea y Dª. Asunción Gómez Pérez.\nSe están dirigiendo X tesis de maestría:\n•\tXxxxx\nSe han dirigido X proyectos fin de carrera:\n•\tDña. María Poveda Villalón (UPM) ha defendido su PFC titulado “Red de Ontologías para el Camino de Santiago”, siendo su directora Dña. María del Carmen Suárez de Figueroa Baonza.\n•\tXxxxx\n3.2   Estancias de investigación relacionadas con el proyecto ( X meses):\n•\tHector Andrés García (UPM) ha visitado el grupo IAM (Intelligence, Agents and Multimedia) de la Universidad de Southampton en el Reino Unido, desde el 02 de Marzo al 30 de Mayo de 2009 para trabajar con el Dr. Harith Alani en la desambiguación de etiquetas utilizando DBpedia como recurso semántico. Estancia financiada por el programa Formación de Personal Investigador FPI del ministerio de ciencia e innovación.\n•\tDña. Elena Montiel Ponsoda (UPM) ha visitado el DFKI en Alemania, desde el 18 de octubre de 2008 al 11 de febrero de 2009 para trabajar con el Dr.Paul Buitelaar y el investigador Thierry Declerck en modelos para la representación de información multilingüe en ontologías, y en patrones multilingües para la reutilización de patrones de diseño ontológico. Adicionalmente, la doctoranda ha realizado una estancia en el Natural Language Processing Group de la Universidad de Sheffield en Reino Unido del 26 de julio al 15 de agosto de 2009 para trabajar con la Dra. Diana Maynar en la implementación de patrones multilingües en la arquitectura GATE. Ambas estancias financiadas por el programa propio de la Universidad Politécnica de Madrid (Tarea X).\n•\tAsunción Gómez Pérez (UPM) ha visitado el Knowledge Media Institute de la Open University en el Reino Unido, desde el 17 de Julio al 17 de Agosto de 2009 para trabajar en el equipo del Prof. Dr. Enrico Motta, entre otros aspectos, en algoritmos de descubrimiento de relaciones entre folksonomias y ontologías (Tarea X)\n•\tCatherine Roussey (LIRIS, Francia) ha visitado la Universidad Politécnica de Madrid, desde el 1 de octubre de 2008 hasta el 30 de junio de 2009, para trabajar en el área de depuración de ontologías en el dominio de la hidrografía (Tarea X)\n•\nAlguna otra estancia???\n3.3 Diseminación\nUn resumen de las actividades de diseminación realizadas en este proyecto son las siguientes: x artículos en revistas internacionales, x en confernecias internacionales, x en workshops, x posters en conferencias internacionales, x en confernecias nacionales, x en workshops nacionales, x capítulos de libros, y x tesis doctorales en progreso. One of these posters was awarded as Best Poster in the WWW2006 international conference.\nSe han mantenido dos reuniones de seguimiento con el Instituto Geográfico Nacional, el cual participa activamente en el proyecto mediante el asesoramiento y aporte de diversos servicios web, conformes con Open Geospatial Consortium (OGC), y recursos de información geo-espacial (por ejemplo: la base de datos perteneciente a la Base Topográfica Numérica a escala 1:25.000, denominada BTN25).\nSe ha asistido al  FLaReNet (Fostering Language Resources Network) Launching Event, celebrado en Viena (12-13 de febrero de 2009), con el fin de determinar posibles cauces alternativos de diseminación y cooperación con otros grupos de investigación europeos en: (i) la generación y mantenimiento de los recursos (computacionales) lingüísticos generados durante el proyecto y (ii) la compartición o reutilización de aquellos que no se poseen y son necesarios para la culminación del mismo.\nLa lista de contactos de relevancia establecidos y presentaciones realizadas durante el año 2008 y 2009 es la siguiente:\n-\tUniversidad de Liverpool. Charla invitada. Enero 2008. (UPM)\n-\tUniversidad de Manchester. Charla invitada. Enero 2008. (UPM)\n-\tJornadas Web3.0: semantically powered, organizada por Robotiker Tecnalia. Abril 2008. (USC).\n-\tCurso de Ontologías y Web semántica en el Máster de Tecnologías de la Información, Investigación en IA y en el Máster Erasmus Mundus en Computational Logic. Facultad de Informática. UPM. Curso 2008/2009 y 2009/2010.\n-       Workshop \"Putting Mobile Services into Context\" del ICT-Mobile Summit 2009. Santander. Junio 2009.\n-       Reunión en el castillo de Dagstuhl sobre el futuro de la Web Semántica. Dagstuhl, Alemania. Junio 2009.\nSe han realizado demostraciones del prototipo a las siguientes Instituciones:\n1.\tUniversidades y centros de investigación: Open University (UK), Universidad de Southampton (UK), Stanford University (USA), Rensselaer Polytechnic Institute (USA), EURECOM (FR), Amit??  USC—Manuel\n2.\tEmpresas de desarrollo de software: Intelligent Software Components, Instituto Geográfico Nacional, LikeCube Ltd. (Reino Unido) y Parquesoft (Colombia). USC—Manuel\n3.      Empresas de telefonía: Telefónica I+D, Vodafone\n4.\tAgentes de turismo: USC—Manuel\nEl proyecto ha dado lugar a colaboraciones con grupos de investigación y empresas internacionales, con los que se han mantenido contactos y reuniones de trabajo:\n-\tGrupo Information Management Group de la Universidad de Manchester, con el que la UPM mantuvo una reunión en los primeros meses del proyecto para determinar si era posible extender la expresividad de los lenguajes de consulta basados en lógica descriptiva para el manejo de información heterogénea procedentes de varias fuentes de datos.\n-\tEmpresa Ordnance Survey, del Reino Unido, con la que la UPM mantuvo una reunión para mostrar resultados del proyecto en términos de ontologías desarrolladas, y para obtener también algunas de las ontologías desarrolladas por la empresa en el dominio geográfico.\nLos resultados de estas reuniones y trabajo realizado en ellas fueron mostrados en varias charlas invitadas, como se ha especificado en las secciones anteriores.\nSe han realizado diseminación para el público en general:\n1.\tEn Youtube\nhttp://www.youtube.com/watch?v=dsLNP2alb-U\n2.\tEn radio, entrevista en la COPE en \"La Gran Manzana Ciencia\" para explicar la aplicación para \nmóviles destinada a los peregrinos del Camino de Santiago (\nhttp://www.fi.upm.es/?id=tablon&acciongt=consulta1&idet=254\n)\n3.\tEn el Web site de la Facultad de Informática\nhttp://www.fi.upm.es/?id=tablon&acciongt=consulta1&idet=199\n. Esta nota de prensa ha originado publicaciones en otras webs\no\tACM Tech News 06.05.2009\no\tIllinois Informatics Institute 07.05.2009\no\tThe Web Scene 08.05.2009\no\tTwine 06.05.2009\no\tAlpha Galileo 05.05.2009 (english)\no\tAlpha Galileo 05.05.2009\no\tSINC 05.05.2009\no\tPlica Zaragozame 04.05.2009\no\tUPM Noticias 05.05.2009\no\tEl Camino Digital 09.09.2009\no\tCreer en lo nuestro 20.05.2009\n4. En la web del proyecto europeo NeOn (historia sobre Geobuddies --> MC: se deberia incluir????) url:\nhttp://www.neon-project.org/web-content/index.php?option=com_content&view=article&id=136:applying-the-neon-methodology-to-build-ontology-networks-for-the-way-of-saint-james-\n3.4   Technology transfer\nSe ha registrado el programa de ordenador titulado “GeoBuddies - Camino de Santiago\", presentado en el Registro Territorial de la Propiedad Intelectual de la Comunidad de Madrid con fecha 19 de enero de 2009 y número de registro M-000413/2009, en el que figuran como autores investigadores de la UPM y de la USC.\nSe han establecido contactos con instituciones \nque pueden estar interesadas en los resultados del proyecto, como empresas de telefonía móvil, empresas específicamente relacionadas con el turismo en el Camino de Santiago, empresas proveedoras de contenidos en las zonas geográficas relacionadas con el Camino de Santiago y con el Instituto Geográfico Nacional.\n-\tReunión con el Director de Innovación de Vodafone. Junio 2008. (USC).\n-\tReunión con la Dirección Xeral de Turismo de la Xunta de Galicia. Junio 2008. (USC).\n-       Reunión con el Director de Estrategia Tecnológica de Telefónica I+D. Octubre 2008 (UPM)\n-\tReunión del Grupo de Trabajo de Nuevas Tecnologías en Turismo de la Plataforma Vindeira. Octubre 2008. (USC-UPM).\nTodos estos contactos se han centrado en analizar cómo se pueden incorporar datos en la aplicación para que los usuarios no se encuentren con el “síndrome de la página en blanco” o problema del “cold start”, y cómo se puede conseguir apoyo de empresas de telefonía.\nAlgun contrato o proyecto derivado en \n•\tusc\n3.5   Participation in international projects\nEl Grupo de Ingeniería Ontológica de la UPM ha comenzado durante 2008 y 2009, la ejecución de varios proyectos en ámbitos relacionados con los de este proyecto, para los cuales la experiencia adquirida por el grupo en el transcurso del proyecto ha sido muy relevante:\n-\tEn febrero de 2009, la UPM comenzó el proyecto STREP DynaLearn (FPxxxx), en el dominio del e-learning mediante la utilización de mapas conceptuales que reflejan relaciones de dependencia causal entre unas variables y otras. La relación con este proyecto se encuentra en el área del alineamiento de ontologías y de la recomendación de mapas conceptuales a estudiantes, utilizando los resultados en el alineamiento.\n-\tEn septiembre de 2008, la UPM comenzó a coordinar el proyecto STREP SemsorGrid4Env(FPxxxx), en el dominio de la integración semántica de información procedente de sensores y bases de datos históricas. La relación con este proyecto se encuentra en el área de la integración de información de fuentes de datos heterogéneas y en la utilización de tecnologías Grid para la gestión de la información.\n-\tEn junio de 2009, la UPM comenzó a coordinar el proyecto STREP SEALS(FPxxxx), en el dominio de la evaluación de las tecnologías semánticas. La relación con este proyecto se encuentra en …ASun..\n-\tEn junio de 2009, la UPM comenzó el proyecto ICPS (International Classification of Patient Safety Taxonomy), financiado por la Organización Mundial de la Salud, para el desarrollo colaborativo de ontologías en el área de seguridad del paciente.\nOtros proyectos europeos en los que la UPM participa, pero cuya temática no está relacionada con este proyecto, son: NeOn (FP6-027595), ADMIRE (FPxxxx) and SCALUS (FP7-PEOPLE-238808).\n3.6   Participation in national projects\nEl Grupo de Ingeniería Ontológica de la UPM ha estado involucrado durante 2008 y 2009 en varios proyectos nacionales en ámbitos relacionados con los de este proyecto, para los cuales la experiencia adquirida por el grupo en el transcurso del proyecto ha sido muy relevante.\n- España Virtual (\nhttp://www.españavirtual.org/\n). Proyecto CENIT orientado a la definición de la arquitectura, protocolos y estándares de la futura Internet 3D, con un foco especial en lo relativo a visualización 3D, inmersión en mundos virtuales, interacción entre usuarios y a la introducción de aspectos semánticos, sin dejar de lado el estudio y maduración de las tecnologías para el procesamiento masivo y almacenamiento de datos geográficos. La UPM está trabajando en el área de integración de datos de fuentes geográficas y en la combinación de ontologías y Grids.\n- mIO!: Tecnologías para prestar servicios en movilidad en el futuro universo inteligente. Proyecto CENIT cuyo objetivo es hacer realidad tecnologías que permitan prestar servicios ubicuos en un entorno inteligente y adaptado a cada usuario y a su contexto, usando el terminal móvil como base de interacción tanto con servicios proporcionados por empresas, como con microservicios creados y prestados por los propios usuarios en movilidad. La UPM está trabajando en el aprovisionamiento de tecnologías semánticas y en el desarrollo de ontologías de contexto.\n-\tWebn+1 (U?M)???\n-\tTodos los de USC\nOtros proyectos nacionales en los que la UPM participa, pero cuya temática no está completamente relacionada con este proyecto, son: UPGrid (PROFIT), Buscador semántico para las administraciones públicas (PROFIT).\n3.7   Collaboration with research groups nacionales y extranjeros\nThe Ontology Engineering Group collaborates with all the universities and companies that participate in the projects presented above. These partners are from Austria (1), Belgium (2), France (4), Germany (7), Greece (3), Ireland (1), Italy (8), The Netherlands (3), Poland (1), Slovenia (1), Spain (28), Switzerland (1), and United Kingdom (5). [[ACTUAlizar los numeros .....\n]]\nSantiago-…….\nAdemás faltan todos los nacionales…..\n4  \tReferences\n-\tGómez-Pérez A, Ramos JA, Rodríguez-Pascual AF, Vilches-Blázquez LM The IGN-E case: Integrating through a hidden ontology The 13th International Symposium on Spatial Data Handling (SDH 2008) In Headway in Spatial Data Handling. Lecture Notes in Geoinformation and Cartography, Ruas, A., Gold, C. (Eds.) pp. 417-435. ISBN: 978-3-540-68565-4 Montpellier, Francia 23-25 de junio de 2008.\n-\tGómez-Pérez A, Ramos JA Semantic mappings: out of ontology world limits 1st International Workshop on Ontology Alignment and Visualization (OnAV’08) 3rd International Conference on Availability, Reliability and Security (ARES 2008) 2nd Int. Conf. on Complex, Intelligent and Software Intensive Systems (CISIS 2008) IEEE Press. March 4th - 7th, 2008. Barcelona, Spain. Pages: 907-912. ISBN: 978-0-7695-3109-0\n-\tGarcía-Silva A., Szomszor M., Alani H., Corcho O. Preliminary Results in Tag Disambiguation using DBpedia. En 1st International Workshop in Collective Knowledge Capturing and Representation (CKCaR'09), California, USA, (September 2009)\n-\tRamos JA, Gómez-Pérez A. Mappings for the Semantic Web. IEEE Intelligent Systems. Trends & Controversies (por invitación) Noviembre 2008. Pages: 79-81\n-\tMauricio Espinoza, Asunción Gómez-Pérez and Eduardo Mena, \"Enriching an Ontology with Multilingual Information\", Proc. of 5th European Semantic Web Conference (ESWC'08), Tenerife (Spain), Springer Verlag LNCS, ISBN 978-3-540-68233-2, ISSN-0302-9743, pp. 333-347, June 2008.\n-\tMauricio Espinoza, Asunción Gómez-Pérez and Eduardo Mena, \"LabelTranslator - A Tool to Automatically Localize an Ontology\", Proc. of 5th European Semantic Web Conference (ESWC'08), Tenerife (Spain), Springer Verlag LNCS, ISBN 978-3-540-68233-2, ISSN-0302-9743, pp. 792-796, June 2008. demo paper\n-       Mauricio Espinoza, Elena Montiel-Ponsoda and Asunción Gómez-Pérez, \"Ontology Localization\", in Proc. of the 5th International Conference on Knowledge Capture (K-CAP 2009), California, US (To appear).\n-       Mauricio Espinoza, Asunción Gómez-Pérez, and Elena Montiel-Ponsoda, \"Multilingual and Localization Support for Ontologies\", Proc. of the European Semantic Web Conference (ESWC2009), demo paper, páginas 821-825 (ISBN 978-3-642-02120-6).\n-\tVilches Blázquez, L.M.; Cañete Pérez, J.A.; Corcho, O. y Bernabé Poveda, M.A. Interrelaciones entre las tecnologías de la información geográfica y la ingeniería ontológica para la mejora de la gestión de los recursos geoespaciales. Póster. XIII Congreso Nacional de Tecnologías de la Información Geográfica Web Congreso. Actas del XIII Congreso Nacional de Tecnologías de la Información Geográfica. Hernández Calvento, L.; Parreño Castellano, J.M. (eds.) ISBN: 978-84-96971-53-0. Las Palmas de Gran Canaria, 15-19 de septiembre de 2008.\n-\tVilches Blázquez, L. M.; Ramos Gargantilla, J. Á.; Corcho, O.; Capdevila Subirana, J. Hacia una armonización semántica de la Información Geográfica. II Congreso Catalán de Geografía. En Treballs de la Societat Catalana de Geografia, number 65. ISSN: 1133-2190. Special number dedicated to Segon Congrés Català de Geografia., 29-31 May, 2008 Barcelona, Spain.\n-       Vilches-Blázquez, L. M., Ramos, J. A., López-Pellicer, F. J., Corcho, O., Nogueras-Iso, J. An approach to comparing different ontologies in the context of hydrographical information. Fourth International Workshop “Information Fusion and Geographic Information Systems” (IF&GIS’09) Popovich et al., (eds.) Lecture Notes in Geoinformation and Cartography (LNG&C) Springer-Verlag. \nPages: 193-207. ISBN: 978-3-642-00303-5 May 17th - 20th, 2009 St. Petersburg, Russia.\n-       Vilches-Blázquez, L.M., Corcho, O. (2009) A heuristic approach to generate good-quality linked data about hydrography. In 8th International Workshop on Web Semantics (WebS’09) in conjunction with 20th edition of DEXA. 31 August - 4 September. Linz, Austria (To appear)\n-\tAguado de Cea G, Puche Alosete J, Ramos JA Tagging Spanish Texts: the Problem of ‘se’ Language Resources and Evaluation Conference (LREC 2008) Marrakech, Marruecos 28-30 de mayo de 2008 Pages: 5\n-\tEkaterina Buyko, Christian Chiarcos, Antonio Pareja-Lora. Ontology-Based Interface Specifications for an NLP Pipeline Architecture. Proc. 6th International Language Resources and Evaluation (LREC'08), pp: 847-854. Mayo, 2008. Marrakech, Marruecos.\n-       Aguado de Cea, G., Gómez-Pérez, A., Montiel-Ponsoda, E., and Suárez-Figueroa, M.C. Using Linguistic Patterns to Enhance Ontology Development. In Proceedings of the International Conference on Knowledge Engineering and Ontology Development (KEOD 2009). (To appear).\n-\tMontiel-Ponsoda, E. Aguado de Cea, G.  Using natural language patterns for the development of ontologies. En las actas del VII Congreso Internacional de la Asociación Europea de Lenguas para Fines Específicos (AELFE 2008), páginas 332-345 (ISBN 978-84-691-5718-3).\n-       Aguado de Cea, G. y Montiel Ponsoda, E. When Phraseology and Ontologies Meet. XI Simposio Internacional de Comunicación Social. Santiago de Cuba (Cuba), enero 2009, páginas 80-84. (ISBN 978-959-7174-14-1).\n-       Aguado de Cea, G., Montiel-Ponsoda, E., and Suárez-Figueroa, M.C. Approaches to ontology development by non ontology experts, Proc. of the International Symposium on Data and Sense Mining, Machine Translation and Controlled Languages (ISMTCL 2009).(ISSN 0758 6787; ISBN 978-2-84867-261-8)\n-       Aguado de Cea, G., Gómez-Pérez, A., and Montiel-Ponsoda, E. Enriching Ontologies with Multilingual Information, en las actas de las III Jornadas Red Temática en Tratamiento de la Información Multilingüe y Multimodal (PLN-TIMM), páginas 107-110.\n-\tRamos JA, Fernández-López M, Gómez-Pérez A (2009) Algoritmo de agregación de mappings basado en reglas de selección. XIII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA 2009). 9-13 Noviembre 2009. Sevilla (España).\n-\tPoveda, M; Suárez-Figueroa, M.C.; Gómez-Pérez, A. \"Patrones, antipatrones y malas prácticas en ontologías\". XIII Conferencia de la Asociación Española para la Inteligencia Artificial (CAEPIA 2009). 9-13 Noviembre 2009. Sevilla (España).\n-       Roussey, C., Corcho, O., Vilches-Blázquez, L.M. A Catalogue of OWL Ontology AntiPatterns. In The Fifth International Conference on Knowledge Capture (K-CAP’09) 1 – 4 September 2009. Redondo Beach, California, USA.\n-        García-Ramos S, Otero-Quintana A, Fernández-López M. OntologyTest: a tool to evaluate ontologies through tests defined by the user. En International Symposium on Distributed Computing and Artificial Intelligence\n(DCAI'09) Salamanca, España. (Lecture Notes in Computer Science LNCS 5518) Springer-Verlag, parte II, Berlín, Alemania, pp 91–98 (2009)\n-        Herrero P., Bosque J.L., Pérez M.S. A Business-Rule Based Model to manage Virtual Organizations in Collaborative Grid Environments. En Market-Oriented Grid and Utility Computing, John Wiley & Sons, Ltd, (2008)\n-        Sánchez A., Montes J., Dubitzky W., Valdes J.J., Perez M.S, de Miguel P. Data Mining meets Grid Computing: Time to Dance. En Data Mining Techniques in Grid Computing Environments, John Wiley & Sons, Ltd, (2008)\n-        Sánchez A., Perez M.S, Gueant P., Peña J.M., Herrero P. DMGA: A generic brokering-based data mining grid Architecture. En Data Mining Techniques in Grid Computing Environments, John Wiley & Sons, Ltd, (2008)\n-        Herrero P., Bosque J.L., Salvadores M., Pérez M.S. WE-AMBLE: A workflow engine to manage awareness in collaborative grid environments, en International Journal of High Performance Computing Applications 22(2), pp. 250-267 (2008)\n-        Pérez M.S., Sanchez A., Abawajy, J. Robles V., Peña J.M. An agent architecture for managing data resources in a grid environment, en Future Gener. Comput. Syst. 25(7), pp. 747-755 (2009)\n-        Montes  J., Sánchez A., Valdes J.J., Perez M.S, Herrero P. The Grid as a Single Entity: Towards a Behavior Model of the Whole Grid, en Proceedings of the OTM 2008 Confederated International Conferences, CoopIS, DOA, GADA, IS, and ODBASE 2008. LNCS 5331, pp. 886-897, Springer Verlag (2008)\n-        Pérez M.S. \"A High Performance Suite of Data Services for Grids\" In Future Generation Computer Systems, Elsevier (To appear)\n'\nBold text'",
  "speaker": "SYSTEM",
  "uuid": "e163335a-910c-4574-8cff-77b9d26d7e87"
}