{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 9\n• \nMiddle out: The team starts just writing down important questions that are \ncomposed and decomposed later on to form abstract and simple questions \nrespectively. \nThe output of this task is (1) a list of non-functional ontology requirements written \nin natural language, which is included in slot 6a of the template shown in Table 1, and \n(2) a list functional ontology requirements in the form of CQs and their associated \nanswers that is the input of task 5. The list of non-functional requirements in the \nSEEMP ORSD is shown in Table 3; the list of CQs and their responses are grouped in \ntask 5 and included in slot 6b of SEEMP ORSD shown in Table 4.   \nTable 3. SEEMP ORSD Slot 6a. \n6 \nOntology Requirements \na. Non-Functional Requirements \nNFR1. The ontology must support a multilingual scenario in the following \nlanguages: English, Spanish, Italian, and French. \nNFR2. The ontology must be based on the international, European or de-facto \nstandards in existence or under development. \n \nTask 5. Group requirements. The goal of this task is to group the list of CQs \nobtained in task 4 into several categories. Users, domain experts and the ontology \ndevelopment team should classify the list of CQs written in natural language using a \nhybrid approach that not only combines pre-established categories such as time and \ndate, units of measure, currencies, location, languages, etc., but it also creates \ncategories for those terms that appear with the highest frequencies in the list of CQs. \nTechniques such as card sorting can be used when the grouping is done manually, \nwhereas techniques for clustering natural language sentences or for information \nextraction can be used when the grouping is done automatically. In addition, mind \nmap tools can help to display graphically the CQs in groups or Cicero if the grouping \nis done collaboratively.  \nThe task output is the set of groups of CQs and responses, which is included in slot \n6b of the template. The output in the SEEMP ORSD is shown in Table 4. \nUsually this task is carried out in parallel with task 4. \nTask 6. Validate the set of requirements, including both non-functional and \nfunctional ontology requirements. The aim here is to identify possible conflicts \nbetween ontology requirements, missing ontology requirements, and contradictions \nbetween them. Users and domain experts must carry out this task taking as input the \nset of requirements identified in task 4 to decide if each element of the set is valid or \nnot. The task output is the confirmation of the validity of the set of non-functional and \nfunctional ontology requirements. \nThe following criteria can be used in this validation task and they are mainly \ninspired by [9, 2]:  \n• \nA set of requirements is correct if each requirement refers to some features of \nthe ontology to be developed. \n",
  "speaker": "SYSTEM",
  "uuid": "e217ca85-b21f-4565-aebf-afab99cfe624"
}