{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 40\nPage 40 of 124\nNeOn Integrated Project EU-IST-027595\nTool\nComponents\nImplementation\nlanguage\nSingle/Several\nSKOS2GenTax\nclasses, attributes, relations\nOWL\nDLP/\nRDF(S)\nSingle\nT-ORG\ninstances\nSeveral\nKAON-REVERSE\nclasses, attributes, relations, in-\nstances\nF-Logic / RDF\nSingle\nODEMapster\ninstances\nRDF\nSingle\nD2R Server\ninstances\nRDF\nSingle\nTopBraid Composer\nclasses, attributes, relations, in-\nstances\nRDF/OWL\n(Full,\nDL or Lite)\nSingle\nXSD2OWL and XML2RDF\nclasses, attributes, relations, in-\nstances\nOWL Full/ RDF\nSingle\nConvertToRdf\ninstances\nRDF\nSingle\nﬂat2rdf\ninstances\nRDF\nSingle\nJava BibTeX-To-RDF Con-\nverter\ninstances\nRDF\nSingle\nExcel2rdf\ninstances\nRDF\nSingle\nRDF123\ninstances\nRDF\nSeveral\nTable 2.6: Ontology characteristics of the tools\n2.5\nResults and Conclusions\nAfter having analyzed the state of the art of methods and tools for re-engineering non-ontological resources,\nwe present the results of applying the evaluation framework described in section 2.2. The results are provided\naccording to the characteristics of the identiﬁed groups, that is, non-ontological resource, transformation\nprocess, and resultant ontology.\n2.5.1\nResults According to Non-ontological Resource\nTable 2.1 and table 2.4 summarize the methods and tools presented according to the characteristics of the\nnon-ontological resource: type of resource, resource implemented in, speciﬁc or any resource, whether the\ndata model is known, and the provenance information.\nMethods\n• According to the type of non-ontological resource: one method is focused on classiﬁcation schemes,\nother method on classiﬁcation schemes and thesauri, two are focused on folksonomies, two are fo-\ncused on lexica, six methods are focused on thesauri. The remaining six are not focused on the\nnon-ontological resource type since they are independent of the resource type.\n• According to the implementation of the non-ontological resource. Five methods focused on resources\nimplemented in databases, four methods, on resources implemented in XML, three methods on re-\nsources implemented in ﬂat ﬁles, one method deals with resources implemented in Prolog, other\nmethod deals with resources implemented in proprietary format, relational database and XML, and\nfour methods are independent of the resource implementation.\n• According to the ability to transform a speciﬁc non-ontological resource or to transform any non-\nontological resource, there are ten methods with the ability to transform a speciﬁc non-ontological\n",
  "speaker": "SYSTEM",
  "uuid": "e2362e1a-a970-448c-a510-28f8e0fb679d"
}