{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Collibra2010 \n\nhttp://www.collibra.com/job/software-engineer\nSoftware Engineer\n==============================================================================\n\nCollibra\nCollibra is an enterprise software company and spin-off from the Laboratory for Semantic Technology and Application Research (STARLab) at the Vrije Universiteit Brussel. Collibra’s mission is to deliver solutions for information governance, sharing and delivery throughout the extended enterprise. Similarly to business process management, Collibra coins its technology business semantics management. It has closed a seed round of ! 850.000 from VC and business angels. The team expanded with world-class employees and board of directors, including Tony Mary (ex-CEO IBM Belgium, KPMG, Bull, ...) and Dirk Boogmans (ex-CEO Gimv). Collibra has several pilot projects running with large multinationals and government. With its unique technology, backed by a solid methodology and via a strong partner network, Collibra has all the necessary qualities to become market leader in its ﬁeld.\nPlease send your cv and cover letter to careers@collibra.com\nJob description\nA good engineer can make anything as long as she/he has the resources and time. We are looking for (junior/senior) engineers that can make anything with limited resources and limited time.\nCollibra is an engineer driven company where engineering talent is greatly appreciated. At Collibra, you do not just implement a traditional system for just another consultancy project. At Collibra, you work with state of the art technology that may become the basis of the “Oracle of the next decade”. If that excites you, we'd like to hear from you .\nFor this position, we are looking for strong (junior/senior) software engineers that can handle a large codebase, and are passionate about user interfaces and workflows.\nGeneral requirements\n* BS or MS in Computer Science or equivalent experience.\n   * Java experience required; other languages such as Ruby, Javascript and Python are a plus.\n   * Familiar with design patterns.\n   * Experience in iterative software engineering, such as SCRUM or XP.\n   * UML modeling and metamodeling in MOF; ORM (Object Role Modeling) and ER are a plus.\n   * Must love challenges and problem solving; no fear for the unknown.\n   * Discipline and flexibility.\n   * Teamplayer.\nBonus points\n* Hibernate, Spring and EJB3\n   * JBoss or other J2EE application server\n   * Semantic technologies, e.g., RDF(S)/OWL\n   * Query languages: e.g., SQL, XPath, XQuery, SPARQL\nProfile\n* Attention to user interface and workflow details.\n   * Sound knowledge of (X)HTML, JavaScript, CSS\n   * Experience in inventing, creating, designing, building, testing and maintaining web applications\n   * Experience with libraries (e.g., jQuery, Prototype, ...) are a big plus\n   * Knowledge of PHP, MySQL, Velocity is a plus\n   * Familiar with information visualization and GUI design pattern\nPlease send your cv and cover letter to careers@collibra.com",
  "speaker": "SYSTEM",
  "uuid": "e29c025c-eada-4aa7-8f76-52fba0b41fae"
}