{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 65\n63\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nStandalone utilities \nStand‐alone CAT tools are designed for use by independent translators who do a lot of their work offline.\nTheir primary advantage is the ability to work independently of Internet connectivity, so a translator can\ndownload a project, copy it into their CAT tool, complete the task, and then check it back into the transla‐\ntion management system when they return.\nThese tools are well entrenched and heavily used by professional translators, and will enjoy continued suc‐\ncess in the marketplace, especially if they are upgraded to inter‐operate with cloud based translation man‐\nagement systems. These tools combine a number of functions including: document editing, translation\nmemory, glossary, and spellchecking. \nExamples of these tools include MemoQ and SDL/Trados.\nTranslation Management Systems\nTranslation Management Systems\nTranslation management systems enable users to centralize and control their translation workflow, as well\nas to manage the assets being translated (documents, videos, and other content). These systems range from\nsimple, purpose‐built TMS solutions, such as Word Press translation tools, to complete supply chain man‐\nagement systems that, in addition to managing translation workflow, also automate the process of interact‐\ning with external translation service providers.\nTranslation management systems provide an additional layer of process management and automation. They\nare used to manage how translation work is assigned to different participants, and to import/export docu‐\nments and their translations to and from other systems, such as content management systems.\nDocument TMS Systems\nTranslation management systems (TMS) provide a similar function as content management systems. These\nsystems enable operators to: \n• Centrally manage resources to be translated (documents, video captions, localisation files, etc.)\n• Control which languages each project or resource is to be translated to\n• Invite and assign translators, editors and reviews to each project/language\n• Define workflows for translation, for example whether translations are auto‐approved on receipt (from\ntrusted sources) or must be independently reviewed\n• Receive quality feedback and defect reports, and automatically route these to the appropriate transla‐\ntors and project managers\n• Use machine translation (for pre‐translation), translation memory, term glossary and advanced leverag‐\ning to re‐use previously completed translations, to boost efficiency, and to increase quality and consis‐\ntency\n• Export completed translations to external systems (e.g. content management system, e‐commerce plat‐\nform, etc.)\nThese systems are fairly mature products in terms of functionality. The major shift underway today is a\nmigration from customer premise based client/server systems (where the customer deploys and manages\ntheir TMS system) to cloud based SaaS (Software‐as‐a‐Service) offerings. Virtually all translation vendors\nstarting up in the last few years offer cloud‐based solutions. These include companies like MemSource and\nXTM International. Major translation technology vendors such as SDL have been retooling their product\nofferings across the board as SaaS services. \n",
  "speaker": "SYSTEM",
  "uuid": "e2c1d540-a568-42d0-a98d-b43df108b018"
}