{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 17\nnismos públicos en régimen específico (sociedades mercantiles y asimiladas, otras entida-\ndes de derecho público), fundaciones y entidades gestoras. Cada una de ellas goza de un\nrégimen jurídico propio; por ello ha sido necesario caracterizarlas para determinar su\ninclusión o no en nuestra investigación.\nLa LOFAGE clasifica los organismos públicos en dos categorías: organismos autóno-\nmos y entidades públicas empresariales. Entre ambas las diferencias se establecen en razón\nal tipo de actividad que realicen y del régimen jurídico al que se someten. Unas y otras, en\ndefinitiva, se han creado “para la realización de cualquier actividad de ejecución o gestión\ntanto administrativas de fomento o prestación como de contenido económico” 27. En cuan-\nto al régimen jurídico, los organismos autónomos se rigen por el derecho público, mien-\ntras que las entidades públicas empresariales lo hacen por el privado, salvo “la formaliza-\nción de la voluntad de sus órganos, el ejercicio de las potestades administrativas y aspectos\nespecíficamente regulados para las mismas en esta ley, en sus estatutos y en la legislación\npresupuestaria” 28. A pesar de la ambigüedad nos ha parecido adecuado utilizar este crite-\nrio para prescindir en nuestro trabajo de las entidades públicas empresariales y sin embar-\ngo incluir los organismos autónomos.\nOrganismos autónomos\nLa ley los define como aquellos que se rigen por el Derecho administrativo y a los que\nse les encomienda, en régimen de descentralización funcional y en ejecución de progra-\nmas específicos, la actividad de un ministerio, la realización de actividades de fomento, de\nprestación o de gestión de servicios públicos29. \nEntidades Públicas Empresariales\nSucesoras de las entidades de derecho público con personalidad jurídica, que por ley\nregulaban su actividad en virtud del ordenamiento jurídico privado. Son definidas como\norganismos públicos a los que se encomienda la realización de actividades de prestación\nde servicios, su gestión o la producción de bienes de interés público susceptibles de con-\ntraprestación30.\nQuedan fuera de esta clasificación muchos organismos públicos que no han sido trans-\nformados, con posterioridad a la LOFAGE, en ninguna de las dos clasificaciones que ésta\nestablece. Se trata de diversos entes calificados, de acuerdo con la legislación anterior a la\nLOFAGE, de entidades de derecho público, consorcios y otras entidades de derecho pú-\nblico. Estas categorías incluyen a muchos organismos públicos cuya existencia, al margen\nde los dos grupos anteriores, se explica por la tendencia de estas instituciones por buscar\nun estatuto peculiar más flexible o ventajoso. \nAdemás, hay que señalar las fundaciones y sociedades mercantiles estatales. Las\nsegundas son empresas de carácter mercantil, industrial o comercial que actúan en régi-\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n22\n27 LOFAGE, art. 43 y ss.\n28 Ídem, art. 53.2.\n29 Ídem, art. 45.1\n30 Ídem, art. 53\nBASES DE DATOS  1/1/04  03:39  Página 22\n",
  "speaker": "SYSTEM",
  "uuid": "e2edf6ef-62eb-4c40-aaad-f71732a074de"
}