{
  "message": "SYSTEM: D5.3.2.pdf: Página 42\nPage 42 of 48 \nNeOn Integrated Project EU-IST-027595 \n \n\u0001 To have two different visualizations of gOntt projects: graphical view and textual view, both \nwith the same information (activities, processes, resource assignments, order, restrictions, \netc.). \na. Graphical view and textual view should be updated at the same time. \nb. Begin and End dates should appear in the views. \nc. Graphical view should show a Gantt diagram. \nd. Phases, processes and activities should appear in the list view with indentation (that \nmeans a set of processes and activities are inside a phase; and a set of activities \nare inside of a process). \n\u0001 To delete processes, activities and phases from a gOntt project. \n\u0001 To modify process, activity and phases names in a gOntt project. \n\u0001 To modify process, activity and phases order in a gOntt project. \n\u0001 To create, modify and delete connections between activities, between processes, and \nbetween activities and processes.  \na. If a connection exists between two activities or two processes or between activities \nand processes, this means dependency, the second one cannot start until the first \none finishes (sequential order).  \nb. Optionally, other types of relations such as two activities/processes starting or \nfinishing at the same time. \n\u0001 To include and modify duration and starting date for processes, activities and phases. \n\u0001 To have the possibility of associating plug-ins to processes and activities. Processes and \nactivities can have more than one plug-in associated. \n\u0001 To have the possibility to hide phases and see only processes and activities \nSpecific Requirements for gOntt Administrator: \n\u0001 To include new processes and activities coming from the NeOn Glossary into gOntt plug-in. \n\u0001 To include methodological guidelines for activities and processes.  \n\u0001 To create schedule templates to be used in the guided manner by the ontology project \nmanager. \n\u0001 To modify and delete existing schedule templates. \nSpecific Requirements for Ontology Project Management: \n\u0001 To create ontology network project schedules from scratch, by means of introducing \nprocesses, activities, phases and their relationships and restrictions.  \n\u0001 To create ontology network project schedules in a guided way, by using templates that \nprovides initial schedule. The guided way should be based on 3 wizard menus: \n• \nThe first menu based on natural language questions to select the ontology life cycle \nmodel.  \n• \nThe second menu based on natural language questions to select processes and \nactivities. \n• \nThe third menu, which is optional, based on natural language questions to decide \nbetween possible optional processes and activities.  \n\u0001 To modify existing ontology network project schedules.  \n \n",
  "speaker": "SYSTEM",
  "uuid": "e345ffcb-2cae-4dbb-818a-0f8b7a7d44fc"
}