{
  "message": "SYSTEM: Wiki: Responsables: Asun, María Poveda, Soco\nURL interna:\nContents\n[\nhide\n]\n1\nimplementación detalles\n2\nOntologies\n3\nRecursos y enlaces de interes\n4\nGuías para extensión\n5\nA tener en cuenta\n6\nque no se olvide\nimplementación detalles\n\nDeicisiones modeado:\n.- Para relacionar las empresas con los códigos mejor usar org:classification mejor que gr:category, por comparación de los rangos con nuestro caso de uso. org es mas precisa y encaja mejor con lo que buscamos, pero se podrían duplicar modelados.\nGrafos en virtuoso:\nhttp://minetur.linkeddata.es/categoriasinteco/\npara la clasificación de inteco\nhttp://minetur.linkeddata.es/mappings/clasificacionA-clasificacionB/\nOntologies\n\nOntologies\nCPV\nmirar\nhttp://cpv.data.ac.uk/\npues en el de cz y moldeas se utilizan las relaciones transitivas. Incluir esto en guias para lineas futuras.\nhttp://linked.opendata.cz/resource/concept-scheme/cpv-2008\nhttp://opendata.cz/en/linked-data\nUNSPSC\nhttp://onki.fi/en/browser/\nOrganization\norg:\nhttp://www.w3.org/TR/2014/REC-vocab-org-20140116/\nrov:\nhttp://www.w3.org/ns/regorg#\ny documentación en\nhttp://www.w3.org/TR/vocab-regorg/\nContratos publicos\npc:\nhttp://purl.org/procurement/public-contracts#\ncontsem:\nhttp://contsem.unizar.es/def/sector-publico/ContSem/\n--> de momento yo no la voy a utilizar pero incluir en el entregable con vistas a futuro.\ngood relations and product ontology (PO)\nClasificaciones\nson las de weso, no estan disponibles:\nhttp://datahub.io/organization/product-scheme-classifications\nutilizan CPV como central. ¿perdidas?\nsolo string matching?\nRecursos y enlaces de interes\n\nhttps://joinup.ec.europa.eu/community/open_standards_ict/description\nGuías para extensión\n\nAhora hemos generado el SKOS \"plano\" solo instancias con relaciones skos. Se puede hacer también siguiendo un modelo como en MOLDES. figura \"Fig. 2. A partial view of the data model for PSCs in SKOS\" del paper: Empowering the access to public procurement opportunities by means of linking controlled vocabularies. A case study of Product Scheme Classifications in the European e-Procurement sector\"\nEn el mismo paper para hacer mappings automáticos: Firstly a target PSC is\nselected and their descriptors (in English) are indexed\nusing Apache Lucene. After that the mappings between\nelements in a source PSC are automatically discovered\nand generated through the execution of queries against\nthe indexed PSC. Basically the creation of a mapping lies\nin a string comparison between the source descriptor\nand the target descriptor. Nevertheless the personalization\nof Apache Lucene and Solr allowed us the creation\nof more accurate mappings. Finally an important issue\nlies in the mapping confidence, in this case a pairwise\nhuman-validation has been carried out to ensure a 80–\n90% of correct mappings.\nGuias para hacer mappings manuales\nLas relaciones que se van a buscar son las definidas en skos para relacionar distinos esquemas de conocimiento. Les asignamos las siguientes siglas:\n(bm) broadMatch\n(cm) closeMatch\n(em) exactMatch\n(nm) narrowMatch\n(rm) relatedMatch\nVamos asignando colores que nos orienten en el dominio. En azul ponemos los propios de seguridad. En naraja, están los que podrían que ver con seguridad.\nSobre el documento cpv_2008_ver_2013SoloES+Inteco_v0.xlsx\nEn rosita (en la etiqueta) estan marcados los títulos que tienen que ver con seguridad.\nEn naranja y morado (en el código) los que no habían mencionado ellos.\nEn azul estan los que nos dieron dados.\nen principio solo enlazamos servicios de cpv con servicios inteco e igual para productos.Podrían darse relaciones de \"related\" entre servicios y productos pero esta relación no es muy fuerte y podría alargarse la generación de datos y links si nos perdemos en relaciones poco fuertes. Las obviamos de momento pero se tendrían que tener en cuenta en el futuro.\nOrden en el que buscamos los mappings.\ngeneramos mappings con una matriz, una clasificación en la X y la otra en la Y. Luego para transformarlo, mirar transformaciones para que nos resulte mas facil con clasificaciones grandes. (para nosotras)\nPreferencias para asignar relaciones de skos.\ntopología:\na priori malla nos parece mas factible.\nse busca la topología en estrella, buscar como hacerla:\nsolución ili-eurowordnet: hay una central que una de referencia \"duplicada\" en la que se va a añadiendo lo necesario de las otras taxnomias de manera que el nucleo central permita interconectarlas. Es decir, si la base carece de un concepto se le añade de alguna manera.\nA tener en cuenta\n\na) El orden del trabajo que te proponemos es el siguiente:\nA. BD Seguridad INTECO\nB. CPV y UNSPSC (objeto de contrato y productos)\nC. NIZA (marcas)\nhttp://web2.wipo.int/nicepub/edition-20140101/taxonomy/?pagination=no&lang=en&mode=flat&explanatory_notes=hide&basic_numbers=show\nD. HS (Exportaciones)\nE. IPC (propiedad industrial)\nhttp://web2.wipo.int/ipcpub/#refresh=page\nF. CNAE\nEstamos abiertos a dialogar sobre ello y a valorar pros y contras. Es posible que tengamos que tener en cuenta alguna más del área de contratación.\nCreo que había una confusión derivada de que nosotros esperábamos de ti esta propuesta de orden de trabajo (aunque hubiéramos hablado de que la BD de INTECO y CPV fueran las primeras) y que por otra parte tú esperabas de nosotros esta propuesta.\nb) De la BD de INTECO obtenemos fundamentalmente:\n- Empresas SEC\n- Productos y Servicios SEC\n- Una primera clasificación\ncon sus entidades y relaciones.\nLa gracia de la BD de INTECO es que contiene tanto una taxonomía como datos y que podemos usarlos tanto en vuestro piloto como en el de Perfil de Mercado de Bitext.\nLo que más nos importa no son las Empresas sino los\nProductos y Servicios\n. Esto es importante, es más prioritario.\nc) Para una primera interacción con el proyecto de Bitext entendemos que fundamentalmente tienes que generar un diccionario, una manera unívoca de identificar cada producto y servicio. A priori nos parece que poco más debería ser necesario.\nDe nuevo estamos abiertos a dialogar sobre ello. Voy a organizar una reunión con Bitext para ir alineándoos. De todos modos siéntete libre de tratar por tu cuenta lo que necesites con Bitext; eso si, por favor id informándoos de los aspectos que tratéis, los avances, los problemas y las soluciones que se vayan derivando.\nd) Del proyecto se espera mucha consultoría por vuestra parte. Entendemos que esto es documentación, know-how compartido y organizado y parcialmente implementado en el piloto. Uno de los entregables es un documento en el que debemos reflejar todo lo que habrá que tener en cuenta cuando no estemos restringidos al ámbito SEC sino que estemos trabajando en todo el sector TIC.\nLa propuesta de utilización de ontologías estándares y la explicación, valoración y documentación por vuestra parte de porqué es bueno usarlas es algo que esperamos ya que se os reconoce excelencia en todo lo relacionado con ontologías. De momento no esperes por nuestra parte grandes aportaciones en este ámbito, al revés, estamos tranquilos porque sabemos que podéis y vais hacer las mejores aportaciones..\nEn particular se espera saber qué arquitectura de ontología será necesaria y viable. Antes de que entrara yo en el proyecto tuviste una reunión con David, José y Juan en la que les planteaste la bondad de un diseño en estrella (lo llamaré así) por ser el más sostenible en el tiempo, de tal manera que una vez que se incorpore una nueva taxonomía no haga falta establecer la traducción con todas las taxonomías previamente existentes. Saber si es cierto esto que hemos asumido como válido o si hay excepciones o variaciones a tener en cuenta, cuales y porqué o si finalmente descubrimos que esto no es así, es un resultado importante del proyecto. El diseño del proceso de añadir una nueva taxonomía a la ontología también es algo que consideramos clave, que se espera como resultado del proyecto.\ne) Creemos que puede ser bueno que le echéis un vistazo a los objetos-de-contrato que aparecen en las plataformas de contratación. \nLas referencias que estamos usando ahora mismo son las siguientes:\n- Portal Transparencia de México, que recoge toda la contratación del estado de México.\nhttp://portaltransparencia.gob.mx/buscador/search/search.do?method=begin\nSi hacéis búsquedas, por ejemplo, de \"Seguridad de la información\"\nhttp://portaltransparencia.gob.mx/buscador/search/search.do?query=seguridad+de+la+informaci%F3n&idDependenciaZoom=&method=search&siglasDependencia=&idFraccionZoom=&searchBy=1\nda resultado bastante prometedores.\n- La plataforma TED:\nhttp://ted.europa.eu/\n- Contratación del estado español:\nhttps://contrataciondelestado.es/wps/portal/plataforma\nEstamos mirando más portales de contratación en LA pero la restricción SEC nos deja con pocos resultados en las plataformas que hemos mirado. Cualquier aportación al respecto es muy bienvenida.\nque no se olvide\n\nemail Soco 1 de abril sobre funciones xml y TED.\nen la base de datos no hay relación entre empresas y categorias inteco, se deduce a través de la relación con los productos.\nanalizar \"manufacturer\", en caso de transformalarla sería con gr:hasManufacturer. Mirar si asi se pueden descubrir nuevas empresas que no estén en la base de datos de inteco.\nMirar\nhttp://unstats.un.org/unsd/cr/registry/regdnld.asp?prn=yes\n¿Podría valer algo de ese email: [ontolog-forum] Patent Vocabulary Ontology and Corpus ?",
  "speaker": "SYSTEM",
  "uuid": "e4225559-be3b-4c6b-8881-11e96cde6677"
}