{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 9\nGu´ıa de orientaci´on para investigadores noveles\n9\nmente, las becas predoctorales m´as conocidas sean las convocadas por el Go-\nbierno (a trav´es del nuevo Ministerio de Ciencia e Innovaci´on, anteriormente\nintegrado en el Ministerio de Educaci´on y Ciencia) como es el caso del pro-\ngrama de “Formaci´on del Profesorado Universitario (FPU)” o del programa\n“Formaci´on de Personal Investigador (FPI)”, que s´olo pueden ser solicitadas\npor estudiantes que est´en en posesi´on un t´ıtulo universitario y que cumplan\nunas determinadas condiciones. En el caso concreto de la Comunidad Valen-\nciana, la Generalitat suele convocar tambi´en becas an´alogas a ´estas, pero a\nnivel de comunidad aut´onoma; y lo mismo sucede a nivel de la Universidad\nde Alicante, que se convocan a trav´es del Vicerrectorado de Investigaci´on,\nDesarrollo e Innovaci´on. Estas becas se denominan de convocatoria p´ublica,\nya que se obtienen tras una evaluaci´on exhaustiva de m´eritos de acuerdo\nal baremo establecido en la convocatoria de las mismas y en general suele\nhaber m´as demanda que plazas disponibles. El haber disfrutado de una beca\npredoctoral, sobre todo si se trata de una beca de convocatoria p´ublica, es\nun valor a˜nadido al curriculum vitae del investigador si en un futuro desea\nobtener una evaluaci´on positiva para poder acceder a las ﬁguras de personal\ndocente e investigador de cualquier universidad (v´ease la secci´on 6). Puesto\nque la ﬁnalidad de este trabajo no es proporcionar una descripci´on en de-\ntalle de las becas predoctorales disponibles, se invita al lector a consultar\nlos enlaces proporcionados en el anexo A si desea ampliar sus conocimientos\nen este apartado.\n5.\nFormaci´on postdoctoral\nAl igual que ten´ıamos varios programas de becas predoctorales de ini-\nciaci´on a la investigaci´on, cuando ya han transcurrido varios a˜nos de inves-\ntigaci´on y ﬁnalmente se est´a en posesi´on del grado de Doctor (o a punto\nde ello), existen programas para seguir con la investigaci´on. Estas becas se\nsuelen realizar en centros distintos al que se ha pertenecido durante la etapa\npredoctoral. Algunos ejemplos de estos programas son el “Programa Ram´on\ny Cajal” o el “Programa Juan de la Cierva” del Ministerio de Ciencia e\nInnovaci´on. Este tipo de becas tambi´en se suelen convocar desde entidades\nprivadas o fundaciones. De forma an´aloga a la secci´on anterior, se invita\nal lector que est´e interesado en conocer m´as informaci´on en este aspecto a\nconsultar algunos de los enlaces propuestos en el anexo A.\n6.\nAgencia Nacional de Evaluaci´on de la Calidad\ny Acreditaci´on (ANECA)\nEn cumplimiento de lo que se establece la LOU 6/2001, modiﬁcada por la\nLOU 4/2007, el 19 de julio de 2002 se cre´o la Agencia Nacional de Evaluaci´on\nde la Calidad y Acreditaci´on (ANECA) con el prop´osito de contribuir a la\n",
  "speaker": "SYSTEM",
  "uuid": "e54e5ab8-06a8-42ae-a615-c683596ed784"
}