{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 88\n86\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nment. \nThis lack of open linguistic data resources have been seen as an open opportunity for many companies that\nhave created linguistic data resources markets for their platforms.\nTechnology Trends\nIntelligent Content core language technologies are in a constant process of evolution. The current trends are\nmainly driven by market needs. Vendors intend to provide better solutions based on new developments. \n• Natural Language Programming: is an ontology‐assisted way of programming in terms of natural lan‐\nguage sentences that can be used to produce formal representations of procedural knowledge or pro‐\ngram the reasoning cycle and operational logic of intelligent agents. Companies like Wolfram or\nSysbrain are approaching the market with this technology. \n• Towards to a semantic web: companies like Google, Facebook or Twitter among others are progres‐\nsively including semantic technologies into their systems with initiatives such as Google’s Knowledge\ngraph, Facebook’s Open Graph protocol and Twitter Cards. Beyond the use of publishing standards\n(RDF, OWL, etc.) and linked data principles, these companies are also considering artificial intelligence\ntechnologies.\n• Convergence with other technologies: Companies are interested in having solutions that provide a uni‐\nfied approach to information management (from access to analysis). Progressively the main vendors\nare integrating more and more technologies such as intelligent content, search, business intelligence,\ndatabase, business analytics and big data. This integration is not closed to software. \n• Many vendors provide appliances: specific hardware and software configurations that solve a prob‐\nlem. The return of artificial intelligence: Artificial intelligence (AI) has come in and out of many times\nin the past 20 years due to promises that underestimate the challenge of meeting the needs of busi‐\nness users. The current interest of artificial intelligence is related to language, learning and cognition.\nAs language goes beyond understanding speech, parsing sentences or disambiguating multiple senses\nof words and includes understanding, artificial intelligence could help to identify patterns to analyse\nbetter language.\n• Resurgence of symbolic approaches: IC companies are looking for new differentiation sources. Some\nvendors aim having a unique service proposition, others focus on technology differentiation. As a\nresult, the market is living a resurgence of symbolic approaches.\n• Patents wars affect the R&D budget: patent wars have become more and more usual in the IT market\nand they are producing significant constrains in the R&D budget and in the company’s survival. LT ven‐\ndors such as Vlingo fought a patent war against Nuance. Although Vlingo survived the battle, due to\nfinancial problems it was finally acquired by Nuance. \n4.14 Scanning/Text Input\nScanning/Text Input are systems that “read” existing text or support the physical input of text through key‐\nboards, keypads, etc. Optical Character Recognition (OCR) was one of the earliest commercial applications\nof pattern‐matching LT and is still an important market. Keyboards (including Virtual Keyboards) can be\nenhanced with LT‐enabled features such as predictive typing, continuous touch/swipe and even gesture\ninput.\nScanning and text input software comprises two different types of applications (1) capture and image man‐\nagement software and (2) text recognition software.\nCapture and image management software helps automate document‐centric workflows that continue to be\n",
  "speaker": "SYSTEM",
  "uuid": "e58266ae-034a-4dd9-93cb-44a74d61b9e9"
}