{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Delftjan2011 \n\nThe Web Information Systems (WIS) group in TU Delft (Delft University \nof Technology, the Netherlands) has a PhD position available in \nSemantic Search, Linked Data and Adaptive Web, funded in a \ncollaboration with Dutch cultural heritage partners.\nThe WIS group concentrates in its research on large-scale information \nsystems, specifically information systems that involve Web and \nSemantic Web technology. Main topics in the group's research \nactivities are:\n- engineering and science of the adaptive web, including user modeling and personalization, \n- semantic search and retrieval, \n- semantic integration and linked data.\nCandidates should have a master degree in computer science or related \ndisciplines. Knowledge of Web and Semantic Web languages and tools is \na plus, as is knowledge of search and retrieval techniques. To be able \nto work in this international group candidates should have good \ncommunicative skills in English, both in speaking and in writing. For \nthis particular position, the candidate should be able to work with \ndata in Dutch, and therefore we demand that a candidate is able to \nread Dutch or a closely related language. We are looking for a \ncandidate with good programming skills as well as good conceptual \nmodeling skills.\nSuccessful candidates will work in collaboration with prominent \ncultural heritage institutes as well as with companies that offer \nstate-of-the-art search and retrieval solutions. We offer the chance \nto perform high-quality and cutting-edge research in an international \nenvironment, while working in close collaboration with the members of \nthe WIS group at TU Delft. The fully funded PhD position is available \nfor a period of four years. Candidates should be able to start in the \nspring of 2011.\nCandidates can express their interest by sending an email with a CV \n(indicating their language skills) and a motivation letter to \nprof.dr.ir. Geert-Jan Houben at wis@ewi.tudelft.nl (mentioning the \nsubject \"PhD2011-1\"). At this moment there is no need to send other \nfiles or documents. Emails that do not meet these requirements will \nnot be processed. More information about the group can be found at \nwis.ewi.tudelft.nl. The deadline for applications is January 22nd \n2011, but applications will be processed as they are received.",
  "speaker": "SYSTEM",
  "uuid": "e585f282-bfc7-4af0-bafd-5e33f39e795b"
}