{
  "message": "SYSTEM: Eswc2010webofdatatrack_submission_2.pdf: Página 13\n \nQ1 \nQ2 \nQ3 \nSPARQL-DQP \n6s \n6s \n9s \nDARQ \n2s \n6s \n5s \nTable 1: DARQ and SPARQL-DQP comparison. \nAs can be seen in Table 1, there are important execution time differences between \nboth systems in queries 1 and 3, while they behave similarly for query 2. In terms of \nthe logical query plans generated, they are similar, hence the main differences \nbetween both systems rely on the efficiency of the implementation, which is better in \ngeneral in the case of DARQ since it does not have to deal with the overhead imposed \nby the marshalling and unmarshalling of Web service based interactions. In the future \nwe will explore better these overheads and also the differences in terms of throughput, \nwhich can show better the advantages of the OGSA-DAI-based approach. \n5   Conclusions and Future Work \nWe have presented a Distributed Query Processing (DQP) system, SPARQL-DQP, \nwhich is able to process SPARQL-D queries across distributed RDF datasets. We \nfollow the approach of classical DQP and we base our solution on an existing \nrelational framework like OGSA-DAI and OGSA-DQP. This allows us to reuse SQL \noptimizers already implemented in this framework, although we also create new ones \nthat are specific for the types of queries that are handled in SPARQL and that can be \nattached to the optimization chain. \nBesides, our choice of implementation also provides us with additional advantages \nthat we will be exploiting in the future. The use and extension of OGSA-DAI \nprovides us with the possibility of creating data workflows that make use of several \ndata resources available in heterogeneous formats (e.g., relational databases, XML \ndatabases and RDF repositories). It is possible to create a workflow that access a SQL \ndatabase, use these results to merge them with a SPARQL query to a RDF repository \nand send the results from this merge to another store or print them on the screen. \nSince the results of queries to RDF resources are provided in a tuple-based format, \nwhich is the basic data format handled in OGSA-DAI, it is also possible to integrate \nthese results easily with queries performed to relational or XML databases. \nOur preliminary evaluation has been based on the comparison of query results and \nquery execution time between our system and DARQL. Other similar systems \ndescribed in the introduction have not been compared because of different reasons: \nSemWIQ does not provide yet access to SPARQL endpoints, although it implement \nseveral optimization mechanisms that would be interesting to test; it has not ben \npossible to evaluate Networked Graphs due to configuration problems; and we have \nnot tested Hartig and colleagues’ approach since it is not available online yet. We \nunderstand that more comparisons and tests with other existing systems are necessary, \nand that an exhaustive testbed should be built as part of our future work, in order to \n",
  "speaker": "SYSTEM",
  "uuid": "e64d5410-f7d2-44e9-9040-138408cf15da"
}