{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 18\nPage 18 of 124\nNeOn Integrated Project EU-IST-027595\nMethods for Transforming Classiﬁcation Schemes into Ontologies\nThe two main methods for transforming classiﬁcation schemes are GenTax [HdB07] and Hakkarainen et al.’s\nmethod [HHST06]. Next both methods are described.\n• GenTax is a method presented by Hepp et al. in [HdB07] for semi-automatically deriving consistent\nRDF(S) and OWL ontologies from hierarchical classiﬁcations, thesauri and informal taxonomies. These\nauthors subsume all three types (taxonomies, thesauri, and hierarchical classiﬁcations) under the\nterm hierarchical categorization schema; the three types have in common that they include a set of\ncategories and some form of a hierarchical order. Hepp et al. have implemented a preliminary tool,\nnamed SKOS2GenTax, to support their method.\nTheir prototype consists of a Java program that\nexpects the informal categorization schema to be stored in a RDBMS. The program accesses the\ncategories via an ODBC link.\nGenTax transforms semi-automatically the entire resource content into an ontology schema.\nHuman intervention in the transformation is limited to checking some conceptual properties and iden-\ntifying frequent anomalies. The basic idea of this method is to derive two ontology classes (1) one\ngeneric concept and (2) one broader taxonomic concept from each category. The method employs\nan ad-hoc wrapper for the transformation. Gentax deals with syntactic transformation aspects\nand how symbols are structured in the non-ontological resource and ontology formats. Further, Gentax\ncontemplates semantic transformation aspects and the semantic interpretation of the resource ele-\nments when deﬁning transformations to ontology elements. However, this method does not tackle the\ninternal data model of the resource. On the other hand, how the resource data is represented and\naccessed for the transformation is not described. GenTax does not keep the resource provenance\ninformation, so the resultant ontology does not keep the reference to the non-ontological resource.\nGenTax consists of the following steps:\n– To pre-process and create a formal representation of the resource.\n– To derive classes from each category and set an ad-hoc relation among classes according to a\ngiven context.\n– To derive a class from each category and set a taxonomic relation among them.\n– To generate the ontology in an ontology language.\nThis method produces one single ontology. The ontology components generated are classes and\nrelations. The ontology is expressed in OWL-DLP or RDF(S).\n• Hakkarainen et al. [HHST06] present a study of the semantic relationship between the ISO 15926-\n26 and OWL DL. The ISO 15926-2 speciﬁes a data model that semi-formally deﬁnes the meaning\nof the life-cycle information in a single context supporting the views engineers, equipment engineers,\noperators, maintenance engineers and other specialists. The ISO 15926-2 is built on EXPRESS7, and\nstored in a ﬂat ﬁle, to specify its data model. The standard consists of 201 entity data types; the\ntop level entity data type is thing, with its subtypes possible_individual and abstract_object. All other\nentities are subtypes of them.\nThis method consists of (a) two transformation protocols, which are based on transformation rules,\nand (b) two inverse transformation protocols, with the purpose of examining the possible loss of seman-\ntics. Transformation protocols include a formal speciﬁcation of the conversions. These protocols\nare based on the approach to transforming resource schema into an ontology schema, and re-\nsource content into instances of the ontology. Then, the protocols translate the relations between\nresource components into subClassOf and ad-hoc relations. However, not a single speciﬁc tool is\n6http://www.iso.org/iso/iso_catalogue/catalogue_tc/catalogue_detail.htm?csnumber=29557\n7the EXPRESS ﬁle is a computer-interpretable of ISO 15926-2 http://www.iso.org/iso/iso_catalogue/\ncatalogue_tc/catalogue_detail.htm?csnumber=38047\n",
  "speaker": "SYSTEM",
  "uuid": "e680d45a-1d26-4c4f-8c6c-b7dea872b792"
}