{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 28\n37 En relación con la aparición de una o varias cajas o casillas en el formulario de consulta, se han establecido dos\ncategorías en el tipo de consulta: \nConsulta simple: Cuando el formulario de consulta de la base de datos presenta una única caja o casilla de búsqueda.\nConsulta avanzada: Cuando el formulario de consulta de la base de datos presenta más de una caja o casilla de\nbúsqueda. \nSe ha utilizado el término recurso de información y documentación específico, pues quedan excluidas las cajas\nde búsqueda genéricas (a modo de buscador global de una página) que suelen aparecer en las páginas de inicio de los\nMinisterios.\nMETODOLOGÍA PARA LA LOCALIZACIÓN,\nIDENTIFICACIÓN Y ANÁLISIS DE LAS BASES DE DATOS\nDE LA ADMINISTRACIÓN GENERAL DEL ESTADO\nDra. Rosario Arquero\ncarquero@ccinf.ucm.es\nEl principal objetivo del trabajo ha consistido en la localización, identificación y aná-\nlisis de las bases de datos de la Administración General del Estado gratuitas y accesibles\na través de Internet. \nLa metodología de trabajo ha contemplado las siguientes fases: \n– Definición de los criterios de selección de las bases de datos. \n– Descripción y análisis de las bases de datos. \n– Creación y publicación del directorio de bases de datos, una vez valorados e interpre-\ntados los resultados derivados del análisis. \nA continuación se analizan las fases de realización del trabajo y la metodología aplica-\nda en cada una de ellas.\n1. DEFINICIÓN DE LOS CRITERIOS DE SELECCIÓN\nDE LAS BASES DE DATOS\nA los efectos de la acotación del material de análisis, se ha partido del siguiente con-\ncepto de base de datos: recurso de información y documentación específico, de acceso\nlibre y gratuito a través de Internet, incluido en la página Web de un Ministerio y que\npuede ser consultado mediante un formulario de búsqueda integrado por una o varias\ncajas o casillas de búsqueda37.\nLos criterios de selección de las bases de datos se han basado en lo expuesto en el epí-\ngrafe previo de esta introducción, titulado “La Administración General del Estado y sus\nbases de datos”. \nBASES DE DATOS  1/1/04  03:39  Página 33\n",
  "speaker": "SYSTEM",
  "uuid": "e748d1d5-27c2-4ba4-88a5-f3bbc9e95d1f"
}