{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 15\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 15 of 124\nof the tag. Furthermore, the co-occurrence of tags implies a semantic correlation among them.\nAn example of how folksonomies are used can be seen in the del.icio.us5 website.\n2. There are different ways of representing the knowledge encoded by the resource. A data model [Car02]\nis an abstract model that describes how data is represented and accessed. There are three basic styles\nof a data model: (1) the conceptual data model, which presents the primary entities and relationships\nof concern to a speciﬁc domain, (2) the logical data model, which depicts the logical entity types, the\ndata attributes describing those entities, and the relationships between entities, and (3) the physical\ndata model, which is related to a speciﬁc implementation of the resource. In this deliverable we will use\nthe term data model when referring to the logical data model. In the following chapters we present\nseveral data models for each of the non-ontological resources, i.e. the data model can be different\neven for the same type of non-ontological resource.\n3. According to the implementation we can classify non-ontological resources into\n• Databases: A database is a structured collection of records or data that is stored in a computer\nsystem.\n• XML ﬁle: eXtensible Markup Language is a simple, open, and ﬂexible format used to exchange\na wide variety of data on and off the Web. XML is a tree structure of nodes and nested nodes of\ninformation in which the user deﬁnes the names of the nodes.\n• Flat ﬁle: A ﬂat ﬁle is a ﬁle that is usually read or written sequentially. In general, a ﬂat ﬁle is a ﬁle\ncontaining records that have no structured inter-relationships.\n• Spreadsheets: An electronic spreadsheet consists of a matrix of cells into which a user can enter\nformulas and values.\n2.2\nEvaluation Framework\nThe goal of this section is to set up a framework for comparing the existing research works (methods and\ntools) and re-engineering non-ontological resources. Next, we present the identiﬁed characteristics grouped\naccording to the non-ontological resource, the transformation process, and the resultant ontology.\n2.2.1\nCharacteristics of the Non-ontological Resource\n• Type of the non-ontological resource. According to the typology introduced in [SFdCB+08], and up-\ndated in section 2.1 of this document, non-ontological resources can be (1) classiﬁcation schemes, (2)\nfolksonomies, (3) glossaries, (4) lexica and (5) thesauri.\n• Implementation of the non-ontological resource. According to the typology presented in [SFdCB+08],\nand updated in section 2.1, non-ontological resources can be implemented in (1) databases, (2) XML\nﬁles, (3) ﬂat ﬁles, or (4) spreadsheets.\n• The research work has the ability to transform a speciﬁc non-ontological resource into an ontology or\nto transform any non-ontological resource.\n• The research work tackles the non-ontological resource data model information. The data model\ndepicts the logical entity types, the data attributes describing those entities, and the relationships\nbetween entities [Car02].\n• The research work deals with the provenance information of the non-ontological resource. Prove-\nnance focuses on describing and understanding where and how data is produced, the actors involved\n5http://del.icio.us/\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "e7cd311f-6c6c-42a5-ab05-818d7bdd90c1"
}