{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 13\nTerminological Principles used for Ontologies \ndiscriminator \nclass \nattributes \nReference \nOralReference \nWrittenReference \nref = Integer pk \ntype = String \nsuppl = String \nref = Integer pk fk \njob: String  \nname: String\nref = Integer pk fk \nyear: String  \npublisher: String  \nauthor: String \ntitle: String\n{type}\n \nFigure 11: Conceptual data model for a part of a terminological database \n  \nWhen using UML for the elaboration of a conceptual data model for an IT \nsystem, the upper compartment of the class comprises the name of the class. \nThe middle compartment contains attributes. Information on operations may \nbe added in the lower compartment. Operations may for example specify \ninput or search procedures that may be carried out on the class. This is not \nshown in Figure 11. \n It is possible to add to the attributes information about data types as well as \ninformation about the primary key (pk) and foreign keys (fk); cf. Figure 11. \nOften this kind of information will not be found in the conceptual data model, \nbut rather in the logical data model, which represents the next step in the data \nmodeling process, i.e. a data model that represents the organization of infor-\nmation in a manner that reflects the structure of an information system. This \nstep is closer to the implementation into tables of a relational database. \n  The attributes that are used in standard UML for data modelling serve a \ndifferent purpose from the feature specifications in an ontology. They specify \nwhat kinds of information may be related to each class, and consequently to \neach instance represented in the IT system. The values of the attributes will \nexist only in an IT system (e.g. in a database), and they will give information \nabout instances; cf. also Madsen, Thomsen, Vikner (2002, 2005). \n The discriminator of UML corresponds to the subdivision criterion (subdi-\nviding dimension) in CAOS. However, in standard UML it is not possible to \nrepresent several dimensions from which one may be chosen as the subdivid-\ning dimension, and there is no notation for the specification of dimension \nvalues, as is the case in CAOS. Furthermore there is no (formal) connection \nbetween the discriminator and the attributes of subordinate concepts. \n In the literature on data bases, data modelling is also referred to as concep-\ntual modelling or semantic modelling, which may contribute to the confusion \n \n13\n",
  "speaker": "SYSTEM",
  "uuid": "e804fa4e-5aed-4cd2-ba80-2010562299f9"
}