{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 51\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 51 of 124\nChapter 4\nMethods for Re-engineering Classiﬁcation\nSchemes\n4.1\nIntroduction\nClassiﬁcation schemes [KBH+97] have a role in aiding information retrieval in a network environment, spe-\ncially for providing browsing structures for subject-based information gateways on the Web. Advantages\nof using classiﬁcation schemes include improved subject browsing facilities, and improved interoperability\nwith other services. Classiﬁcation schemes are likely the most valuable input for creating, at reasonable\ncost, ontologies in many domains. They contain, readily available, a wealth of category deﬁnitions plus a\nhierarchy, and they reﬂect some degree of community consensus [HdB07]. In this chapter we present a\ndeﬁnition of classiﬁcation schemes, the data models for representing classiﬁcation schemes and the method\nfor re-engineering classiﬁcation schemes into ontologies.\n4.2\nClassiﬁcation Scheme\nA classiﬁcation scheme [ISO04] is the descriptive information for an arrangement or division of objects into\ngroups based on characteristics, which the objects have in common. For example, the Fishery International\nStandard Statistical Classiﬁcation of Aquatic Animals and Plants (ISSCAAP)1.\nBased on [ISO04] we identify the following classiﬁcation scheme components in Figure 4.1:\n• cs_name, which is the name of the classiﬁcation scheme.\n• Classiﬁcation scheme item, which represents the individual item within a classiﬁcation scheme. It has\nthe following elements:\n– csi_name, which is the name of the classiﬁcation scheme item.\n– One or more csi_attributes\n• Classiﬁcation scheme item relationship, which is the relationship among items within a classiﬁcation\nscheme. Such relation serves to assist navigation through a large number of classiﬁcation scheme\nitems. It has the csir_name element, which is the name of the classiﬁcation scheme item relationship.\n1http://www.fao.org/figis/servlet/RefServlet\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "e88234f4-6323-4566-8717-166a31cbd983"
}