{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 8\n6\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n1. A New ICT Ecosystem\n1.1 The deep transformation of the competitive landscape\nA new ICT ecosystem is rapidly evolving, based on wide‐scale connectivity for mobile access and social com‐\nputing via remote cloud services, generating and using vast volumes of digital information end enabling the\nunification of the user experience on digital networks. These are the conditions in which LT companies oper‐\nate, and they will influence the future direction of the industry.\nIn the next two years…\nIn 2012 digital content has grown to 2.837 zettabytes, up almost 50% from 2011, on its way to 8.5ZB by 2015.\nBig Data technologies1, tools, and services that turn this information overload to information gains are the\nnext opportunity for competitive advantage, and LT is a core Big Data technology.\nBy 2014, the number of intelligent communicating devices on global networks will outnumber traditional\ncomputing devices by almost 2 to 1, with “intelligence” largely driven by the semantics of LT. This will change\nthe way people think about interacting with each other, and with their devices.\nA growing number of ICT solutions will be built on the next‐generation cloud platforms producing high‐value,\nvertically‐focused solutions. LT is premium enabling technology for vertical solutions, as it employs semantical‐\nly rich domain knowledge.\nOver 80% of new software applications will be distributed/deployed on clouds, making the packaged soft‐\nware market increasingly obsolete. Legacy packaged Enterprise apps will start migrating to clouds, but the\nrace for innovation is not necessarily dominated by legacy global software suppliers. Cloud platforms level the\nplaying field for innovative LT suppliers.\nCloud services spending will hit $60 billion, growing at 26% a year. This is still less than 10% of IT  spending,\nbut with over 50% of customers transitioning to the cloud, the huge strategic impact of cloud competencies\nis obvious. Amazon Web Services will join the $1 billion IT cloud services club and Google Enterprise is right\nbehind. The opportunity for innovative cloud platforms is wide open. Cloud platforms unlock the potential for\nubiquitous embedding of LT across the ICT landscape.\nSpending on mobile devices will grow 23%, driving 43% of IT growth; a mobile strategy is priority number\none for all industry players in 2012. Mobile device spending will exceed PC spending, growing 4 times as fast.\nIntelligent interactivity using LT is a signal feature of the new mobile market.\nMobile data services will exceed fixed‐line data, growing over twice as fast. Mobile operators are on the front\nlines of mobile‐device‐driven opportunities; a sustainable model for funding network growth will demand\nnew‐generation services. Consumers have demonstrated their appetite for the personalised features LT delivers.\nOver 700 million smart phones and tablets will be shipped in 2012, a jump of 34%, nearing double PC ship‐\nments. This growing advantage in volumes is a major attraction for developers and a key factor in the PC‐\nversus‐mobile device war. Establishing LT-based dominance on mobile devices (speech interfaces, intelligent\nassistants, language translation, semantic awareness of location, context) is a strategic position in this war.\n1 Definition of Big Data Technology as well as its differences with Business analytics is provided in the report\nAnnex.\n",
  "speaker": "SYSTEM",
  "uuid": "e8dfa3c9-7ba9-4ae4-90b1-9b957740a08e"
}