{
  "message": "SYSTEM: MasterUPM_O%26SW-english.pdf: Página 3\nUnit 12. \nProcedures and methods to turn content information from databases into semantic contents \nusable in the semantic web. Accessing data bases in terms of semantic contents. \nUnit 13. \nArchitectures and languages used in creating semantic web services (WSMO, OWL-S) \nUnit 14. \nApplications using semantic web technologies that have been built in national and \nEuropean projects in different domains (e-commerce, knowledge management, semantic portals, etc.) \n \nTo allow students to consolidate knowledge and skills acquired throughout the course some assignments \nrelated to each unit have been designed.  Students will work in pairs and all the coursework to be done \nwill be related to a specific domain. That domain will be agreed by the teacher and the students. The aim \nis to enable students to apply the knowledge acquired in the course in order to face new situations and \nsolve real problems. Thus, students will be well prepared to adapt to the continuous technological \nevolution in this field.  \n \nThe units mentioned above will be explained as follows:  \n• Unit 1.  Introduction to the Semantic Web \n• Unit 2. Terminological resources used for ontological purposes \n• Unit 4. General overview of ontologies \n• Unit 5. Languages used in the semantic web \n• Unit 6. Editors and reasoners \n• Unit 7. Methodologies used in building ontologies \n• Unit 8. Ontology specification requirements \n• Unit 9. Ontology reusing, reengineering and learning  \n• Unit 10. Ontology alignments and mappings \n• Unit 3.  Multilingualism in ontologies \n• Unit 11. Textual and multimedia annotation \n• Unit 12. Semantic access to distributed DBs \n• Unit 13. Semantic Web Services \n• Unit 14. Applications \n \nMethodology \n  \nTable 1 describes the coursework that students will have to prepare for each unit and the technologies that \nwill be used. \n \n \n \n  \n",
  "speaker": "SYSTEM",
  "uuid": "e94a93c1-d433-44a0-a73f-2df8f8efa0fb"
}