{
  "message": "SYSTEM: Hirst-Ontol-2003.pdf: Página 11\n1. Ontology and the Lexicon\n11\nclear, agreed-on top-level ontology, a project that has exercised many people for\nmany years. That is, we have found that we cannot build a satisfactory top-level\nontology merely by looking at the relevant vocabulary of one or even several natu-\nral languages; see, for example, the extensive criticisms by Gangemi, Guarino, and\nOltramari (2001) of the top level of WordNet as an ontology. From this, we can\nconclude that the upper levels of the lexical hierarchy are a poor ontology.\n1.4.3 Linguistic categorizations that are not ontological\nAnd yet, even though natural languages omit many distinctions that we would plau-\nsibly want in an ontology, they also make semantic distinctions—that is, distinctions\nthat are seemingly based on the real-world properties of objects—that we probably\nwouldn’t want to include in an ontology. An example of this is semantic categoriza-\ntions that are required for “correct” word choice within the language and yet are\nseemingly arbitrary or unmotivated from an ontological point of view. For example,\nEnglish requires the division of vehicles into categories according to whether or not\nthe vehicle can be viewed as a container (e.g., bus and canoe versus bicycle), and, if\na container, whether or not one can stand up in it (e.g., bus versus car and canoe).\nThe verb board may only be used with vehicles that are containers that one can\nstand in; the verb ride in rather than ride on may only be used with vehicles that are\ncontainers that one cannot stand in.\nOften, the linguistic categorization is not even a reliable reﬂection of the world.\nFor example, many languages distinguish in their syntax between objects that are\ndiscrete and those that are not: countable and mass nouns. This is indeed an im-\nportant distinction for many ontologies; but one should not look in the lexicon to\nﬁnd the ontological data, for in practice, the actual linguistic categorization is rather\narbitrary and not a very accurate or consistent reﬂection of discreteness and non-\ndiscreteness in the world. For example, in English, spaghetti is a mass noun, but\nnoodle is countable; the English word furniture is a mass noun, but the French meu-\nble and German M¨obel are countable.\nA particularly important area in which languages make semantic distinctions\nthat are nonetheless ontologically arbitrary is in the behaviour of verbs in their\ndiathesis alternations—that is, alternations in the optionality and syntactic real-\nization of the verb’s arguments, sometimes with accompanying changes in meaning\n(Levin 1993). Consider, for example, the English verb spray:\n(1)\nNadia sprayed water on the plants.\n(2)\nNadia sprayed the plants with water.\n(3)\nWater sprayed on the plants.\n(4)\n\u0003The plants sprayed with water.\n(The ‘ \u0003’ on (4) denotes syntactic ill-formedness.) These examples (from Levin\n1993) show that spray permits the locative alternation (examples 1 and 2), with\neither the medium or the target of the spraying (water or the plants) being realized\nas the syntactic object of the verb, and the second case (example 2) carrying the\nadditional implication that the entire surface of the target was affected; moreover,\n",
  "speaker": "SYSTEM",
  "uuid": "e991ce0d-c78d-4d3c-b4f1-8ee153c7fd44"
}