{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 11\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n11\nFig. 5: Facebook-based user authorization management\nUpGrid Control Point sends a SIP call to the remote Home Gateway, and once\naccepted it has access to the authorized resources.\nOur UpGrid Control Point also provides search functionalities using tags and\nontology-based annotations, and an alert service associated to these search func-\ntionalities that informs the user of any changes to the ontology-based metadata\navailable in our local metadata server or any other authorized remote metadata\nserver according to a given SPARQL query.\nSome videos of the current user interface of the UpGrid Control Point in\naction while adding friends, annotating multimedia resources, browsing through\nlocal and remote resources, generating alerts, etc., can be found at http://www.\nyoutube.com/results?search_query=UPnPGrid.\n6\nEvaluation of the UpGrid Control Point\nIn order to measure the quality of the UpGrid Control Point, a set of 15 par-\nticipants were selected. Levels of experience on web technologies ranging from\nlow to high. A practical use case was created and presented to each participant.\nThis use case covered most of the functionality of the UpGrid application, such\nas annotation of images and audio, semantic search in the available semantic\nrepositories and management of friend's multimedia resources. This use case\ntypically required 30 minutes to each participant.\nAfter the use case, a detailed questionnaire was presented to each partic-\nipant (available at http://sites.google.com/site/upgridquestionnaire).\nThis questionnaire had 49 questions comprising three di\u001berent features: (a) user's\nskills in UPnP and web technologies, (b) usability of the Control Point and (c)\nuser's satisfaction concerning the User Interface of the Control Point. Most of\nthese questions were based on standard questionnaires [11].\nThe number of participants is a balance between precision and e\u001bort. As\nshown by formula (1), in order to achieve a 90% con\u001cdence level for a given\nmean with error less than 1%, it is required to take 15 measurements at least [7].\nThis assumes intervals based on a normal population distribution for mean, as\nwe consider it is the case.\n",
  "speaker": "SYSTEM",
  "uuid": "ea6c3fb5-0091-49b4-9744-99121c4cf7dd"
}