{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 2\n2\nAndr´es Garc´ıa-Silva et al.\nwell as synonyms, acronyms, and ambiguous tags. Misspellings, synonyms and\nacronyms cause that not all the relevant resources are retrieved in user queries,\nwhile ambiguous tags cause that irrelevant resources are presented to the user.\nBesides, as it happens with the rest of web content, tags are available in mul-\ntiple languages. We have not found any general statistics about multilinguality in\nfolksonomies though we can cite the results of a recent report on Internet statis-\ntics3, as of December 2009, English speaking users of Internet were only 27.7%\nof the total. Thus, resources are hidden behind the language barrier created by\nthe tag language. For instance, images tagged with tags in Spanish cannot be re-\ntrieved by users who do not know that language. An experiment reported herein\nshows that in some domains (e.g., Tourism) people use more than one language\nto tag their pictures. In the analyzed data set we found that 53% of pictures\nwere tagged with tags in English and Spanish.\nSome proposals [3, 10, 17, 13] tackle the lacks of semantics associated with\ntags by clustering them, in the hope of such grouping exposes the meaning of\nthe tags. The clusters are created according to a deﬁned relation among tags,\nusually relying on a deﬁnition of tag similarity [6]. On the other hand, other\nauthors [1, 5, 20] address this problem by relating folksonomies to ontologies. We\nexpect that semantically enriched folksonomies will lead to better information\nretrieval processes and will be used as knowledge source. In this context, precision\ncan be improved due to the fact that tags are related with their meaning and\nthus the system can use this semantic information to deliver more accurate\nresults. Semantic relations among tags can be used to carry out query expansion\nprocesses [18] so that a richer result set can be presented to the user.\nHowever, the multilinguality of tags has not been addressed by any of the\naforementioned approaches. As a matter of fact, those approaches using on-\ntologies are limited to the natural language in which ontology is written, and\ncurrently most of the ontologies are written in English. Aiming at overcom-\ning the tag language barrier, we have generated a multilingual sense repository\nbased on Wikipedia and DBpedia [4], and propose an approach (Sem4Tags) for\nthe semantic grounding of multilingual tags in folksonomies that exploits that\nmultilingual sense repository.\nThe created sense repository contains terms associated with one or more\nsenses in the term language. For each sense we have the keywords appearing\nin the corresponding Wikipedia article along with their frequency. In addi-\ntion, senses in Spanish and English are related to DBpedia resources. We chose\nWikipedia and DBPedia due to its large coverage and multilinguality support in\ncontrast to some domain ontologies. Wikipedia evolves continuously with user\ncontributions in diﬀerent languages, while DBPedia represents in RDF a snap-\nshot of some part of the Wikipedia information. Although DBpedia’s main lan-\nguage is English, other languages are represented and linked to English resources.\nThe process for the semantic grounding starts by preprocessing the tag and\nits context. Then it carries out a sense disambiguation activity where the most\nprobable sense, among the set of candidate senses, is selected according to the\n3 http://www.internetworldstats.com/stats7.htm\n",
  "speaker": "SYSTEM",
  "uuid": "ead5a005-4952-44a4-9f79-80e4c921251c"
}