{
  "message": "SYSTEM: Ruiziniesta_030414.pdf: Página 17\nDocument Structure \nhttp://purl.org/spar/doco \n \ntitle \nlist of authors \nsection \nbibliography \ntable \nfigure \nCommon motifs in scientific workflows: An empirical analysis \nAbstract. Workflow technology continues to play an \nimportant role as a means for specifying and enacting \ncomputational experiments in modern science……… \n4. Scientific workflow motif catalog for abstracting \nworkflows \n …………………………………………………………….... \nKeywords. Workflow motif, Workflow pattern, Taverna, \nWings... \nD.Garijo, et al., Common motifs in scientific worksflows: An empirical analysis, Future Generation \nComputer Systems (2013), In press. \nReferences \n[1] Ewa Deelman, Dennis Gannon, Matthew Shields, Ian \nTaylor …. \n[2] Katherine Wolstencroft, Robert Haines, Donal Fellows, \nAlan Williams, … \n[3] Yolanda Gil, Varun Ratnakar, Jihie Kim, Pedro A. \nGonzález-Calero, Paul T. Groth,…. \n[4] Jeremy Goecks, Anton Nekrutenko, James Taylor, Galaxy: \na comprehensive… \n[5] Carlos E. Scheidegger, Huy T. Vo, David Koop, Juliana \nFreire, Claudio T. Silva,… \n[6] Bertram Ludäscher, Ilkay Altintas, Chad Berkley, Dan \nHiggins, Efrat Jaeger, \nMatthew Jones, Edward A. Lee, Jing Tao, Yang … \n[7] Thomas Fahringer, Radu Prodan, Rubing Duan, Jürgen \nHofer, Farrukh Nadeem… \n[8] Jia Zhang, Wei Tan, J. Alexander, I. Foster, R. Madduri, \nRecommend-as-yougo… \n……………………………………… \n[12] Daniel Garijo, Pinar Alper, Khalid Belhajjame, Oscar \nCorcho, Yolanda Gil, Carole Goble, Common motifs in \nscientific workflows: an empirical analysis, in: 8th IEEE \nInternational Conference on eScience 2012, Chicago, IEEE \nComputer \nSociety Press, USA, 2012. \n7 Conclusions \n………………………………………………………….... \nIn doing so, we have defined a catalog of motifs  distinguishing \nData-Operation motifs, which describe the tasks carried out by \nthe workflow steps, from Workflow- Oriented motifs, which \ndescribe the way those tasks are implemented within the \nworkflow………………………………………… \n………………………………………………………… \nAs part of our future work, we envisage deriving best practices \nthat can be used in workflow design and providing tools that \nassist users in automatic workflow annotation using our Motif \nOntology………………………………………………………… \n1 Introduction \nA scientific workflow is a template defining the set of tasks \nneeded \nto \ncarry \nout \na \ncomputational \nexperiment \n[1].…………………………………………………… \n..In this paper we present the result of an empirical analysis \nperformed over 260 workflow descriptions from Taverna \n[2], Wings [3], Galaxy [4] and Vistrails [5]. Based on this \nanalysis, we propose a catalog of  domain independent \nconceptual abstractions for workflow steps that we call \nscientific \nworkflow \nmotifs……………………………………………………………\n……………. \nThe new contributions reported on in this paper are an \nextension of the related work in Section 2, the addition and \nextension of scientific domains from Wings and Taverna \nworkflows (Social Network Analysis, Astronomy and \nDomain Independent) in  Sections 3 and 5; and the \nanalysis of workflows from  the Galaxy and Vistrails \nsystems among different  domains (Genomics, Text Mining, \nDomain Independent and Medical Informatics). Finally, we  \nhave also revisited the motif catalog (Section 4), our \nprevious results (Section 5) and conclusions (Section 7) \naccording to our new findings. \nThis paper extends our previous work [12], which \nperformed \nan analysis of 177 workflows from Wings and Taverna \n2 Related work \n……………………………………………………………………\n……………………………………………… \n3 Analysis setup \n………………………………..…………………………………\n……………………………………………… \n3.2 Approach for workflow analysis \nOur analysis has been performed based on the \ndocumentation, metadata and traces available for each of \nthe \nworkflows \nwithin \nthe \ncohort \nstudied……………………………………………………………\n……………………………………… \n \n \n \n \n \n \n \n \nAcknowledgments \nThis research was supported by the… \nDaniel Garijo, Pinar Alper, Khalid Belhajjame, Oscar Corcho , Yolanda Gil ,Carole Goble  \n \nOntology Engineering Group, Universidad Politécnica de Madrid, Spain \nSchool of Computer Science, University of Manchester, United Kingdom \nInformation Sciences Institute, Department of Computer Science, University of Southern California, United States \nTowards an annotation schema for Dr Inventor \n",
  "speaker": "SYSTEM",
  "uuid": "eb95411d-1c87-4819-9661-5cefc6320109"
}