{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 59\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 59 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n Scheduling [32] refers to the activity of identifying the tasks to be performed during the \nontology development, their arrangement, and the time and resources needed for their \ncompletion. \n Ontology Search refers to the activity of finding candidate ontologies or ontology modules to \nbe reused. \n Ontology Selection refers to the activity of choosing the most suitable ontologies or ontology \nmodules among those available in an ontology repository or library, for a concrete domain of \ninterest and associated tasks. \n Ontology Specialization is an ontology enrichment activity for extending the ontology in \ndepth. \n Ontology Specification is a collection of requirements that the ontology should fulfill, e.g. \nreasons to build the ontology, target group, intended uses, possibly reached through a \nconsensus process.  \n Ontology Summarization refers to the activity of providing an abstract or summary of the \nontology content. \nNote: The summary can include, for example, a couple of top levels in the ontology class \nhierarchy (perhaps a graphical representation of these top-level concepts and links between \nthem). \n Ontology Translation refers to the activity of changing the representation formalism or \nlanguage of an ontology from one to another.  \nNote: Ontology Translation can be part of an ontology reengineering process. \n Ontology Update refers to minor changes carried out in an ontology that could not be \nconsidered an upgrade. \n Ontology Upgrade refers to the activity of replacing an existing ontology with a new version. \n Ontology Validation is the ontology evaluation that compares the meaning of the ontology \ndefinitions against the intended model of the world aiming to conceptualize. \nNote: It answers the question: Are you producing the right ontology?.  \n Ontology Verification is the ontology evaluation which compares the ontology against the \nontology specification document (ontology requirements and competency questions), thus \nensuring that the ontology is built correctly (in compliance with the ontology specification). \nNote: It answers the question: Are you producing the ontology right?. \n Ontology Versioning [54] refers to the activity of handling ontology changes by creating and \nmanaging different versions of the ontology. \nThe 53 definitions and their corresponding comments included in the NeOn Glossary of Activities \nhave been checked and reviewed by an expert terminologist from the UPM team, from a linguistic \npoint of view. \n3.3. Required or If Applicable Activities  \nIn order to facilitate the identification of which activities are important and neccessary for \ndeveloping a software product, IEEE standards [3, 4] identify which activities are mandatory and \noptional when developing a particular software product.  \nActivities of the software development process are categorized as either mandatory or “if \napplicable” [3]. Mandatory activities must be always carried out, and “if applicable” ones contains \nan explanation of the cases to which it will apply. For example, most activities in the Project \n",
  "speaker": "SYSTEM",
  "uuid": "ec62004c-61d7-4d45-aaf1-50e713e123ce"
}