{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/EventosWebNmasUno \n\nEventos\nEvento\nLugar\nFecha\nAsistente\nDescripción\nTipo Evento\nRanking\nURL\nGrupos asistentes\n2010 ACM SIGMOD/PODS\nIndianapolis, USA\n6 - 11 Junio 2010\nConferencia internacional de mayor importancia en el área de bases de datos.\nConferencia\nA+\nhttp://www.sigmod.org/\nISWC 2010: 9th International Semantic Web Conference\nShanghai, China\n7 - 11 Noviembre 2010\nForo internacional de mayor importancia para las áreas de investigación relacionadas con la red semántica.\nConferencia\nA+\nhttp://iswc2010.semanticweb.org/\nVLDB 2010: 36th International Conference on Very Large Data Bases\nSingapur\n13 - 17 Septiembre 2010\nForo anual internacional para investigadores, proveedores, profesionales y usuarios vinculados a las áreas de manejo de datos y bases de datos.\nConferencia\nA+\nhttp://www.vldb2010.org/\nAAAI 2010: Twenty-Fourth AAAI Conference on Artificial Intelligence\nAtlanta, USA\n11 - 15 Julio 2010\nEl propósito de esta conferencia es promover la investigación en el área de inteligencia artificial, así como también, fomentar el intercambio de conocimientos científicos entre los investigadores, profesionales, científicos e ingenieros de las disciplinas relacionadas a la inteligencia artificial.\nConferencia\nA+\nhttp://www.aaai.org/Conferences/AAAI/aaai10.php\nICDE 2010:26th IEEE International Conference on Data Engineering\nLong Beach, USA\n1 - 6 Marzo 2010\nConferencia internacional con enfoque al uso de técnicas y metodología ingenieriles en el diseño, desarrollo y evaluación de sistemas de información.\nConferencia\nA+\nhttp://www.icde2010.org/index.php/\nWWW\nRaleigh Convention Center-NC-USA\n26 - 30 Abril 2010\nEvento global en el que se juntan todos los investigadores  que dan forma a la Web\nAcadémico/Workshop/ Industrial\nA+\nhttp://www2010.org/www/\nRDB2RDF Working group:\nhttp://www.w3.org/2009/08/rdb2rdf-charter.html\nProvenance incubator group Charter:\nhttp://www.w3.org/2005/Incubator/prov/charter\nESWC2010: 7th Extended Semantic Web Conference\nHeraklion, Grecia\n30 Mayo - 03 Junio 2010\nConferencia internacional enfocada en las áreas de investigación de tecnologías de red semántica.\nConferencia\nA\nhttp://www.eswc2010.org/\n\"EKAW 2010: International Conference on Knowledge Engineering and Knowledge Management \"\nLisboa, Portugal\n11 - 15 Octubre 2010\nConferencia internacional con enfoque en las áreas de adquisición, modelado y manejo de conocimiento, así como también, el papel que estas tienen en la construcción de sistemas y servicios para la red semántica, e-business, procesamiento de lenguaje natural, integración inteligente de información,  etc.\nConferencia\nA\nhttp://ekaw2010.inesc-id.pt/\n\"EDBT 2010:13th International Conference on Extending Database Technology\"\nLausanne, Suiza\n22 - 26 Marzo 2010\nConferencia internacional donde se presentan avances de investigación en el área de manejo de datos.\nConferencia\nA\nhttp://lbd.epfl.ch/EDBTICDT/\n\"HPDC 2010:High Performance Distributed Computing\"\nChicago, Ilinois\n21 - 25 Junio 2010\nConferencia en la que se presentan los últimos resultados en diseño, implementación, evaluación y uso de sistemas distribuidos paralelos.\nConferencia/Workshop\nA\nhttp://hpdc2010.eecs.northwestern.edu/\nDEXA 2010: 21th International Conference on Database and Expert Systems Applications\nBilbao, España\n30 Agosto - 3 Septiembre 2010\nDEXA es una conferencia internacional anual realizada en Europa en la cual se presentan los últimos avances en la investigación de sistemas de bases de datos, así como también, integración de conocimiento, información y datos.\nConferencia\nA\nhttp://www.dexa.org/\nIIWAS 2009: 11th International Conference on Information Integration and Web-based Applications & Services\nKuala Lumpur, Malasia\n14 - 16 Diciembre 2009\nConferencia internacional al fin del intercambio de conocimientos, ideas, resultados y experiencias en todas las áreas relacionadas con la integración de información y aplicaciones y servicios basados en la web.\nConferencia\nC\n\"\nhttp://www.wikicfp.com/cfp/servlet/event.showcfp?eventid=5148&copyownerid=2\n\"\nIRI 2010:IEEE International Conference on Information Reuse and Integration\nLas Vegas, USA\n26 - 28 Julio 2010\nConferencia internacional enfocada a los temas de re-uso de información, integración de información y re-uso de sistemas.\nConferencia\n?\nhttp://iri2010.cpsc.ucalgary.ca/\nICWE 2010: 10th International Conference on Web Engineering\nVienna, Austria\n5 - 9 Julio 2010\nConferencia internacional que promueve la investigación y el intercambio de conocimientos científicos en el área de ingeniería web.  Esta conferencia esta dirigida a científicos y profesionales interesados en  tecnologías, metodología, herramientas y técnicas para el desarrollo de aplicaciones web y para fomentar y mejorar la diseminación de los contenidos en la web.\nConferencia\n?\nhttp://icwe2010.webengineering.org/\nBIS 2010: 13th International Conference on Business Information Systems\nBerlin, Alemania\n3 - 5 Mayo 2010\nConferencia internacional que cubre todos los aspectos relacionados a las tecnologías informáticas para los negocios.\nConferencia\n?\nhttp://bis.kie.ae.poznan.pl/13th_bis/\nNTII 2010: 2nd International Workshop on New Trends in Information Integration\nLong Beach, USA\n1 - 6 Marzo 2010\nWorkshop en nuevas técnicas de integración de información.\nWorkshop\n?\nhttp://www.cse.iitb.ac.in/~grajeev/ntii10/index.htm\n\"SSPS 2010: 3rd International Workshop on Scalable Stream Processing Systems\"\nAtlanta, USA\n23-abr-10\nWorkshop con  temas de interés en los diferentes aspectos relacionados al diseño e implementación de sistemas altamente escalables para el procesamiento de flujo de datos.\nWorkshop\n?\nhttp://research.ihost.com/ssps/\nGLOBE 2010:  3rd International Conference on Data Management in Grid and P2P Systems\nBilbao, España\n30 Agosto - 3 Septiembre 2010\nConferencia internacional enfocada a temas en Grid and Peer-to-Peer computing y su importancia en la escalabilidad de sistemas distribuidos para el manejo eficiente de datos voluminosos, distribuidos e heterogéneos.\nConferencia\n?\nhttp://www.globe2010.com/about/past-globe-events.aspx\n\"AMW 2010: IV Alberto Mendelzon International Workshop on Foundations of Data Management\"\nBuenos Aires, Argentina\n17-may-10\nWorkshop en manejo de datos, organizado por la comunidad de investigadores latino americanos en el área de manejo de datos.\nWorkshop\n?\nhttp://www-2.dc.uba.ar/amw2010/\nSemantic Days 2010\nStavanger, Noruega\n31 Mayo - 2 Junio 2010\nConferencia anual orientada a uso de ontologías y tecnología semántica.\nConferencia / Tutorial\n?\nhttps://www.posccaesar.org/wiki/PCA/SemanticDays2010\neScience\nAmsterdam, Hollanda\n13 – 17 Septiembre 2010\nSe realizará un informe acerca de la Infraestructura grid europea\nAcadémico\n?\nhttp://www.sintef.no/Projectweb/eVITA/English/eSCience-Meeting-2010/\nProvenance Challenge\n¿?\nSuele ser en Junio. Se suele saber en Marzo\nEvento que surgió por primera vez en el IPAW’06 porque la comunidad decidió que se necesitaban comprender las distintas representaciones de provenance, aspectos comunes y razones por las que son diferentes.\nWorkshop\n?\nhttp://twiki.ipaw.info/bin/view/Challenge/\nDataSem 2010: 1st International Workshop on Data Semantics\nLausanne, Suiza\n22-mar-10\nWorkshop con el propósito de reunir investigadores, profesionales y usuarios vinculados a la semántica de datos.  Los temas de interés incluyen desde teorías que soporten la definición formal de contenido semántico, hasta descripción de sistemas innovadores que utilicen conocimientos semánticos para la solución de problemas en un dominio especifico.\nWorkshop\n\"?(Si es la DASWIS, encontes C)\"\nhttp://cs.ulb.ac.be/conferences/datasem10/",
  "speaker": "SYSTEM",
  "uuid": "ecb24110-691c-4868-b9c4-e84ff9fe5040"
}