{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/STIoct2010 \n\nOpen position: PhD student in various EU projects\nThe Semantic Technology Institute (STI) Innsbruck (\nhttp://www.sti-innsbruck.at\n), formerly known as DERI Innsbruck, was founded in 2002 and has developed into a challenging and dynamic research institute of approximately 40 people. STI Innsbruck collaborates with an international network of institutes in Asia, Europe and the USA, as well as with global industrial partners.\nOur major objective is to establish Semantic technologies as a core pillar of modern Computer Science, thereby providing interoperability and scalability for Semantically Enabled Service Orientated Architectures.\nSTI Innsbruck is currently seeking candidates for the position of a PhD student.\nWe offer\n•\tA stimulating environment of a leading research group in the fields of Semantic Web, Semantic Web services, formal languages and reasoning\n•\tExcellent ties to research groups worldwide\n•\tUp-to-date infrastructure and resources, including funding for attending international conferences, PhD symposia, summer schools, etc.\n•\tStandardized international exchange programs such as BIT\n•\tOpportunity to work in nationally funded integrated research projects\n•\tOpportunity to take part in international research projects focusing on topics such as Web 2.0, service-oriented computing, formal languages and reasoning, ontologies and ontology engineering\n•\tOpportunity to work with internationally established academic and industrial partners\n•\tMulticultural working place with modern infrastructure and facilities\nWe expect\n•\tA strong background in Computer Science or related disciplines\n•\tWillingness to work in an international environment\n•\tThe ability to take part in large-scale international research projects\n•\tWillingness to combine formal scientific work with application-oriented research in order to solve real-world problems\n•\tResearch interest and expertise in at least one of the areas: Formal languages and reasoning (Description Logics, Logic Programming), ontology languages, Semantic Web services, ontologies, business aspects of semantic systems.\nWe kindly invite you to submit your application to:\nUniversität Innsbruck\nChiffre MIP-6231\nPosteinlaufstelle der Zentralen Dienste\nInnrain 52\nA-6020 Innsbruck\nApplication deadline: Nov 10, 2010",
  "speaker": "SYSTEM",
  "uuid": "ed60e31f-5269-471b-be90-5078dd0d19f1"
}