{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 6\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 6 de 42 \nDesde 2010, han realizado estancia en el Grupo de investigación más de 35 invitados, siendo \n29 investigadores predoctorales y 6 profesores doctores: \n• Jose Leomar Todesco –Universidad Federal de Santa Catarina \n• Catherine Roussey – National Research Institute of Science and Technology for \nEnvironment and Agriculture \n• Rosa Alarcón – Pontificia Universidad Católica de Chile \n• Edna Ruckhaus – Universidad Simón Bolívar \n• Nataliya Keberle – Zaporizhzhya National University \n• Philip Cimiano – Catedrático en la Universidad de Bielefeld \n1.5 \nPrincipales resultados científicos y tecnológicos \nEn esta sección se incluyen los resultados más relevantes en el área de Ingeniería Ontológica, \ntecnologías semánticas y Datos Enlazados, señalando en negrita aquellos que son de directa \naplicación para el desarrollo de este proyecto. La sección 2.5 enumera los 16 registros de \nutilidad del software. \nAlgunos de los resultados más importantes en el área de Ingeniería Ontológica son: \n1. Las metodologías de desarrollo de ontologías METHONTOLOGY y la metodología \nNeOn, ampliamente utilizadas por la comunidad científica y empresarial nacional e \ninternacional. \n2. Ontologías: \na. Ontologías para representar metadatos de recursos: OMV y NoRMV. \nb. Ontología de gestión de recursos humanos.  \nc. Ontología de fenómenos geográficos e hidrográficos. \nd. Ontología LIR para representar conocimiento lingüístico en ontologías. \ne. En colaboración con otras instituciones internacionales se han desarrollado las \nontologías siguientes en el contexto del W3C: PROV-O (provenance), SSN \n(redes de sensores), M3 (multimedia) y OntoLex (Ontologías y lingüística). \n3. Desarrollo de numerosas herramientas que dan soporte al ciclo de vida del desarrollo \nde una ontología. Las más significativas son: \na. labeltranslator para traducir ontologías a otros idiomas,  \nb. OWL Doc para generar documentación sobre ontologías, \nc. OOPS!! para evaluar ontologías,  \nd. Oyster, repositorio de ontologías distribuido. \nAlgunos de los resultados más importantes del OEG en el área de Datos Enlazados son:  \n1. Desarrollo de numerosas herramientas para la generación de Datos Enlazados en \ndiferentes dominios: \na. Marimba para transformar registros de bibliotecas en formato MARC21 en \nRDF. \nb. Vocab-express para explorar el vocabulario utilizado en un conjunto de Datos \nEnlazados. \nc. R2O+, ODEMapster+ y Morph para generar RDF a partir de bases de datos. \nd. Geometry2rdf para generar ficheros RDF a partir de información geométrica \n(que puede estar disponible en GML o WKT). \ne. Map4rdf para explorar y visualizar conjuntos de datos RDF enriquecidos con \ninformación geométrica. \nf. \nSem4Tag para descubrir a partir de las etiquetas procedentes de redes \nsociales (en inglés o español) aquellos recursos de DBpedia  que definen el \nsignificado de cada etiqueta procesada. \ng. SPARQL-DQP extiende SPARQL permitiendo la federación de consultas.  \nh. Licensius verifica y recomienda el tipo de licencia que debe utilizar un conjunto \nde datos. \n2. Transformación de recursos lingüísticos a datos enlazados: \na. Terminesp \nb. Familia Apertium \n",
  "speaker": "SYSTEM",
  "uuid": "ee05544e-06f5-46ac-b05d-7c8086a04159"
}