{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 3\n \n \nPág. 5 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nMotivación  \n1\n \nTanto la Agenda Digital para España como la Estrategia Española de Ciencia y Tecnología y de \nInnovación, establecen el desarrollo de la economía y la sociedad digital como uno de los retos \nglobales que requieren un mayor esfuerzo en materia de Investigación Científica, Desarrollo e \nInnovación Tecnológica (I+D+i); y señalan como una fortaleza del país la posición de liderazgo \ncientífico, tecnológico y empresarial del sector de las Tecnologías de la Información y la \nComunicación (TIC). Se le identifica como un ámbito estratégico de innovación con gran \npotencial para aumentar la competitividad del tejido productivo e impulsar el crecimiento y la \ngeneración de empleo. Asimismo, las Comunidades Autónomas coinciden en señalar en sus \nEstrategias de Especialización Inteligente en Investigación e Innovación (RIS3), el potencial \ntractor de las TIC en la economía. \nEn el mismo sentido, el informe de conclusiones y recomendaciones del “ERAC Peer Review of \nSpanish Research and Innovation System”, presentado el 24 de julio de 2014 y elaborado por un \ngrupo de expertos europeo en I+D+i anima a desarrollar iniciativas, lideradas por las empresas y \nlas Administraciones Públicas, en los denominados Ámbitos Estratégicos de Innovación. En ellos \nse establecen una serie de prioridades que reflejen las oportunidades de mercado, las fortalezas \nexistentes y el potencial futuro en un entorno competitivo internacional.. El informe señala tres \nprincipios de actuación fundamentales:  \n \n \n \n \n \n \n \n \nLa Secretaría de Estado de Telecomunicaciones y para la Sociedad de la Información (SETSI) \ntiene entre otras competencias: \n• \nEl estudio, propuesta y ejecución de la política general sobre telecomunicaciones y \nSociedad de la Información.  \n• \nLa promoción y desarrollo de las infraestructuras y servicios avanzados de \ntelecomunicaciones y de la Sociedad de la Información. \n• \nEl impulso y la coordinación de los planes, proyectos tecnológicos y programas de \nactuaciones para el fomento de la Sociedad de la Información. \n1) La identificación de proyectos de innovación a gran escala desde un enfoque de \nespecialización y con un fuerte componente de I+D+i y una amplia contribución de las \ntecnologías de la información. \n2) La necesidad de dotarse de enfoques e instrumentos caracterizados por un horizonte \ntemporal de medio plazo (5-10 años)  \n3) La concentración de recursos para incrementar la eficiencia y la eficacia de las ayudas para \nque el impacto sea mayor y se produzcan cambios efectivos en el desarrollo económico y \nsocial de los sectores o regiones en los que se esté actuando. \n",
  "speaker": "SYSTEM",
  "uuid": "ee5dfc7c-5e63-4c88-81e9-a258795f48d7"
}