{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 13\nPREFIX\nf i r e : <http ://www. ssg4env . eu#>\nPREFIX\nr d f : <http ://www. w3 . org /1999/02/22−rdf−syntax−ns#>\nSELECT RSTREAM ? speed\nFROM STREAM <www. ssg4env . eu/ SensorReadings . s r d f > [FROM NOW −10 MINUTES TO\nNOW STEP 1 MINUTE]\nWHERE {\n?WindSpeed a\nf i r e : WindSpeedMeasurement ;\nf i r e : hasSpeed\n? speed ;\n}\nListing 5. sparqlStream query which every minute returns the wind speed for\nthe last ten minutes.\nSELECT\nRSTREAM\nconcat(’http :// ssg4env.eu# WindSpeedMeasurement ’,windsamples .\nsensorId ,windamples.ts) AS id , windsamples .speed AS speed\nFROM\nwindsamples[FROM\nNOW - 10\nMINUTES\nTO NOW\nSLIDE 1 MINUTE ];\nListing 6. The sneeql query that is generated for the input query in Listing 5.\nping deﬁnes that WindSpeedMeasurment instances are generated based on the\nsensorId and ts attributes of the windsamples stream, using a concatenation\nfunction to generate each instance uri. Similarly the S2O mapping deﬁnes that\nhasSpeed properties are generated from the values of the speed attribute of the\nwindsamples stream. The processor will evaluate this as:\nλ(Φwindsamples(xsensorId, xts, zspeed)[now −10, now, 1]) =\nπsensorId,ts,speed(ωnow−10,now,1(windsamples))\nIn this case no joins and other selection conditions are needed, and only one\nstream has to be queried to produce the results. The query generated in the\nsneeql language is shown in Listing 69. The relational answer stream that results\nfrom evaluating the query in Listing 6 are transformed by the Data Transforma-\ntion module depicted in Figure 1 according to the S2O mappings. This results in a\nstream of tagged triples which are instances of the class WindSpeedMeasurement.\n7\nRelated Work\nSeveral systems providing ontology-based access to stored data, mainly in the\nform of relational databases, have been proposed. A good survey is provided\nby [3]. A simple approach is to ﬁrst generate a syntactical translation of the\ndatabase schema to an ontological representation. Although the resulting ontol-\nogy has no real semantics, it may be argued that this is a ﬁrst step through an\nontology model and could later be mapped to a real domain ontology [21]. Vir-\ntuoso [22] and d2rq [2], like R2O, use mappings between the source relational\nschema to rdf ontologies enabling users to issues queries over a semantically\n9 Although the current available implementation of the SNEE processor lacks the\nconcat operator, we include the sample query in its complete form here.\n13\n",
  "speaker": "SYSTEM",
  "uuid": "ee80a516-4393-4ba7-ab93-2f43c21a06a6"
}