{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 4\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 4 of 21\n \n \n1.1 Reference Ontology (UPM) \nAs it was mentioned before, the main objective of SEEMP is to develop an interoperable \narchitecture for public e-Employment services. The resultant architecture will consist of: a \nReference Ontology, the core component of the system, that acts as a common “language” \nin the form of a set of controlled vocabularies to describe the details of a job posting; a set of \nLocal Ontologies, each PES uses its own Local Ontology, which describes the employment \nmarket in its own terms; and a set of mappings between each Local Ontology and the \nReference Ontology. \nIn this section we describe the adopted approach to build the Reference Ontology. We utilize \nsome of the existing human resources management standards described in detail in section \n2.2 of the SEEMP deliverable D2.1 “Semantic and Technical Aspects in e-Gov Software \nDevelopment”. We will follow some of the identified tasks of the ontology development \nmethodology METHONTOLOGY [Gómez-Pérez et al 2003]. The building process consists \nof: \n• \nSpecifying, using competency questions, the necessities that the ontology has to \nsatisfy in the new application. \n• \nSelecting the standards that cover most of the identified necessities. \n• \nSemantic enrichment of the chosen standard. \n• \nEvaluating the Ontology content  \n• \nIntegrating the resultant ontology in the SEEMP platform. \n1.1.1 Specifying, using competency questions, the necessities that the ontology has \nto satisfy in the application. \nThe specification activity states why the ontology is being built, what its intended uses are \nand who the end-users are. For specifying the ontology requirements we will use the \ncompetency questions techniques proposed in [Grüninger et al 1995]. Before identifying \nthem, we will identify the intended uses of the ontology and their users. \nIntended uses of the ontology  \nThe development of the Reference Ontology is motivated by scenarios related to the \napplication that will use the ontology. Such scenarios describe a set of the ontology’s \nrequirements that the ontology should satisfy after being formally implemented. The \nmotivating scenarios are described in the SEEMP deliverable D1.1 “User Requirement \nDefinition”. In summary, the purpose of building the Reference Ontology is to provide a \nconsensual knowledge model of the employment domain that could be used by PESs, more \nspecifically within the ICT (Information and Communication Technology) domain. \nIntended users of the ontology \nAs it was mentioned before, the Reference Ontology will be the core component of the \nSEEMP platform; the peers on the SEEMP interoperate with each other from their local \nontologies via the Reference Ontology. The analysis of the motivating scenarios described in \nthe SEEMP deliverable D1.1 “User Requirement Definition”, allowed us to identify the \nfollowing intended user of the ontology: \n",
  "speaker": "SYSTEM",
  "uuid": "eefcc2fd-310e-4574-b8e2-cd932fcb6782"
}