{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/RecomendacionesParaEscribirArticulos \n\nARTÍCULO DE CONFERENCIA\nLa\nIntroducción de un artículo\ndebería incluir los siguientes puntos o ideas, cada uno en un párrafo:\nPresentación de los antecedentes del tema (ámbito)\nReferencia al conocimiento establecido en el campo\nReferencia a los principales problemas de investigación (motivo de existencia, relevancia, creamos interés)\nRevisión de la investigación relacionada (introducción del estado de la cuestión)\nReferencia a la investigación previa\nReferencia a las limitaciones en la investigación previa\nReferencia a las ventajas de la presente investigación\nReferencia a la continuación de la investigación previa\nPresentación de la nueva investigación\nReferencia al objetivo de la investigación\nReferencia al procedimiento principal de la investigación\nReferencia a los resultados principales\nReferencia a la estructura del articulo\nEl\nEstado de la cuestión/Estado del arte\ndebería ser:\nExhaustivo\n. Debería quedar claro qué es lo que tratamos en el artículo, y qué lo que queda\nout of the scope\ndel artículo. Hay que conseguir ser exhaustivo dentro de los límites que nos hemos marcado para nuestra investigación, y para ello hay que dejar claro cuáles son los límites.\nPreciso\n. Deberíamos categorizar los enfoques o investigaciones existentes y subrayar las diferencias que existen entre los enfoques anteriores y lo que aporta nuestro trabajo. Crear una tabla con las distintas categorías puede ser de gran ayuda.\nJustificado\n. Es muy importante justificar y fundamentar los avances que nuestro trabajo aporta al estado de la cuestión. Esto es lo equivalente a las hipótesis en la tesis.\nObservación: un análisis detallado y completo del estado de la cuesión (\nreview or survey\n) es mejor para un artículo de revista.\nLa\nEvaluación\ndebería constar de 2 partes:\n1. El\nset up\n, los preparativos o la configuración de la evaluación. (Esto restringe las hipótesis lanzadas al principio).\n2. Los resultados de la evaluación presentados en tablas, gráficos, etc., más una valoración detallada de las tablas, el porqué de los resultados, etc.\nLa\nConclusión\ndebería:\nResumir las dos primeras secciones de la introducción (introducción del ámbito y del problema en un pequeño párrafo).\nResumir en otro pequeño párrafo (o en el anterior) las tres siguientes secciones de la introducción (limitaciones, estado de la cuestión y avances a realizar).\nResumir los resultados que se derivan de la evaluación. Debería empezar con\nHemos demostrado... que los resultados son buenos, mejores de lo esperado, bla, bla, bla\n.\nFinalmente, el parrafo anterior nos lleva a plantear las líneas de futuro, o también llamadas nuevas hipótesis.\n(Libro que propone Mariano:\nEstadística para experimentadores\n)\nARTÍCULO DE REVISTA\nEl artículo de revista recopila lo que se ha presentado anteriormente en conferencias y lo completa algunos datos más.\nEn general, se puede decir que hay 2 tipos de revistas:\nGlossy: utilizan un lenguaje no excesivamente técnico, son divulgativas y suelen tener un mayor impacto.\nNon glossy: utilizan un lenguaje técnico y no son tan divulgativas. Estas se pueden dividir a su vez en 2: las que presentan avances y las que presentan estados de la cuestión (\nsurvey o reviews\n).\nListado de revistas",
  "speaker": "SYSTEM",
  "uuid": "ef0c90fd-4a1d-41e7-b40e-f044269893f3"
}