{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 16\n14\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nwho have come across advertisements from other EU countries have also made a cross‐border purchase.\nAlas, a majority of Europeans (55%) have never come across advertisements or offers from sellers/providers\nlocated in other EU countries. And two‐thirds of EU consumers would not buy a product or service online\nunless it is offered in his or her native language.\nEvery aspect of the new ecosystem, and all the products and services built on it, must be delivered in the\nlanguages of their actual users, and this is the driving force behind the market for translation software and\nservices, as well the multilingual features of both speech and content applications. \nWhere language is the very stuff of our digital system – customer interactions, employee conversations,\ntechnical and scientific knowledge, cultural and social objects of all kinds – the era of the Lingua Franca is\nover. Interacting across the many languages of the digital world is no longer optional.\nThere is already significant global spending for LT software & services, but while the identifiable market for\nLT is far from trivial, its impact extends much further, enabling the next generation of our digital systems.\nEvery sector will rely on LT at some level to remain competitive – to manage the data tsunami, to enable\ncross‐border trade, and to engage with employees, customers, patients and citizens flexibly and responsibly\nthrough their multiple digital devices.\n2.2 The LT‐Innovate Market Model\nTo measure the scale of the LT market involves modelling its components, and hypothesising about size, seg‐\nmentation and growth rates. At present no analysts follow the LT market as a whole, though many track its\ncomponents and sub‐components in different ways; larger pure‐play LT companies are tracked, as are the LT‐\nrelated developments and products in the larger software companies. As will become evident in the discus‐\nsion of trends, the borders between the technological segments (speech, translation, content) are fuzzy at\nbest, and much of the real innovation in LT is happening at the edges, where different types of intelligent\nservices are combined in Unified LT applications (speech and translation, intelligent content and translation,\netc.).\nAn initial sizing of the industry is, therefore, reliant on a number of different sources whose assumptions and\ntaxonomies inevitably vary. Is speech analytics measured in the speech, or the content analytics space? Is\nmultilingual content management included in the content or the translation space? What about speech\nsearch? Where would you classify an intelligent, multilingual interactive virtual assistant? It is evident that\nthe convergence of the different historically separate market segments for LT will require new market cate‐\ngories, but as yet these do not exist in the minds of the analyst community.\nNevertheless, an order‐of‐magnitude sizing of the LT industry is essential to understanding its contribution\nto the vitality of the ICT market. This initial sizing is based on a model that draws on a number of different\nsources, with input from IDC on the companies and technologies they track in their Worldwide Software Market\nForecaster service. IDC’s service includes reliable tracking of Enterprise software markets and companies. To\nmeasure the size of the market for Intelligent Content (which is largely, though not exclusively, delivered via\nthe Enterprise channel) the IDC analysts identified the segments and companies within their software market\ntaxonomy that are active in the different sub‐segments of Intelligent Content (Scanning/Text Input, Content\nAuthoring/Creation, Search & Navigation, Text Mining/Analytics, Rich Media Search/Analytics) and extract‐\ned the revenues that they consider are directly attributable to Intelligent Content Technology sales. The fore‐\ncast for Intelligent Content is therefore IDC’s direct contribution to the model.\nIDC’s forecasting model is robust for predicting the general rates of growth in software markets as a whole;\ntheir growth and exchange rates were used as a baseline for the other two segments (speech and transla‐\ntion), and then adjusted based on the findings from LT‐Innovate research. IDC contributed additional intelli‐\ngence on the companies they track who are active in these markets (i.e. large players such as Nuance,\n",
  "speaker": "SYSTEM",
  "uuid": "ef0c719c-3f07-4ef1-93dc-b9512cd8b186"
}