{
  "message": "SYSTEM: Cv_abreviado-mperez.pdf: Página 4\n \n4 de 4  \n \nCURRÍCULUM ABREVIADO (CVA) \n \n \n \n \nITN-238808 SCALUS (SCAling by means of Ubiquituous Storage), IP (Andre Brinkmann, \nUniversity of Paderborn, IP de la UPM: María S. Pérez),  University of Paderborn, \nBarcelona Supercomputing Center, Durham University, Ruprecht-Karls-Universitat \nHeidelberg, Foundation for Research and Technology, Universidad Politecnica de Madrid, \nEcoles des Mines, INRIA, XLAB Research, Xyratex, NEC Deutschland GmBH, CERN, \nMicrosoft Research Ltd., Fujitsu Siemens Computers, Oracle, Universitat Bielefeld. \nDiciembre 2009 - Diciembre 2013 \nUE, Marie Curie Action Initial Training Networks. FP7-PEOPLE-ITN-2008 \n \n \nmyBigData: métodos, técnicas y herramientas para dar soporte a la e-Ciencia basada en \ndatos (TIN2010-17060). Ministerio de Ciencia e Innovación. Convocatoria de Proyectos \nde Investigación Fundamental (TIN). Universidad Politécnica de Madrid. 01/01/2011-\n31/12/2013. 19.481,00€. IP: Oscar Corcho García \n \nTIN2013-46238-C4-2-R, 4V: volumen, velocidad, variedad y validez en la gestión \ninnovadora de datos \nCoordinadora: M. Aranzazu Illarramendi Echabe \nUniversidad de Zaragoza, OEG, Universidad Politécnica de Madrid, Universidad \ndel País Vasco, Universidad de A Coruña \n286702,24 euros \n2014-2016 \nPrograma Estatal de Investigación, Desarrollo e Innovación Orientada a los Retos \nde la Sociedad \n \n \nITN-642963 - BigStorage: Storage-based Convergence between HPC and Cloud to handle \nBig Data, IP (María S. Pérez), Universidad Politecnica de Madrid, Barcelona \nSupercomputing Center, University of Mainz, INRIA, Foundation for Research and \nTechnology, Xyratex Technology Limited, Deutsches Klimarechenzentrum GMBH, \nCommissariat al Energie Atomique et Aux Energies Alternatives, CA Technologies, \nFujitsu, 3.803.407,92 euros, Enero 2015 - Diciembre 2018 \nUE, H2020-MSCA-ITN-2014, IP: María S. Pérez \n \nC.3. Contratos \n \n“ALMOSS: Application Lifecycle Management Open Source”,  \nIP: A. Gómez-Pérez (UPM), Carlos Ortega (Banco Santander) et al. Fecha inicio: 01-04-\n2012 Fecha final: 30-06-2013. Entidad financiadora: Banco Santander \n \nC.4. Patentes \nN/A, aunque aunque tiene un registro de software. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "ef357b1a-e2d7-4259-b9c2-494f8f5253d2"
}