{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Tejasfeb2011 \n\nOpen Positions\nLanguage Computer Corporation (LCC) is a privately-owned company committed to the development of next-generation natural language processing technologies.  Since our founding in 1995, we've provided both government and commercial customers with intelligent, semantically-informed search and discovery software.  These tools unlock value by actually understanding the information stored in large collections of text.  LCC has spun off two semantic technology startups, including Swingly, a Web-scale answer engine, and Extractiv, a high-performance content harvesting service.\nWe are currently seeking Software Engineers to help develop integrated natural language processing and retrieval applications.  Ideal candidates must possess a constant desire to learn, think creatively, and work in a team environment.  A solid foundation of developing applications on the Java platform is a must. Successful candidates will work with a team of researchers and engineers to improve existing products as well as develop brand new technologies.\nLanguage Computer has openings for the following positions:\n* Software Engineer - Richardson, Texas\nSoftware Engineer - Richardson, Texas\nRequirements:\n* Strong programming skills on the Java platform\n   * Education: BS in Computer Science\n   * U.S. Citizenship or Permanent Resident\n   * Competent in written language structure, syntax and grammar\n   * Strong knowledge of development under Unix/Linux\n   * Good communication skills\n   * Patience necessary to work in a team environment\n   * Desire to learn and pioneer new technologies\n   * Ability to work under a deadline\n   * Discipline to be self-motivated and self-directed when necessary\nDesirable Qualities:\n* Natural language processing (NLP), linguistics, artificial intelligence (AI), and/or speech processing experience\n   * Experience with machine-learning technologies and techniques\n   * Strong math and statistics skills\n   * Industry R&D experience\n   * Database programming/development\n   * Other programming languages: Python, Ruby, Scala, Clojure\n   * Source code management (e.g. SVN, Git, Mercurial, Bazaar)\n   * Web Application experience\n   * Experience with multi-threaded / distributed applications\n   * Understanding of design concerns such as abstraction, modularization, coupling, and maintainability\n   * Experience with unit testing and integration testing\n   * Talent for writing time- and memory-sensitive code\nAdditional Information:\n* Salary: commensurate with industry experience\n   * Position Type: Full-Time Employee\n   * Posting Date: Jan  12, 2011\nHow to apply\nThink you're up to the challenge? Do you have the skills -- and the passion -- to be a part of LCC's research and engineering teams? Interested candidates can submit their résumé (or curriculum vitae) and cover letter here. Please indicate the job title and posting number that you are applying for in the subject of your message.\nNo phone calls or FAX-ed résumés, please.\nLegal Information\nRésumés are kept for a minimum of one year (12 months). All submitted résumés are considered when new openings become available. If you have submitted your résumé in the past year, there is no need to resubmit a new résumé.\nLanguage Computer Corporation (LCC) is an Equal Opportunity Employer. LCC does not discriminate against persons because of age, race, color, creed, religion, disability, gender, ethnic or national origin, or veteran status. LCC also prohibits discrimination against individuals with disabilities and will reasonably accommodate applicants with a disability, upon request, and will also ensure reasonable accommodation for employees with a disability.",
  "speaker": "SYSTEM",
  "uuid": "ef39d62d-68a4-4f82-8980-f0c1fec01b3f"
}