{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 6\n4\nwhole industries in cooperative initiatives (analogous to SWIFT in banking) (p. 21)\nCollaboration between the industry and data owners will be needed. (p. 22)\nMany IT managers are still relatively unaware of the benefits that LT can provide them... Suppliers, LT ven‐\ndors and IT integrators should work closer and harder to identify killer business cases, increase market\nawareness and deploy market strategies understanding how economic return affects clients, developing\nmodular/incremental products, and forging cross‐industry alliances for to strengthen market channels. (p.\n24)\nLT‐Innovate estimates that there are around 500 companies in Europe either actively developing Language\nTechnology, or embedding its features in their products and services in an innovative way... The industry\ncomprises mostly small companies, concentrated in the western and northern regions of the EU, with a mix\nof long‐established players but also a significant number of new entrants. A quarter of the companies are\nmicro‐enterprises with fewer than 10 employees, while only 6% have more than 200 employees; almost the\nentire industry is composed of  SMEs... Over half the industry comprises companies active for more than 10\nyears, many that remain small. The fact that so many companies fail to scale, even after years in business,\nis unusual in a technology industry, and indicative of the market context for LT in Europe: local/national com‐\npanies with expertise in local languages serve local markets with services based on their own languages. This\nstate of affairs is not likely to be sustainable, as cloud‐based language‐enabled services are launched on a\nlarge scale. At present, few European companies are in a position to compete in an ecosystem where access\nto technology, rather than narrow linguistic expertise, is the driving factor. (p. 25)\nInnovation in the LT Industry\nThe dynamics of the general software market, and the limits of what is currently possible for niche LT SMEs,\nstrongly suggest that a Digital Language Infrastructure for Europe could both unlock potential for the indus‐\ntry, and help meet the need for pervasive “multilinguality” in Europe’s digital economy. The industry itself\nshould define the nature and content of the infrastructure, what features are appropriately shared and\nopen, what should remain in the commercial IP realm. (p. 33)\nThe review of conditions in the LT industry suggests that collaborative approaches to the market could break\nthrough the fragmentation that is evident.(p. 33)\nAsymmetric partnering for SMEs is a natural route to developing technologies in specialist areas with steep\ntechnical demands (heavy R&D), where domain expertise is key. Peer partnering takes the alternate route\nof creating new “breakout” categories of products or services through the collaborative combination of\ncomplementary technologies... Dominant markets are those where technical depth meets the greatest\nopportunity. (p. 38)\nInteractive, Multilingual, Intelligent\nThe speech applications market shows immense potential, and it is expected to grow rapidly in the next few\nyears... The market is mainly driven by the increased demand in the Mobile Devices segment. This segment\nis witnessing high demand for speech recognition applications because of the increase in the number of reg‐\nulations on the use of mobile phones while driving. (p. 47)\nWe can debate whether the translation industry’s response to rapid globalisation and growth in content has\nbeen the right one. Has the industry made best use of technology to raise its capacity and stay profitable?\nOr has the content explosion marginalized an industry of artisans? (p. 55)\nIntelligent content refers to content that is structurally rich and semantically aware, and is therefore discov‐\nerable,reusable, reconfigurable and adaptable and which is not limited to one purpose, technology or out‐\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n",
  "speaker": "SYSTEM",
  "uuid": "ef9d7933-9585-44ca-a65d-a2f3d3335f74"
}