{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 12\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13920\n2.  Asimismo, el Ministerio de Educación podrá establecer una convocatoria anual \npara otorgar una mención de excelencia a las Escuelas de Doctorado que destaquen por \nsu prestigio y especial proyección internacional. En dicha convocatoria se establecerán los \nrequisitos para la obtención de la citada mención y los criterios de evaluación.\n3.  El Gobierno, en el marco de la legislación vigente en materia de ciencia, tecnología \ne innovación, podrá realizar convocatorias periódicas de ayudas para el fomento de las \nEscuelas de Doctorado y de la formación doctoral de calidad, dirigidas a programas de \ndoctorado, especialmente a aquellos que hayan obtenido el sello de excelencia y a las \nEscuelas de Doctorado que asimismo hayan obtenido la mención de excelencia.\n4.  Las administraciones públicas podrán establecer mecanismos de fomento y \nfinanciación de la internacionalización de los doctorados y de apoyo a la movilidad.\nDisposición adicional primera.  Verificación de programas de doctorado conjuntos \ninternacionales Erasmus Mundus.\nLos programas de doctorado conjuntos creados mediante consorcios internacionales \nen los que participen instituciones de Educación Superior españolas y extranjeras y que \nhayan sido evaluados y seleccionados por la Comisión Europea en convocatorias \ncompetitivas como programas de excelencia con el sello Erasmus Mundus, se entenderá \nque cuentan con el informe favorable de verificación a que se refiere el artículo 10 de este \nreal decreto.\nA estos efectos, la universidad solicitante enviará al Ministerio de Educación la \npropuesta del plan de estudios aprobada por la Comisión Europea junto con el Convenio \ncorrespondiente del consorcio y la carta de notificación de haber obtenido el sello Erasmus \nMundus al que se refiere el párrafo anterior, así como un formulario adaptado que \nproporcione los datos necesarios para la inscripción del correspondiente programa de \ndoctorado en el RUCT.\nEl Ministerio de Educación enviará el expediente al Consejo de Universidades a efectos \nde emitir la correspondiente resolución de verificación de acuerdo con lo dispuesto en el \nReal Decreto 1393/2007, de 29 de octubre.\nDisposición adicional segunda.  Incorporación a las nuevas enseñanzas de doctorado \nestablecidas en el presente real decreto.\n1.  Los doctorandos que hubieren iniciado su programa de doctorado conforme a \nanteriores ordenaciones universitarias, podrán acceder a las enseñanzas de doctorado \nreguladas en este real decreto, previa admisión de la universidad correspondiente, de \nacuerdo con lo establecido en este real decreto y en la normativa de la propia universidad.\n2.  Podrán ser admitidos a los estudios de doctorado regulados en el presente real \ndecreto, los Licenciados, Arquitectos o Ingenieros que estuvieran en posesión del Diploma \nde Estudios Avanzados obtenido de acuerdo con lo dispuesto en el Real Decreto 778/1998, \nde 30 de abril, o hubieran alcanzado la suficiencia investigadora regulada en el Real \nDecreto 185/1985, de 23 de enero.\nDisposición adicional tercera.  Doctor Honoris Causa.\nDe acuerdo con lo que establezca su normativa, las universidades podrán nombrar \nDoctor Honoris Causa a aquellas personas que, en atención a sus excepcionales méritos \nacadémicos, científicos o personales sean acreedoras de tal distinción.\nDisposición transitoria primera.  Doctorandos conforme a anteriores ordenaciones.\n1.  A los doctorandos que en la fecha de entrada en vigor de este real decreto hubiesen \niniciado estudios de doctorado conforme a anteriores ordenaciones, les será de aplicación \nlas disposiciones reguladoras del doctorado y de la expedición del título de Doctor por las \nque hubieren iniciado dichos estudios. En todo caso, el régimen relativo a tribunal, defensa \ny evaluación de la tesis doctoral previsto por el presente real decreto será aplicable a \ndichos estudiantes a partir de un año de su entrada en vigor.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "efeb6863-540c-4818-a65a-970aaad7b30f"
}