{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 45\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \nPREMIOS: \n• \nPremio Extraordinario de Doctorado del Curso 2008-2009. Universidad Politécnica de Madrid. \n• \n3rd Best Paper Award en la 24th International Conference on Software Engineering and Knowledge Engineering (SEKE \n2012), conferencia con ranking CORE B, por el artículo “Semantic Technology Recommendation Based on the Analytic \nNetwork Process” por Radulovic F.; García-Castro R. \nCHARLAS INVITADAS: \n• \n“The evolution of semantic technology evaluation in my own flesh (The 15 tips for technology evaluation)”. Instituto per \nla Matematica Applicata e Tecnologie Informatiche – Consiglio Nazionale delle Recherche. Genova, Italia, 15 octubre \n2013. \n• \n“Benchmarking the interoperability of Semantic Web technologies”. Web PIC seminar. IBM Research, Watson Research \nCenter. Hawthorne, NY, Estados Unidos, 5 mayo 2009. \n• \n“Benchmarking the interoperability of Semantic Web technologies”. Computer Science and Engineering seminar. Lehigh \nUniversity. Bethlehem, PA, Estados Unidos, 20 abril 2009. \n• \n“Benchmarking the interoperability of Semantic Web technologies”. Advanced Semantic Web course. Rensselaer \nPolytechnic Institute. Troy, NY, Estados Unidos, 17 marzo 2009. \n• \n“Strategies for evaluating the interoperability of Semantic Web technologies”. Universität Innsbruck. Innsbruck, Austria, \n24 febrero 2009. \n• \n“Semantic Web Framework”. II Edición de la Jornada Técnica Web Semántica. Zamudio, España, 29 marzo 2007. \n• \n“Experimentation approaches for benchmarking the interoperability of Semantic Web technology”. Vrije Universiteit \nAmsterdam. 19 marzo 2007. \n• \n“Towards the improvement of the Semantic Web technology”. 2nd International Workshop on Scalable Semantic Web \nKnowledge Base Systems (SSWS2006). Athens GA, USA. 5 noviembre 2006. \n• \n“Tecnologías de la Web Semántica: cómo funcionan y cómo interoperan”. IV Seminario Internacional Tecnologías \nInternet (SITI 2006). Popayán, Colombia. 5-7 octubre 2006. \n• \n“Benchmarking como herramienta de transferencia tecnológica”. III Encuentro Internacional de Investigadores en \nInformática y Computación Parquesoft. Popayán, Colombia. 4 octubre 2006. \nTESIS DE MASTER CODIRIGIDAS: \n• \nCotutor, en el Máster “Máster de Investigación en Inteligencia Artificial” de la tesis “A Software Quality Model for the \nEvaluation of Semantic Technologies” escrita por Filip Radulovic. Calificación: Sobresaliente. Junio 2011. \n• \nCotutor, en el Máster “Máster de Investigación en Inteligencia Artificial” de la tesis “Methodology for Requirements \nEngineering and Architectural Design of Large-scale Semantic Applications” escrita por Óscar Muñoz García. \nCalificación: Sobresaliente. Septiembre 2009. \n• \nCotutor, en el Máster “Máster de Investigación en Inteligencia Artificial” de la tesis “Método para mejorar los \nimportadores y exportadores de ontologías de herramientas de la Web Semántica” escrita por Moisés Gamio Vergara. \nCalificación: Sobresaliente. Septiembre 2008. \n• \nCotutor, en el Máster “European Master in Computational Logic”, de la tesis “Defining a benchmark suite for \nevaluating the import of OWL Lite ontologies” escrita por Stefano David. Calificación: Sobresaliente. Julio 2006. \nTRABAJOS FIN DE CARRERA CODIRIGIDOS: \n• \nCotutor del trabajo fin de carrera “ORMS: Un Sistema de Gestión de Requisitos para Ontologías” escrito por Luis Villa \nBriongos. Facultad de Informática, UPM. Calificación: Notable. Julio 2013. \n• \nCotutor del trabajo fin de carrera “Koliseo: Integración social de un portal de venta de entradas” escrito por Germán \nGarcía Fernández. Facultad de Informática, UPM. Calificación: Notable. Septiembre 2008. \n• \nCotutor del trabajo fin de carrera “Diseño de un módulo semántico para gestores de contenidos” escrito por José Luis \nFernández Domínguez. Facultad de Informática, UPM. Calificación: Notable. Septiembre 2008. \n• \nCotutor del trabajo fin de carrera “Recomendación de herramientas ontológicas y análisis de resultados de \ninteroperabilidad utilizando RDF(S)” escrito por Silvia Platas Bricio. Facultad de Informática, UPM. Calificación: \nMatrícula de Honor. Julio 2008. \nTRABAJOS SISTEMAS INFORMÁTICOS CODIRIGIDOS: \n• \nCotutor del trabajo de la asignatura de Sistemas Informáticos (15 créditos LRU, troncal 5º curso) “CheckMyJava: \nRetroalimentación de programas Java” escrito por Valentín Hernández Caro. Facultad de Informática, UPM. Junio \n2012. \nACREDITACIONES: \n• \nProfesor Ayudante Doctor por la ANECA. Junio 2010. \n",
  "speaker": "SYSTEM",
  "uuid": "f090b73a-078b-4983-a17d-5977b7e7bd27"
}