{
  "message": "SYSTEM: CICYT-GAC_Enero_2010.pdf: Página 31\n Otros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \n \nDirección de Trabajos y participación en actividades académicas \n• \nDirectora de 30 Trabajos Fin de Carrera. Todos ellos guardan relación con la lingüística y la informática. Entre \nalgunos de los temas tratados merecen destacarse los que abordan el tema de la generación del lenguaje natural, \naplicaciones para la normalización de la terminología, las aplicaciones para la elaboración de corpus de lenguajes \nde especialidad o las nuevas tecnologías aplicadas a la enseñanza de lenguas (inglés y francés). \n• \nDirectora de cuatro trabajos de investigación (de 12 créditos) dentro de los nuevos programas de doctorado, para \nla obtención del DEA. \n• \nProfesora de los cursos de Doctorado del Dpto. de Lingüística Aplicada a la Ciencia y Tecnología (2006-07, 2005-\n06, 2004-05, 2003-04, 2002-03, 2001-02, 2000-01, 2000-1999) \n \n \n \nInvitaciones por parte de otras universidades \n• \nConferenciante invitada en diferentes universidades españolas (UAM, Alicante, Málaga, Burgos, UJI, etc.) \n• \nProfesora invitada en el Master de Inglés y español para fines específicos y empresariales. Universidad de \nAlicante Curso 2008-09, 2007-08, 8 horas. Módulo Lingüística Computacional. \n• \nProfesora de Traducción Técnica en el Master de Traducción impartido por el Instituto Universitario de Lenguas \nModernas y Traductores de la Universidad Complutense de Madrid. Cursos 2007-08, 2006-07, 2005-06, 2004-\n2005, 2003-04, 2002-03, 2001-02, 2000-01, 1999-00, 1998-99. (20 horas, por curso) \n• \nProfesora invitada en el Curso de Doctorado de la Universidad Autónoma de Madrid  para impartir un curso sobre \nEnglish for Specific Purposes  Enero, 2000, 20 horas. \n• \nMiembro de tribunal en más de 30 tribunales de tesis \n• \nMiembro de tribunales para la contratación de profesores doctores  (U. De Alicante, UNED) \n \n \nSociedades o grupos científicos a los que pertenece \n• \nAsociación Española de Lingüística Aplicada AESLA \n• \nAsociación Europea de Lenguas para fines específicos AELFE  \n• \nVicepresidenta de AELFE \n• \nSecretaria del comité CTN_191 AENOR. \n• \nSociedad española de procesamiento de lenguaje natural SEPLN  \n• \nVocal de la Comisión ejecutiva de la Asociación Española de Terminología. AETER \n• \nMiembro del comité científico de la revista RAEL. \n• \nMiembro del comité científico de la revista “Lingüística  y Lenguas Aplicadas” \n• \nMiembro del Consejo Científico de RESLA (Revista Española de Lingüística Aplicada). \n \n \nGestión Académica \n• \nDirectora Delegada del Departamento de Lingüística Aplicada a la ciencia y tecnología en la Sección \nDepartamental de la Facultad de Informática desde 2004 hasta la actualidad. \n• \nCoordinadora del Programa de Doctorado “Lenguas para fines específicos: Un enfoque multidisciplinar. \nAnálisis, metodología y nuevas tecnologías” del Departamento de Lingüística Aplicada a la Ciencia y a la \nTecnología de la Universidad Politécnica de Madrid (UPM),2007-08,2006-07,2005-06, 2005-04, 2003-04, 2002-03, \n2001-02, 2000-01, 1999-00. \n• \nMiembro de la Comisión de Doctorado de la Facultad de Informática. \n• \nSubdirectora del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología de la Universidad Politécnica \nde Madrid  desde Diciembre 1995 hasta 2004 \n• \nSecretaria de la Facultad de Informática (UPM) desde Febrero 1993 hasta Marzo 1999. \n• \nSecretaria del Departamento de Lingüística Aplicada a la Ciencia y a la Tecnología desde Junio 1988 hasta \nFebrero 1993. \n \n \nOtros trabajos \n• \nOrganizadora de las Jornadas de Investigación del Departamento de Lingüística Aplicada a la Ciencia y a la \nTecnología (1989, 1990, 1991, 1992, 1993, 2006) \n",
  "speaker": "SYSTEM",
  "uuid": "f0dfd253-7bcb-438e-bb1f-50b8054063b9"
}