{
  "message": "SYSTEM: FormularioCPM_asunciondemaria.gomez.pdf: Página 6\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n1.6. Coste estimado del desarrollo de su solución propuesta\n€\n1.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n1.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n1.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n1.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 1.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­6­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n24\n139.992,00\nLos portales de datos abiertos de las distintas administraciones serían el objetivo primero \nde esta solución tecnológica. Los usuarios podrán hacer consultas a estos portales de \ndatos abiertos de forma intuitiva y sencilla, aumentando su satisfacción y su interés por \nexplorar la información disponible. \n  \nEl previsible que el uso de esta herramienta tenga como resultado que los usuarios hagan \nun uso mayor de los datos abiertos, lo que probablemente tenga como efecto que las \nempresas aumenten su interés en usar y proporcionar datos abiertos.\nEsta tecnología se podría licenciar a cualquier empresa interesada en proporcionar a sus \nclientes un acceso intuitivo a un conjunto de datos. \nHemos identificado como potenciales clientes de esta tecnología a: \n-        Call centers. Las empresas que desarrollan estos sistemas pueden tener interés en \nproporcionar a sus empleados (los que resuelven las consultas telefónicas) sistemas que \nrespondan con mayor velocidad, o que permitan las consultas de manera más sencilla. \nEsto proporciona a la empresa un mayor rendimiento de sus empleados y la oportunidad \nde ser más competitivas. \n-        Clientes finales. Varios estudios muestran que muchos clientes de empresas de \nsuministros prefieren resolver sus dudas, a través de mail o páginas web, antes que \nhablar con operadores telefónicos (call centers). Nuestro sistema puede derivar parte de \nlos clientes a sistemas web de “auto resolución de incidencias”, aliviando la carga del call \ncenter. Esto produce un ahorro significativo del coste de resolución de incidencias. \n-        Sistemas de business intelligence. Los sistemas dirigidos a la generación de \ninformes para ejecutivos ya incluyen cajas “de texto libre” donde el usuario puede describir \nel informe que desea. Estos sistemas sufren las ambigüedades del lenguaje natural y, en \nmuchos casos, no son capaces de “entender” la frase proporcionada por el usuario. \nNuestro sistema no permite ambigüedades, por lo que las respuestas son mucho más \nprecisas.\nEl sistema se desarrollará siguiendo los estándares de la web semántica, implementando \nlos principios de los datos enlazados, para publicar online y relacionar entre sí grandes \nvolúmenes de datos. Esto facilita la interoperabilidad de sistemas en la administración \npública, así como con terceras partes. \n  \nLa solución propuesta es váida tanto en plataformas web como móviles. \n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "f1bacc30-9d4b-40d0-ab06-3e8fe4dbdc98"
}