{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 7\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \npodrá ser calificado como confidencial y únicamente los adjuntos a ese modelo podrán designarse \ncomo tales. \nLos participantes podrán designar como confidenciales documentos que aporten junto con su \nsolicitud. Esta circunstancia deberá quedar reflejada claramente en el formulario y en el propio \ndocumento designado como tal. \nNoveno. Derechos de Explotación de la Propiedad Intelectual e Industrial. \nLas posibles ideas de soluciones que se presenten en el marco de la Consulta Preliminar al \nMercado no podrán mencionar una fabricación o una procedencia determinada o un \nprocedimiento concreto, ni hacer referencia a una marca, a una patente o a un tipo, a un origen o \na una producción determinados. \nEl uso del contenido de las propuestas se limita exclusivamente a su posible inclusión en las \nespecificaciones de un eventual procedimiento de contratación posterior. \nDécimo. De la jurisdicción. \nContra esta Resolución podrá interponerse, conforme a lo dispuesto en los artículos 123 y 124 de \nla Ley 39/2015, de 1 de octubre del Procedimiento Administrativo Común de las Administraciones \nPúblicas, recurso de alzada ante cualquiera de los órganos que efectúan la presente convocatoria, \nen el plazo de un mes, o bien, directamente, recurso contencioso administrativo, en virtud de lo \ndispuesto en los artículos 8.3, 14.1 y 46 de la Ley 29/1998, de 13 de julio, Reguladora de la \nJurisdicción Contencioso Administrativa, en el plazo de dos meses, en ambos casos contados \ndesde el día siguiente al de su publicación en el Boletín Oficial del Estado. \nUndécimo. Contratación pública. \nA partir de las ideas de soluciones innovadoras recogidas como resultado de esta convocatoria, la \nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital podrá definir las \nespecificaciones técnicas y/o funcionales, que servirán de base para la definición, con el grado de \nconcreción necesario, del objeto de contratación del correspondiente procedimiento de \ncontratación pública ulterior. \nEste eventual procedimiento de compra pública posterior estará abierto a todas las ofertas que \ncumplan, en su caso, las condiciones de tal procedimiento, hayan participado o no estado en esta \nconsulta preliminar al mercado. \n \nMadrid, 20 de abril de 2017 \n \nEl Secretario de Estado para la Sociedad de la Información y la Agenda Digital \n \n \n \nJosé María Lassalle Ruiz \n",
  "speaker": "SYSTEM",
  "uuid": "f1e0657b-1cf4-4fd7-81e9-53cc5c444a1d"
}