{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 18\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n18 \nProblema nº 14: Facturas de Teléfono  (3 puntos)   \n \nJuan  desea construir un sistema de producción que le permita ahorrar en sus facturas de teléfono. La \nmayor parte de sus llamadas son locales e interprovinciales, y como las tarifas de teléfono cambian cada \nmes, ha decidido construir un sistema de producción que le aconseje la compañía por la que debe hacer la \nllamada. \n \nComo Juan  habla mucho por teléfono, desea que el sistema le pregunte:  \na) si la llamada es local o interprovincial,  \nb) el tiempo estimado de la llamada \nc) la hora de comienzo (se entiende que las 11:45 son las 11) \nd) el día en el que se hace la llamada \npara así poder estar más acertado en su decisión.  El sistema compara los precios de las dos compañías y \nle informa por cuál debe llamar.  \n \nEl sistema de producción conoce los siguientes precios: \n \nLos precios  de la compañía  A son: \n \na) Las llamadas locales tienen una tarifa mínima de 15 pesetas, e incluye los dos primeros minutos. Los \nsiguientes minutos son: \n• \nDe lunes a viernes, de 8 a 18 horas, 2 pesetas  \n• \nDe lunes a viernes, de 18 a 8 horas, 1 pesetas  \n• \nSábados y domingos todo el día, 1 pesetas \n• \n \nb) Las llamadas interprovinciales  tienen una tarifa mínima de 25 pesetas. Estas llamadas se facturan a \npartir del segundo minuto. \n• \nDe lunes a viernes, de 8 a 22 horas, 40 pesetas  \n• \nDe lunes a viernes, de 22 a 8 horas, 20 pesetas \n• \nSábados y domingos todo el día, 20  pesetas \n \nLos precios base  de la compañía B son: \n \na) Las llamadas locales tienen una tarifa mínima de 6  pesetas, pero no incluye ningún minuto. \n• \nDe lunes a viernes, de 8 a 20 horas, 5 pesetas  \n• \nDe lunes a viernes, de 20 a 8 horas, 2 pesetas  \n• \nSábados y domingos todo el día, 2 pesetas \n \nb) Las llamadas interprovinciales  tienen una tarifa mínima de 15 pesetas. Estas llamadas se facturan a \npartir del primer minuto. \n• \nDe lunes a viernes, de 8 a 20horas, 44 pesetas  \n• \nDe lunes a viernes, de 20 a 8 horas, 18 pesetas \n• \nSábados y domingos todo el día, 18  pesetas \n \nSe pide construir un sistema de producción en el cual se puedan incluir nuevos tipos  de llamada  y \nnuevas tarifas fácilmente, realizando el menor número de cambios sobre la base de reglas existente. \na) Describir la base de hechos del sistema. \nb) Describir la base de reglas del sistema. \nc) Definir los criterios de resolución del conjunto conflicto. \nd) Supóngase que Juan ha realizado las llamadas siguientes: \n• \nSabado-1, compañía A, interprovincial, tiempo estimado 8 minutos comenzando a las 12 horas. \n \n",
  "speaker": "SYSTEM",
  "uuid": "f3147867-d037-4c54-b0ce-bf0395d4f84a"
}