{
  "message": "SYSTEM: DynaLearn_exercises2.pdf: Página 1\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n101 / 103 \ninto the ecosystem. (Ignore the details of the neighbour population in terms it \nbecoming smaller due to individuals leaving). \n \nWhen simulating the model, run a simulation in which the Number_of starts at Zero. \nThis should result in a state-graph in which this population starts growing from Zero and \nreaches it maximum size. Also run a simulation in which Number_of starts at a value \nhigher than Zero. Does this situation lead to the population becoming extinct (thus \nNumber_of going to Zero)? Why not? An additional assignment could be to adapt the \nmodel such that it does go to Zero, e.g. by including an emigration process. \nNegative, Neutral and Positive growth \nThis assignment is intended to get the reader acquainted with the assumption \nmechanism in Garp3 (not to be confused with the notion of ‘using assumptions’, which \nrefers to using additional labels to include or exclude model fragments). The assumption \nmechanism in Garp3 is always active. It is concerned with inequality reasoning. \nParticularly, in the situation that an inequality cannot be proven inconsistent, the engine \n‘assumes’ that the inequality is true. This assumption stays active until counter evidence \nis found, in that case all inferences depending on the assumption are considered \nincorrect (which may lead to states not being generated). \n \nThe Garp3 engine assumption mechanism can be used to automatically try all possible \nvalues for quantities by creating model fragments with conditional value assignments for \neach value of such quantities. In this assignment this mechanism is used to generate all \nvalues for the quantity Growth. Proceed as follows: \n• Use only one rate: the quantity Growth (and do not use Birth, Death, Immigration \nnor Emigration). Growth can take on three values: {min, zero, pos}, referring to \ndecrease, steady and increase (notice that zero should be a point). \n• Define a process (e.g. named 'Growth') in which the quantity Growth has a \npositive influence on Number_of (thus: when Growth has value min, Number_of \nwill decrease, with value zero it will stay steady, and with value plus it will \nincrease). \n• Create three subtypes of this process model fragment, namely 'Negative growth', \n'Neutral growth' (i.e., no change), and ‘Positive growth'. Each of these fragments \nas a conditional value statement concerning Growth, namely Growth<zero, \nGrowth=zero, and Growth>zero, respectively. \n \nWhen simulating the model, run a simulation in which the Number_of starts at a value \nhigher than Zero. Does Number_of go to Zero in this simulation? If not, why? Hint: is \nthere feedback from Number_of on Growth. See also previous assignments. \nB.3: Communicating Vessels \nConstruct a (simple) qualitative model that captures the typical behaviour of \ncommunicating vessels (also referred to as U-tube systems), using a QPT oriented \napproach. \n \nTake the following details into account: \nThe height of the liquid column determines the pressure at the bottom of the container. \nThe amount of liquid determines the height of the column. The latter also depends on \nthe width of the column, but when the containers have the same shape this fact can be \nignored (assume the containers are equal). When two containers are (partially) filled \nwith liquid and connected by a pipe near the bottoms of the containers, the pressure \ndifference (at the bottoms) between the two liquid columns determines the flow of liquid \n",
  "speaker": "SYSTEM",
  "uuid": "f34180bf-918b-4536-869c-49bb289d2a78"
}