{
  "message": "SYSTEM: Wiki: Here we include information for the students of the \"Master Universitario en Inteligencia Artificial\".\nThe\nevaluation on July\nwill be on\nJuly 7th\n, 15:00, in room 6206. Students must present the ontololgy building and Linked Data assignment, and optionally a research work.\nContents\n[\nhide\n]\n1\nObjectives\n2\nLectures structure\n3\nEvaluation\n4\nSchedule and Material\n5\nHands on activities\n6\nResearch topics\n7\nJob offers\nObjectives\n\nThe aim of this module is to provide the theoretical and practical scientific,\nmethodological and technology basis involved in building ontology, which will be\nused in building applications that integrate, combine and deduce distributed and\nheterogeneous information. In particular, we will present:\nthe concepts of ontology and annotation in the context of Semantic Web and corporate semantics,\nthe fundamental theory and best-known ontologies;\nlanguages RDF(S) and OWL,\nthe methodologies, methods and techniques used in its building that include guidelines for identifying the life-cycle, specification, planning, conceptualisation, correspondences, reuse, reengineering, etc.;\nmethods and techniques for the annotation of resources and significant applications.\nThroughout the entire module open research problems will be set that allow students to provide innovative solutions.\nLectures structure\n\nAll lectures, except for the introductory one, will follow this structure:\nPresentation (90 minutes)\nDiscussion about work done during the week (e.g., papers that have been read, assignment that has been carried out) (25 minutes)\nDescription of work to be done for the following week (5 minutes)\nEvaluation\n\nEvaluation will be done on the basis of: weekly work and participation in discussion (10%), ontology building assignment (30%), Linked Data assignment (30%) and research work (30%)\nPartial assignments that will be done throughout the academic year, and which are specified in the schedule section, will allow creating the aforementioned ontology building and Linked Data assignments, which will be presented orally on 16/12/2010. The optional research work will have to be submitted in January 2011 (31/01/2011).\nThe evaluation on July will be on\nJuly 7th\n, 15:00, in room 6206. Students must present the ontololgy building and Linked Data assignment, and optionally a research work.\nSend your hands-on to the following email\nmasterr10@delicias.dia.fi.upm.es\nSchedule and Material\n\nLectures will be held every Thursday in lecture room 6206, from 15:00 to 17:00.\n9/9/2010. Introduction (Asun)\nRecomended reading: Tim Bernes Lee articles\nSlides: [\nIntro Sweb\n]\nAssignment (deadline: 15/09/2010 9pm): discuss and summarise the following reading/watching list in approximately three pages (in groups of three):\nArticles written by TBL in 1996 and 2002\nTED 2009 talk by TBL\nLinked Data dessign issues technical report\nLinked Data Vision paper from Bizer et al., 2009\n16/9/2010. Ontologies and terminologies (Asun)\nRecommended reading:\nSlides: [\nTerminology in ontologies\n]\nAssignment (no deadline, and no need to submit anything): Students should read the first two articles and one more selected from the others: [\n[1]\n]  [\n[2]\n]  [\n[3]\n[\n[4]\n][\n[5]\n] [\nOntoterminology\n]\nPresentation: No presentation will be selected from this block of papers\n23/9/2010. Theoretical Foundations of Ontologies  (Asun)\nRecommended reading: Chapter 1 and 2 of the book \"Ontological Engineering\"\nSlides: [\nFoundations of ontologies\n]\nAssignment: Choose betwen one of them.\nRead and comment the following paper that includes several definitions of ontologies: Guarino N, Giaretta P (1995) Ontologies and Knowledge Bases: Towards a Terminological Clarification. In: Mars N (ed) Towards Very Large Knowledge Bases: Knowledge Building and Knowledge Sharing (KBKS’95). University of Twente,Enschede, The Netherlands. IOS Press, Amsterdam, The Netherlands, pp 25–32\nSearch papers on the topic of Ontological Commitments.  Read, comment and compare at least the following two papers:\nGruber, T.; Olsen, G. An Ontology for Engineering Mathematics. Fourth International Conference on Principles of Knowledge Representation and Reasoning.  Ed by Doyle and Torasso. Morgan Kaufmann. 1994. Also as KSL-94-18.\nGuarino, N.; Carrara, M.; Giaretta, P. Formalizing Ontological Commitments. 12th National Conference on Artificial Intelligence. AAAI-94. 1994. 560-567\nChoose a domain and find  ontological and non ontological available resources consensuated by a community. Classify them in the continuous line identified by Lassila and McGuiness. Justify why they are important and how do you know that they represent consesuated knowledge.\nIdentify a set of criteria to be used to compare technologies used for searching ontologies. Classify existing technologies according to the criteria.\n30/09/2010. Methodologies I (Asun)\nThe objective of this lecture is to show scenarios for the construction of ontologies, and provide methods and tools to create the ontology requirements specification document, to perform the search of potential resources to be reused, to select the ontology life cycle model and to plan and schedule the ontology development.\nRecommended reading and resources:\nNeOn Glossary of Processes and Activities\nOntology Requirements Specification:\n[6]\nPlanning and Scheduling:\n[7]\nNeOn Toolkit:\nhttp://neon-toolkit.org/wiki/Download\nNeOn Book. NeOn Methodology in a Nutshell:\nhttp://www.neon-project.org/nw/NeOn_Book\nSlides:\n[8]\nAssignment (deadline: 20/10/2010 9pm):\nSelect the data sources you plan to use.\nWrite the ontology requirement specification document (ORSD) using the methodological guidelines and the provided material, and documenting in detail the decisions taken.\nUse FreeMind Software for writing the competence questions\n[9]\nThe template for writing the ORSD (ontology requirement specification document):\nORSD Template\nQuick search for non-ontological resources in internet and ontologies using Watson that could be reused during the ontology development.\nSchedule the ontology network development using the gOntt plugin included in the NeOn toolkit.\nComment if the NeOn methodology should be adapted for building ontologies in this scenario and write your proposal.\nFill in the questionnaire\n[10]\nregarding the guideliness related with ontology requirement specification.\nDo the same\n[11]\nabout the gOntt plug-in.\n7/10/2010. Invited talk: General Ontologies (Mariano Fernández López)\nThe goal of this lecture is to present guidelines for reusing general or common ontologies.\nRecommended reading:\nSlides:\nGeneral ontologies\nAssignment: see the butlast slide\n14/10/2010. Methodologies II (Asun)\nThe goal of this lecture is to present methods and tools for reusing and re-engineering non-ontological resources into ontologies.\nRecommended reading (Reusing and Re-engineering non-ontological resources):\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[12]\nChapter 6: Non-Ontological Resource Reuse and Re-engineering.\nD2.2.2. Methods and Tools Supporting Re-engineering\n[13]\nChapter 2: State of the Art.\nChapter 3: NeOn Method for Re-engineering Non-ontological Resources.\nChapter 4: Methods for Re-engineering Classification Schemes.\nChapter 5: Methods for Re-engineering Thesauri.\nSlides:\n[14]\nAssignment (deadine: 20/10/2010 9pm) Use PRNOR to build the ontologies\n[15]\n21/10/2010 and 28/10/2010. Ontology languages I - RDF(S) and SPARQL (Oscar)\nRecommended reading:\nChapter 4 of the book \"Ontological Engineering\", W3C documents on RDF, RDF Schema and SPARQL\nJ. Perez, M. Arenas, C. Gutierrez, The Semantics and Complexity of SPARQL. 5th International Semantic Web Conference, ISWC 2006, Athens, Georgia, USA, November 2006.\nhttp://www.dcc.uchile.cl/~cgutierr/papers/sparql.pdf\nSlides:\nRDF(S)\nSPARQL\nAdditional RDF(S) examples:\nEjemplos RDF(S)\nAssignment: see Ontology Languages (II)\n4/11/2010. Annotation (Oscar)\nRecommended reading:\nHandschuh S, Staab S (2003). Annotation for the Semantic Web. IOS Press\nCorcho, O. Ontology-based document annotation: trends and open research problems. International Journal of Metadata, Semantics and Ontologies 1(1):47-57. 2006.\n[16]\nSix challenges for the Semantic Web. Benjamins VR, Contreras J, Corcho O, Gómez-Pérez A. KR2002 Workshop on Semantic Web. Toulouse, France. April 2002\nRequirements and Services for Metadata Management. Missier P, Alper P, Corcho O, Dunlop I, Goble C. IEEE Internet Computing 11(5): 16-24\nToward a New Generation of Semantic Web Applications. d'Aquin M, Motta E, Sabou M, Angeletou S, Gridinoc L, Lopez V, Guidi D. IEEE Intelligent Systems, June 2008\nRDFa tools (\nhttp://www.w3.org/2001/sw/wiki/RDFa\n)\nWYMeditor -\nhttp://wymeditor.org/\n- which integrates with Drupal, Rails, Django, or WordPress. Prototype:\nhttp://files.wymeditor.org/wymeditor/trunk/src/examples/15-rdfa-editor.html\nAloha editor with a RDFa prototype at\nhttp://aloha-editor.com/wiki/index.php/Semantic_Annotation\nRDFa Documents:\nhttp://www.adobe.com/cfusion/exchange/index.cfm?event=extensionDetail&extid=1759526\n. Only supports RDFa 1.0.\nRDFa Square:\nhttp://demos.inf.ed.ac.uk:8836/rdfasquare\nSome links:\nhttp://www.ebusiness-unibw.org/wiki/RDFaAuthoring\nSlides:\nSlides\nAssignment: Taking into account the domain ontologies generated in the previous assignments, select a set of Web pages, wikis, databases or any other resources and make ontology-based annotations about them, publishing them in a suitable form.\nDeadline: there is no need to deliver this assignment. It is just homework for you.\n11/11/2010. Linked Data generation (Oscar)\nRecommended reading:\nDocumentación disponible en\nhttp://www.geolinkeddata.es\nA Survey of Current Approaches for Mapping of Relational Databases to RDF (PDF), Satya S. Sahoo, Wolfgang Halb, Sebastian Hellmann, Kingsley Idehen, Ted Thibodeau Jr, Sören Auer, Juan Sequeda, Ahmed Ezzat, 2009-01-31. Available at\nhttp://www.w3.org/2005/Incubator/rdb2rdf/RDB2RDF_SurveyReport.pdf\nCheck\nhttp://code.google.com/p/google-refine/\nfor some of the issues that we were talking about as well.\nSlides:\n[17]\nAssignment: Generate Linked Data in a domain like the one proposed in hands-on 1\nDeadline: 24/11/2010 9pm\n25/11/2010. Ontology languages II. OWL (Oscar)\nRecommended reading: Chapter 4 of the book \"Ontological Engineering\", OWL 2 documents available at W3C\nSlides: [\nOntology languages (OWL)\n] [\nOWL Modularisation and Debugging\n] [\nSample OWL ontology with inconsistencies\n]\nAdditional reading:\n[1] Cuenca Grau B, Horrocks I, Kazakov Y, Sattler U. Just the Right Amount: Extracting Modules from Ontologies. WWW2007,\n[2] Horridge M, Parsia B, Sattler U. Laconic and Precise Justifications in OWL. ISWC2008.\n[3] Schlobach S, Cornet R. “Non-standard reasoning services for the debugging of description logic terminologies”. In Proceedings of the 18th International Joint Conference on Artificial Intelligence (IJCAI), Acapulco, Mexico: 355-362. (2003)\n[4] Hai Wang, Alan Rector, Nick Drummond, Matthew Horridge, et al. OWL Pizzas: Practical Experience of Teaching OWL-DL: Common Errors & Common Patterns. EKAW 2004\nhttp://www.co-ode.org/resources/papers/ekaw2004.pdf\n[5] Corcho O, Roussey C, Vilches-Blázquez LM and Pérez I. Pattern-based OWL Ontology Debugging Guidelines. Proceedings of the Workshop on Ontology Patterns (WOP 2009), collocated with the 8th International Semantic Web Conference (ISWC-2009), Washington D.C., USA, 25 October, 2009.\nhttp://ftp1.de.freebsd.org/Publications/CEUR-WS/Vol-516/\nAssignment: --\nDeadline: --\n2/12/2010. Assignments: overview, questions, etc. (Asun)\n9/12/2010. Applications (Asun)\n[18]\n13/01/2011. Exam\nNote\n: all the students will need to submit their final ontology and Linked Data assignments on 12/01/2010 9pm.\nHands on activities\n\nAll hands-on activities must be submitted by e-mail to masterr10@delicias.dia.fi.upm.es.\nDesign and implement an ontology to be used for linked data generation taking into account open and public data in Spanish. As an example of the type of data you should use, go to the Web page of Ministerio de Medio Ambiente [2] . You will see there that data are available in different formats (Microsoft Excel, PDF,  ASCII files, etc. Taking into account the particular data you have selected, you should:\nBuild an ontology following the NeOn methodology.\nTransform the data sources into RDF\nLink the data with existing data in the Web of Data. Examples of potential resources are: DBPedia [4], GeoLinkedData [5] or GeoNames [6]. You can also use for searching resources sig.ma [7]. If you plan to represent stastistical information, you should use SCOVO [8].\nImplement the ontology you can use any of the following tools: RDF Gravity [9], Jena [10], NOR2O [11] and the  NeOn Toolkit [12].\n[1]\nhttp://www.w3.org/RDF/\n[2]\nhttp://www.mma.es/portal/secciones/biodiversidad/banco_datos/\n[3]\nhttp://www.mma.es/portal/secciones/biodiversidad/montes_politica_forestal/estadisticas_forestal/indice_estadisticas_forestales_2007.htm\n[4]\nhttp://dbpedia.org/\n[5]\nhttp://geo.linkeddata.es/\n[6]\nhttp://www.geonames.org/\n[7]\nhttp://sig.ma/\n[8]\nhttp://purl.org/NET/scovo#\n[9]\nhttp://semweb.salzburgresearch.at/apps/rdf-gravity/\n[10]\nhttp://jena.sourceforge.net/\n[11]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[12]\nhttp://www.neon-toolkit.org/\nResearch topics\n\nLinked Data lifecycle\nDistributed SPARQL querying\nOWL Debugging\nOntology Design Patterns\nOntology Reuse\nTransformation of Knowledge-aware Resources\nJob offers\n\nOhio. Dayton. Septiembre 2010. PhD students\nKnoesis2010\n(más información: contactar con Oscar Corcho)\nEEUU. Los Ángeles. Agosto 2010. Distributed/Federated Query Expert\nOrangeDog2010\n(más información: contactar con Oscar Corcho)\nAustria.  Innsbruck. Agosto 2010. PhD-Researcher\nINSEMTIVES2010\n(más información: contactar con Oscar Corcho)\nUK. Oxford. Agosto 2010. Research.\nOxford2010\n(más información: contactar con Oscar Corcho)\nGermany. Munich. Agosto 2010. Researcher: SEMANTIC TECHNOLOGIES and SERVICE-ORIENTED COMPUTING.\nDOCOMO2010\n(más información: contactar con Oscar Corcho)\nAustria. Vienna. Julio 2010. Junior Researcher.\nSTI2010\n(más información: contactar con Oscar Corcho)\nItaly. Ancona. Julio 2010. Semantic Web Applications.\nSemWebApp2010\n(más información: contactar con Oscar Corcho)\nPaís Vasco. España. Julio 2010. Doctor\nIDEKOJul2010\n(more information: Oscar Corcho)\nUSA. Colorado. Golden. Julio 2010. Information Curator\nNRELJul2010\n(more information: Oscar Corcho)\nIreland. Galway. Junio 2010. PhD\nDERIJun2010\n(more information: Oscar Corcho)\nAustria. Innsbruck. Junio 2010. PhD Researcher\nSTIJun2010\n(more information: Oscar Corcho)\nUK. Milton Keynes. Abril 2010. Researcher/Senior Researcher\nKMi2010\n(more information: Oscar Corcho)\nAustralia. Queensland. Abril 2010. Post-doctoral research fellowship\nPost-doctoral2010\n(more information: Oscar Corcho)\nUSA. Stanford. Abril 2010. Computer Scientist\nComputerScientist2010\n(more information: Oscar Corcho)\nAustria. Innsbruck. Abril 2010. Phd Student at the IMSENTIVES project\nINSEMTIVESApr2010\n(more information: Oscar Corcho)\nGermany. Berlín. Abril 2010. DBPedia developer.\nDBPediaApr2010\n(more information: Oscar Corcho)\nPostdoc position at GESIS, Germany. Semantic Web. April 2010\nGESISApr2010\n(more information; Oscar Corcho)\nResearch associate at GESIS, Germany. Semantic Web and Web2.0. March 2010.\nGESIS2010\n(more information: Oscar Corcho)\nPostdoc position at TU Vienna. Fuzzy logic and ontologies. February 2010.\nhttp://www.logic.at/WWTF016/\nFPI (Formación de Personal Investigador) Grant at Universidad de Santiago de Compostela, related to medical terminologies. February 2010.\nFPIUSC2010\n. (more information: Oscar Corcho)\nPhD researcher at Universitat Innsbruck, Austria. February 2010.\nhttp://orawww.uibk.ac.at/public_prod/owa/karriereportal.karriere_detail?asg_id_in=5845\nPostdoc and PhD student positions at Agile Knowledge Engineering and Semantic Web (AKSW), Universitat Leipzig (Germany). February 2010.\nhttp://aksw.org/Jobs\nPostdoc position at Universidad Rey Juan Carlos. January 2010.\nhttp://www.cetinia.urjc.es/es/news/postdoc-position\nFPI fellowship in Universidad Rey Juan Carlos\n. January 2010.\nSemantic-technologies software engineer in Playence, Austria. January 2010. (more information: Oscar Corcho)\nFull-time internship in Knowledge Media Institute, Milton Keynes (UK). January 2010. (more information: Oscar Corcho)\nPart-time internship at iSOCO, Madrid (Spain). January 2010. (more information: Oscar Corcho)\nSenior scientists and postdocs, Tetherless World Group, RPI (Jim Hendler), January 2010.\nhttp://tw.rpi.edu/wiki/Jobs\nPostdocBourgogne\n, Collaborative Web for Musical Resources, November 2009\nPostdocLORIA\n, November 2009\nPostdoc in Aberdeen on Semantic Infrastructures, November 2009.\nhttp://www.abdn.ac.uk/jobs/display.php?recordid=RDH013R\nResearch Associate in Knowledge Media Institute, Milton Keynes, November 2009.\nhttp://kmi.open.ac.uk/jobs/vacancy-6149.php\nSenior Researchers and Postdoc positions at Semantic Technology Institute, Austria, November 2009.\nhttp://www.sti-innsbruck.at/about/jobs/\nRecommended reading (Ontology Matching):\nJ.Euzenat \"Tutorial on Ontology Matching\" (at least the section titled \"Matching problem\").\n[19]\nJorge Gracia and Eduardo Mena, \"Web-based Measure of Semantic Relatedness\", Proc. of 9th International Conference on Web Information Systems Engineering (WISE 2008), Auckland (New Zealand), Springer Verlag LNCS, volume 5175, pp. 136-150, September 2008.\n[20]\nSlides: 2.\nSemantic Measures and Ontology Matching: an Overview and some Examples",
  "speaker": "SYSTEM",
  "uuid": "f36739c6-e148-464c-a676-e6bb0ec98a9b"
}