{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 24\nPage 24 of 124\nNeOn Integrated Project EU-IST-027595\n– Comparison with existing methods. Here the authors compare the goals and requirements to\nthose existing methods to choose a suitable one. The authors compared the methods of Soergel\net al. [SLL+04], Miles et al. [Mil05], and van Assem et al. [vAMSW04].\n– Developing steps of the method. The method by Miles et al. [Mil05], which has a comparable goal\nand requirements was employed as starting point and adapted to this purpose. The outcoming\nsteps are\n∗To analyze the digital format and the documentation of the resource. The output of this step\nis a catalogue of data items and constraints and a list of thesaurus features.\n∗To deﬁne a mapping between input data items and output SKOS RDF. The output of this step\nare tables that map data items to schema items.\n∗To develop an algorithm for the transformation program. The output of this step is a conver-\nsion program.\n– Applying the method. The method has been applied to three thesauri: IPSV18, GTAA19 and\nMeSH20 because they are used in practice and represent progressively complex thesauri.\n– Evaluating the method. The case studies showed that the method gives appropriate guidance\nin identifying common features of thesauri. However, the authors point out that conversion of\nconcept-based thesauri should be simpler than term-based thesauri as SKOS is concept-based.\nThis method follows the approach used for transforming resource content into an ontology\nschema and an ad-hoc wrapper is used for the transformation. This method contemplates syn-\ntactic transformation aspects and how symbols are structured in the thesaurus and ontology for-\nmats. On the other hand, the method contemplates the semantic transformation aspects and the\nsemantic interpretation of the resource elements when deﬁning transformations to ontology elements.\nHowever, it does not tackle the internal data model of the thesaurus, nor does it explains how the\nresource data is represented and accessed for the transformation. It does not provide the resource\nprovenance information, so the resultant ontology does not keep the reference to the thesaurus.\nThe method produces one single ontology. The ontology components generated are classes, at-\ntributes, and relations and they are expressed in SKOS RDF.\n• Wielinga et al.\nin [WSWS01] present a method for transforming the Art and Architecture The-\nsaurus (AAT) into an RDF(S) ontology. The AAT is the most elaborate and most standardized body\nof knowledge concerning classiﬁcations of art objects. AAT is published via a searchable online Web\ninterface21 and it is also available in XML ﬁles.\nThis method is based on the approach for transforming resource content into an ontology schema\nand employs an ad-hoc wrapper. This method contemplates syntactic transformation aspects and\nhow symbols are structured in the thesaurus and ontology formats. It, also contemplates semantic\ntransformation aspects since it considers the semantic interpretation of the resource elements when\ndeﬁning transformations to ontology elements. It tackles the internal data model of the thesaurus\nand describes how the resource data is represented and accessed for the transformation. However,\nit does not inform about the resource provenance information, so the resultant ontology does not\nkeep the reference to the thesaurus. The method consists of the following steps:\n– To convert the full AAT hierarchy into a hierarchy of concepts where each concept has a label\nslot corresponding with the main term in AAT and a synonyms slot where alternate terms are\nrepresented.\n18Integrated Public Sector Vocabulary http://www.esd.org.uk/standards/ipsv/\n19Common Thesaurus for Audiovisual Archives http://informatieprofessional.googlepages.com/gtaa\n20Medical Subject Headings http://www.nlm.nih.gov/mesh/\n21http://www.getty.edu/research/conducting_research/vocabularies/aat/\n",
  "speaker": "SYSTEM",
  "uuid": "f377a698-d4b8-48fe-8b59-ab1a650a7ed6"
}