{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 72\nPage 72 of 124\nNeOn Integrated Project EU-IST-027595\nTable 4.6: Pattern for Re-engineering a Classiﬁcation Scheme which follows the\nﬂattened model(continued)\nSlot\nValue\nExample\n1. Create the Geographical Area, Region, Province classes, according to the\nISTAT entities.\n2. Create the hasRegion binary relation with Geographical Area as domain and\nRegion as range.\n3. Create the hasProvince binary relation with Region as domain and Province as\nrange.\n4. Create the LOCATION class and assert that Geographical Area, Region, and\nProvince are subClassOf LOCATION.\n5. Create an instance of Geographical Area class for each distinct ISTAT geo-\ngraphical area.\n6. Look for the Regions of each Geographical Area instance in the ISTAT regions\nand create an instance of REGION for each distinct region. Create an instance of the\nhasRegion relation associated to the current Geographical Area instance and\nrelated to the current Region instance.\n7. Look for the Provinces of each Region instances in the ISTAT provinces and cre-\nate an instance of Province for each distinct province. Create an instance of the\nhasProvince relation associated to the current region instance and related to the\ncurrent province instance.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\n4.4\nNeOn Method for Re-engineering Classiﬁcation Schemes\nThe goal of the classiﬁcation scheme re-engineering process is to transform a classiﬁcation scheme into an\nontology. The activities of this process are based on the ones presented in 3.1.4: (1) non-ontological resource\nreverse engineering, which includes tasks 1 to 3, (2) non-ontological resource transformation, which includes\ntasks 4 and 5, and (3) ontology forward engineering, which includes tasks 6 and 7.\n4.4.1\nClassiﬁcation Scheme Transformation\nIn the following, we outline the specialization of the non-ontological resource transformation activity for classi-\nﬁcation schemes, and consequently how to carry out tasks 4 and 5 included in Figure 3.2. The classiﬁcation\nscheme transformation consists of the following tasks:\n• Task 4.\nSearch for a suitable pattern for re-engineering classiﬁcation scheme.\nThe goal of\nthis task is to ﬁnd out if there is any applicable re-engineering pattern for re-engineering classiﬁca-\ntion scheme useful to transform the classiﬁcation scheme into a conceptual model. The search for\na suitable pattern for re-engineering classiﬁcation scheme should be done using the NeOn library of\npatterns8. For this search, the following search criteria can be used by the ontology developer:\n– Type of non-ontological resource: classiﬁcation scheme.\n– Data model: one of the aforementioned data models, e.g.: path enumeration, adjacency list,\nsnowﬂake, or ﬂattened.\n– Target ontology: taxonomy or lightweight ontology.\n– The semantics of the relations between classiﬁcation scheme items: subClassOf, parOf, or other\nad-hoc relation.\n8http://www.ontologydesignpatterns.org\n",
  "speaker": "SYSTEM",
  "uuid": "f46ed6cb-6ee3-4171-b769-0588afac6f41"
}