{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 3\n3   Experiment on Developing Ontologies \nIn this section we present the experiment carried out on ontology development with \nthe aim of analyzing the resultant ontologies. Section 3.1 presents the setting of the \nexperiment, which was made up of two main parts: (1) ontology development by \nparticipants, described in Section 3.1.1, and (2) analysis of the ontologies, described \nin Section 3.1.2. \n3.1   Experiment Setting \nThrough this section we present the setting of the experiment we have carried out. In \nSubsection 3.1.1, we describe the session setup for the experiment in which we have \nobtained a set of ontologies to be analyzed. Then, in Subsection 3.1.2, we present the \napproach followed during the analysis carried out over the aforementioned ontologies. \nThe analysis allowed us to identify a set of anomalies that ontology developers, \nmainly beginners, often make. \n3.1.1   Session Setup \nWe have divided the experiment into 3 separate sessions. Each session involved a \ndifferent set of participants and was held in different periods of time. All the sessions \nwere carried out involving participants with background in computer science and \nsome experience in ontology engineering. Participants, who worked in groups of up to \ntwo, were distributed through of the following training courses: \nS1. 22 participants attended the “Ontologies and the Semantic Web” course at \nthe Master on Information Technologies (in the following IT Master 07-08) \nat the Universidad Politécnica de Madrid (UPM), from October 2007 to \nFebruary 2008.  \nS2. 10 participants attended the “Ontologies and the Semantic Web” course at \nthe Master on Information Technologies (in the following IT Master 09-10) \nat UPM, from October 2009 to February 2010.  \nS3. 19 participants attended the “Ontologies and the Semantic Web” course at \nthe Master of Research on Artificial Intelligence (in the following AI Master \n09-10) at UPM, from October 2009 to February 2010. \nIn all the sessions the participants were taught in:   \n1. the theoretical foundations of ontologies \n2. ontologies and terminologies \n3. ontology languages, including RDF(S) and OWL \n4. methodologies for building ontologies, specifically in the NeOn Methodology \nframework [12] and the methodological guidelines for specifying \nrequirements, scheduling, reusing, reengineering, and mapping knowledge \nresources as well as  modelling ontologies. \nAdditionally, all the sessions incorporated independent practical training in: \n1. building a proof ontology in RDF(S) and OWL \n2. writing the ontology requirements specification document (ORSD) [12, 13] in \none of the domains proposed and shown in Table 1 \n",
  "speaker": "SYSTEM",
  "uuid": "f48d7644-d00c-4c39-8f11-67e7ba3b06d0"
}