{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/DERInov2010 \n\nThe Digital Enterprise Research Institute (DERI) at the National University of Ireland, Galway, is seeking candidates for the following position(s):\nProject Research Intern\nThe Digital Enterprise Research Institute (DERI) is among the largest research organisations working in Semantic Web technologies. DERI’s mission is to establish semantics as a core pillar of modern computer engineering. DERI offers a stimulating, dynamic, multi-cultural research environment with excellent ties to research groups worldwide. This is a unique opportunity to join the efforts within DERI, in collaboration with our industrial partner you will during this internship develop and implement advanced querying technologies based on semantic technologies.\nThe Person\n- Ability to work in a team based environment developing state of the art software solutions on time and to specification\n  - Motivated and proactive attitude to take ownership and initiative in all work assignments\n  - Excellent analysis and problem solving skills\n  - Strong design, development & testing skills\n  - Excellent communication skills, verbal and written\n  - Creative Thinking\nEssential Skills\n- Good knowledge of object-oriented design principles and design patterns with an understanding of their application in Java\n  - Software development experience on Linux with open-source tools\n  - Third level degree in computer science or related discipline\nDesirable Experience & Background (inc. qualifications):\n- Experience with Semantic Web technologies (e.g. RDF, OWL, SPARQL, Jena)\nThe duration of the interenship will be for 4 months in the first instance.\nApplication procedure:\n==========\n\nInformal enquiries about these positions may be made to:\naxel.polleres@deri.org\nWhen applying, please use the same email address and put \"Project Research Intern\" in the subject line of emails.\nCandidates are requested to submit a cover letter and CV (PDF)\nClosing date for receipt of applications is Dec 15, 2010. We expect the successful candidates to start at the earliest possible date, ideally in January 2011.",
  "speaker": "SYSTEM",
  "uuid": "f4b7a07d-5460-49b7-a0b1-342d1597e3d0"
}