{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 14\n14\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\ndependencies. Henceforth, when using the term TGD (resp., KD), unless stated oth-\nerwise, we shall refer to TGDs (resp., KDs) that are part of a set of CDs (the results\nof this paper do not hold in general).\n1.4 Separable Conceptual Dependencies\nIn this section we introduce the novel class of non-conﬂicting CDs. This class en-\nsures that the TGDs and the KDs do not interact, so that answers to queries over\nan ER+ schema can be computed by considering the TGDs only, and ignoring the\nKDs, once it is known that the initial data are consistent with respect to the schema.\nThis semantic property is known as separability [11, 26].\nDeﬁnition 1.3. Consider a set Σ = ΣT ∪ΣK of CDs over a schema R, where ΣT\nare TGDs and ΣK are KDs. Σ is separable if for every database D for R, either\nchase(D,Σ) fails or, for every CQ q over R, ans(q,D,Σ) = ans(q,D,ΣT).\n1.4.1 Deﬁnition of Non-Conﬂicting CDs\nBefore syntactically deﬁning non-conﬂicting CDs, we need some preliminary tech-\nnical deﬁnitions.\nConsider a set Σ = ΣT ∪ΣK of CDs over a schema R, where ΣT and ΣK are\nTGDs and KDs, respectively. The CD-graph of Σ is a multigraph ⟨V,E,λ⟩, where\nV is the node set, E is the edge set, and λ is a labeling function E →ΣT. The node\nset V is the set of positions of (fe(R) ∪fr(R)). For each TGD σ ∈ΣT such that\n{pred(body(σ)),pred(head(σ))} ⊆V, and for each universally quantiﬁed variable\nX that occurs in body(σ) at position π and in head(σ) at position π′, there exist:\n(i) an edge e from π to π′ with λ(e) = σ, and (ii) for each existentially quantiﬁed\nvariable Y in head(σ) at position π′′, a special edge e′ from π to π′′ with λ(e′) = σ.\nA node v = p[i] ∈V is called e-node (resp., r-node) if p ∈fe(R) (resp., p ∈fr(R)).\nMoreover, if v is an r-node and the KD key(p) = {i} occurs in ΣK, then v is called\nk-node.\nLet G be the CD-graph of Σ. Consider an edge u↷v in G which is labeled by\nthe TGD r1(X1,...,Xn) →r2(Xj1,...,Xjn), where {r1,r2} ⊆fr(R) and [j1,..., jn]\nis a permutation of the set [n]. Intuitively, the permutation [j1,..., jn] indicates that\nthe ji-th component of the relationship R1 is the i-th component of the relationship\nR2. This fact can be represented by the bijective function fu↷v : [n] →[n], where\nfor each i ∈[n], fu↷v( ji) = i. Now, consider a cycle C = v↷\n1 v↷\n2 ...↷v↷\nm v1 of only\nr-nodes in G. The permutation associated to C, denoted as πG(C), is deﬁned as the\npermutation g([1,...,n]) = [g(1),...,g(n)], where g = fv↷\nm v1 ◦...◦fv↷\n2 v3 ◦fv↷\n1 v2.\nWe are now ready to give the formal deﬁnition of non-conﬂicting CDs, which is\nbased on the notion of the CD-graph.\n",
  "speaker": "SYSTEM",
  "uuid": "f50ba70b-bf7e-4795-bff9-3e9cf0a7148f"
}