{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 32\nPage 32 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n2.4. Knowledge Engineering: Development Process  \nThe \nmajor \ndifference \nbetween \nKnowledge \nEngineering \n(the \nscience \nof \ndeveloping \nknowledge-based software systems) and Software Engineering is the requirement for knowledge \nengineers to capture, represent, analyse and exploit knowledge in order to produce a successful \nknowledge-based system [41].  \nBoth disciplines (Software Engineering and Knowledge Engineering) has the similar main goal, that \nis to turn the process of developing systems (classical and knowledge-based, respectively) from an \nart into an engineering discipline. This requires the analysis of the building and maintenance \nprocess itself and the development of appropriate methods, languages and tools for developing \nsystems [56]. \nA methodological development of a project requires the definition and standarization of \ndevelopment and maintenance processes (from the requirements specification to the maintenance \nof the final product) and of the life cycle models to be within the project. \nBased on Software Engineering field, some methodologies for building knowledge-based systems \n(KBSs) have been proposed, taking into account the features of this kind of systems. Such \nmethodologies provides the complete life cycle for the development process, including guidelines \nto be followed in the different activities of the process. \nIn this deliverable we include briefly the development processes proposed by two Knowledge \nEngineering methodologies: CommonKADS and IDEAL. \nIn the CommonKADS methodology [50], KBS development entails constructing a set of six \nengineering models of problem solving behavior in its concrete organization and application \ncontext. This modeling concerns not only expert knowledge, but also the various characteristics of \nhow that knowledge is embedded and used in the organizational environment. A KBS, then, is a \ncomputational realization associated with a collection of these models. The models to be \ndeveloped are: \n \nThe organization model, which models the main features of the organization developing the \nKBS.  \n \nThe task model, which models the different tasks to be supported by the application being \ndeveloped. \n \nThe expertise model, which models the problem solving behavior of an agent in terms of \nthe knowledge that is applied to perform a certain task. \n \nThe agent model, which models the features and capabilities of the agents (people, \ninformation systems, etc.) carrying out tasks. \n \nThe communication model, which models the communication between the agents involved \nin the resolution of a task.  \n \nThe design model, which models the technical aspects of the KBS. \nThe aforementioned models are considered not as “steps along the way”, but as independent \nproducts in their own right that play an important role during the development process of the KBS \n[50].  \nIn the IDEAL methodology [34], KBS development and maintenance processes consists of the \nfollowing five main phases, which includes several stages. \n \nPhase I: Identification of the tasks to be developed. In this phase the KBS objectives and \nproblem characteristics are defined and the systems requirements are specified. A viability \nstudy is also carried out in this phase. \n",
  "speaker": "SYSTEM",
  "uuid": "f551b39f-6bca-4759-8366-35f728e73f39"
}