{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 74\nPage 74 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n5. Life Cycle of Ontology Networks \nBased on the definitions presented in Section 2.1, an ontology network life cycle model is \ndefined as the framework, selected by each organization, on which to map the activities identified \nand defined in the NeOn Glossary of Activities, presented in Chapter 3, to produce the ontology \nnetwork life cycle. On the other hand, the ontology network life cycle is defined as the project-\nspecific sequence of activities created by mapping the activities identified in the NeOn Glossary of \nActivities onto a selected ontology network life cycle model. \nThus, the main objective of establishing the life cycle is to determine when the identified activities \nshould be carried out and through which stages the ontology network moves during its life. \nThis chapter includes a collection of ontology network life cycle models (version 1) in Section 5.1, \nthe classification of the activities identified (in Chapter 3) based on the IEEE groups in Section 5.2, \nand guidelines for obtaining the life cycle for a concrete ontology network in Section 5.3. \n5.1. NeOn Life Cycle Models \nBased on the Software Engineering field [46], we can say that ontology network life cycle models \ndefine how to develop an ontology network project (that is, how to develop and maintain an \nontology network); in other words, they organize the activities of the NeOn Glossary of Activities \ninto phases or stages.  \nIn general, life cycle models can be seen as abstractions of the phases or stages through which a \nproduct passes along its life; in our case the product is an ontology network. Life cycle models are \nused to represent the entire life of a product from concept to disposal and they should determine \nthe order of the phases and establish the transition criteria between different phases. Each phase \nor stage should be described with a statement of purpose and outcomes.  \nIn the Software Engineering field it is acknowledged that there is no a unique life cycle model valid \nfor all the software development projects and that each life cycle model is appropriate for a \nconcrete project, depending on several features. For example, sometimes it is better a simple one \n(like waterfall), whereas other times it is most suitable a spiral one (if the analysis of the risk is \nneeded within the project). \nThis claim is also valid for the Ontology Engineering field. Therefore, to propose a unique life cycle \nmodel for all the ontology network developments is not very realistic.  \nTaking into account the specific features of the ontology network development, we can define a \ncollection of ontology network life cycle models (version 1) based on the life cycle models \ndescribed and used in Software Engineering (Section 2.3).  \nIn this section we have created and proposed several theoretical ontology network life cycle \nmodels, based on those proposed in the Software Engineering field. The ontology network life \ncycle models here presented vary from trivial and simple models to difficult and complex ones. In \nour proposal, we have put special emphasis in knowledge resources (ontological and non \nontological) reuse and reengineering, and in ontology merging.  \nAs a first stage we propose a collection of theoretical life cycle models for ontology network \ndevelopments; and through the NeOn project, recommendations and guidelines about cases in \nwhich one model is more suitable than another (from the proposed collection) will be provided as \nwell as information on updates on the collection based on experimentations in different use cases. \n",
  "speaker": "SYSTEM",
  "uuid": "f67ccb62-bd7e-451e-92a8-394085a7c931"
}