{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 6\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \nactualizaciones a todos los que hayan participado hasta ese momento en la consulta a través de la \ndirección de correo electrónico desde la que se envió la propuesta. Además se publicarán, al \nmenos, en la página web del Plan de Impulso de las Tecnologías del Lenguaje. \nEl cierre de la consulta se determinará para cada reto publicado cuando la Secretaría de Estado \npara la Sociedad de la Información y la Agenda Digital estime que, o bien dispone de información \nsuficiente sobre propuestas innovadoras para ese reto como para iniciar un eventual proceso de \ncontratación pública de innovación, o bien considere que tal reto no ha generado suficiente \ninterés en el mercado como para mantener la consulta, o bien considere que la oportunidad de \nplantear ese reto ha pasado. En cualquier caso, nunca se cerrará antes de trascurridos dos meses \ndesde la publicación del reto. El cierre de la consulta sobre un reto se anunciará con al menos un \nmes de antelación, publicándolo en sitio web arriba indicado. Se avisará del cierre de cada reto a \ntodos los que hayan participado hasta ese momento en la consulta a través de la dirección de \ncorreo electrónico desde la que se envió la propuesta. Se podrá revocar el aviso de cierre de un \nreto en cualquier momento informando de ello por los mismos medios. \nSéptimo. Resultado de la Consulta Preliminar al Mercado. \nLa Secretaría de Estado para la Sociedad de la Información y la Agenda Digital estudiará las \npropuestas que se presenten y podrá utilizarlas, conforme a lo establecido en el artículo 117 del \ntexto refundido de la Ley de contratos del sector público, aprobado por el Real decreto legislativo \n3/2011, de 14 de noviembre, y en la Cláusula 42 de la nueva Directiva 2014/24/UE del Parlamento \nEuropeo y del Consejo, de 26 de febrero de 2014, sobre contratación pública, para definir las \nespecificaciones funcionales o técnicas detalladas que se puedan emplear en los procedimientos \nde contratación de bienes o servicios que con posterioridad se puedan convocar, \nfundamentalmente a través del procedimiento de Compra Pública de Innovación (CPI). \nPara el análisis de las diferentes propuestas presentadas, la Secretaría de Estado para la Sociedad \nde la Información y la Agenda Digital podrá nombrar un comité técnico formado por personal del \nórgano proponente. Este comité podrá recabar la opinión de expertos externos con voz pero sin \nvoto en las deliberaciones. \nLa composición de este comité técnico y los expertos externos consultados se publicarán en la \npágina web del Plan de Impulso de las Tecnologías del Lenguaje. \nOctavo. Protección de datos personales y confidencialidad. \nLa Secretaría de Estado para la Sociedad de la Información y la Agenda Digital almacenará los \ndatos de contacto de los participantes en el procedimiento a los meros efectos de establecer un \ncanal de comunicación con los proponentes durante el proceso de Consulta Preliminar al \nMercado.  \nPara asegurar la transparencia del proceso, la disponibilidad de la mayor información posible y el \nintercambio eficaz de experiencias y opiniones, los participantes harán constar expresamente su \nconformidad para que la Secretaría de Estado para la Sociedad de la Información y la Agenda \nDigital mantenga accesible y actualizada la información necesaria, total o parcial, sobre sus \npropuestas, sin perjuicio de aquella que haya sido marcada como confidencial. \nLos participantes indicarán la documentación o la información técnica o comercial de su \npropuesta que tiene carácter confidencial, no siendo admisible que efectúen una declaración \ngenérica o declaren que toda la información tiene carácter confidencial. Este carácter confidencial \nprotege, en particular, a los secretos técnicos o comerciales y a los aspectos confidenciales de las \nsoluciones. En este sentido, el contenido la información incluida en el formulario en ningún caso \n",
  "speaker": "SYSTEM",
  "uuid": "f6c1a212-eb39-4fb5-b000-d7e8288c465f"
}