{
  "message": "SYSTEM: Ejercicios.pdf: Página 13\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n13 \n Ejercicio 5    Ejercicio del Sistema Periódico. \n \nConstruir una BC formalizada en marcos que represente el Sistema Periódico (SP). Tras la \netapa de conceptualización se sabe que: \na) \nLos elementos del SP se clasifican en los siguientes grupos: Metales, No Metales, \nSemi-Metales y los Gases Notables, a excepción del Hidrógeno que no tiene un grupo \nbien definido. Además se sabe que, el Hidrógeno, los Metales, los no-metales y los \nsemi-metales reaccionan con otros elementos, mientras que los otros no. \nb) \nLos elementos metales se pueden clasificar en dos grupos: Metales de No Transición, \nque a su vez engloba a los Alcalinos y Alcalinotérreos; y los Metales de Transición, que \ncomprenden la primera y segunda serie de transición y a los Lantánidos y Actínidos, \ntambién llamados primera y segunda serie de transición interna. \nc) \nLa clasificación de los no metales no está tan bien definida como en la clase de los \nmetales. Sin embargo, existe un grupo bien diferenciado que es el de los Halógenos. \nd)  Los elementos del SP sólo pertenecen a un único grupo. A saber: \n* Los Alcalinos son el grupo Ia (Li, Na, K, Rb, Cs, Fr) \n* Los Alcalino-Térreos son el grupo IIa (Be, Mg, Ca, Sr, Ba, Ra) \n* La primera serie de transición interna son los grupos de los Lantánidos (Ce, Pr, \nNd, Pm, Sm, Eu, Gd, Tb, Dy, Ho, Er, Tm, Yb, Lu) \n* Los Actínidos (Th, Pa, U, Np, Am, Cm, Br, Cf, Es, Fm, Md, No, Lw) \n* Forman la primera serie de trnsición los elementos del cuarto período (Sc, Ti, V, \nCr, Mn, Fe, Co, Ni, Cu, Zn), y la segunda serie de transición los del quinto período \n(Y, Zr, Nb, Mo, Tc, Ru, Rh, Rd, Ag, Cd). \n* El elemento La no tiene un grupo bien definido dentro de los Metales de \nTransición. \n* Los Halógenos son el grupo VIIb: (F, CI, Br, I, At). El resto de elementos (C, N, \nO, P, S), pertenecen al resto de No-Metales. \n* El grupo VIII (He, Ne, Ar, Kr, Xe, Rn) son los gases nobles. \n \n \nSe pide:  \n1. Construir la Taxonomía \n2. Identificar propiedades de clase y de instancia. \n",
  "speaker": "SYSTEM",
  "uuid": "f7cdbbcf-7d0b-4597-bc86-f607cf42aa44"
}