{
  "message": "SYSTEM: QRVocabulary.pdf: Página 2\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n84 / 103 \nA.1: The notion of Model \nA central concept to Qualitative Reasoning and Modelling is the 'model': A model is an \nabstract representation of a system that enables users to make testable predictions \nabout what happens to a system in different situations. \nA.2: Structural Building Blocks \nStructural modelling ingredients describe the organisation of the concepts within a \nsystem and the static features of those concepts. \nA.2.1 Entities \nEntities are the physical objects or abstract concepts that play a role within the system. \nThese entities are arranged in a subtype hierarchy. \n \nExamples: \n• An Animal is an Entity \n• A Vertebrate is an Animal \n• A Mammal is a Vertebrate \n• A Zebra is a Mammal \n \nRemarks: \nThe organisation of entities in a subtype hierarchy allows more general entities higher in \nthe hierarchy to be used in model fragments instead of more specific entities below \nthem. This allows for more efficient modelling, as there is no need to - for example - \ncreate a model fragment describing flow for every occurrence of an entity. Instead, just \none model fragment is needed to describe the characteristics of the whole class. \nA.2.2 Configurations  \nConfigurations are used to model relations between instances of entities and agents; \nthey are sometimes referred to as structural relations. \n \nExamples:  \n• Lion preys on Zebra. \n• Container contains Water. \n• Container is connected to Tube. \n \nRemarks: \nEntities and agents cannot exist within a model fragment without a configuration \nconnecting them; they have to be structurally related. \nA.2.3 Attributes \nAttributes are properties of entities that remain static during simulation (i.e. do not \nchange). They have an associated set of attribute values, which are the possible values \nof the attributes.  \n \nExamples: \n• The colour of the animal is black. \n• The openness attribute of a pan filled with boiling water can be either open or \nclosed.  \n• The status of a lock can be either unlocked of locked. \n• The status of a device can be turned on or turned off. \n \n",
  "speaker": "SYSTEM",
  "uuid": "f832b049-2409-4e6a-a736-5a00025ee2bb"
}