{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 16\n5   Conclusions \nOne of the critical activities when developing ontologies is to identify their \nrequirements. In this paper we have systematized the ontology requirements \nspecification activity by proposing detailed and prescriptive methodological \nguidelines for specifying ontology requirements, and a template for writing the \nORSD. When a particular ORSD is created, it can be used for speeding up the \nontology development process. Terms and their frequencies from the pre-glossary in \nthe ORSD can be used for searching and selecting already knowledge-aware and \nconsensual resources that, after a re-engineering process if necessary, allow building \nontologies cheaper, faster, and with higher quality. CQs in the ORSD can be used for \nverifying the correctness of the ontology with respect to the ontology requirements \nidentified. \nThe NeOn methodological guidelines for the ontology requirements specification \nactivity and the ORSD template presented here have been used in the development of \nthe NeOn ontologies and the development of ontologies in other research and \neducational projects with interesting feedback from the ontology developers involved \nin each case. \nFinally, it is worth mentioning that the ORSD facilitates the ontology development \nin different ways: (1) allowing the identification of which particular knowledge \nshould be represented in the ontology, (2) facilitating the reuse of existing knowledge \nresources by means of focusing the resource search towards the particular knowledge \nto be represented in the ontology, and (3) permitting the verification of the ontology \nwith respect to the requirements that the ontology should fulfill. As in other \ndisciplines, a good specification (a) establishes the basis for agreement between the \nusers and ontology developers, (b) reduces the development effort, (c) provides a \nbasis for estimating costs and schedules, and (d) offers a baseline for verification. \n \nAcknowledgments. This work has been partially supported by the European \nCommission projects NeOn (FP6-027595) and SEEMP (FP6-027347), as well as by \nan R+D grant from the UPM. We are very grateful to Elena Montiel-Ponsoda and \nMariano Fernández-López for their revisions and comments. \nReferences \n1. Buzan, T. “Use your head”. BBC Books. 1974. \n2. Davis, A. “Software Requirements: Objects, Functions and States”. Upper Saddle River, \nNew Jersey: Prentice Hall, 1993. \n3. Fernández-López, M., Gómez-Pérez, A. “Searching for a Time Ontology for Semantic Web \nApplications”. Formal Ontology in Information Systems, Turín, Italy. 2004. \n4. Gómez-Pérez A., Suárez-Figueroa, M.C. “NeOn Methodology: Scenarios for Building \nNetworks of Ontologies”. 16th International Conference on Knowledge Engineering and \nKnowledge Management Knowledge Patterns (EKAW 2008). Conference Poster. Italy. \n2008. \n",
  "speaker": "SYSTEM",
  "uuid": "f865593f-25d0-4863-862b-a97e328c6302"
}