{
  "message": "SYSTEM: OEG_submission_SSN2014.pdf: Página 7\nReferences\n1. Babu, S., Bizarro, P.: Adaptive Query Processing in the Looking Glass. In: Pro-\nceedings of the Second Biennial Conference on Innovative Data Systems Research\n(CIDR), Jan. 2005 (2005)\n2. Balduini, M., Della Valle, E., DellAglio, D., Tsytsarau, M., Palpanas, T., Con-\nfalonieri, C.: Social Listening of City Scale Events Using the Streaming Linked\nData Framework. In: Alani, H., Kagal, L., Fokoue, A., Groth, P., Biemann, C.,\nParreira, J.X., Aroyo, L., Noy, N., Welty, C., Janowicz, K. (eds.) The Semantic\nWeb ISWC 2013, pp. 1–16. Springer Berlin Heidelberg (2013)\n3. Broering, A., Echterhoﬀ, J., Jirka, S., Simonis, I., Everding, T., Stasch, C., Liang,\nS., Lemmens, R.: New Generation Sensor Web Enablement. Sensors 11(3), 2652–\n2699 (Mar 2011)\n4. Calbimonte, J.P., Corcho, O., Gray, A.J.G.: Enabling ontology-based access to\nstreaming data sources. In: Proceedings of the 9th International Semantic Web\nConference on The Semantic Web - Volume Part I, pp. 96–111. Springer Berlin\nHeidelberg, Shanghai, China (2010)\n5. Calbimonte, J.P., Fern´andez-Carrera, A., Corcho, O.: Demo paper: Tablet-based\nvisualization of transportation data in Madrid using SPARQLStream. In: Corcho,\nO., Henson, C., Payam, B. (eds.) Proceedings of the 6th International Workshop on\nSemantic Sensor Networks co-located with the 12th International Semantic Web\nConference (ISWC 2013). pp. 67–70. CEUR-WS, Sydney, Australia (2013)\n6. Calbimonte, J.P., Jeung, H., Corcho, O., Aberer, K.: Enabling Query Technolo-\ngies for the Semantic Sensor Web. International Journal on Semantic Web and\nInformation Systems 8(1), 43–63 (2012)\n7. Compton, M., Barnaghi, P., Bermudez, L., Garcia-Castro, R., Corcho, O., Cox,\nS., Graybeal, J., Hauswirth, M., Henson, C., Herzog, A., Huang, V., Janowicz,\nK., Kelsey, W.D., Phuoc, D.L., Lefort, L., Leggieri, M., Neuhaus, H., Nikolov, A.,\nPage, K., Passant, A., Sheth, A., Taylor, K.: The ssn ontology of the w3c semantic\nsensor network incubator group. Web Semantics: Science, Services and Agents on\nthe World Wide Web 17(0) (2012)\n8. Deshpande, A., Ives, Z., Raman, V.: Adaptive Query Processing. Foundations and\nTrends in Databases 1(1), 1–140 (Jan 2007)\n9. Fern´andez, J.D., Mart´ınez-Prieto, M.A., Guti´errez, C., Polleres, A., Arias, M.: Bi-\nnary {RDF} representation for publication and exchange (HDT). Web Semantics:\nScience, Services and Agents on the World Wide Web 19(0), 22–41 (2013)\n10. Fern´andez Garc´ıa, N., Arias Fisteus, J., S´anchez Fern´andez, L., Fuentes-Lorenzo,\nD., Corcho, O.: RDSZ : An approach for lossless RDF stream compression. In: In\n11th European Semantic Web Conference (ESWC 2014). pp. 1–16. Crete, Greece\n(2014)\n11. Le-phuoc, D., Nguyen, H., Quoc, M., Van, C.L., Hauswirth, M.: Elastic and Scal-\nable Processing of Linked Stream Data in the Cloud. In: Alani, H., Kagal, L.,\nFokoue, A., Groth, P., Biemann, C., Parreira, J.X., Aroyo, L., Noy, N., Welty, C.,\nJanowicz, K. (eds.) The Semantic Web\nISWC 2013, vol. 287305, pp. 280–297.\nSpringer Berlin Heidelberg (2013)\n12. Le-phuoc, D., Parreira, J.X., Hauswirth, M.: Linked Stream Data Processing. In:\nReasoning Web. Semantic Technologies for Advanced Query Answering, pp. 245–\n289. Springer Berlin Heidelberg (2012)\n",
  "speaker": "SYSTEM",
  "uuid": "f8df1edc-8ad0-458c-87ea-a637cdcb144d"
}