{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 10\n6   Guidelines to avoid Pitfalls \nWith the aim of developing ontologies without errors, it is important both (a) to \nprevent the appearance of pitfalls in ontologies and (b) to correct the ontologies \ncontaining such common anomalies, with the aim of improving their quality. In this \npaper we provide some guidelines for helping developers to model ontologies free of \npitfalls and to correct the ontologies that contain pitfalls. \nOur goal is to provide simple and direct guidelines that can be used both by \nontology experts and naïve ontology developers. Therefore, our proposal consists of \ndescribing each pitfall identified in our catalogue (Section 4) with the following \ninformation in the so-called pitfall description card. This card follows the template \nshown in Table 3 and includes: \n1. A description of the pitfall explaining possible inconveniences that it could entail \nand situations in which the pitfall could appear. This information appears in the \n“Description” slot. \n2. Some guidelines to avoid the pitfall appearance when modelling ontologies are \navailable in the “Recommendation” slot. \n3. Some preliminary guidelines to correct a pitfall once it have appeared can be \nfound in the “Example” slot, including its “Not recommended” and \n“Recommended” fields. \n4. Additional information could be found in the “Comments” slot if necessary. \nWe are now focused on the guidelines to avoid pitfalls, but we also provide some \npreliminary ideas on how to correct a particular pitfall once it has appeared in an \nontology. Due to the different nature of the pitfalls their corresponding preliminary \nguidelines provided can be described at different levels of granularity or abstraction.   \nTable 3. Pitfall description card template (based on [9]) \nName  \nName of the pitfall intended to avoid \nDescription \nThis field includes a general description of the pitfall. It can also include the possible inconveniences that \npitfall may imply and the different cases in which the pitfall can appear. \nRecommendation \nThis field provides some guidelines or recommendations to avoid the pitfall. \nExample \nThis field includes an example of the pitfall as well as some guides to correct it.  \nIn the “Not Recommended” field we can see a graphical representation of the example where the pitfall has \nbeen identified. \nIn the “Recommended” field we can see a possible design for the problem proposed in the example; such a \ndesign tries to avoid the pitfall. \nNot Recommended \nRecommended \nGraphic representation: ontology editor screenshots \nor UML diagrams. \nGraphic representation: ontology editor screenshots \nor UML diagrams. \nComments \nThis optional field includes possible comments on the pitfall or on the associate recommendation. \n",
  "speaker": "SYSTEM",
  "uuid": "f8eaf9a4-526c-4da6-9aac-4cafd3768569"
}