{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 70\n68\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nplace orders, and manage their projects via a SaaS offering. This is attractive for companies that have com‐\nplex translation needs that require the use of multiple agencies. Simpler marketplaces, such as ProZ and\nTranslator’s Cafe, enable users to request competitive quotes, but do not provide integrated project man‐\nagement tools.\nTranslators will often decide to work directly with their favourite clients. New tools make it easier for peo‐\nple who are not translation industry professionals to assume many project management tasks, and therefore\nto work directly with a hand‐picked crew of translators.\nLanguage service providers (translation agencies)\nLanguage service providers typically interact with the supply chain via more direct means, since they serve\nin an intermediary role for individual translators. They typically focus on direct sales, and to a lesser extent\nreach customers through translation marketplaces. \nOne of the services they provide is outbound sales and account management to larger corporate clients;\nsomething individual translators are not necessarily skilled at or financially equipped to do. \nThere are a significant number of translation agencies that work primarily as subcontractors for larger serv‐\nice providers. These typically focus on a small number of languages or specialize in specific sectors. They\nundertake the production, while the larger firms maintain the relationship with customers. \nTo a lesser extent, translation agencies will access customers through translation marketplaces like ProZ and\nCloudwords. The larger agencies generally don’t feel they need to participate in these communities, except\nto recruit translators, since they have well developed outbound sounds and account management capabili‐\nties. Small and mid‐sized agencies, which tend to specialize by language, services or domain of expertise, do\nactively participate in these.\nContent producers and publishers \nPublisher organisations, or content producers, are generally concerned with delivering translations once\ncompleted, and generate requests for translation for new content, whether it is a website article, travel list‐\ning or other item. They will typically use a content management system or e‐commerce platform that has\nbeen integrated with the translation supply chain to implement an automated or semi‐automated workflow. \nThere are many different types of publisher organisations, since anyone who produces content in print or\ndigital form can be considered a content producer. Different types of content producers will typically use dif‐\nferent types of content management and e‐commerce systems. For example, the online version of a news‐\nmagazine might use a content management system like Drupal to host its website, while a flight booking\nservice would use a completely different system.\nThese customers are typically looking to integrate their existing publishing and e‐commerce platforms with\ntranslation resources that automate the process of detecting new content, queuing it for translation, and\nthen storing/displaying the translated content when needed. Each type of content producer has different\nrequirement where translation is concerned. For example, an e‐commerce site may have tens of thousands\nof product listings that need to be translated and kept in sync, and may be concerned more with search\nengine visibility than the highest possible translation quality. A magazine publisher, on the other hand, will\nhave fewer but longer texts needing translation, and will be much more concerned with output quality.\nIn most of these cases, the customer’s primary concern is system integration between their content delivery\nplatform and their translation management system. \n",
  "speaker": "SYSTEM",
  "uuid": "f9248b73-33e7-4cb1-aaf5-8ecc79535515"
}