{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 110\nPage 110 of 111 \nNeOn Integrated Project EU-IST-027595 \n \n30. J. M. Gómez, C. Daviaud, B. Morera, R. Benjamins, T. Pariente Lobo, G. Herrero Cárcel, G. \nTort. NeOn Deliverable D8.1.1 Analysis of the Pharma Domain and Requirements. September \n2006. Available at: http://www.neon-project.org/. \n31. J. M. Gómez-Pérez, C. Buil-Aranda, T. Pariente, G. Herrero. NeOn Deliverable D8.3.1 \nOntologies for the Pharmaceutical Case Studies. 2007. \n32. A. Gómez-Pérez, M. Fernández-López, O. Corcho. Ontological Engineering. November 2003. \nSpringer Verlag. Advanced Information and Knowledge Processing series. ISBN 1-85233-551-\n3. \n33. A. Gómez-Pérez, M. D. Rojas-Amaya. Ontological Reengineering for Reuse. Knowledge \nAcquisition, Modeling and Management: 11th European Workshop, EKAW 1999. Dagstuhl \nCastle, Germany, May 1999. LNCS Volume 1621/1999. \n34. A. Gómez-Pérez, N. Juristo, C. Montes, J. Pazos. Ingeniería del Conocimiento. Editorial Centro \nde Estudios Ramón Areces, S.A. 1997. ISBN: 84-8004-269-9. \n35. P. Haase, S. Rudolph, Y. Wang, S. Brockmans, R. Palma, and J. Euzenat, M. d'Aquin. NeOn \nDeliverable D1.1.1 Networked Ontology Model. November 2006. Available at: http://www.neon-\nproject.org/. \n36. E. Herrera-Viedma, F. Mata, L. Martínez, L. G. Pérez. An Adaptive Module for the Consensus \nReaching Process in Group Decision Making Problems. V. Torra et al. (Eds.): MDAI 2005, \nLNAI 3558, pp. 89–98, 2005. Springer-Verlag Berlin Heidelberg 2005. \n37. M. Iglesias, C. Caracciolo, Y. Jaques, M. Sini, F. Calderini, J. Keizer, F. Le Hunte Ward, M. \nNissim, A. Gangemi. NeOn Deliverable D7.1.1 WP7 User Requirements. September 2006. \nAvailable at: http://www.neon-project.org/.   \n38. T. C. Jones. Reusability in programming: A survey of the state of the art. IEEE Transaction on \nSoftware Engineering. Vol. SE-IO, pp. 488-494, September 1984. \n39. N. Juristo, J. Pazos. Towards a joint life cycle for software and knowledge engineering. 1993. \nKnowledge Oriented Software Design (A-27). Ed. J. Cuena. Pages: 119-138. \n40. Y. Kalfoglou, M. Schorlemmer. Ontology mapping: the state of the art. The Knowledge \nEngineering Review. Volume 18, Issue 1 (January 2003). Pages: 1-31. 2003. ISSN:0269-8889. \n41. J. Kingston. Linking Knowledge Acquisition with CommonKADS Knowledge Representation. \nBCS SGES Expert Systems 1994 conference, St John's College, Cambridge, 12-14 December \n1994. \n42. K. Kotis, G. Vouros. The HCONE Approach to Ontology Merging. In: The Semantic Web: \nResearch and Applications. First European Semantic Web Symposium (ESWS 2004). Pp. 137-\n151. \n43. S.L. Landau. Dictionaries. The art and craft of lexicography, Cambridge: Cambridge University \nPress. 1984. \n44. B. Leuf, W. Cunningham. The Wiki Way. Addison-Wesley, 2001. \n45. A. Newell. The Knowledge Level. Artificial Intelligence 18(1):87–127. 1982. \n",
  "speaker": "SYSTEM",
  "uuid": "f934a7eb-7091-4642-b3e6-97e0dddc613a"
}