{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 24\nGu´ıa de orientaci´on para investigadores noveles\n24\n7.\nCaso de estudio: importancia de planiﬁcar una\ninvestigaci´on\nEn esta secci´on vamos a suponer una situaci´on ﬁcticia, pero que podr´ıa\nser real para ilustrar con un ejemplo lo que podr´ıa ser una carrera investi-\ngadora planiﬁcada y ver las diferencias respecto a otra no planiﬁcada.\nImaginemos dos personas, a las que nos referimos como persona A y per-\nsona B, que comienzan su carrera investigadora y a las que en un futuro les\ngustar´ıa formar parte del PDI de la Universidad. Tanto A como B acabaron\nlos estudios de Ingenier´ıa en Inform´atica, decidieron que quer´ıan seguir es-\ntudiando y optaron por matricularse en estudios de tercer ciclo (doctorado),\npero en diferentes departamentos, ya que sus gustos eran distintos. A “A”\nsiempre le hab´ıa gustado los temas de inform´atica m´as aplicados a los proce-\nsos industriales y puesto que vio que exist´ıa un programa de doctorado que\ninclu´ıa una l´ınea de investigaci´on en este campo, se matricul´o. “B” sin em-\nbargo, no sab´ıa por qu´e programa decidirse y tampoco ten´ıa ninguna l´ınea\nde investigaci´on que le apasionara. Por eso, tras ver los programas de doctor-\nado que ofrec´ıan los distintos departamentos de inform´atica, se decidi´o por\nel del Departamento Lenguajes y Sistemas Inform´aticos, que vio que ten´ıa\n“Menci´on de Calidad”. A “A” le gustaba mucho el tema que hab´ıa escogido\npara su investigaci´on y estaba muy contento. Decidi´o realizar el doctorado,\npero no se preocup´o en informarse sobre las becas que se conced´ıan desde\nlos distintos organismos p´ublicos, ni en lo que le pod´ıan ofrecer en su depar-\ntamento. “B” decidi´o informarse y desde el departamento le ofrecieron una\nbeca de ajudicaci´on directa de un a˜no de duraci´on y decidi´o aceptarla. Pero\nB sab´ıa por otros compa˜neros y amigos, que anualmente sol´ıan salir convo-\ncatorias para becas que ten´ıan m´as prestigio y de vez en cuando consultaba\nlas distintas p´aginas Web para estar al tanto y solicitarlas en cuanto salieran\nlas convocatorias correspondientes. Durante el primer a˜no, cada uno en sus\nrespectivos programas de doctorado, asisti´o a los distintos cursos y ambos\nlos aprobaron con buena nota. Pero adem´as, la investigaci´on que llevaba a\ncabo B estaba relacionada con una de las actividades planiﬁcadas para un\nproyecto nacional, en el ´area de las telecomunicaciones y la sociedad de la in-\nformaci´on, para el que su departamento hab´ıa conseguido ﬁnanciaci´on desde\nel Ministerio, y esto le permit´ıa colaborar con otros investigadores de su de-\npartamento. A punto de ﬁnalizar el primer curso y el a˜no de beca, le conceden\na B una beca de tipo FPU del Ministerio. Durante el segundo a˜no, B tiene la\nposibilidad de realizar una estancia en otro centro y decide irse tres meses a\nla Universidad de Oxford (Inglaterra) ya que hay un grupo de investigaci´on\nall´ı que est´a trabajando en lo mismo que B, y es una buena oportunidad para\nmejorar sus conocimientos y trabajar all´ı antes de presentar el DEA. Cuan-\ndo llega julio, tanto A como B presentan el DEA sin problemas. La estancia\n",
  "speaker": "SYSTEM",
  "uuid": "fa2a6773-2b47-4877-a93a-bc9dcf92b1dc"
}