{
  "message": "SYSTEM: Wiki: En las páginas\n[1]\ny\n[2]\nhay información sobre cómo llegar a la Facultad con distintos medios de transporte.\nAdemás, es útil mandar este enlace para aquéllos que vienen en Metro Ligero y se paran en Montepríncipe:\n[3]\nAquí mandamos un ejemplo de la información que se puede enviar a los partners de cualquier proyecto europeo, cuando se tiene que enviar información sobre cómo llegar a la facultad:\nUPM Computer Science School (ETSI Informáticos)\nETSI Informáticos (UPM)\nCampus de Montegancedo \n28660 Boadilla del Monte (Madrid) Spain\nThe meeting room will be at XXXXXX. Anyway, we normally put signs around the school to indicate you the way to get to the room.\nDetails about how to access the campus from Madrid’s city centre are provided\nhere\n.\nMaps and Directions:\nUPM CS School:\nhttp://www.fi.upm.es/docs/campus/como_llegar/img/166_accesoCampusMontegancedoUPM.jpg\nRecommended hotels\n\nPlease pay attention to the recommendations that we are making for hotels, as our school is located in the outskirts of Madrid, what means that a bad decision for the selection of the hotel may mean more than one-hour travel time to our meeting place.\nClose to the school and not too far from the city (4-5 tram stops away + 10 minutes walking), and only chain restaurants around: i-Hotel (\nhttp://www.eurostarsihotel.com/\n) and NH Ciudad de la Imagen (\nhttp://www.nh-hoteles.es/nh/es/hoteles/espana/madrid/nh-ciudad-de-la-imagen.html\n)\nClose to the school (2 tram stops away + 10 minutes walking) but far from the city and no restaurants around: H2 Boadilla (\nhttp://www.hoteles2.com/h2-boadilla.html\n), Hostería La Cabaña (\nhttps://goo.gl/maps/SFnYZGFfBs82\n)\nClose to the school (6 tram stops away + 10 minutes walking), in Boadilla, a very nice hotel and probably expensive: El Convento de Boadilla (\nhttp://elconvento.net/\n)\nIf you want to be in the city center, hotels in the area of Príncipe Pío or Plaza España (metro line 10 to Colonia Jardín) or in Atocha (Cercanías line C-5 to Aluche) may be also a good alternative, since transportation is not too hard from there.",
  "speaker": "SYSTEM",
  "uuid": "faa1f88f-0dd3-4134-9f3e-beecbf7cd706"
}