{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 7\nPREFIX\nf i r e : <http ://www. semsorgrid4env . eu#>\nPREFIX\nr d f : <http ://www. w3 . org /1999/02/22−rdf−syntax−ns#>\nSELECT RSTREAM ?WindSpeedAvg\nFROM STREAM <www. semsorgrid4env . eu/ SensorReadings . s r d f > [FROM NOW −10\nMINUTES TO NOW STEP 1 MINUTE]\nFROM STREAM <www. semsorgrid4env . eu/ SensorArchiveReadings . s r d f > [FROM NOW −3\nHOURS TO NOW −2 HOURS STEP 1 MINUTE]\nWHERE {\n{\nSELECT AVG(? speed ) AS ?WindSpeedAvg\nWHERE\n{\nGRAPH <www. semsorgrid4env . eu/ SensorReadings . s r d f > {\n?WindSpeed a\nf i r e : WindSpeedMeasurement ;\nf i r e : hasSpeed\n? speed ;\n}\n} GROUP BY ?WindSpeed\n}\n{\nSELECT AVG(? archivedSpeed ) AS ? WindSpeedHistoryAvg\nWHERE\n{\nGRAPH <www. semsorgrid4env . eu/ SensorArchiveReadings . s r d f >\n{\n? ArchWindSpeed a\nf i r e : WindSpeedMeasurement ;\nf i r e : hasSpeed\n? archivedSpeed ;\n}\n} GROUP BY ? ArchWindSpeed\n}\nFILTER (? WindSpeedAvg > ? WindSpeedHistoryAvg )\n}\nListing 1. An example sparqlStream query which every minute computes the\naverage wind speed measurement for each sensor over the last 10 minutes if it is\nhigher than the average of the last 2 to 3 hours.\n4.2\nS2O: Expressing Stream-to-Ontology Mappings\nThe mapping document that describes how to transform the data source elements\nto ontology elements is written in the S2O mapping language, an extended ver-\nsion of R2O [1]. An R2O mapping document includes a section that describes\nthe database relations, dbscehma-desc. In order to support data streams, R2O\nhas been extended to also describe the data stream schema. A new component\ncalled streamschema-desc has been created, as shown in the top part of Listing 2.\nThe description of the stream is similar to a relation. An additional attribute\nstreamType has been added, it denotes the kind of stream in terms of data\nacquisition, i.e. pushed or pulled. In the same way as key and non-key attributes\nare deﬁned, a new timestamp-desc element has been added to provide support for\ndeclaring the stream timestamp attribute. Since S2O extends R2O, relations can\nalso be speciﬁed using the existing R2O mechanism. For the class and property\nmappings, the existing R2O deﬁnitions can be used for stream schemas just as\nit was for relational schemas. This is speciﬁed in the conceptmap-def element as\nshown in the bottom part of Listing 2.\nIn addition, although they are not explicitly mapped, the timestamp attribute\nof stream tuples could be used in some of the mapping deﬁnitions, for instance in\nthe uri construction (uri-as element). Finally, a sparqlStream streaming query\nrequires an rdf stream to have an iri identiﬁer. S2O creates a virtual rdf stream\n7\n",
  "speaker": "SYSTEM",
  "uuid": "fad1c267-3ede-401a-a1d7-c52fa7713a10"
}