{
  "message": "SYSTEM: Wiki: Cenit Social Cloud\n\nEstados de la cuestión\nAcceso semántico a bases de datos heterogéneas (Boris). Describe las tecnologías para acceder semánticamente a BBDD (Obsever, D2R, R20, etc.).\nAcceso semántico a bases de datos - Version 1.0\nEstudio de especificaciones de modelado ontológico y diseño de la ontología de modelado base del sistema (Carmen y María Poveda puede ayudar). Referencias a las princiaples metodologías con especial énfasis en las especificaciones, patrones de diseño y actividades de reingenería.\nMetodologías de desarrollo de ontologías\nEstudio de sistemas de\nmappings\ny mezcla de ontologias (Jorge)\n[1]\n.\nAnálisis de técnicas de población automática de ontologías (Raul Garcia, Boris, Andrés). Creo que en Plata o en algún proyecto, alguno de vosotros hizo este estado de la cuestión. Es importante que metáis los enfoques de\npopulation\ny también que analicéis como el OLD se puede utilizar para poblar ontologias. Poneos de acuerdo entre los tres.\nPoblación de ontologías - Version 1.1\nAnálisis de técnicas de actualización automática de las semánticas de modelado (Raúl Garcia, Boris, Andrés). Tengo un artículo con David Manzano que trata el tema de\nOntology Learning\n. Poneos de acuerdo entre los tres.\nSoA Aprendizaje de Ontologías (V1.0)\nAnálisis de herramientas para el desarrollo de la ontología (María Poveda). Incluid por favor Topbraid, Protege y NeOnTK, y poner páginas web donde se vean. Especial mención a los muchos\nplugins\ndel NeOnTK (enumerar para qué sirve).\nHerramientas para el desarrollo de ontologías\nCapacidad Investigadora\nDescripción general del Grupo y de sus objetivos\n[2]\n.\nLíneas de investigación que se desarrollan\n[3]\n.\nProyectos de I+D+i del Grupo\n[4]\n.\nInfraestructura y recursos  (Alcázar, hay info en su solicitud de Técnico de Apoyo).\n2  portatiles para el grupo\n12 portatiles personales asignados\n29 PCs sobremesa de usuarios\n11 PCs con función de servidor (asignados a proyectos). La mayoria tienen un webserver, base de datos Oracle con OdeSew, almacenamiento local y servicios asociados. \n4  servidores virtualizados\nServidor de grupo con correo, subversion, mysql, mediawiki, paginas personales, FTP...\n5  servidores (reales). 2 de ellos en cluster y el resto asignados a proyectos\n1  NAS con capacidad de 1.6 TB\nAmpliaciones a corto plazo:\n- Aumentar la capacidad de almacenamiento para proyectos y usuarios (estimacion de 3 a 6 TB)\n- Infraestructura de benchmarking para proyecto Seals\nColaboración con otros Grupos de Investigación (José Ángel).\nAlemania\nDFKI\nUniv. of Augsburg\nUniv. of Karlsruhe\nUniv. of Koblenz\nUniv. of Hannover\nUniv. of Mannheim\nUniv. of Bielefeld\nForschungszentrum Informatik\nAustria\nUniv. of  Wien\nUniv. of NR & ALS\nUniv. of Innsbruck\nBélgica\nFree Univ. of Brussels\nBulgaria\nAcademy of Sciences\nFrancia\nINRIA\nGrecia\nUniv. of Athens\nTUC\nEslovaquia\nÚstav Informatiky\nHolanda\nUniv. of Amsterdam\nFree Univ. of Amsterdam\nIrlanda\nUniv. of  Galway\nItalia\nCNR\nUniv. of Trento\nUniv. of Bolzano\nReino Unido\nOpen University\nOxford University\nUniv. of Manchester\nUniv. of Liverpool\nUniv. of Sheffield\nUniv. of Aberdeen\nUniv. of Edinburgh\nUniv. of Southampton\nUniv. of Hull\nSuiza\nUniv. of Zurich\nNo europeos\nStanford University\nUniv. of Tel Aviv\nUniv. of Brasilia\nPublicaciones (ya veremos).",
  "speaker": "SYSTEM",
  "uuid": "fb17aa23-94e0-4520-8695-dc02bb8cd365"
}