{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 35\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 35 de 42 \n1. Aguado de Cea, Guadalupe, Montiel-Ponsoda, Elena, Kernerman, Ilan, Ordan, Noam. \nFrom dictionaries to cros-lingual lexical resources. KD Newsletter. pp 25-31. July 2016. \n2. Aguado de Cea, Guadalupe, Montiel-Ponsoda, Elena, Kernerman, Ilan, Ordan, Noam, \nBosque, Julia, Gracia, Jorge. From Dictionaries to Cros-lingual Lexical Resources: a \nNew Paradigm for Old Needs. MetaForum 2016. Poster presentation \n3. Aguado de Cea, Guadalupe, Montiel-Ponsoda, Elena, Kernerman, Ilan, Ordan, Noam. \nFrom Dictionaries to Cros-lingual Lexical Resources. Presentation at MetaForum 2016. \n4. Alves Dures D; Davide Carneiro; Javier Bajo Perez; Paulo Novais. Supervising and \nImproving Attentiveness in Human Computer Interaction. \"Intelligent Environments \n2016. Ambient Intelligence and Smart Environments series Vol. 21, pp. 255-264.\".pp. \n255 - 264. ISBN 978-1-61499-689-7. Septiembre 2016. \n5. Alves Dures D; Javier Bajo Perez; Amparo Jimenez; Paulo Novais. \"Methodologies and \nIntelligent Systems for Technology Enhanced Learning. Advances in Intelligent Systems \nand Computing Vol. 478, pp 33 - 40. ISSN: 2194-5357.\".pp. 33 - 40. ISBN 978-3-319-\n40164-5. Junio 2016. \n6. Alves Dures D; Javier Bajo Perez; Davide Carneiro; Paulo Novais. Using Computer \nPeripheral Devices to Measure Attentiveness. \"Trends in Practical Applications of \nScalable Multi-Agent Systems, the PAAMS Collection. Advances in Intelligent Systems \nand Computing Vol. 473, pp 147 - 155. ISSN: 2194-5357.\".pp. 147 - 155. ISBN 978-3-\n319-40158-4. Junio 2016. \n7. Bajo J; tiancheng li; juan m. corchado; shudong sun; juan f. de paz. Effectiveness of \nBayesian filters: An information fusion perspective. INFORMATION SCIENCES. 329 - \nnull, pp. 670 - 689. 2016. ISSN 0020-0255 \n8. Bajo J; juan f. de paz; sara rodriguez; gabriel villarrubia; juan m. corchado. Intelligent \nsystem for lighting control in smart cities. INFORMATION SCIENCES. 372 - null, pp. \n241 - 255. 2016. ISSN 0020-0255 \n9. Bajo J; andrew t. campbell; sigeru omatu; andre c. p. l. f. carvalho; juan m. corchado. \nMobile sensing and social computing. INTERNATIONAL JOURNAL OF DISTRIBUTED \nSENSOR NETWORKS. 12 - 8, pp. 0 - 2. 2016. ISSN 1550-1329 \n10. Bajo J; amparo jimenez; dalila duraes; paulo novais. Monitoring Level Attention \nApproach in Learning Activities. METHODOLOGIES AND INTELLIGENT SYSTEMS \nFOR TECHNOLOGY ENHANCED LEARNING (MIS4TEL). 478 - null, pp. 33 - 40. 2016. \nISSN 2194-5357 \n11. Bajo J; gaetano c. la delfa; salvatore monteleone; vincenzo catania; juan f. de paz. \nPerformance analysis of visualmarkers for indoor navigation systems. FRONTIERS OF \nINFORMATION TECHNOLOGY & ELECTRONIC ENGINEERING. 17 - 8, pp. 730 - \n740. 2016. ISSN 2095-9184 \n12. Bajo J; pablo chamoso; juan f. de paz; gabriel villarrubia; juan manuel corchado. \nPredictive Analysis Tool for Energy Distribution Networks. ADVANCES IN ARTIFICIAL \nINTELLIGENCE, CAEPIA 2016. 9868 - null, pp. 271 - 279. 2016. ISSN 0302-9743 \n13. Bajo J; livia campo; ignacio j. aliaga; juan f. de paz; alvaro enrique garcia; gabriel \nvillarubia; juan m. corchado. Retreatment Predictions in Odontology by means of CBR \nSystems. COMPUTATIONAL INTELLIGENCE AND NEUROSCIENCE. pp. 0 - 11. \n2016. ISSN 1687-5265 \n14. Bajo J; pablo chamoso; juan f. de paz; sara rodriguez. Smart Cities Simulation \nEnvironment for Intelligent Algorithms Evaluation. AMBIENT INTELLIGENCE - \nSOFTWARE AND APPLICATIONS (ISAMI 2016). 476 - null, pp. 177 - 187. 2016. ISSN \n2194-5357 \n15. Bajo J; juan m. corchado; li weigang; fei wu; tian-cheng li. Special issue on distributed \ncomputing and artificial intelligence. FRONTIERS OF INFORMATION TECHNOLOGY \n& ELECTRONIC ENGINEERING. 17 - 4, pp. 281 - 282. 2016. ISSN 2095-9184 \n16. Bajo J; juan m. corchado. Special issue on distributed computing and artificial \nintelligence systems. NEUROCOMPUTING. 172 - null, pp. 382 - 384. 2016. ISSN 0925-\n2312 \n17. Bajo J; j. a. rincon; a. fernandez; v. julian; c. carrascosa. Using emotions for the \ndevelopment \nof \nhuman-agent \nsocieties. \nFRONTIERS \nOF \nINFORMATION \nTECHNOLOGY & ELECTRONIC ENGINEERING. 17 - 4, pp. 325 - 337. 2016. ISSN \n2095-9184 \n",
  "speaker": "SYSTEM",
  "uuid": "fb1adee1-814a-4664-917b-8ebb7adce87b"
}