{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/CFP_Semantics_Web_Dynamics \n\n============================\n\nPRELIMINARY CALL FOR PAPERS\nJournal of Web Semantics\nSpecial Issue on Semantic Web Dynamics\n============================\n\nDescription\nRecent years have witnessed the arrival of more and more semantically annotated data and related ontologies in the Semantic Web. For example, the linked data initiative has been very successful in making datasets available online, with a total of about 5 billion triples all together so far. While existing semantic tools and reasoning engines are year after year getting better in dealing with time invariant domain of ontological knowledge, supporting rapidly changing information has not yet attracted sufficient attention.\nThere are more and more heterogeneous and/or dynamic data types being created and which integration could lead to interesting applications and models (e.g. sensor data streams, geospatial information and imagery, financial transactions, news feeds, 3D models, engineering data, information for policy intelligence etc.). Current Stream Database Management Systems provide on the fly analysis of data streams, but they suffer several limitations: they cannot handle heterogeneous data streams originating from a variety of already deployed sensors; they cannot combine data streams with slowly evolving knowledge at query time; and they cannot perform reasoning tasks. And in the area of reasoning, while the problem of classical, time invariant domain of ontological knowledge has been extensively studied, the task of reasoning with rapidly changing information has been mostly neglected and constitutes a new challenge.\nFurthermore, ontologies, just like any structure holding knowledge and information, need to be updated too: changes could be initiated because of a change in the world being modeled; or by a change in the users? needs which would require a different conceptualization; or by the acquisition of knowledge previously unknown, unclassified or otherwise unavailable; or by the noticing of a design flaw in the original conceptualization. In all these cases, the representation of knowledge in the ontology should be modified so as to form a more accurate or adequate conceptualization of the domain.\nThis general issue of Semantic Web Dynamics includes difficulties from both practical and theoretical points of view, raising a variety of research questions and development challenges, such as how to support the ontology and data publishers in maintaining up-to-date, adequate representations; how to detect the need for evolution and changes; how to facilitate the integration of new, dynamic sources in existing datasets and ontologies; how to validate and evaluate the impact of the changes on semantic information; how to handle changes triggered from multiple sources and collaborative updates; and how to keep track of (possibly\nconcurrent) versions of and ensure the delivery of up-to-date and valid knowledge.\nTopics of Interest\nFor this special issue, we seek articles describing foundational and theoretical work as well as technological solutions to these challenges.\nMore specifically, we expect submission on (but not restricted to) the following topics:\n?\tFoundational and formal aspects of Semantic Web dynamics\n?\tLanguage extensions for Semantic Web dynamics\n?\tReasoning with dynamic data and ontologies\n?\tEngineering dynamic data and ontologies\n?\tRequirements and practical issues for Semantic Web dynamics\n?\tApplications of dynamic data and ontologies\n?\tTheory for stream reasoning\n?\tLogic language for stream reasoning\n?\tScalability issues in stream reasoning\n?\tOntologies for dynamic environments\n?\tDynamic knowledge building, and (re-)use\n?\tOntology evolution and versioning\n?\tLanguage extensions for evolution\n?\tBelief revision for ontologies\n?\tChange propagation in ontologies dynamic datasets and ontologies\n?\tInconsistency in evolving semantic information\n?\tIncremental  reasoning\n?\tCase studies and applications of ontology and knowledge evolution\n?\tTools to support dynamic data and ontologies\nImportant Dates\n31 May 2010: \t   Submission deadline\n31 August 2010:\t   First-round reviews complete\n31 October 2010:   Revised papers submitted\n23 December 2010:  Final acceptance decisions\nMethod of Submission\nOnly electronic submissions will be considered. The precise method will be announced later. Any question can be addressed to the guest editors.\nGuest Editors\nGrigoris Antoniou (FORTH, Greece)\nMathieu d?Aquin (The Open University, United Kingdom) Jeff Z. Pan (University of Aberdeen, United Kingdom)\nNeon-All mailing list\nNeon-All@lists.neon-project.org\nhttp://lists.neon-project.org/listinfo.cgi/neon-all-neon-project.org",
  "speaker": "SYSTEM",
  "uuid": "fb22ccbb-7734-45d3-9648-b0ac96ff8c02"
}