{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 97\nMINISTERIO DE SANIDAD Y CONSUMO\n103\n91.- Catálogo de pruebas de los laboratorios clínicos. M. de Sanidad y Consumo\nDirección Web: http://www.ingesa.msc.es/estadEstudios/documPublica/memorias/\nlaboratorios.htm\nOrganismo editor: Instituto Nacional de Gestión Sanitaria.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nMateria: Sanidad.\nDescripción y comentarios: Manual para catalogar las pruebas que se hacen en los labora-\ntorios. Es necesario descargar la base de datos para poder ejecutarla, de modo que no es una\nbase de datos en línea en sentido estricto, ya que se ejecuta la base desde una ventana del\nordenador. Al final de la página Web se accede en línea a la estructura de la base de datos;\nuna vez descargada y ejecutada se accede al catálogo de pruebas y a distintos listados.\n92.- Base de datos de Información sobre Consumo del Centro de Información\ny Documentación al Consumo (CIDOC)\nDirección Web: http://aplicaciones.consumo-inc.es/cidoc/Consultas/Consulta_Documental/\nbusquedaBD.aspx\nWeb adicional: http://aplicaciones.consumo-inc.es/cidoc/Consultas/Consulta_Documental\n/busquedaBD.aspx\nOrganismo editor: Instituto Nacional del Consumo (INC).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Consumo.\nDescripción y comentarios: Bibliografía, legislación, jurisprudencia, asociaciones. La\nbase de datos de información sobre Consumo agrupa dos bloques temáticos: uno jurídico,\nque engloba tanto legislación como la jurisprudencia sobre consumo, y otro de carácter\nbibliográfico, en el que están incluidas monografías, artículos y la relación de revistas que\nse reciben en el CIDOC. Asimismo incorpora una herramienta denominada Catálogo de\nfuentes de información estadísticas y cualitativas sobre consumo, que sistematiza la bús-\nqueda de bases de datos sobre estudios, tanto públicos como privados, nacionales e inter-\nnacionales. El usuario puede acceder a esta información haciendo una selección por cam-\npos en cada una de las bases de datos, o bien mediante la búsqueda por tesauro que orienta\nal usuario en la elección del término adecuado para consultar los documentos. La Base de\nDatos de Información sobre Consumo incluye un directorio de organizaciones de consu-\nmo españolas y extranjeras, cuya búsqueda puede realizarse tanto por campos como\nmediante la navegación por mapas.\nBASES DE DATOS  1/1/04  03:39  Página 103\n",
  "speaker": "SYSTEM",
  "uuid": "fbba9419-7697-44a3-89ea-47665a25700e"
}