{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 14\ngreat research. So I'll give you two answers. You read; but it is not the amount, it is the way you read that\n\u0017\ncounts.\n\u0007\nQuestion: How do you get your name attached to things?\nHamming:\n2\n By doing great work. I'll tell you the hamming window one. I had given Tukey a hard time,\nquite a few times, and I got a phone call from him from Princeton to me at Murray Hill. I knew that he was\n\u0010\nwriting up power spectra and he asked me if I would mind if he called a certain window a ``Hamming\n\nwindow.'' And I said to him, ``Come on, John; you know perfectly well I did only a small part of the work\n\nbut you also did a lot.'' He said, ``Yes, Hamming, but you contributed a lot of small things; you're entitled\n\u001d\nto some credit.'' So he called it the hamming window. Now, let me go on. I had twitted John frequently\n\f\nabout true greatness. I said true greatness is when your name is like ampere, watt, and fourier - when it's\n\t\nspelled with a lower case letter. That's how the hamming window came about.\n\u0006\nQuestion: Dick, would you care to comment on the relative effectiveness between giving talks, writing\npapers, and writing books?\n\u000f\nHamming: In the short-haul, papers are very important if you want to stimulate someone tomorrow. If you\nwant to get recognition long-haul, it seems to me writing books is more contribution because most of us\n\nneed orientation. In this day of practically infinite knowledge, we need orientation to find our way. Let me\n&\ntell you what infinite knowledge is. Since from the time of Newton to now, we have come close to doubling\n\f\nknowledge every 17 years, more or less. And we cope with that, essentially, by specialization. In the next\n,\n340 years at that rate, there will be 20 doublings, i.e. a million, and there will be a million fields of\n3\nspecialty for every one field now. It isn't going to happen. The present growth of knowledge will choke\n\u0006\nitself off until we get different tools. I believe that books which try to digest, coordinate, get rid of the\nduplication, get rid of the less fruitful methods and present the underlying ideas clearly of what we know\n \nnow, will be the things the future generations will value. Public talks are necessary; private talks are\n&\nnecessary; written papers are necessary. But I am inclined to believe that, in the long-haul, books which\nleave out what's not essential are more important than books which tell you everything because you don't\nwant to know everything. I don't want to know that much about penguins is the usual reply. You just want\n\nto know the essence.\n\f\nQuestion: You mentioned the problem of the Nobel Prize and the subsequent notoriety of what was done to\nsome of the careers. Isn't that kind of a much more broad problem of fame? What can one do?\n\u0006\nHamming:\n2\n Some things you could do are the following. Somewhere around every seven years make a\nsignificant, if not complete, shift in your field. Thus, I shifted from numerical analysis, to hardware, to\n\u0006\nsoftware, and so on, periodically, because you tend to use up your ideas. When you go to a new field, you\n\u0006\nhave to start over as a baby. You are no longer the big mukity muk and you can start back there and you\ncan start planting those acorns which will become the giant oaks. Shannon, I believe, ruined himself. In fact\n\u0007\nwhen he left Bell Labs, I said, ``That's the end of Shannon's scientific career.'' I received a lot of flak from\n\nmy friends who said that Shannon was just as smart as ever. I said, ``Yes, he'll be just as smart, but that's\nthe end of his scientific career,'' and I truly believe it was.\n\f\nYou have to change. You get tired after a while; you use up your originality in one field. You need to get\nsomething nearby. I'm not saying that you shift from music to theoretical physics to English literature; I\n\u0006\nmean within your field you should shift areas so that you don't go stale. You couldn't get away with forcing\n\u0014\na change every seven years, but if you could, I would require a condition for doing research, being that you\n\t\nwill\n4\n change your field of research every seven years with a reasonable definition of what it means, or at the\nend of 10 years, management has the right to compel you to change. I would insist on a change because I'm\n\b\nserious. What happens to the old fellows is that they get a technique going; they keep on using it. They\n\u0006\nwere marching in that direction which was right then, but the world changes. There's the new direction; but\n\nthe old fellows are still marching in their former direction.\n\f\nYou need to get into a new field to get new viewpoints, and \n5\nbefore\n6\n you use up all the old ones. You can do\nsomething about this, but it takes effort and energy. It takes courage to say, ``Yes, I will give up my great\n\u0006\nreputation.'' For example, when error correcting codes were well launched, having these theories, I said,\n``Hamming, you are going to quit reading papers in the field; you are going to ignore it completely; you are\ngoing to try and do something else other than coast on that.'' I deliberately refused to go on in that field. I\n\u0017\nwouldn't even read papers to try to force myself to have a chance to do something else. I managed myself,\n\n",
  "speaker": "SYSTEM",
  "uuid": "fbd47d9c-2b88-46d8-8f5b-2991e6b61f18"
}