{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 12\n \n \n12\n    UNIVERSIDAD POLITÉCNICA DE MADRID \nc) \nFotocopia del Documento Nacional de Identidad (DNI), Tarjeta de Identidad de \nExtranjero (NIE) o del pasaporte del solicitante. \nd) \nFotocopia de la certificación académica detallada en la que figuren todas las \ncalificaciones académicas obtenidas por el solicitante y las fechas de su \nobtención, así como la explícita constancia de la nota media del expediente. \nEn caso de existir en el expediente asignaturas convalidadas, en las que no se \nespecifique calificación, se aportará certificado oficial de la nota obtenida en la \nasignatura de referencia. En ausencia de ésta se computará como aprobado. \ne) \nLos solicitantes que hayan cursado los estudios en el extranjero y/o posean \ncertificación académica extendida en un idioma distinto del español habrán de \nacompañarla de la correspondiente traducción jurada.  En tales casos, la \ncertificación indicará,  así  mismo,  cuales  son  las  calificaciones  máxima  y \nmínima dentro del sistema de evaluación correspondiente; del mismo modo, se \nhará constar cual es la calificación mínima necesaria para aprobar. \nf) \nAceptación del Director del Departamento, Instituto Universitario y/o Centro de \ninvestigación, en el que va a desarrollar su actividad y al que esté adscrito el \ngrupo de investigación, en el que conste de forma explícita el apoyo necesario \npara el desarrollo de la beca. \ng) \nFotocopia  del título o de la certificación de tener abonados los precios públicos \npara la expedición del título de Licenciado, Ingeniero o Arquitecto. No es \nnecesario en el caso de haber desarrollado su formación en la Universidad \nPolitécnica de Madrid. \nh) \nAcreditación, en su caso, del Suplemento Europeo al título \ni) \nFotocopia de la Resolución de homologación del título o documento acreditativo \nde admisión en los cursos de doctorado de esta Universidad, en el caso de \nestudios o títulos realizados u obtenidos en el extranjero. \nj) \nAcreditación de la matrícula en los estudios de Máster y/o de doctorado curso \n2009/10. \nk) \nAcreditación, en su caso, de las situaciones contempladas en el artículo 2.1. \npunto 3.  \n \nDECIMOCUARTO.-  SELECCIÓN DE CANDIDATOS \n \n14.1. El Vicerrectorado de Investigación de la Universidad Politécnica de Madrid, tras recibir \nel asesoramiento de la Comisión de Investigación, así como del Vicerrectorado de \nRelaciones Internacionales para los candidatos a las ayudas de temática relacionada \ncon la investigación en cooperación, seleccionará para proponer al Rector  un \ncandidato por cada una de las áreas temáticas de la UPM, que cuente con un \nexpediente académico con una nota media igual o superior a 2 o 7,5; valorándose la \nmemoria de investigación en relación con el tema propuesto, con los proyectos de \ninvestigación, y productividad investigadora del Director y del grupo de investigación. \nPara las ayudas para becas indicadas en el artículo 6.1. b) se valorará especialmente \nel informe del Director respecto de la actividad de investigación en cooperación del \nsolicitante. A estos efectos, el Vicerrectorado de Investigación podrá exigir la \ndocumentación complementaria que estime precisa. \n",
  "speaker": "SYSTEM",
  "uuid": "fc730453-92fb-41e7-91a8-b352912c0eaf"
}