{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 9\n7\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nIn 2012, 1.5 million mobile apps will be available, over 15 times the number of PC apps. Amazon’s Kindle Fire\nwill gain a nearly 20% share of media tablets, and the number of Android apps will finally exceed those for\nApple’s iOS. The iPad will still dominate (62% share), but serious branded competition is arriving. This is a\ntest of the power of «open» versus «closed» environments, still a close call in 2012. Open platforms for LT-\nenabling could help shift the power dynamics in this market.\n85 billion mobile apps will be downloaded in 2012, an increase of 122%; the 8% of mobile apps that are paid\nfor will generate more revenue than mainframes. Competition between today’s mobile app platforms and\nstores can be disrupted, as 15% of new mobile apps launched in 2015 will be based on HTML5 and develop‐\ners try to bypass native OS fragmentation and distribution handcuffs. New open paradigms, language-neutral\ndevelopment platforms and multilingual development resources could foster disruption, particularly in Europe.\nIn the next five years…\nThe hallmarks of next‐generation ICT will be mobile connectivity and service unification across devices and\nplatforms, with features common to both business and consumer users. Unified Communication will enable\nusers to experience the social, communicative features of ICT through integrated messaging, conferencing,\ncollaborating, content‐ and data‐sharing based on “presence” information, intelligent applications, transla‐\ntion systems and speech technology. Unified Communication is cross-platform, multi-modal and multilingual.\nUnified Information Access will remove barriers to the access, use and understanding of information using\nhighly scalable platforms that integrate large volumes of unstructured, semi‐structured, and structured infor‐\nmation into a unified environment for processing, analysis and decision‐making. Unified Information Access\nwill be built on hybrid architectures that combine database, search, reporting, visualisation and translation\ntechnologies. Intelligent multilingual tools support Unified Information Access in any language, and across lan-\nguages. \nStandardised user interfaces will give way to a Unified User Experience that is customised, personalised, and\n“contextual”; online and offline experiences will converge through the use of mobile, Internet of things, Near\nField Communications, social and hyper‐connectivity, and ubiquitous connection to social networks, using\nsocial browsers or navigating from within applications. Intelligent personal assistants, with naturalistic voic‐\nes and able to speak many languages, will mediate between users and their devices and data. The Unified\nUser Experience is based on natural and convenient interaction with machines and processes, in any language.\n1.2 A Mobile/Social/Global Ecosystem\nThe robustness of the mobile market is driving the evolution of the new ecosystem. The always‐on internet\nconnection in consumers’ pockets has spurred enormous growth in web usage, changed the way people\nshop, and vastly increased content consumption. Mobility is driving applications software and data into the\nCloud, reducing location dependency, increasing the need for “presence” data (who is where, doing what, in\nwhat context).\nSocial media represents a paradigm shift with enormous consequences for all types of businesses and organ‐\nisations, and especially for consumer‐facing companies whose systems are shifting from channelled experi‐\nences and brand‐controlled messages to empowered consumers in a channel‐agnostic marketplace. This is\nwhat Geoffrey Moore calls the move from “systems of record” to “systems of engagement”, another way to\ndescribe the transition from information‐centric to interaction‐centric ICT. While this is most visible in the\nconsumer space, exactly the same tendencies are transforming internal business functions, sometimes\ncalled the “consumerisation” of the Enterprise.\nConsumers who used to browse portals or interact with the Web using search (e.g. from Yahoo to Google)\nnow engage via social media; the time spent online using search is hardly growing at all, while time spent on\nsocial networks increased 50% in 2011 (moving from Google to Facebook…or to Google+). For many users,\n",
  "speaker": "SYSTEM",
  "uuid": "fcbfba12-966b-4da8-ba70-574864343a87"
}