{
  "message": "SYSTEM: PosterSem4Tags.pdf: Página 1\nAndrés García-Silva, Jorge Gracia, and Oscar Corcho, \n{hgarcia,jgracia,ocorcho@fi.upm.es} \nUniversidad Politécnica de Madrid, Spain\nGeobuddies project\nWay of St. James\nAbstract: Tagging systems are nowadays a common feature in web sites where user-generated content plays an important role. However,\nthe lack of semantics and multilinguality hamper information retrieval process based on folksonomies. In this paper we propose an approach\nto bring semantics to multilingual folksonomies. This approach includes a sense disambiguation activity and takes advantage from knowledge\ngenerated by the masses in the form of articles, redirection and disambiguation links, and translations in Wikipedia. We use Dbpedia as\nsemantic resource to define the tag meanings.\n710.659 results\n8.661.581 Results\nSystems ignore resources tagged with morphological variations or \nsynonyms of that tag, as well as the resources tagged with more generic \nor more specific tags\nTagging systems are not aware of:\nWhen searching with polysemous tags, all the resources tagged with \nthat tag are retrieved without taking into account the tag sense the user \nwas looking for (e.g bank retrieves financial institutions and river edges)\n1) possibly related tags due to relations such as synonyms,   \nbroader-than, narrower-than, and spelling variation,\n2) the use of ambiguous tags.\nBank\nCelebration\nParty\nMultilingual Sense Repository\nNormalized versions of the tags are related to the  set of \nopossible meanings defined by DBpedia resources\n1) Article URLs as sense identiers, and article words \nalong with their frequency as keywords associated \nwith the sense \n2) Articles listed in disambiguation pages as possible \nsenses for ambiguous words,\n3) Explicit translations among articles to link senses \nin languages diferent from English to English senses\n4) DBpedia resources to define formally each sense.\nA process for the Association of Semantics to tags\nExperimental results\nVector space model to represent the senses and the tag context.\nThe vector components are the set of most frequent terms appearing in the \nWikipedia pages related to the candidate senses.  \nIn the case of the sense vectors the values of these components are \ncalculated using TF-IDF.\nIn the case of the tag context vector the values of these components are 1 \nor \n0 whether the corresponding term appears in the tag context or not. \nWe compare the tag context vector against each sense vector using the \ncosine.\nTest data: 759 photos annotated with 12.4 tags in avarage\nBaseline: English and Spanish URI to find Dbpedia resources\nhttp://en.wikipedia.org/wiki/tag \nhttp://es.wikipedia.org/wiki/tag\nCoverage\nApproach\\Language\nEnglish\nSpanish\nBaseline\n51%\n32%\nSem4Tags\n83%\n89%\nAccuracy\nApproach\\Language\nEnglish\nSpanish\nBaseline\n79%\n79%\nSem4Tags\n81%\n80%\nSem4Tags & Active Context\n86%\n85%\n",
  "speaker": "SYSTEM",
  "uuid": "fce6c35f-c136-410b-b54f-f7b144537136"
}