{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/DOCOMO2010 \n\nDOCOMO Communications Laboratories Europe GmbH (DOCOMO Euro-Labs)\nbelongs to the Japanese premier mobile operator, NTT DOCOMO. The\nEuropean research subsidiary is researching on future\ntelecommunication systems and platforms with the support of highly\nmotivated and qualified researchers from different technical domains\nwithin a multicultural working environment.\nWe currently have the following opening:\nResearcher\nSEMANTIC TECHNOLOGIES and SERVICE-ORIENTED COMPUTING\nThe Smart and Secure Services Research Group at DOCOMO Euro-Labs is working on service\nenablers for the next generation of mobile networks and applications.\nTo realize our vision of value-added mobile services, we're looking for a highly technical and\nhands-on computer scientist to further expand our team in the area of Semantic Technologies\nand Service-oriented Computing.\nApplicants should meet the following requirements:\nVery high technical competence and strong academic record.\nSolid, relevant hands-on technical experience, and a record of individual technical\nachievement.\nAbility to achieve challenging goals in a fast paced R&D environment.\nSubstantial experience in at least one of the following fields: Semantic Technologies and\nservice-oriented platforms, Knowledge Representation, Artificial Intelligence.\nStrong knowledge of the Semantic Web and related standards (e.g., OWL, RDF, GRDLL,\nSPARQL), ideally in a mobile application setting.\nExperiences with advanced database systems, Internet platforms and semantic mash-ups, e.g. for social\nnetworks on the Semantic Web\nKnowledge of Multimedia standards (e.g., MPEG-7, XMP).\nExcellent English language skills orally and in writing.\nGeneral:\nYour workplace will be in Munich, Germany. Your assignment requires a principal interest in core\nconcepts of Mobile Services and Telecommunication Platforms, e.g. RCS (GSMA Rich\nCommunication Suite) and IMS (3GPP IP Multimedia Subsystem) technology. The position is\ninitially limited for two years with a possibility to be converted\ninto an unlimited one.\nApplications & Inquiries:\nPlease send us your complete job application as electronic file (curriculum vitae, graduation & score\ncertifications, reference letter, starting availability, salary expectation)\nto:\ninfo@docomolab-euro.com\nFor further information and inquiries, please feel free to contact:\nMassimo Paolucci\npaolucci@docomolab-euro.com\nDOCOMO Communications Laboratories Europe GmbH\nLandsbergerstrasse 312, 80687 Munich\nhttp://www.docomolab-euro.com\nMassimo Paolucci\nDOCOMO Communications Laboratories Europe GmbH\nLandsberger Strasse 308-312, 80687 Munich\nPhone:  +49-89-56824-238\nFax:    +49-89-56824-300\nMobile: +49-162-2919238\nmailto:paolucci@docomolab-euro.com\nhttp://www.docomolab-euro.com\nManaging Directors (Geschaeftsfuehrer):\nDr. Masami Yabusaki, Mr. Naoki Tani, Mr. Seiichi Ikeda\nAmtsgericht Muenchen, HRB 132976",
  "speaker": "SYSTEM",
  "uuid": "fd0dc28e-4634-4db4-a8f9-8d0243361cc7"
}