{
  "message": "SYSTEM: Cicyt_jorge_CV_Ene2010.pdf: Página 18\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \nREVISOR EXTERNO EN CONFERENCIAS \n- \n2009 IEEE International conference on Information Reuse and Integration (IEEE IRI-2009) \n- \n2008 Knowledge Engineering and Knowledge Management (EKAW 2008) \n- \n2008 IEEE International conference on Information Reuse and Integration (IEEE IRI-2008) \n \nCHARLAS INVITADAS \n- \nSeminario impartido en el Human Computer Studies Laboratory (University of Amsterdam, Holanda): \n“Techniques for Semantic Heterogeneity Reduction on the Web”, el 9/09/2009 \n- \nSeminario impartido en el Knowledge Media Institute (Open University, Reino Unido): “Discovering the \nsemantics of user keywords: an application to improve ontology matching”, el 5/09/2007 \n \nPARTICIPACIÓN EN GRUPOS DE INVESTIGACIÓN \n- \nMiembro del Ontology Engineering Group (Univ. Politécnica de Madrid), del  grupo de Bases de Datos \nInteroperantes (Univ. P. Vasco y Zaragoza) y del grupo de Sistemas de Información Distribuidos (Univ. \nZaragoza)  \n \nOTROS ESTUDIOS DE POSTGRADO \n- \nCertificado de Aptitud Pedagógica (ICE, Universidad de Zaragoza) (1996-1997) \n- \nCertificado de Postgrado en Gestor de Proyectos Informáticos (Univ. Oberta de Catalunya, 2002) \n- \nCertificado de Postgrado en Programador en Java para Internet (UOC,  2002) \n- \nCertificado de Postgrado en Técnico en Gestión del Conocimiento (UOC,  2003) \n- \nDiploma de Formación Pedagógica para el Profesorado Universitario (Instituto de Ciencias de la Educación, \nUniversidad de Zaragoza, 2005-2006) \n- \nCurso Avanzado en “Semantic heterogeneity and ontology matching” (Facultad de Informática, Universidad \npolitécnica de Madrid, 2008) \n- \nPrimer curso de la Diplomatura de Estadística en la Facultad de Ciencias de la Universidad de Zaragoza \n \nOTROS CURSOS DE FORMACIÓN TÉCNICA \n- \n1998: Beca de Formación de la empresa CORITEL sobre entornos Cliente/Servidor lenguaje C, SQL, Visual \nBasic, metodología y estándares de diseño estructurado, etc. (300 horas); Curso de PL/SQL. \n- \n1999: Curso de DSS Agent  impartido por MicroStrategy. \n- \n2000: Curso de DEVELOPER 2000; Curso de C++ (2000); Curso de Redes Digitales Integradas en la \nEscuela de Ingeniería de La Salle (Universidad Ramon Llull de Barcelona) (80 horas). \n- \n2001: Curso de Optimización de Aplicaciones sobre Oracle; Curso de Estructura y Utilidades de Oracle; \nCurso de Análisis y Diseño Orientado a Objetos con UML. \n- \n2002: Curso de DEVELOPER 6i.  \n \nEXPERIENCIA PROFESIONAL \n- \nEntre Julio de 1998 y Diciembre de 1999 desarrolló su carrera profesional en la empresa CORITEL \n(consultora de servicios informáticos, del grupo Accenture) como programador en entornos Cliente/Servidor, \nhabiendo desarrollado su trabajo en un proyecto de Datawarehouse para la empresa Danone. \n- \nEntre Diciembre de 1999 y Noviembre de 2003 trabajó en la oficina de Barcelona de la empresa GEPIN \nSOFT (antes TECO SOFT, del grupo TELECOM ITALIA) participando en proyectos de Ingeniería del \nSoftware para importantes empresas de telecomunicaciones (Retevision, Auna). Desarrolló su trabajo como \nAnalista Funcional, habiendo adquirido experiencia en la elaboración de modelos de datos, análisis de \nrequerimientos, coordinación de pequeños equipos de trabajo, aplicación de metodologías de desarrollo, etc. \n",
  "speaker": "SYSTEM",
  "uuid": "fd162f7e-b444-4bd1-b2c9-51625de4f5ef"
}