{
  "message": "SYSTEM: Wiki: Contents\n[\nhide\n]\n1\nInstituto Geográfico Nacional\n2\nOrganización Mundial de la Salud\n3\nRAE (Lupe: actualizar)\n4\nCRTM (Oscar: actualizar)\nInstituto Geográfico Nacional\n\nLa colaboración entre el Instituto Geográfico Nacional (IGN) y el grupo OEG-UPM se ha centrado en la creación de una ontología de fenómenos, denominada PhenomenOntology, y un conjunto de mappings entre la ontología y las tablas correspondientes de los modelos entidad-relación de los Nomenclátores y las Bases Cartográficas Numéricas del IGN. El objetivo de esta ontología y de este conjunto de mappings es el de permitir una mejor gestión de los catálogos de información geográfica, mediante una clasifiación única que abarque las distintas clasificaciones propuestas por estas fuentes de información.\nSe ha realizado un amplio estudio de la heterogeneidad entre estas fuentes y se han creado heurísticas para la detección de duplicados tanto dentro de la misma fuente de información como entre fuentes.\nAsimismo, en el contexto de este convenio el grupo OEG-UPM está realizando labores de asesoramiento en estandarización en el Work Item de ISO 19150, perteneciente al Internacional Standard Organization / Technical Committee (ISO/TC) 211.\nOrganización Mundial de la Salud\n\nICPS (International Classification for Patience Safety) es un proyecto de la Organización Mundial de la Salud (OMS), en el contexto de la alianza World Alliance for Patient Safety. El objetivo global de este convenio de colaboración entre la Organización Mundial de la Salud y el OEG fue el de desarrollar una clasificación internacional sobre seguridad del paciente que pudiera ser utilizada por todos los agentes relacionados con este sub-área de la Sanidad (gobiernos, hospitales, médicos, etc.) en diversos tipos de aplicaciones (informes sobre eventos relacionados con seguridad del paciente, búsquedas de artículos científicos, propuestas de mejoras de protocolos, etc.).\nEl proyecto completo, en el que participaron también otras instituciones europeas y estadounidenses, se desarrolló durante el año 2008. El OEG-UPM se centró en el paquete de trabajo denominado Formalism and Knowledge Engineering, y este trabajo dio como resultado la red de ontologías sobre seguridad del paciente que está descrita en XXXXXXXXXX\nRAE (Lupe: actualizar)\n\nSe realizará una consultoría sobre la situación actual en la organización interna de los departamentos de Informática y Lingüística Computacional de la Real Academia Española con el fin de proponer recomendaciones para la mejora de los procesos organizativos y de la comunicación entre ambos departamentos, de forma que todo ello redunde en beneficio del servicio prestado a los distintos proyectos que se desarrollan en la Real Academia Española, por una parte, y a los usuarios de los sistemas de acceso público o privado.\nPor otra parte, se realizará una consultoría sobre la situación actual del desarrollo de proyecto del Nuevo diccionario histórico de la lengua española con el objetivo de proponer un conjunto de acciones específicas para el periodo comprendido entre abril y diciembre de 2008, así como esbozar algunas de las acciones que se puedan llevar a cabo en años posteriores.\nCRTM (Oscar: actualizar)\n",
  "speaker": "SYSTEM",
  "uuid": "fd8f4331-acfe-41e3-8b95-7e361394d263"
}