{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual17122009 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz anotación híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción semántica a partir de anotaciones\n.\nNo hay avances esta semana - Personal en vacaciones.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Actualización de interfaz web para registro de fuentes, utilizando los servicios de recuperacion de informacion de parametros de entrada (dbpedia)\nTarea 3. Modelo de anotación híbrido\n.\n- Implantación y agregación de GATE en el servicio web para la anotación. Resolución de problemas asociados entre otros referenciación y configuración.\n- Tratamiento de ontologías sobre GATE y aparición de problemas. Actualmente están en proceso de análisis y tratamiento.\nInterfaz anotación híbrida\n\nTarea 1. Busqueda de Elementos php, para consumir Web Services\n.\n- Software encontrado NuSoap, WS02. - Empezando pruebas y busqueda de problemas.\nTarea 2. Busqueda de Elementos AJAX y JQUERY, para interfaz Cliente\n.\n- Software encontrado Jquery UI, para mostrar widgets dinámicos en la interfaz.\n- Problemas encontrados para agregar información en la pagina de resultados anotados por GATE. La cual debe cargarse en la interfaz - buscando solución.\nTarea 3. Busqueda de Elementos elementos Nuevos para integrar\n.\n- Multifaceted Search - Exhibit - SIMILE Project y Pivot - Live Labs Microsoft o para imágenes de Image - swirl de googlelabs.\nTarea 2.4\n\nDurante este periodo se ha detectado un fallo en el arranque de los agentes instalados en Linux. Dicho error ha sido solventado, quedando así la plataforma Fura completamente instalada en ambos SO. Se está procediendo a llevar a cabo diferentes pruebas en Java sobre los servicios que oferta Fura, para terminar de comprobar su funcionamiento y adquirir un conocimiento a nivel funcional más en profundidad.\nTarea 1.4\n\nSelección de subconjuntos de fuentes de información para agilización del proceso de revisión manual de las pruebas.\nTarea 7.1\n\nContinuación del proceso de mejora de los mappings R2O para generar resultados (RDF) de mayor calidad.\nAnálisis de problemas detectados en la lógica del software r2o (\"equals\" & \"match-regexp\").",
  "speaker": "SYSTEM",
  "uuid": "fdd6472e-359a-489b-b9f8-d6a168b9a3ae"
}