{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 15\nSemantic Grounding of Cross-Lingual Folksonomies\n15\nFig. 3. Multilinguality and Ambiguity of TAS with relevant results produced\nby Sem4Tags\n6\nFuture Work\nThe exploitation of the active context of a tag seems to improve the performance\nof our approach. Nonetheless, we do not obtain statistically signiﬁcant evidence\nto support that claim. Additional evaluations focused on measuring the impor-\ntance of semantic context have to be done. Analyzing the performance of our\napproach we ﬁnd out that named entities lead to better precision. We shall carry\nout a more exhaustive study on this direction.\nBased on the satisfactory results achieved by Sem4Tags, and the easy exten-\nsion of MSR to other languages, we plan to carry out experiments with other\nlanguages so that we can analyze how distinct language characteristics aﬀect our\nsemantic grounding approach. In addition, though the conducted experiment in-\ncludes a wide range of tags and users, they belonged to the tourist places domain.\nWe want to run our approach using tags from diﬀerent domains to compare if\nthe achieved results hold with other kind of tags. Finally, we are interested in\nusing our evaluation results, where users have stated that some semantic entities\nare related to some tags in a particular context, as an starting point to produce a\ntestbed that allows to compare the existing approaches to identify the semantics\nof tags.\nReferences\n1. Angeletou, S., Sabou, M., Motta,\nE.: Semantically Enriching Folksonomies with\nFLOR. In 1st International Workshop on Collective Semantics: Collective Intelli-\ngence & the Semantic Web (CISWeb 2008). Tenerife, Spain (2008)\n2. Banerjee, M., Capozzoli, M., McSweeney, L., Sinha, D.: Beyond Kappa: A Review\nof Interrater Agreement Measures. The Canadian Journal of Statistics / La Revue\nCanadienne de Statistique, (27)1, 3-23(1999)\n3. Begelman G., Keller P., Smadja F.: Automated tag clustering: Improving search and\nexploration in the tag space. In 15th International World Wide Web Conference.\nEdinburgh, Scotland (2006)\n4. Bizer, C., Lehmann, J., Kobilarov, G., Auer, S., Becker, C., Cyganiak, R., Hell-\nmann, S.: DBpedia - A Crystallization Point for the Web of Data. Journal of Web\nSemantics: Science, Services and Agents on the World Wide Web, 7, 154-165 (2009)\n5. Cantador, I., Szomszor, M., Alani, H., Fern´andez, M., Castells, P.: Enriching On-\ntological User Proﬁles with Tagging History for Multi-Domain Recommendations.\n",
  "speaker": "SYSTEM",
  "uuid": "fe0a690f-6f8e-4687-b6be-bb6153c0fc0e"
}