{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 253\nMINISTERIO DE ECONOMÍA Y HACIENDA\n259\n397.- Clasificación de Empresas-Contratación administrativa\nDirección Web: http://serviciosweb.meh.es/apps/contratistas/\nOrganismo editor: Junta Consultiva de Contratación Administrativa.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Empresas.\nDescripción y comentarios: La herramienta permite la consulta de empresas de obras y\nde servicios; además, se puede interrogar de forma general sobre las empresas clasificadas\no bien por subgrupos de clasificación. En las búsquedas se tiene en cuenta la Comunidad\nAutónoma y la provincia. En cuanto a la presentación de los resultados se puede elegir el\ncriterio de ordenación: número de expediente, alfabético, por provincias, etc. \n398.- Biblioteca Virtual del Ministerio de Economía y Hacienda \nDirección Web: http://biblioteca.meh.es/basiscicdocs/tlpesp_search.html?eleccion=accesoNo\nOrganismo editor: Ministerio de Economía y Hacienda.\nClase de información:\nFormato de presentación:\nCatálogos\nImagen/Texto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Economía.\nDescripción y comentarios: Catálogo de la Biblioteca Central del Ministerio de\nEconomía y Hacienda. Ofrece la posibilidad de consultar obras a texto completo en for-\nmato TIFF o PDF. La Sala de Fondo Histórico permite consultar una selección de docu-\nmentos existentes tanto en la propia Biblioteca Central como en el Archivo General del\nDepartamento, elegidos por el interés que encierran como joyas documentales y bibliográ-\nficas. Cuenta también con una colección de fotografías de contenido histórico y artístico.\nPara efectuar la consulta dispone de varios tipos de búsqueda: sencilla, avanzada, por con-\ntenido (que permite realizar búsquedas en los índices y el texto completo de las publi-\ncaciones). La navegación conceptual permite la consulta de documentos a través de los\ntérminos del tesauro del catálogo de la Biblioteca Central. \nBASES DE DATOS  1/1/04  03:39  Página 259\n",
  "speaker": "SYSTEM",
  "uuid": "fefe5876-372f-4895-a2a2-b98549f9afe1"
}