{
  "message": "SYSTEM: Resolucion-consulta-preliminar-mercado-planTL.pdf: Página 4\n \nCAPITAN HAYA, 41 \n28071 MADRID \nTLF.: \nFAX.: \n28071 MADRID \n \n \n \n \nPrimero. Convocatoria \nSe convoca una Consulta Preliminar al Mercado previa al procedimiento de Compra Pública de \nInnovación en el marco del Plan de Impulso de las Tecnologías del Lenguaje. \nSegundo. Objeto \nEl objeto de la presente Consulta Preliminar al Mercado es preparar una eventual contratación \npública de innovación en el marco del Plan de Impulso de las Tecnologías del Lenguaje e informar \na los operadores económicos acerca de sus planes y sus requisitos de contratación. \nSe pretende promover la participación de personas físicas o jurídicas para la presentación de \npropuestas innovadoras para solucionar los retos tecnológicos publicados en la página web del \nPlan de Impulso de las Tecnologías del Lenguaje (www.plantl.es) mediante el empleo de \ntecnologías del lenguaje en diferentes ámbitos contemplados en el citado plan. \nEstas propuestas servirán para evaluar las capacidades del mercado y definir especificaciones \nfuncionales que impliquen innovación pero sean factibles en una eventual Compra Pública de \nInnovación u otro procedimiento de contratación posterior. \nTercero. Participantes \nLa convocatoria es abierta y se dirige a personas físicas o jurídicas, públicas o privadas. \nSe admitirá la presentación de varias propuestas por una misma persona física o jurídica, ya sea \nindividualmente o en forma conjunta con otras. \nCuarto. Presentación de propuestas. \nPara la presentación de las propuestas se ceñirán a las siguientes reglas: \n1. Los participantes deberán formular sus propuestas cumplimentando el formulario que se \npuede descargar en la página web del Plan de Impulso de las Tecnologías del Lenguaje. Se \npodrá acompañar el formulario con la documentación complementaria que se estime \noportuna, donde se podrá desarrollar la propuesta con mayor detalle, pero se ruega \natenerse al formulario para facilitar su análisis. \n2. Las propuestas se enviarán a la siguiente dirección de correo electrónico: \nConsultaPreliminarMercadoPlanTL@MINETAD.ES. \n3. Cada propuesta será identificada mediante la dirección de correo electrónico desde la que \nse remitió. \n4. Por eso, en caso de que un mismo participante envíe varias propuestas, deberá emplear \ndiferentes cuentas de correo electrónico para diferenciarlas.  \n5. Se podrán enviar sucesivas versiones de una propuesta, desde la misma dirección de \ncorreo electrónico, pero cada propuesta enviada sustituirá completamente a la anterior. \nPor ello, la nueva propuesta deberá incluir todo lo que se considere que sigue siendo \nválido de las anteriores. \n6. En caso de que una propuesta se presente de forma conjunta por un grupo de personas o \nentidades, deberá emplearse una única dirección de correo electrónico,  para los efectos \nde identificación de la propuesta e interlocución con los proponentes. \n7. La Secretaría de Estado para la Sociedad de la Información y la Agenda Digital no se obliga \na financiar ni a aceptar las propuestas presentadas en esta convocatoria. \n",
  "speaker": "SYSTEM",
  "uuid": "ff8304f2-6de1-4c74-8b92-853f161f8ac4"
}