{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 10\nPage 10 of 124\nNeOn Integrated Project EU-IST-027595\nChapter 1\nIntroduction\nThe development of ontologies in different international and national projects has revealed that there are\ndifferent alternative ways or possibilities to build ontologies. Just to name a few of them, in the Esperonto1\nproject ontologies were built from scratch; in Knowledge Web2 the issues dealt with were the aligning and\nversioning of ontologies as well as the use of best practices or patterns related to W3C activities; in the\nSEEMP3 project the development of ontologies is based on the reuse of non-ontological resources, e.g.,\nhuman resources standards, language classiﬁcations, etc. Thus, it is not premature to afﬁrm that a new\nontology development paradigm is being born, whose emphasis is placed on the reuse and subsequent re-\nengineering of knowledge-aware resources, as opposed to custom-building new ontologies from scratch. In\norder to support and promote such re-engineering-based approach, new methods, techniques, and tools are\nneeded. Therefore, the main goal of this deliverable is to contribute to this new paradigm by presenting a set\nof methods and tools for re-engineering non-ontological resources into ontologies.\n1.1\nWP2 Objectives and Main Tasks\nWorkpackage 2, Collaborative Aspects for Networked Ontologies, investigates the collaborative aspects of\nontology development and reuse. The main objectives of WP2 is, on the one hand, to analyze and describe\nthe activities underlying collaborative design of networked ontologies and, on the other hand, to produce\nappropriate methods and tools for supporting the related workﬂow, by focusing on the collaborative aspects\nunderlying the work of a knowledge community.\nOne of the tasks involved in this workpackage is T2.2\nMethods and tools for collaborative engineering ontologies, which provides methods and tools to support\nre-engineering, evaluation and selection in the context of building networked ontologies. Within T2.2 we can\ndistinguish the following two subtasks:\n• T2.2a Methods and tools for evaluating and selecting ontology components, which includes (1) design\npattern based evaluation of ontology modules; (2) evaluation of ontology statements reuse in Wat-\nson plugin; and (3) collaborative evaluation of knowledge assets using Open Rating Systems. The\nassociated deliverable of this task is D2.2.3 Methods and tools for ontology evaluation and selection.\n• T2.2b Methods and tools for re-engineering non-ontological resources, which includes (1) implementa-\ntion of methods for re-engineering folksonomies to ontologies; (2) creation of re-engineering patterns\nfor transforming non-ontolgical resources into an ontology; (3) extension of the R2O and ODEMap-\nster for re-engineering database content and populating ontologies with instances derived in this way;\n(4) learning support for semi-automatic ontology construction; (5) implementation of term and named\nentity extraction; (6) implementation of a component for LSA and sense tagging. The results of all\n1http://www.esperonto.net\n2http://knowledgeweb.semanticweb.org\n3http://www.seemp.org\n",
  "speaker": "SYSTEM",
  "uuid": "0232b2c3-00d6-442d-b6cd-a2bfa8352d83"
}