{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 250\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n256\n391.- INE base. Base de datos del Instituto Nacional de Estadística\nDirección Web: http://www.ine.es/\nWeb adicional: http://www.ine.es/inebmenu/indice.htm\nOrganismo editor: Instituto Nacional de Estadística (INE).\nClase de información:\nFormato de presentación:\nDatos estadísticos\nImagen/Texto; Hoja de cálculo\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nSimple\nMateria: Estadísticas.\nDescripción y comentarios: Estadísticas, inventario de operaciones estadísticas de la Administra-\nción General del Estado (IOE). INEbase es el sistema que utiliza el INE para el almacenamiento de\nla información estadística en Internet. Contiene toda la información que el INE produce en forma-\ntos electrónicos; esto es, casi el 100% de su producción. Los bloques de clasificación de la infor-\nmación, que puede ser consultada por fecha, son los siguientes: entorno físico y medio ambiente,\ndemografía y población, sociedad, ciencia y tecnología, agricultura, industria y construcción, ser-\nvicios, clasificaciones, internacional e historia. En INEbase la información está siempre actualiza-\nda. En el mismo instante en que se hacen públicos los datos estadísticos a los medios de comunica-\nción, se puede consultar en INEbase toda la información disponible: nota de prensa, resumen de\ntablas y resultados detallados. Para cada operación estadística en INEbase se ha diseñado una página\nque presenta toda la información disponible relativa a la misma. Esta página incluye tanto la infor-\nmación numérica como la información metodológica o descriptiva que permitirá ayudar a la me-\njor comprensión e interpretación de los datos. En cuanto a la información numérica, para cada ope-\nración se presenta: un resumen de resultados que contiene la nota de prensa que ha dado publicidad\na los datos y un anexo de tablas con los principales resultados. En este apartado se publican normal-\nmente ficheros en formato Word, Excel o pdf. Un apartado con los resultados detallados de la esta-\ndística, donde se incluyen no sólo los últimos resultados publicados, sino que se guarda la historia\nreciente de la estadística. Los ficheros que se presentan tienen formato Pc-Axis y pueden ser visua-\nlizados directamente desde INEbase o bien ser descargados para un tratamiento posterior utilizan-\ndo el programa Pc-Axis. En el primer caso no necesita tener instalado el programa Pc-Axis, pero sí\nen el segundo. En cuanto a la información metodológica y descriptiva, para cada operación se pre-\nsenta: un breve texto descriptivo de la operación, documentos metodológicos y notas explicativas.\nEn ocasiones están también accesibles los cuestionarios utilizados para la recogida de los datos, ca-\nlendario donde se recoge la fecha prevista para la salida de los datos y enlace a la página del catá-\nlogo de publicaciones para conocer las publicaciones asociadas a la operación.\n392.- IOE. Inventario de Operaciones Estadísticas de la Administración General\ndel Estado. Instituto Nacional de Estadística (INE)\nDirección Web: http://www.ine.es/ioe/ioe.jsp\nOrganismo editor: Instituto Nacional de Estadística (INE).\nClase de información:\nFormato de presentación:\nDatos estadísticos\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Estadísticas.\nDescripción y comentarios: Repertorio de las operaciones estadísticas realizadas por el\nInstituto Nacional de Estadística, los Ministerios y el Banco de España. Instrumento funda-\nmental para la coordinación y planificación estadística y punto de partida para la formula-\nción del Plan Estadístico Nacional. \nBASES DE DATOS  1/1/04  03:39  Página 256\n",
  "speaker": "SYSTEM",
  "uuid": "03d58f72-8241-4d87-99d6-3cb478bb8bb8"
}