{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 1\n \n \n1\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n \n \n \nRESOLUCIÓN DE 26 DE OCTUBRE DE 2009 DEL RECTOR DE LA \nUNIVERSIDAD POLITÉCNICA DE MADRID, POR LA QUE SE CONVOCAN \nAYUDAS EN EL MARCO DEL PROGRAMA PROPIO DEL PERSONAL \nINVESTIGADOR EN FORMACIÓN PARA LA REALIZACIÓN DEL DOCTORADO \nEN SUS ESCUELAS, FACULTADES, CENTROS DE I+D E INSTITUTOS \nUNIVERSITARIOS. (RR01/2009) \n \n \nPREÁMBULO \n \nAl amparo de lo dispuesto sobre política general de Becas y Ayudas, en el art. 45.4 de la Ley \nOrgánica 6/2001, de 21 de diciembre, modificada por la Ley Orgánica 4/2007, de 12 de abril, \nsin perjuicio y complementariamente de las convocatorias que realizan otros Organismos, la \nUniversidad Politécnica de Madrid, desarrollando el Cap. II de su Reglamento sobre \nBecarios, aprobado por su Junta de Gobierno el 25 de abril de 1991 y en atención a los fines \ny competencias (art. 2 y 3) expresados en los Estatutos de esta Universidad (decreto \n215/2003, de 16 de octubre) y para dar cumplimiento a los art. 98 y 101 de los mismos, \nconvoca estas ayudas para el personal investigador en formación para la realización del \ndoctorado, como instrumento de formación del personal docente e investigador. \nAsimismo, esta convocatoria recoge el marco jurídico, los derechos y deberes aplicables al \npersonal investigador en formación, que se establecen en el Real Decreto 63/2006, de 27 de \nenero, por el que se aprueba el Estatuto del personal investigador en formación, así como \nlas condiciones que se derivan de la inscripción de este programa en el Registro general de \nprogramas de ayudas a la investigación del Ministerio de Ciencia e Innovación. \nEsta convocatoria recoge el marco jurídico del Real Decreto 1393/2007, de 29 de octubre, \npor el que se establece la ordenación de las enseñanzas universitarias oficiales, así como \nlos requisitos relacionados con los Másteres de Investigación e Itinerarios vinculados a \nprogramas de Doctorado, establecidos por la UPM, aprobados en el Consejo de Gobierno de \n25 de septiembre de 2008.  \nY a tal efecto,  \n \n \nDISPONGO: \n \nOrdenar la publicación de la decimonovena convocatoria de ayudas para becas y contratos \nen el marco del Programa propio del personal investigador en formación para titulados \nuniversitarios que vayan a realizar el Doctorado en Escuelas, Facultades, Centros de I+D e \nInstitutos Universitarios de Investigación de esta Universidad. \n",
  "speaker": "SYSTEM",
  "uuid": "04467050-cb10-47e2-b9ae-d7666b922727"
}