{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 17\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 17 of 124\n– The transformation process is carried out by using either (1) an ad-hoc wrapper, or (2) a formal\nspeciﬁcation of the conversions between entities of the resources (a non-ontological resource\nand ontology) with an associated transformation condition that deﬁnes complex rules (in which\ncase it is necessary a processor or interpreter). The formal speciﬁcation of the conversions could\nbe declarative or not.\n– The transformation process handles the semantics of the non-ontological resource relation-\nships between the non-ontological resource components (e.g. subClassOf, partOf, etc).\n– The transformation process performs a full conversion of the resource. Full conversion implies\nthat all queries that are possible on the original source are also possible on the resultant ontology\n[vAGS06].\n– The transformation process uses additional resources to carry out the conversion.\n• General characteristics\n– The transformation aspects are contemplated at the (1) syntactic or (2) semantic levels. The\nsyntactic level deals with the ability to structure the representation in structured sentences,\nformulas or assertions. The syntactic level includes the transformations of resource component\ndeﬁnitions, according to the grammars of the source and target formats [Cor05]. The semantic\nlevel deals with the ability to construct the propositional meaning of the representation [Cor05].\n– The research work provides some methodological guidelines to support the transformation\nprocess.\n– The list of employed techniques serves to guide the transformation process, e.g., mapping\nrules, re-engineering patterns.\n– If a speciﬁc tool is provided, then it should give technological support to the transformation\nprocess.\n2.2.3\nCharacteristics of the Resultant Ontology\n• The generated ontology components are classes, attributes, relations, or instances.\n• The ontology implementation language: OWL, RDF(S).\n• The research work generates a single ontology or several ontologies. We do not distinguish if the\nontologies generated are interconnected or not.\n2.3\nNon-ontological Resource Re-engineering Methods\nIn this section, we describe the most signiﬁcant methods for re-engineering non-ontological resources taking\ninto account the characteristics identiﬁed in section 2.2. This section is divided in two subsections: methods\ncentered on the non-ontological resource type, section 2.3.1, and methods centered on the non-ontological\nresource implementation, section 2.3.2.\n2.3.1\nMethods Centered on the Non-ontological Resource Type\nIn this section we present the most outstanding methods we have found in the literature relating to the\nre-engineering of the following non-ontological resources: classiﬁcation schemes, folksonomies, lexica and\nthesauri.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "05289890-5567-40fb-b751-1ef5b74ebe8b"
}