{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 229\nMINISTERIO DE ECONOMÍA Y HACIENDA\n235\n349.- Consulta Código ISIN (International Securities Identification Numbering\nSystem) de la Comisión Nacional del Mercado de Valores (CNMV)\nDirección Web: http://www.cnmv.es/index.htm\nOrganismo editor: Comisión Nacional del Mercado de Valores (CNMV).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Economía.\nDescripción y comentarios: La Comisión Nacional del Mercado de Valores, en sus fun-\nciones de Agencia Nacional de Codificación de Valores Mobiliarios, tiene como objetivo\nla identificación de todas las emisiones e instrumentos financieros españoles con un códi-\ngo internacional que se denomina ISIN. Este código identifica unívocamente un valor\nmobiliario a nivel internacional. \n350.- Entidades emisoras en la CNMV. Información registrada por la Comisión\nNacional del Mercado de Valores\nDirección Web: http://www.cnmv.es/index_n.htm?/consultas/entidades.htm~/p_consultas_1.html\nWeb adicional: http://www.cnmv.es/index.htm\nOrganismo editor: Comisión Nacional del Mercado de Valores (CNMV).\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nSimple\nMateria: Mercado de Valores.\nDescripción y comentarios: Buscador de toda la información que sobre entidades regis-\ntra la Comisión Nacional del Mercado de Valores. Herramienta de búsqueda de entidades\nque aparecen en el registro de la Comisión Nacional del Mercado de Valores y que permi-\nte obtener información, sobre una entidad concreta, agrupada en los siguientes bloques:\nparticipaciones significativas y autocartera, auditorías, información adicional de audito-\nrías, información sobre Gobierno corporativo, comunicaciones previas, reglamentos inter-\nnos de conducta, datos de la entidad, folletos de admisión, hechos relevantes, otras comu-\nnicaciones, información pública periódica, códigos ISIN, escrituras de anotaciones en\ncuenta e información sobre esta entidad en los Registros Mercantiles. La mayor parte de\nesta información se presenta en formato pdf. \nBASES DE DATOS  1/1/04  03:39  Página 235\n",
  "speaker": "SYSTEM",
  "uuid": "05aa7594-e629-428b-931c-acb883a4ca52"
}