{
  "message": "SYSTEM: Compromiso_Conocimiento_Protocolo_v1_%28JASH%29.pdf: Página 5\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n \nA3. Desplazamientos durante el viaje \nIgualmente, durante el viaje, o tiempo que permanezcamos en el lugar de destino, utilizaremos transporte \npúblico en todos aquellos desplazamientos en que sea posible, minimizando las facturas de taxi.  \n \nB) FORMAS DE PAGO \nLos gastos derivados de los viajes pueden ser abonados de tres formas diferentes y en un mismo viaje se \npueden utilizar todas las alternativas. \n \nB1. A través de la agencia de viaje \nLa persona que realiza el viaje solicitará a Luisa  por correo electrónico [mailto:lfernandez@centralvia.es] el \nbillete de avión y/o hotel indicándole que debe emitir factura con los siguientes datos, pues es el Grupo el que \nva a pagar dichos gastos: Universidad Politécnica de Madrid, Ramiro de Maeztu 7 28040 Madrid, CIF \nQ2818015F.  \n \nB2. Anticipando personalmente el dinero  \nEn aquellos casos en los que la persona hace frente personalmente CON SU DINERO a los gastos de viaje, se \nrecomienda solicitar un anticipo de los gastos conocidos con al menos 15 días de antelación respecto a la \nfecha de inicio del viaje.  Los gastos conocidos son:  \n- Gastos de desplazamiento (avión, tren, alquiler de coche, gasolina) \n- Gastos de alojamiento \n- Gastos de inscripción en conferencias \nDado que anticipar duplica la gestión, los miembros deberán cumplir una serie de normas específicas (y con \ncarácter adicional a todo lo expuesto en el protocolo) con el fin de agilizar todo lo posible tanto el cobro por \nparte de los investigadores de los importes gastados como consecuencia del viaje, como el proceso \ndesarrollado por el personal encargado de la gestión de dicho cobro. \n1. Sólo en el caso de que un miembro del OEG pague CON SU DINERO el importe del \ndesplazamiento y/o del alojamiento y/o inscripción, procederá la solicitud de un anticipo. Es decir no \nprocederá el anticipo de gastos pagados con Tarjeta OTT, o a través de Central de Viajes, dado que en \nesos casos el miembro no hace frente al gasto con su dinero, si no con el del Grupo. \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "060a31ef-c483-4e22-a1e5-eab679ca1c60"
}