{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 19\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 19 of 21\n \n• \nGuide to regions of the World18. \n• \nRegions of the World19 \nWe choose the ISO 3166 country codes and also we will use the following European \nDynamics20 taxonomies: Continent, Country and Region. \n \nSelecting Language classification \nFor language classification we use the language taxonomy used by European Dynamics20 \nand the ISO 63921.  \n1.1.3 Semantic enrichment of the chosen standard \nThe selected standards in the previous sections are expressed in different representation \nformats: \n• \nNACE Rev. 1.1 is expressed in MS Access and HTML format. \n• \nISCO-88 (COM) is expressed in MS Access, MS Excel and HTML format. \n• \nClassification of Fields of Education and Training (FOET) is expressed in MS Access, \nMS Excel and HTML format. \nThese standards are lightweight ontologies that only have concept classifications without \nproperties, relations between concepts, etc. The goal is to transform these standards in \nontologies following the process: \n• \nVerifying concept taxonomies; METHONTOLOGY proposes to use the following four \ntaxonomic \nrelations: \nSubClass-Of, \nDisjoint-Decomposition, \nExhaustive-\nDecomposition, and Partition. \n• \nEstablishing ad hoc relationships between concepts of the same (or different) \nconcept taxonomy; and also it is necessary to check that the ad hoc binary relations \nhave no errors. \n• \nSpecifying concept attributes; once the ad hoc binary relations have been \nestablished, it is time to specify the properties that describe each concept of the \ntaxonomy, and optionally, their instances. \n• \nDefining formal axioms; to perform this task, it is necessary to identify the formal \naxioms needed in the ontology and describe them precisely. Formal axioms are \nlogical expressions that are always true and are normally used to specify constraints. \nIn order to make possible the enrichment of the standards it is necessary to import them into \nan ontology engineering tool, WebODE [Corcho 2002] in this particular case. This process \nconsists of: \n                                                                                                                                                     \n17 http://www.iso.org/iso/en/prods-services/iso3166ma/index.html \n18 http://www.countriesandcities.com/regions/ \n19 http://park.org/Regions/ \n20 European Dynamics SA is an user partner of the SEEMP project, http://www.eurodyn.com/ \n21 http://www.iso.ch/iso/en/prods-services/iso3166ma/02iso-3166-code-lists/index.html \n",
  "speaker": "SYSTEM",
  "uuid": "061c4816-2dd7-430a-a4b0-0fe5cf0d7686"
}