{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 11\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13919\nelaborado ante los miembros del tribunal. Los doctores presentes en el acto público podrán \nformular cuestiones en el momento y forma que señale el presidente del tribunal.\n5.  Una vez aprobada la tesis doctoral, la universidad se ocupará de su archivo en \nformato electrónico abierto en un repositorio institucional y remitirá, en formato electrónico, \nun ejemplar de la misma así como toda la información complementaria que fuera necesaria \nal Ministerio de Educación a los efectos oportunos.\n6.  En circunstancias excepcionales determinadas por la comisión académica del \nprograma, como pueden ser, entre otras, la participación de empresas en el programa o \nEscuela, la existencia de convenios de confidencialidad con empresas o la posibilidad de \ngeneración de patentes que recaigan sobre el contenido de la tesis, las universidades \nhabilitarán procedimientos para desarrollar los apartados 4 y 5 anteriores que aseguren la \nno publicidad de estos aspectos.\n7.  El tribunal emitirá un informe y la calificación global concedida a la tesis en términos \nde «apto» o «no apto».\nEl tribunal podrá proponer que la tesis obtenga la mención de «cum laude» si se emite \nen tal sentido el voto secreto positivo por unanimidad.\nLa Universidad habilitará los mecanismos precisos para la materialización de la \nconcesión final de dicha mención garantizando que el escrutinio de los votos para dicha \nconcesión se realice en sesión diferente de la correspondiente a la de defensa de la tesis \ndoctoral.\nArtículo 15.  Mención Internacional en el título de Doctor.\n1.  El título de Doctor o Doctora podrá incluir en su anverso la mención «Doctor \ninternacional», siempre que concurran las siguientes circunstancias:\na)  Que, durante el periodo de formación necesario para la obtención del título de \ndoctor, el doctorando haya realizado una estancia mínima de tres meses fuera de España \nen una institución de enseñanza superior o centro de investigación de prestigio, cursando \nestudios o realizando trabajos de investigación. La estancia y las actividades han de ser \navaladas por el director y autorizadas por la Comisión Académica, y se incorporarán al \ndocumento de actividades del doctorando.\nb)  Que parte de la tesis doctoral, al menos el resumen y las conclusiones, se haya \nredactado y sea presentado en una de las lenguas habituales para la comunicación \ncientífica en su campo de conocimiento, distinta a cualquiera de las lenguas oficiales en \nEspaña. Esta norma no será de aplicación cuando las estancias, informes y expertos \nprocedan de un país de habla hispana.\nc)  Que la tesis haya sido informada por un mínimo de dos expertos doctores \npertenecientes a alguna institución de educación superior o instituto de investigación no \nespañola.\nd)  Que al menos un experto perteneciente a alguna institución de educación superior \no centro de investigación no española, con el título de doctor, y distinto del responsable de \nla estancia mencionada en el apartado a), haya formado parte del tribunal evaluador de la \ntesis.\n2.  La defensa de la tesis ha de ser efectuada en la propia universidad española en la \nque el doctorando estuviera inscrito, o, en el caso de programas de doctorado conjuntos, \nen cualquiera de las universidades participantes o en los términos que identifiquen los \nconvenios de colaboración.\nArtículo 16.  Fomento de la formación doctoral.\n1.  El Ministerio de Educación podrá establecer una convocatoria anual para otorgar \nun sello de doctorado de excelencia a aquellos programas de doctorado que destaquen \npor sus resultados y su alto nivel de internacionalización. En dicha convocatoria se \nestablecerán los requisitos para la obtención del citado sello y los criterios de evaluación.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "070b995a-f43c-4c82-993a-de962cdd80f1"
}