{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 12\n12\nMariano Rico, Óscar Corcho et al.\nIn this equation, been C the con\u001cdence level, Z∗is the upper (1 −C)/2\ncritical value for the standard normal distribution, σ stands for the standard\ndistribution (sample mean), and m stands for the margin of error.\nn = (Z∗· σ/m)2\n(1)\n6.1\nEvaluation of skills in UPnP and web technologies\nThe user's skills were calculated as the sum of the numerical values freely auto-\nassigned by each participant (depending on his/her level of competence, from 0\nto 5) on the UPnP and web side aspects described in the questionnaire.\n6.2\nEvaluation of the usability\nThe usability of the Control Point was measured by means of a popular stan-\ndard test called \u0010Practical Heuristics for Usability Evaluation\u0011 [12]. This test\nincludes 13 questions ranging from 1 (bad) to 5 (good), which provides a useful\nmeasure of the user's perceived usability. The results of this test are shown in\nFig. 6a. This \u001cgure shows the average value assigned by the participants to the\nquestions related to usability in the questionnaire, as well as the average value\nand deviation bounds.\nThe analysis of usability was based on the average value assigned in this test,\nwhich was 2.88, with a standard deviation of 0.52. This shows medium usability\nvalues for the whole range of participants, although the most skilled users assign\nslightly lower usability values. A possible explanation is that skilled users are\nmore demanding, and this results in slightly lower evaluations. These results\ncon\u001crm that UpGrid is a usable tool even for less skilled users.\n6.3\nEvaluation of the user's satisfaction\nIn order to evaluate the user's satisfaction concerning the Control Point user\ninterface, we used a slightly modi\u001ced version of the standard test \u0010User Interface\nSatisfaction\u0011 [5]. The standard version includes 27 questions, but it was reduced\nto 25 due to overlaps with the usability test described previously. Valid responses\nto these questions were positive integers ranging from 0 (not satis\u001ced at all) to\n7 (completely satis\u001ced). The results are shown in Fig. 6b.\nThe average value for user satisfaction was 4.13, with a standard deviation\nof 0.43. Besides, the results show the dependency between the user's satisfaction\nand his/her skills. It is worth noting that the user satisfaction depends on the\nuser skills in the same way that usability, that is, higher-skilled users assign a\nslightly lower value to satisfaction.\n6.4\nEvaluation results\nAlthough the values assigned by the participants are apparently low, if we remove\nthe questions out of the average bounds (questions U-L1, U-F3, U-F4 in the\n",
  "speaker": "SYSTEM",
  "uuid": "078aa0f0-7a82-476c-b055-cdabc515012c"
}