{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/People/Boris \n\nWorkshop CAEPIA\nhe estado gestionando la revision de papers y respondiendo preguntas\nOscar puede comentar sobre los issues que hemos tenido, ahora que recuerdo, Asun estaba en un mail también\nme fallaron algunos revisores, lo de siempre, asi q me tocó revisarme un par de papers.\npreparar el programa para noviembre\nTriplification Challenge - El Viajer\nDani y yo preparamos el camera ready del paper, tengo pendiente book hotel/vuelo y registrarme\nDC conference - guidelines for the multingual web\nDAni/Elena y yo preparamos el camera ready del paper. Dani irá a presentarlo\nW3C Workshop A Local Focus for the Multilingual Web\nDani/Elena y yo preparamos un proposal para el workshop, pero fue rechazado :(\nBookchapter GLD - Methodological Guidelines\nReestructuré el paper, Oscar tiene conocimiento de esto.\nDavid Wood va a presentar un excerpt del chapter (junto con otros) en una conferencia de eGov. Le pasé un extended abstract para esto.\nBookchapter NeOn - Reuse and Re-engineering\nCorrecciones del revisor externo. Tengo que ponerme con esto este finde.\nOGK2011\nDavid Wood, Bernadette Hyland, Timothy Lebo, Boris Villazón-Terrazas, Percy Salas, Matias Frosterus and Pierre Desrochers\nInvited Panel Discussion: Linking Government Data\nOGK2011\nPaper AEMET\nRe-submit del paper y coordinación de los cambios. Gran Ayuda de OCorcho\nPaper IEEE\nLuis tiene que liderar la escritura, yo colaboraré como segundo autor en lo que haga falta\nPaper Dani BNE\nDani está liderando la escritura, yo colaboraré como segundo autor en lo que haga falta\nLibro de la Tesis\nTEngo pendiente mandarle al editor la info que me pidió ... a ver si en agosto saco un hueco.\nDocumento e info envidadas, esperando que salga.\npaper para un workshop con MC y Raúl García\nJournal Paper - Publishing Orthology and Diseases Information in the Linked Open Data Cloud\nPaper aceptado ... ;)\nCon Mikel y unos chicos de Murcia, hemos enviado este artículo a una revista Bio.\npaper para revista, del SoA de la tesis\nSeguro que se me olvida algun paper\nTesis de Master\n\nTEngo que leerme la parte de la tesis que me ha pasado Dani Vila\nSe me dijo que iba a ser el Cotutor de la Tesis de Dani Vila (varias veces). De la noche a la mañana aparecieron 3 personas en la cotutoria de Dani Vila (se sabe por experencia anterior que esto no puede ser posible en tesis de master). Decliné de ser co-tutor de esa tesis para no añadir ruido y desgaste de Dani en el tema. Hasta ahora no he recibido un comunicado oficial.\nRevisiones\n\n*\nCOLD\n*\nOCAS\nPC del ESWC12\nCursos\n\nCurso Tenerife\nCurso Athens\nCurso Biblioteca Nacional\nCurso GRan Canaria\nCurso Tenerife\nDocumentos Cursos Asun\nRegistro Software\n\nnor2o, falta el cd con las fuentes\nodemapster plugin falta el tema legal de Jan\nOthers\n\nEstuvimos con Dani Garijo llenando la info en CKAN de los datasets de la UPM. Si todo sale bien estarán elviajero, aemet (el de la BNE no pude añadirlo porque no hubo tiempo de poblarlo y enlazarlo).\nAprovechando el pánico también registré el OGOLOD (de Mikel).\nHe quedado con Elena para reunirnos en septiembre (presencialmente) y aunar esfuerzos para el tema del multilinguismo, asi estaríamos 3 personas (Dani, Elena y yo).\nEstoy con MC viendo como poblar las ontos que tiene en\nBuscamedia\na partir de unos XML que tiene.\nSeguimos con el tema\nHemos identificado que los XML son más complejos de lo que pensamos en su día\nTengo pendiente mirarme los mappings de la bd que me pasó Oscar y pasarla a instancias de GoodRelations\nTengo (y quiero) hacer un refactor de nor2o para que sea más user-friendly e incluir algunas mejoras y bug fixes\nseguro que se me está pasando alguna que otra cosa ... pero de momento esto es lo que he hecho/estado haciendo\nPlanning - Reunion de Postdocs\n\nEsto lo preparé para la reunión de postdocs, pero al final sólo se habló de proyectos\nSome statistics\nInput:\nhttp://ckan.net\nhttp://semantic.ckan.net/\nhttp://km.aifb.kit.edu/projects/btc-2011/\nhttp://sparql.sindice.com/\nOutput:\nlang stats\nlinks between resources in different languages\ninjection data for the lemonn tools?\nvocabularies most used? al estilo de los mondeca guys and LOV?\nmultilingual crosslinking\nextension of silk by including the access of translation services\nextension of silk by including Jorge metric similarity\neGov\ncreación y mantenimiento de\nhttp://es.ckan.net/\nopen data spain\nwe can suggest spanish vocabs, spanish methods, etc.\ncreación y de mantenimiento de\nhttp://data-gov.es/\ncreación y de mantenimiento de\nhttp://open.data.es\nfallo ya existe\nhttp://open-data.es\ndata shapes (graph, tree, table)\nservice for data shape transformations\nwe are always transforming from one shape to another\nfirst service that implements r2rml\nsecond service nor2o variation of r2rml for excel\nsecond service nor2o variation of r2rml for xml\nextensible to sensors data?\ngeolinkeddata\nvalidación de los links\nuri lookupservice\nchange scovo for RDF data cube\ninclusion of the opm for provenance description\nfixing current errors\ngeovocab comenzar colaboracion con Andreas y proponer gente del geospatial consortiium, John Goodwin, Luis Bermudez\ngeometry2rdf\nextension for shapefile support\nmarc21toLD\nalso available as service\nsameAs validator\nempaquetado del soft y mantenimiento\nnor2o y goodrelations\nrefactor of nor2o and inclusion of the creation of goodrelations compliant vocabs\nhacer lo de las empresas de oscar\nwebsite que incluira todos los vocabs desarrollados en el grupo\ndesde ahora todo deferenceable\nutilizar voaf para anotar los vocabs\nsoporte a schema.org\nestudio de schema.org\nposibles datasets a estudiar - tarea de ev\ncentros deportivos de madrid, spain\nseemp ld",
  "speaker": "SYSTEM",
  "uuid": "08f08095-c3c2-4bcc-a153-7fcad64789f6"
}