{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Servicios_generales_relacionados_con_etiquetas \n\nCrear un repositorio en delicias: lexUtils\nContents\n[\nhide\n]\n1\nStemmer\n2\nPalabras compuestas y errores ortográficos\n3\nIdentificar relaciones entre términos\n4\nIdentificación de sinónimos\n5\nServicio de Sugerencias Ortográficas\nStemmer\n\nIdiomas\n: En inglés y en español\nEstado del arte\n:\nInglés: check GATE (Andrés/Jorge, preguntando a Lupe/Elena)\nEspañol (Andrés/Esther): analizar lo que tenga José Angel más herramientas de propósito general existentes (check freeling)\nPuede ser utilizado por Andrés, Víctor y Esther\nPalabras compuestas y errores ortográficos\n\nIdiomas\n: En inglés y en español\nEstado del arte\n: para ambos idiomas\nErrores ortográficos: En DynaLearn se utiliza el servicio de sugerencias de Yahoo!. El máximo es de 5000 términos por IP y usuario (Brenda)\nPalabras compuestas: En Dynalearn tenemos código para generar distintas versiones de las palabras compuestas que aparecen (Brenda)\nPuede ser utilizado por Andrés y Esther\nTareas\n: Hablar con Yahoo (Peter Mika o Ricardo Baeza) para ver si se puede eliminar esta restricción. En caso contrario, habría que desarrollar es un ofuscador de IPs (Angel)\nIdentificar relaciones entre términos\n\nEstado del arte\n: SCARLET (muchos problemas de cobertura)\nIdiomas\n: Independiente del idioma\nTareas\n: hacer un estado del arte, analizando limitaciones en dominios concretos.\nPuede ser utilizado por Víctor y Andrés\nIdentificación de sinónimos\n\nEstado del arte\n: WordNet synsets (si hemos identificado el synset), sameAs, uso de labels, sharednames.org, Mauricio\nIdiomas\n: En inglés y en español (en los algoritmos no habrá diferencias, en principio, pero sí en cobertura).\nPuede ser utilizado por Andrés y Víctor\nServicio de Sugerencias Ortográficas\n\nEstán disponibles los siguientes servicios web (rest):\nServicio:\nhttp://grafias.dia.fi.upm.es/didYouMean\nArgumentos:\n- word palabra de entrada\n- lang Idioma (es o en)\n- accuracy valor real entre 0 y 1 que indica la similitud mínima entre una palabra sugerida y la palabra de entrada (Opcional) \n- num valor entero que indica el número de sugerencias que se espera recibir (Opcional). Se recomienda utilizar como mínimo un valor de 5 (Nunca 1).\nResultado: Cadena de caracteres que contiene las palabras sugeridas codificadas en UTF-8 y separadas por \"|\"\nEjemplos:\n-\nhttp://grafias.dia.fi.upm.es/service/didYouMean?word=cancion&lang=es&accuracy=0.5f&numberOfSuggestions=15\n-\nhttp://grafias.dia.fi.upm.es/service/didYouMean?word=Realmadrid&lang=es\nEl servicio didYouMean no devuelve ninguna sugerencia si la palabra esta bien escrita (es decir que hace parte del diccionario) o si no se encuentra ninguna sugerencia. Con lo cual es necesario una función que nos diga si una palabra esta o no en el diccionario.\nServicio:\nhttp://grafias.dia.fi.upm.es/service/exists\nArgumentos:\n- word palabra de entrada\n- lang Idioma (es o en)\nResultado: Cadena de caracteres true o false.\nEjemplos:\n-\nhttp://grafias.dia.fi.upm.es/service/exists?word=cancion&lang=es\n-\nhttp://grafias.dia.fi.upm.es/service/exists?word=canci%C3%B3n&lang=es",
  "speaker": "SYSTEM",
  "uuid": "0a1c6cb2-33e2-4454-a2d1-1db857ab8086"
}