{
  "message": "SYSTEM: 05.Annotation.pdf: Página 2\n• 2 \nTable of Contents \n1. \nOntology-based Annotation \n2. \nWeb Resource Annotation \n3. \nDatabase Annotation \n3.1  Approaches for database annotation \n3.2  R2O and ODEMapster \n3.3   Practical Example: NeOn Toolkit \nWhat is the metadata of this HTML fragment? \nBased on Dublin Core\t\n\r\nThe contributor and creator is the ﬂight booking service “www.ﬂightbookings.com”.\t\n\r\nThe date would be January 1st, 2003, in case that the HTML page has been generated on that \nspeciﬁc date.\t\n\r\nThe description would be something like “ﬂight details for a travel between Madrid and Seattle via \nChicago on February 8th, 2004”.\t\n\r\nThe document format is “HTML”.\t\n\r\nThe document language is “en”, which stands for English\t\n\r\nBased on thesauri\t\n\r\nMadrid  is  a  reference  to  the  term  with  ID  7010413  in  the \nthesaurus, which refers to the city of Madrid in Spain.\t\n\r\nSpain is a reference to the term with ID 1000095, which refers to \nthe kingdom of Spain in Europe.\t\n\r\nChicago is a reference to the term with ID 7013596, which refers \nto the city of Chicago in Illinois, US.\t\n\r\nUnited States of America is a reference to the term “United \nStates” with ID 7012149, which refers to the US nation.\t\n\r\nSeattle is a reference to the term with ID 7014494, which refers \nto the city of Seattle in Washington, US. \t\n\r\nBased on ontologies\t\n\r\nConcept instances relate a part of the document to one or several concepts in an ontology. For example, “Flight details” may represent \nan instance of the concept Flight, and can be named as AA7615_Feb08_2003, although concept instances do not necessarily \nhave a name.\t\n\r\nAttribute values relate a concept instance with part of the document, which is the value of one of its attributes. For example, \n“American Airlines” can be the value of the attribute companyName.\t\n\r\nRelation instances that relate two concept instances by some domain-speciﬁc relation. For example, the ﬂight \nAA7615_Feb08_2003 and the location Madrid can be connected by the relation departurePlace  \n",
  "speaker": "SYSTEM",
  "uuid": "0c560898-fadf-46ac-a782-5db4998e98d1"
}