{
  "message": "SYSTEM: NeOn_Glossary_of_Processes_and_Activities.pdf: Página 1\nNeOn Glossary of Processes and Activities \n \n Ontology Aligning. This term refers to the activity of finding the correspondences between two or \nmore ontologies and storing/exploiting them. A synonym for this activity is Ontology Mapping. \n \n Ontology Annotation. It refers to the activity of enriching the ontology with additional information, \ne.g., metadata or comments. \n Ontology Assessment. It refers to the activity of checking an ontology against the user’s \nrequirements, such as usability, usefulness, abstraction, quality. \n Ontology Comparison. It refers to the activity of finding differences between two or more \nontologies or between two or more ontology modules. \n Ontology Conceptualization. It refers to the activity of organizing and structuring the information \n(data, knowledge, etc.), obtained during the acquisition process, into meaningful models at the \nknowledge level and according to the ontology requirements specification document. This activity is \nindependent of the way in which the ontology implementation will be carried out. \n Ontology Configuration Management  [Gómez-Pérez et al., 2003]. It refers to the activity of \nrecording all the versions of the documentation, software and ontology code, and of controlling the \nchanges. \n Control [Gómez-Pérez et al., 2003]. It refers to the activity of guaranteeing that the activities \nscheduled in the ontology development process are completed and performed in the manner \nintended. \n Ontology Customization. It refers to the activity of adapting an ontology to a specific user's needs. \n Ontology Design Pattern Reuse. It refers to the process of using available ontology design \npatterns in the solution to different modelling problems during the development of new ontologies. \n Ontology Diagnosis. It refers to the activity of identifying parts of the ontology directly responsible \nfor incorrectness and incompleteness. Ontology diagnosis is triggered by ontology validation. \n Ontology Documentation. It refers to the collection of documents and explanatory comments \ngenerated during the entire ontology building process. \nExamples of the documents external to the implemented ontology include ontology requirement \nspecification document, sources used for acquiring knowledge, ontology conceptualization \ndocument, design and decision criteria, etc. \nThe information inside the implemented ontology includes natural language comments, ontology \nmetadata, and implementation code. \nIn summary: anything that could be useful to help users, who did not build the ontology, to \nunderstand and learn how the ontology was built. Note that the level of granularity of descriptions \ncan help the understanding of the ontology. \n Ontology Elicitation. It is a knowledge acquisition activity in which conceptual structures (e.g., T-\nBox) and their instances (e.g., A-Box) are acquired from domain experts. \n \n Ontology Enrichment. It refers to the activity of extending an ontology with new conceptual \nstructures (e.g., concepts, roles and axioms). \n Ontology Environment Study. It refers to the activity of analyzing the environment in which the \nontology is going to be developed. \n Ontology Evaluation. It refers to the activity of checking the technical quality of an ontology against \na frame of reference. \n Ontology Evolution [Stojanovic, 2004]. It refers to the activity of facilitating the modification of an \nontology by preserving its consistency. \n",
  "speaker": "SYSTEM",
  "uuid": "0f36bdda-f2bc-4040-928d-a125365097f9"
}