{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Registro_de_Software \n\n¿\tCompetente Ontology (almacenada en el fichero Competence0ntology.wsml). Esta ontología define el concepto Competence como super-concepto de los conceptos importados: Skill, Language Proficiency y Driving License. \n¿\tCompensation Ontology (almacenada en el fichero Compensation0ntology.wsml). Esta ontología está basada en el estándar ISO 4217. \n¿\tDriving License Ontology (almacenada en el fichero DrivingLicenseOntology.wsml). Esta ontología está basada en los niveles reconocidos por la Legislación Europea. \n¿\tEconomic Activity Ontology (almacenada en el fichero EconomicActivity0ntology.wsml). Esta ontología está basada en el estándar NACE Rev. 1.1. \n¿\tEducation Ontology (almacenada en el fichero Education0ntology.wsml). Los campos de educación están basados en el estándar FOET y los niveles de educación está basados en el estándar ISCED97. \n¿\tGeography Ontology (almacenada en el fichero Geography0ntology.wsml). Esta ontologia está basada en el estándar ISO 3 166.\n¿\tJob Offer Ontology (almacenada en el fichero JobOfferOntology.wsm1). Esta ontología ha sido desarrollada tomando como punto de partida las recomendaciones de HR-XML. \n¿\tJob Seeker Ontology (almacenada en el fichero JobSeekerOntology.wsml). Esta ontología ha sido desarrollada tomando como punto de partida las recomendaciones de HR-XML.\n¿\tLabour Regulatory Ontology (almacenada en el fichero LabourRegulatory0ntology.wsml). Esta ontología está basada en las clasificaciones de LE FOREM para tipos de contrato.\n¿\tLanguage Ontology (almacenada en el fichero LanguageOntology.wsm1). Está ontología está basada en el estándar ISO 6392 y en el Common European Framework of Reference (CEF).\n¿\tOccupation Ontology (almacenada en el fichero OccupationOntology.wsml). Está ontología está basada en el estándar ISCO-88 (COM) de clasificación de ocupaciones.\n¿\tSkill Ontology (almacenada en el fichero Skill0ntology.wsml). Esta ontología modela el dominio de las habilidades (skills).\n¿\tTime Ontology (almacenada en el fichero TimeOntology.wsml). Esta ontología está basada en la DAML ontología de tiempo.\nEsta ontología va un paso más allá que los esquemas XML propuestos por el consorcio HR-XML' para representar currículos y ofertas de trabajo. Los esquemas XML mencionados sólo proporcionan una especificación sintáctica de los datos relativos a currículos y ofertas de empleo. En cambio, esta ontología no sólo proporciona una especificación sintáctica, sino también semántica para los distintos campos de información utilizados en los currículos y las ofertas de empleo. Esto significa que esta ontología no sólo especifica que, por ejemplo, un currículo debe incluir información sobre los datos personales, historial académico, experiencia profesional, etc. (al igual que un esquema XML), sino que también proporciona conjuntos de términos organizados en taxonomías para rellenar los apartados de un currículo. Por ejemplo, esta ontología incluye una taxonomía de todas las áreas de conocimiento que pueden cubrir las titulaciones académicas.\nDocenDIA\nM-2801/2011\nocorcho (), asun (), asiles (), ajimenez (), rriera (), amontes ()\nAplicación web para la gestión de los másteres enmarcados en la UPM.\nGeo-DSI\nM-20692011, M-20732011\ngramos (), mperez ()\nSolución para la optimización de la transferencia de contenido multilmedia para dispositivos móviles haciendo uso de la tecnología GRID y de los sistemas de codificación de imágenes, audio y video más populares.\ngOntt\nM-006071/2011\nasun (), mcsuarez (), omunoz (), mvigo ()\n\"gOntt es un plug-in para el entorno de desarrollo de ontologías llamado NeOn Toolkit. Permite identificar, mostrar, interactuar y planificar los distintos procesos y actividades que forman parte del desarrollo de una ontología; mostrando la planificación mediante diagramas Gantt. Como meta-tool para el NeOn Toolkit, gOntt proporciona guías metodológicas para cada proceso y actividad planificada, información sobre los NeOn plug-ins que se pueden utilizar en cada proceso y actividad, y además facilita el uso de dichos plug-ins.\ngOntt permite planificar ciclos de vida para el desarrollo de ontologías e integra los plugins necesarios para la realización de las tareas de las actividades y procesos pudiendo utilizar estos directamente desde el gOntt.\"\nGeometry2RDF\nM-002491/2012\nvsaquicela (), lmvilches (), magarcia (), ocorcho (), bvillazon (), asun (), aleon ()\nGeometry2RDF permite generar información en formato (Resource Descriptión Framework) a partir de información geométrica almacenada en bases de datos geoespaciales\nMap4RDF\nM-002493/2012\nvsaquicela (), lmvilches (), magarcia (), ocorcho (), bvillazon (), asun (), aleon ()\nMap4RDF es una herramienta para explorar y visualizar conjuntos de datos RDF enriquecidos con información geométrica en el contexto de la Web de los Datos.\nMARiMba\nM-002489/2012\nasun (), dvila (), bvillazon ()\nMARiMba es una herramienta orientada a bibliotecas para transformar sus registros en formato MARC (MAchine-ReadableCataloging) a RDF, siguiendo las mejores prácticas de Linked Data.\nNOR2O\nM-001914/2012\nasun (), bvillazon ()\nEs una librería para transformar recursos no-ontológicos en ontologías.\nOOPS! - Ontology Pitfall Scanner\nM-009445/2012\nasun (), mpoveda (), mcsuarez ()\nHerramienta orientada al a validación de ontologías. En concreto OOPS! permite analizar ontologías para detectar algunos de los errores que se suelen dar durante el desarrollo de ontologías. En este sentido OOPS! realiza un diagnóstico de la ontología de manera independiente al dominio o los requisitos modelados en la misma. A partir de dicho diagnóstico OOPS! genera una serie de notificaciones indicando en qué elementos se podrían estar cometiendo errores.\nHerramientas para la visualización 3D de entornos laborables simulados\n00/2013/1156\njbajo\nPrograma de ordenador\nInterfaces móviles para la monitorización a través de servicios Web\n00/2013/1154\njbajo\nPrograma de ordenador\nMonitorización de una flota de vehículos comerciales y generación de rutas de reparto\n00/2013/1158\njbajo\nPrograma de ordenador\nPlataforma multiagente para la recuperación y catalogación de recursos educativos\n00/2013/1155\njbajo\nPrograma de ordenador\nPlataforma para la simulación y visualización de Agentes Inteligentes (MISIA)\n00/2013/1157\njbajo\nPrograma de ordenador\nTecnologia Grid aplicada a la genómica comparada\n00/2013/1153\njbajo\nPrograma de ordenador\nPendiente de registrar",
  "speaker": "SYSTEM",
  "uuid": "11059823-3ef2-4087-9af7-4938d6444842"
}