{
  "message": "SYSTEM: FormularioCPM_asun2.pdf: Página 5\n1.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n1. Solución I\n1.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n1.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n1.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­5­\n(*) Campos obligatorios\nversión 1.2.\nLa creación semiautomática de terminologías de dominio y su transformación en \nontologías, de acuerdo con los principios de la Web Semántica, requiere la aplicación de \nmétodos,  técnicas y herramientas que garanticen la calidad y eficiencia del proceso. Si \nlas terminologías son los son los recursos necesarios para dotar de cobertura a las \ndiferentes aplicaciones de procesamiento del lenguaje natural (PLN) en ámbitos \nespecializados de los distintos sectores verticales, las ontologías permiten esa \ncomunicación a nivel de gestores y sistemas informáticos, y favorecen la integración y \nreutilización de la información.  \n \nEl Ontology Engineering Group (OEG), grupo de referencia internacional, pionero en \nEspaña en Ingeniería Ontológica, con más de 20 años de experiencia en la creación y \naplicación de tecnologías semánticas, y el Institut de Lingüística Aplicada (IULA), el más \nprestigioso centro de investigación y formación en España dedicado a la Terminología, la \nLexicografía y el desarrollo de herramientas de procesamiento de lenguaje natural para \nlas lenguas del Estado, cuentan con el know-how y las herramientas necesarias para \nllevar a cabo la construcción de recursos terminológicos multilingües de forma \nsemiautomática y su posterior transformación en recursos semánticos, u ontologías, que \nserán un componente fundamental en el desarrollo de plataformas de procesamiento de \nlenguaje natural y traducción automática para las Administraciones Públicas.   \n \nPara la extracción semiautomática de terminologías se partirá de corpus de dominio, y se \ntomarán como punto de partida otras terminologías o recursos léxicos existentes que se \npuedan reutilizar total o parcialmente para dicho dominio.  En caso de que no existan \ntales terminologías, se utilizará la librería H-NER (Hierarchical Named Entity Recognition), \ndesarrollada por el OEG para llevar a cabo la identificación y extracción de términos. \nH-NER utiliza lexicones y diccionarios (gazetteers), reglas basadas en patrones \nléxico-sintácticos y de formato, y técnicas basadas en aprendizaje automático para \nidentificar términos y entidades nombradas a partir de textos no estructurados \n(documentos en texto plano, documentos en formato PDF, cadenas de mensajes, etc.). \nEsta herramienta permite así mismo la identificación de colocaciones, el contexto en el \nque se encuentra el término y el enlazado a entidades de ontologías. De esta forma, el \nrecurso terminológico que se derive queda enlazado con el corpus del que ha sido \ngenerado.  También se dispone de la herramienta YATE \n(http://eines.iula.upf.edu/cgi-bin/Yate-on-the-Web/yotwMain.pl?lang=ES), que junto con un \npre-anotador generan un texto pre-anotado para la posterior verificación por un experto, y \nde TERMINUS (http://terminus.iula.upf.edu//cgi-bin/terminus2.0/terminus.pl?lInt=Es) una \nestación de gestión de la terminología. \n \n \n \n \n \n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "15f29643-7c4a-4430-80db-8988050c92e0"
}