{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Protocolo_viajes2 \n\nContents\n[\nhide\n]\n1\nMEDIDAS DE RACIONALIZACIÓN DEL GASTO\n1.1\nReserva del alojamiento y del medio de desplazamiento\n1.2\nDesplazamientos durante el viaje\n2\nFORMAS DE PAGO\n2.1\nA través de la agencia de viaje\n2.2\nAnticipando personalmente el dinero\n2.3\nUtilizando la tarjeta OTT\n2.4\nEn todos los casos\n3\nDIETAS\n4\nSOL MELIA - Acuerdo de colaboración 2010\nMEDIDAS DE RACIONALIZACIÓN DEL GASTO\n\nLos miembros del OEG, en la medida de lo posible, observarán las siguientes normas con el fin de racionalizar el gasto total en viajes del Grupo:\nReserva del alojamiento y del medio de desplazamiento\n\n1. Tan pronto como se tenga conocimiento de la realización del viaje, cada miembro debe proceder a reservar hoteles y billetes de avión. Los gatos deben ser aprobados por Asun u Oscar si los billetes de avión superan los 300 euros o si el hotel supera los 75 euros en habitación individual ó 140  en habitación compartida.\n2. En aquellos casos en que, por circunstancias excepcionales, las reservas se realicen durante los 15 días que preceden a la fecha de salida, se deberá enviar un correo electrónico a Asun u Óscar, con copia a José Alberto, informando de esta contingencia así como de la/s causa/s de la misma y bajo ningún concepto se puede incurrir en gastos si éstos no están autorizados.\n3. Además, hay que cumplimentar la hoja previaje\n[1]\n, que debe ser presentada al menos con quince días de antelación. En aquellos casos en los que el viaje implique la presentación de un artículo será obligatorio entregar el mismo junto con la hoja previaje, o bien en formato digital. Existe orden de no pagar los viajes, en tanto no tenga lugar la presentación del artículo correspondiente.\nDesplazamientos durante el viaje\n\nSe utilizará transporte público en todos aquellos desplazamientos en que sea posible\n, minimizando las facturas de taxi. I\ngualmente, se utilizará la forma más economica de transporte al aeropuerto\n. Esto implica que, en caso de disponer de vehículo particular, el desplazamiento al aeropuerto únicamente se realizará en taxi cuando resulte más económico que haciéndolo en el propio vehículo, es decir, cuando la tarifa del desplazamiento en taxi de ida y vuelta al aeopuerto sea inferior, que el precio del kilómetraje con el vehículo particular más la tarifa del parking en Barajas. Para tomar la decisión seguiremos los siguientes pasos:\n1. Previsión coste taxi\n: pinchando en el siguiente enlace\n[1]\npodéis determinar aproximandamente el precio del taxi desde cualquier punto de origen, hasta el aeropuerto de Barajas. Para obtener la tarifa total, simplemente la multiplicamos por dos. Al hacer  el cálculo en el enlace nos mostrará la distancia en kilómetros del desplazamiento. Lo apuntamos.\n2. Previsión coste parking barajas\n: las tarifas del parking de larga estancia en el aeropuerto son las siguientes:\nDuración\nPrecio\n1 día\n10,60 €\n2 días\n21,20 €\n3 días\n30,80 €\n4 días\n40,40 €\n5 días\n50 €\n6 días\n55,60 €\n7 días\n61,20 €\n8 días\n66,80 €\n9 días\n72,40 €\n10 días\n78 €\nPara más información sobre tarifas, localización... del parking de larga estancia de barajas, pincharemos en el siguiente enlace\n[2]\n3. Coste kilometraje vehículo particular\n: multiplicaremos la distancia en kilómetros al aeropuerto (que hemos apuntado en el paso 1) por 0,19 € y por dos (ya que el desplazamiento es de ida y vuelta).\nConclusión: Si 1>2+3 nos desplazaremos utilizando el vehículo particular, y si 1<2+3 nos desplazaremos en taxi.\n* Hemos de tener en cuenta que en caso de decantarnos por el parking de larga estancia de barajas, por ser la alternativa más económica, habremos de realizar la reserva antes de acceder a las instalaciones del parking en el Tlf.913936937, realizando el prepago de la estancia reservada.\nFORMAS DE PAGO\n\nLos gastos derivados de los viajes pueden ser abonados de tres formas diferentes\ny en un mismo viaje se pueden utilizar todas las alternativas.\nA través de la agencia de viaje\n\nLa persona que realiza el viaje solicitará a Luisa  por correo electrónico\n[3]\nel billete de avión y/o hotel indicándole que debe emitir factura con los siguientes datos, pues es el Grupo el que va a pagar dichos gastos: Universidad Politécnica de Madrid, Ramiro de Maeztu 7 28040 Madrid, CIF Q2818015F.\nAnticipando personalmente el dinero\n\nEn aquellos casos en los que la persona hace frente personalmente a los gastos de viaje\n, se recomienda s\nolicitar un anticipo de los gastos conocidos con al menos 15 días de antelación\nrespecto a la fecha de inicio del viaje.  Los gastos conocidos son:\n- Gastos de desplazamiento (avión, tren, alquiler de coche, gasolina)\n- Gastos de alojamiento\n- Gastos de inscripción en conferencias\nDado que anticipar duplica la gestión,\nlos miembros deberán cumplir una serie de normas específicas\n(y con carácter adicional a todo lo expuesto en el protocolo) con el fin de agilizar todo lo posible tanto el cobro por parte de los investigadores de los importes gastados como consecuencia del viaje, como el proceso desarrollado por el personal encargado de la gestión de dicho cobro.\n1. Sólo en el caso de que un miembro del OEG pague con su dinero el importe del desplazamiento y/o del alojamiento y/o inscripción, procederá la solicitud de un anticipo. En el caso de que dichos gastos sean pagados con tarjeta OTT, o a través de Central de Viajes, no procederá el anticipo de los conceptos comentados, ya que en ambos casos el importe ya se ha anticipado al miembro. (Sí podría proceder, en su caso, el anticipo de otros conceptos, como por ejemplo los gastos de inscripción.)\n2. En el caso de que se solicite el anticipo de dichas cantidades para hacer frente a los gastos de viaje, deberá entregarse  a José Alberto tanto la hoja previaje (como se venía haciendo hasta ahora), como la hoja posviaje en la que se desglosarán las distintas cantidades que integren el total a anticipar. Igualmente deberán adjuntarse las facturas/mails de los conceptos cuyo anticipo se solicita (ya que sólo se anticipan gastos ciertos), y entregarse dicha documentación con una antelación mínima de\n15 días\nrespecto de la fecha de inicio del viaje,  periodo mínimo para que los miembros hayan podido cobrar el anticipo en la fecha de salida.\n3. No procederá solicitar anticipo de cantidades que posteriormente sean abonadas con tarjeta OTT o, dicho de otro modo, no procederá pagar con tarjeta OTT aquellos conceptos cuyo anticipo se haya solicitado.\n4. Si se desea solicitar el anticipo de los gastos de alojamiento, y se desconoce el importe del mismo, el miembro se imputará la siguiente cantidad: 0,5 x dieta alojamiento x nº días que se pernocte en el destino.\nUtilizando la tarjeta OTT",
  "speaker": "SYSTEM",
  "uuid": "1676c37e-c950-4a5f-85f3-ff3a8e7a3f16"
}