{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 1\nHow to write and use the Ontology Requirements \nSpecification Document \nMari Carmen Suárez-Figueroa1, Asunción Gómez-Pérez 1, and Boris Villazón-\nTerrazas1 \n \n1 Ontology Engineering Group, Departamento de Inteligencia Artificial,  \nFacultad de Informática, Universidad Politécnica de Madrid, \nMadrid, Spain \n{mcsuarez, asun, bvillazon}@fi.upm.es \nAbstract. The goal of the ontology requirements specification activity is to \nstate why the ontology is being built, what its intended uses are, who the end-\nusers are, and which requirements the ontology should fulfill. The novelty of \nthis paper lies in the systematization of the ontology requirements specification \nactivity since the paper proposes detailed methodological guidelines for \nspecifying ontology requirements efficiently. These guidelines will help \nontology engineers to capture ontology requirements and produce the ontology \nrequirements specification document (ORSD). The ORSD will play a key role \nduring the ontology development process because it facilitates, among other \nactivities, (1) the search and reuse of existing knowledge-aware resources with \nthe aim of re-engineering them into ontologies, (2) the search and reuse of \nexisting ontological resources (ontologies, ontology modules, ontology \nstatements as well as ontology design patterns), and (3) the verification of the \nontology along the ontology development. In parallel to the guidelines, we \npresent the ORSD that resulted from the ontology requirements specification \nactivity within the SEEMP project, and how this document facilitated not only \nthe reuse of existing knowledge-aware resources but also the verification of the \nSEEMP ontologies. Moreover, we present some use cases in which the \nmethodological guidelines proposed here were applied.  \nKeywords: Ontology Requirements; Competency Questions; Ontology \nRequirements Specification; and Methodologies. \n1   Introduction \nOne of the key processes in software development is software specification [13], \nwhose aim is to understand and define what functionalities are required from the \nsoftware product. This process leads to the production of a software requirements \ndocument [13], that is, the specification for the software product. It has been proved \nthat a detailed software requirements document provides several benefits [10], such \nas: (a) the establishment of the basis for agreement between customers and suppliers \non what the software product is supposed to do, (b) the reduction of the development \n",
  "speaker": "SYSTEM",
  "uuid": "177e1321-ac2e-4fb7-9adb-304456682d58"
}