{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Further_information \n\nEl lenguaje de las imágenes de arte: ¿cómo aprovechar las etiquetas sociales multilingües en colecciones de imágenes digitales?\nResumen\nIrene Eleta presentará su trabajo de investigación, realizado con la ayuda de la Dra. Jennifer Golbeck. En este estudio se comparan los patrones de etiquetación social en dos lenguas (inglés y español) en una colección experimental de imágenes de arte. Al mismo tiempo, este trabajo propone varias maneras de aprovechar las etiquetas sociales multilingües en bibliotecas y museos digitales. El objetivo de usar etiquetas sociales es enriquecer los metadatos de las imágenes, dándoles mayor diversidad, y mejorar el acceso a la colección en diferentes lenguas. Este trabajo ha sido recientemente aceptado para su publicación en la conferencia Internacional del ACM CSCW (Computer-Supported Cooperative Work), en 2012.\nFinalmente, Irene explicará brevemente el contexto de su investigación: el proyecto T3 en la Universidad de Maryland, que combina análisis de texto y etiquetas sociales para mejorar el acceso a colecciones de imágenes digitales de museos y bibliotecas. Este proyecto lo dirigen las Dras. Judith Klavans (Computational Linguistics and Information Processing Lab) y Jennifer Golbeck (College of Information Studies/ Human-Computer Interaction Lab).\nInformación sobre el proyecto T3 (Text, Tags, and Trust):\nhttp://umiacs.umd.edu/research/t3/\nEnglish:\nIrene Eleta will present her research work, carried out with the guidance of Dr. Jennifer Golbeck. The goal of this study is to compare social tagging patterns in two languages (Spanish and English) in image collections of art, while seeking exploitable strengths for the application of multilingual social tagging in digital libraries and museums. The use of social tags would enrich the metadata of images, adding diversity, and improving access to the collection in different languages. Recently, this work was accepted in the International ACM Conference CSCW (Computer-Supported Cooperative Work), to be held in February, 2012.\nFinally, Irene will explain briefly the context of her research: the T3 project at the University of Maryland, which combines text mining and social tags for improving access to digital image collections in museums and libraries. The principal investigators of this project are Drs. Judith Klavans (Computational Linguistics and Information Processing Lab) and Jennifer Golbeck (College of Information Studies/ Human-Computer Interaction Lab).\nInformation about the T3 project (Test, Tags, and Trust) can be found at:\nhttp://umiacs.umd.edu/research/t3/\nBio:\nIrene Eleta estudia el doctorado en el College of Information Studies en la Universidad de Maryland (EE.UU.), con el patrocinio de Fulbright y la supervisión de la Dra. Jennifer Golbeck. El acceso a la información en diferentes lenguas es la motivación de sus intereses de investigación y desarrollo profesional; tras su experiencia como traductora profesional, realizó un máster en la Universidad de Sheffield (Inglaterra), donde se interesó en la búsqueda translingual y las bibliotecas digitales multilingües. Su trabajo más reciente en el doctorado investiga la etiquetación social multilingüe de imágenes digitales en museos de arte, en el marco del proyecto T3.",
  "speaker": "SYSTEM",
  "uuid": "1a974b55-959a-4668-95e5-8220df983243"
}