{
  "message": "SYSTEM: CV-Cicyt_Mariano_enero2010.pdf: Página 23\nOtros méritos o aclaraciones que se desee hacer constar \n(utilice únicamente el espacio equivalente a una página). \n \n \nADECUACIÓN A BOLONIA \n\u0001 \nHa formado parte del grupo de formadores de la Universidad San Pablo CEU sobre nuevas metodologías docentes \nadaptadas a la Declaración de Bolonia. Antes de impartir cursos al resto de compañeros fue formado por profesores \nde la Universidad de Harvard. \nPREMIOS \n\u0001 \nPrimer Premio Extraordinario de Tesis de la Facultad de Informática de la Universidad Politécnica de Madrid del \ncurso 2001-2002. \n \n\u0001 \nMención honorífica al mejor libro de texto de la Fundación Universidad Politécnica de Madrid al libro “Ontological \nEngineering”. \n \n\u0001 \nChip de Oro otorgado por Onda Cero Radio en 1997, previo acuerdo con la Comisión Nacional de Apoyo a la \nDivulgación de la Informática, como premio al esfuerzo e interés en apoyo a la divulgación informática. \n \nREVISOR EN REVISTAS JCR \n• \nExpert Systems \n \n• \nKnowledge Engineering Review \n \n• \nInternational Journal of Human Computer Studies (IJHCS). \n \nREVISOR PROYECTOS \n• \nRevisor de la ANEP \n \nCHARLAS POR INVITACIÓN EN CENTROS EXTRANJEROS DE INVESTIGACIÓN \n \n• \nTutorial en la Universidad de Sunderland (Reino Unido) sobre la plataforma WebODE. \n \n• \nPresentación de la Universidad de Sunderland la tesis doctoral del candidato, titulada: “Bi-phase method, based on \nmeta-models, for conceptualising ontologies”. \n \n• \nPresentación en el CNR italiano titulada: “Some relevant results of the Ontology Group of the Laboratory of Artificial \nIntelligence at UPM”. \n \n• \nPresentación en el CNR italiano titulada: “The potential of Formal Ontology in the reuse in knowledge based systems”. \n \n• \nPresentación en el CNR italiano titulada: “Main results of the Mariano Fernandez Lopez’s stay at the LADSEB-CNR”. \n \n \nPARTICIPACIÓN EN REDES TEMÁTICAS DE INVESTIGACIÓN \n \nTítulo de la red: Semantic Web Spain \n \nEntidades participantes: Universidad Politécnica de Madrid (UPM), Universidad de Zaragoza (Unizar), Universidad de \nSantiago de Compostela (USC), Universidad de Murcia, Universidad de Deusto, Universidad Complutense de Madrid, \nUniversidad de Extremadura, Universidad Rey Juan Carlos (URJC), Universidad de Murcia, Universidad de León, Universitat \nJaume I, Universidad de Alcalá, Universidad Carlos III de Madrid, Universidad de Córdoba, Universidad San Pablo CEU \n",
  "speaker": "SYSTEM",
  "uuid": "1b3bbcac-4416-46b3-8689-64bdc102d4df"
}