{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 96\nPage 96 of 111 \nNeOn Integrated Project EU-IST-027595 \n \nFigure 39. Main Scenarios for Building the Invoice Management Ontology Network  \nHere the main activities carried out or to be carried out for building the invoice management \nontology network are explained. These activities are based on the methodological work being done \nin WP5. Some of such activities have been performed following the methodological guidelines \nprovided by WP5. \n¾ Knowledge Acquisition and Ontology Elicitation. The pharmaceutical domain was analysed \nin [30]. In such document a complete description of the pharmaceutical industry and the \ninvoicing requirements has been given. The document also describes how the invoicing \nprocess is done and what actors and requirements are needed. It is important to highlight that \nsuch document also describes what happens to an invoice since it is emitted till the moment it \nis validated by the receiving company, who are the actors that participate in this process, which \nare the requirements of each company in each cluster (laboratories, wholesalers and \nproviders) and how the NeOn technology will be used. \n¾ Ontology Specification. The idea is to specify the needs that the ontology has to satisfy in the \napplication, using competency questions (CQs). Competency questions are questions used \nwhen we want to analyze the need of use ontologies in a certain scenario. These competency \nquestions have been written by ontology engineers to be answered by several domain experts. \nCompetency questions highlight the need of having three different ontologies: one reference \nontology that will integrate all the concepts used in the other two. This reference ontology will \ncontain time concepts, invoicing technology terminology, invoicing concepts and other \ninformation related to the whole invoicing process. The second ontology will contain specific \nconcepts related to the invoicing process followed by each company belonging to a cluster. (A \nlaboratory invoice contains a high number of common concepts with a wholesaler or a provider \ninvoice but it also contains enough different concepts to create a specific ontology for each \ncluster). The third ontology is a customization of the cluster ontology for each company. These \ncompanies will adapt the cluster/sector ontology to their particular needs. \nThe list of competency questions has been included in [31]. \n \n",
  "speaker": "SYSTEM",
  "uuid": "1c403e7c-0a2a-43d2-b23e-26cc3b0c36ab"
}