{
  "message": "SYSTEM: 01.Recopilaci%C3%B3nFuentesInformaci%C3%B3n.pdf: Página 17\nOntologías y la Web Semántica. Práctica 1: Recopilación de Fuentes de Información \n \n \n4. WordNet:. \n- \nhttp://wordnet.princeton.edu/ \n- \nWordNet® es una amplia base de datos léxica del ingles, desarrollada bajo \nla dirección de George A. Miller. Nombres, verbos, adjetivos y adverbios \nson agrupados en conjuntos de igual significado, denominados synsets, cada \nuno de los cuales expresa un concepto distinto. Los synsets se relacionan \nentre sí a través del significado semántico conceptual y del léxico. Esta red \nde significado entre palabras y conceptos puede ser navegada a través de un \nbrowser. \n- \nWordNet está disponible de forma pública por lo que se puede obtener \ndesde la red de manera gratuita. Está formado por un conjunto de \nherramientas para el procesamiento del lenguaje natural y la lingüística \ncomputacional. \n- \nFormatos: aplicación web, Windows (march, 2005) o linux (December, \n2006) aplicación o ficheros en formato texto (December, 2006). \n- \nDescargadas las aplicaciones para windows y linux. \n- \nEstá en proyecto un tesauro multilingüe financiado por la UE y con \nparticipación de universidades españolas como la Uned: EuroWordNet. Se \npuede encontrar en el web de la Universidad de Amsterdam: \n5. EuroWordNet:. \n- \nhttp://www.illc.uva.nl/EuroWordNet/ \n- \nEuroWordNet is es una base de datos multilingüe con  wordnets de muchas \nlenguas europeas (Holandés, Italiano, Español, Alemán, Francés, Checo y \nEstonio). Los wordnets son estructuras similares al WordNet americano \nexplicado anteriormente pero para el inglés ( Princeton WordNet, Miller et \nal 1990) conjuntos de palabras sinónimas con relaciones de semántica \nbásica entre ellos. Cada wordnet expresa un sistema de léxico interno único. \nAdemás, los wordnets están unidos a través de un Inter-Lingual-Index, \nbasado en Princeton wordnet. A través de este índice, los idiomas se \ninterconectan de tal forma que es possible navegar de una palabra en un \nidioma a otra palabra similar en cualquier otro idioma.. El índice permite \n \n17\n",
  "speaker": "SYSTEM",
  "uuid": "1e904204-ff40-47d4-822c-87ad9221f122"
}