{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 21\n19\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nqualified professionals have started to use online engines to create first‐draft translations, which they sub‐\nsequently correct. They can make the corrections in the Google interface, and choose to share that transla‐\ntion back to the platform. \nWhat’s significant about the vast scale of use, particularly by professionals, is that the quality of translations\non these systems is directly proportional (at least in theory) to the quality of the existing translations they’re\nbased on. Anyone can translate two million characters a month at no cost on Bing (that’s hundreds of text\npages), and after that pay only $10 per million characters. The paid Google service costs $20 per million char‐\nacters. While the services are open, and easily linked, the translation data derived from these services\nremains closed and proprietary.\nTranslation is by far the most service‐intensive segment in LT; in the professional market, human translation\nstill rules, though a quiet but pronounced shift to machine translation with post‐editing (analogous to what\nfreelance translators are doing with Google and Bing) is unquestionably underway in the agencies, some of\nwhom are also actively developing their own engines using open‐source software. The cost of human trans‐\nlation without automation is simply unsustainable for most applications.\nPrior to the statistical revolution, machine translation was used minimally and the dominant technology in\nthe market was translator aids, which still have a substantial share of the market. The legacy market in desk‐\ntop translators, the only option for consumers prior to web‐based engines, is also shifting online, though a\nnumber of packaged products are still sold. Next we will see the maturing generation of hybrid engines that\ncombine different techniques, appropriate to different translation requirements.\nAutomatic translation is being embedded in Enterprise applications and services, e.g. in chat rooms for cus‐\ntomer service. The other major trend is the emergence of consumer translator tools (including spoken trans‐\nlation) on mobile devices or in online applications. These systems come and go; most of them use the Google\nTranslate API, though when Google started charging for that service, the field was cleared somewhat. Other\nproducts use their own technology, including the Jibbigo app developed at CMU and Karlsruhe, which is dis‐\ntinctive in delivering automatic spoken translation entirely from the device, without relying on an internet\nconnection.\nDevelopments in China are notable, where nearly 75% of internet users say they use online translation tools\n(that’s nearly half a billion people) and they too are increasingly accessing translation on mobile devices.\nTranslation is the fourth most common application online in China, after shopping, searching, and social net‐\nworking. In the last year translation requests to the Chinese search engine Youdao’s mobile app doubled,\nwhile web‐based requests grew by 30%.\nMajor markets for translation technology:\n• Language Service Providers\n• Large, global Enterprises with substantial internal publishing requirements (particularly technical pub‐\nlishing)\n• Embedded in Enterprise systems\n• Embedded in social software\n• Consumer devices\nMajor gaps and opportunities for translation technology:\n• Coverage for languages that are either poorly handled by current technology, or for which digital\nresources are poor\n• Custom, adapted engines for specific domains (e.g. verticals, comparable to work at the European\nPublications Office)\n• Translation data on open platforms (data services), to continue to reduce cost and handle growing vol‐\n",
  "speaker": "SYSTEM",
  "uuid": "1f838c4e-3e78-4446-a005-3e6f541f414e"
}