{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual24122009 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción semántica a partir de anotaciones\n.\nPersonal en periodo vacacional\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Busqueda de servicios que permitan sugerir palabras (Parecido al Did you mean de los buscadores).\n- Conexion al servicio e implementación en la plataforma.\nTarea 3. Modelo de anotación híbrido\n.\n- Los Gazetteers son uno de los componentes que la herramienta proporciona. Los hay de dos tipos: los predefinidos y los introducidos por los programadores. Estos componentes clasifican las palabras, en general, según estén definidos en ellos. Esta clasificación consiste en dos niveles: major y minor type. Los dos niveles resultan insuficientes en muchos casos para inferir mayor información. A raíz de las limitaciones de los Gazetteers se buscan formas ontológicas: Selección de ontologías en base a posibles temas de interés, tales como geografía, turismo y gastronomía; y los formatos adecuados para el servicio, algunos formatos no aportan toda la información necesaria (rdf vs owl). Las diferencias fundamentales son de expresividad. RDF(S) no permite especificar al nivel de detalle que permite OWL. Por ejemplo, en RDF(S) no existen los cuantificadores universales, no se pueden expresar las restricciones del tipo conjuntos disjuntos, los operadores lógicos tampoco existen y no se pueden establecer relaciones inversas entre las propiedades. Sin embargo, para utilizar dichas ontologías es necesario tener instancias para la correcta aplicación sobre los recursos anotados.\n- Estudio y comparación entre FreeLing y TreeTagger en cuestiones de anotaciones ya que son los que a priori mejores resultados están dando en el idioma español. Además, Gate anexa un plugin para la utilización de TreeTagger. Freeling es un sistema trabajado en el OEG de la UPM. Incorporación de las herramientas en el trabajo de anotación mediante Gate.\n- Solución de los problemas de las librerías del servicio Web.  Las librerías que utiliza Gate  están especificadas en su API, pero es necesario, en cuestiones de programación, la incorporación en el proyecto de las librerías de la herramienta. La migración de una máquina a otra estaba dando problemas. En la máquina en la que corre la aplicación debe estar la herramienta y por tanto, sus librerías.\nInterfaz Anotación Híbrida\n\nTarea 1. Busqueda de Patrones y Codigo PHP\n.\n- Descarga y prueba de codigo php para reutilizar.\nTarea 2. Propuesta de Planificación\n.\n- Desarrollo de una propuesta de planificación para el desarrollo de la interfaz.\nTarea 3. Modelo de Datos\n.\n- Propuesta de un modelo de datos para la interfaz.\nTarea 2.4\n\nFinalización de la fase de instalación de Fura y los agentes necesarios sobre los sistemas operativos Linux y Windows.\nInstalación del SDK y pruebas funcionales de Fura completadas.\nTarea 1.4\n\nReplanificación de tareas a partir de la nueva versión de la ontología de referencia, PhenomenOntology 3.6.\nRegeneración de las pruebas de\nmapeado\ncon las otras fuentes de información y comienzo del análisis manual de los resultados.\nTarea 7.1\n\nContinuación del proceso de mejora - Inclusión de las condiciones \"equals\" & \"match-regexp\" en la codificación de los mappings R2o para generar resultados (RDF) de mayor calidad.",
  "speaker": "SYSTEM",
  "uuid": "1fed2fd2-70ee-491e-b60e-30a35505513d"
}