{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 3\nGu´ıa de orientaci´on para investigadores noveles\n3\n1.\nMotivaci´on de este trabajo\nEl presente trabajo se ha elaborado con el objetivo de servir como una\ngu´ıa de orientaci´on para todas aquellas personas, entre las que me incluyo,\nque comienzan a dar sus primeros pasos en el mundo de la investigaci´on.\nSe han intentado exponer de forma clara conceptos b´asicos que guardan\nrelaci´on con la investigaci´on y la universidad p´ublica que, en ocasiones, las\npersonas que inician su camino en la investigaci´on, y concretamente dentro\ndel ´ambito universitario, desconocen. Cuando uno se adentra en el mundo de\nla investigaci´on, se puede optar por investigar simplemente lo que le guste\nsin ponerse metas y sin pensar en las consecuencias futuras o se puede tomar\nla decisi´on de comenzar una investigaci´on con el objetivo o planteamiento\ninicial de poder beneﬁciarse luego de esa investigaci´on para obtener alguna\nplaza de profesor en la universidad, por ejemplo. A partir de este dilema,\nse plantea este trabajo, que nos servir´a para intentar deﬁnir a priori unos\nposibles “mapas de carreteras” a seguir, y as´ı, poder orientar a un joven\ninvestigador en las decisiones que va a tomar mientras est´a en periodo de\nformaci´on por si, en un futuro, ´este desea poder optar a una plaza como\nprofesor en una determinada universidad. Todo ello con la ﬁnalidad de que,\ndependiendo de cu´ales sean los objetivos del lector, se aproveche al m´aximo\nlas etapas previas a la obtenci´on del t´ıtulo de doctor, para satisfacer dichos\nobjetivos, cuando se trate de hacer carrera profesional en la universidad.\n1.1.\nContenido global del documento\nComo ya se ha dejado entrever, nos vamos a centrar en la carrera in-\nvestigadora dentro del ´ambito universitario y vamos a enmarcarlo dentro de\nlas ense˜nanzas t´ecnicas, concretamente en la Ingenier´ıa en Inform´atica en el\n´area de conocimiento “Lenguajes y Sistemas Inform´aticos1”. Este trabajo se\nha realizado cuando todav´ıa no se ha producido el cambio a los nuevos planes\nde estudios de grado adaptados al Espacio Europeo de Educaci´on Superior\n(EEES), por lo que en un futuro puede que se produzcan modiﬁcaciones\nrespecto a lo comentado aqu´ı. Comenzaremos con una breve introducci´on\nsobre la investigaci´on como salida profesional, para acotar y enmarcar las\nl´ıneas que se pretenden seguir con este trabajo. A continuaci´on, en la secci´on\n3 se expondr´an unas breves pinceladas sobre la universidad como instituci´on\ndocente y centro de investigaci´on y de formaci´on de investigadores. Abar-\ncaremos las etapas iniciales de investigaci´on previas a la presentaci´on de\nla tesis doctoral en la secci´on 4 y las opciones de formaci´on postdoctoral\nexistentes una vez que se est´a en posesi´on del t´ıtulo de Doctor (secci´on 5).\nLa ´ultima parte de este trabajo (secci´on 6) ser´a la m´as extensa y en ella\nse intentar´an explicar, de la manera m´as sencilla posible, cu´ales son los fac-\ntores que intervienen a la hora de poder acceder a un puesto como Personal\n1El c´odigo que identiﬁca este ´area de conocimiento es el 570.\n",
  "speaker": "SYSTEM",
  "uuid": "23634ccc-c695-4ab1-ad48-3f8fc41fb25e"
}