{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 4\n3. reusing and reengineering non-ontological resources \n4. reusing general ontologies \n5. modelling ontologies \nAt the end of each session, participants should perform a global practical training, \nwhich consists on the development of an ontology in the domain selected when the \nrequirements specification activity was performed. It is worth mentioning that the \ntrainers reviewed, corrected, and improved all the ORSDs provided by the \nparticipants; and thus, participants used during the global practical training the \ncorrected ORSD.  \nIn Table 1 you can observe both the domains proposed by the trainers and the \nnumber of ontologies developed by the participants in each session with respect to the \ndomains proposed. As a result of this phase, we obtained 26 ontologies: 11 ontologies \nin session S1 developed with Protégé, 5 ontologies in session S2 developed both with \nProtégé and NeOn Tookit, and 10 ontologies in session S3 built with Protégé and \nNeOn Toolkit.  \nTable 1. Domains proposed and number of ontologies by domains \nDomain \nS1 \nS2 \nS3 \nTotal \nArchitecture \n2 \n \n \n2 \nArt \n2 \n \n \n2 \nBiological organisms \n \n \n1 \n1 \nCommunity Services \n4 \n \n \n4 \nElectronic devices \n \n1 \n \n1 \nFood \n \n \n2 \n2 \nFootball \n \n1 \n2 \n3 \nGeography \n2 \n \n \n2 \nJudo \n \n \n1 \n1 \nMovies \n \n1 \n \n1 \nMusic \n \n \n1 \n1 \nPersonality \n1 \n \n \n1 \nReligion \n \n \n1 \n1 \nTheatre \n \n \n1 \n1 \nTraveling \n \n1 \n \n1 \nVehicles \n \n1 \n1 \n2 \nTotal \n11 \n5 \n10 \n26 \n3.1.2   Ontology Analysis Approach \nThe focus of the ontology analysis performed with the 26 ontologies, obtained in the \nglobal practical training explained in Section 3.1.1, was on the following dimensions: \nstructural, functional, and usability-profiling [4]. The analysis was carried out by \nmanually inspect each ontology with respect to the following aspects: \n \nModelling issues. This aspect refers to the structural dimension. In this sense \nwe analyzed modelling decisions taken by participants paying particular \nattention to whether they could be improved.  \n",
  "speaker": "SYSTEM",
  "uuid": "254d24da-efd8-41e6-94df-64b3192deede"
}