{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 2\nprocesses, interoperability and reconciliation of local professional profiles and \ntaxonomies, semantically enabled web services for distributed knowledge access and \nsharing. The SEEMP project relies on WSMO [4] that permits to semantically \ndescribe Web Services, ontologies and mediators. WSML [3] is the concrete language \nused in SEEMP for encoding those descriptions. For this purpose, the resultant \narchitecture will consist of: a Reference Ontology, the core component of the system, \nthat acts as a common “language” in the form of a set of controlled vocabularies to \ndescribe the details of a job posting or a CV (Curriculum Vitae); a set of local \nontologies, so that each ES uses its own local ontology, which describes the \nemployment market in its own terms; a set of mappings between each local ontology \nand the Reference Ontology; and a set of mappings between the ES schema sources \nand the local ontologies [5]. \nA major bottleneck towards e-Employment applications of Semantic Web \ntechnology and machine reasoning is the lack of industry-strength ontologies that go \nbeyond academic prototypes. The design of such ontologies from scratch in a \ntextbook-style ontology engineering process is in many cases unattractive for two \nreasons. First, it would require significant effort. Second, because the resulting \nontologies could not build on top of existing community commitment. Since there are \nseveral human resources management standards, our goal is not to design human \nresources ontologies from scratch, but to reuse the most appropriate ones for public e-\nEmployment services developed on the framework of the SEEMP project. In this \npaper we present the methodological approach we followed for reusing existing \nhuman resources management standards like NACE2 (Statistical Classification of \nEconomic Activities in the European Community), ISCO-88 (COM)2 (International \nStandard Classification of Occupations, for European Union purposes) and FOET2 \n(Classification of fields of education and training), among others.  \nThis paper is organized as follows: Section 2 presents some related work. Next \nsection 3 explains the adopted methodological approach to build the SEEMP \nReference Ontology from standards/classifications and already existing ontologies, \nand then in section 4 an overall perspective of the resultant SEEMP Reference \nOntology is shown. Then section 5 describes some considerations with respect to the \nbuilding process of the local ontologies taking as starting point the Reference \nOntology and the ES data sources. Finally, section 6 offers some final conclusions, \nand poses the future work that, among other things, will serve to validate the ideas \nproposed in this paper. \n2 Related Work \nCurrently the Human Resource Semantic Web applications are still in an experimental \nphase, but their potential impact over social, economical and political issues is \nextremely significant.  \nCOKE is described in [9], a three-level ontology containing a top-level Human \nResources ontology, a middle-level Business Process ontology and a lower-level \nKnowledge Objects ontology. PROTON (PROTO-Ontology), a 4-level ontology \n                                                           \n2 Available through RAMON Eurostat's Classifications Server at http://ec.europa.eu/comm/eurostat/ramon/ \n",
  "speaker": "SYSTEM",
  "uuid": "25adc9fb-acc6-4418-8f79-f3502b0fd64c"
}