{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 19\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97744\ny si fueran varios, por separado pero siempre dentro de los plazos establecidos de \npresentación de solicitudes o en el de subsanación cuando se requiera al candidato.\nArtículo 30.  Documentación y plazo de presentación de solicitudes.\n1.  El plazo de presentación de solicitudes será de veinte días naturales contados \ndesde el día siguiente de su publicación en el BOE.\n2.  Los candidatos sólo podrán presentar una solicitud. La presentación de dos o más \nsolicitudes invalidará todas las presentadas por el mismo candidato.\n3.  El formulario de solicitud estará disponible en la dirección electrónica http://web.\neducación.es. Una vez debidamente cumplimentado el formulario en todos sus apartados \na través de los medios telemáticos habilitados para ello en la citada página Web, se deberá \nconfirmar y enviar los siguientes archivos en formato electrónico:\na)  Currículum vitae del candidato, con un máximo de mil palabras. En el caso de \nhaber obtenido Premio extraordinario fin de carrera concedido por el Ministerio de \nEducación, deberá señalarse debidamente mediante referencia a la publicación oficial de \nsu concesión.\nb)  Memoria del proyecto formativo que incluya la tesis doctoral, con un máximo de \ntres mil palabras,\nc)  Informe del director o los directores de la tesis sobre el programa de doctorado que \nvaya a cursar o curse el solicitante y su adecuación con el proyecto propuesto.\nd)  Currículum vitae del director de la tesis en el modelo de impreso normalizado o \nadaptación del mismo.\ne)  Historial científico de los últimos cinco años del grupo investigador receptor. A \nefectos de la presente convocatoria, se entenderá por grupo investigador, constituido \nformal o informalmente, a la persona o personas que colaboran como investigadores en un \nproyecto de I+D o línea de investigación determinada, constatable por las colaboraciones \nrealizadas o en ejecución, y que quedan comprometidas en participar en el desarrollo del \nprograma de formación del becario.\n4.  Una vez confirmado el envío telemático de la solicitud y de los cinco archivos de \nlos documentos electrónicos señalados en el punto anterior, se deberá imprimir la solicitud \ny presentarla firmada por el interesado y el director de la tesis por el procedimiento indicado \nen el artículo 22, acompañada de los originales o fotocopias compulsadas de los \ndocumentos que se relacionan a continuación.\na)  Fotocopia del Documento Nacional de Identidad o su equivalente en caso de \nciudadanos de la Unión Europea y tarjeta de residente en vigor para ciudadanos de países \nno comunitarios. En el caso de los estudiantes extranjeros no comunitarios que no estén \nen posesión del NIE, pasaporte y acreditación de domicilio en España mediante inscripción \nen el padrón municipal.\nb)  Certificación académica personal, en la que consten todas las asignaturas \nsuperadas, con sus créditos, las calificaciones obtenidas, el curso académico y la nota \nmedia del expediente. El certificado debe expresar que el conjunto de asignaturas y \ncréditos cursados constituyen la licenciatura o su equivalente y que el solicitante queda \nfacultado para acceder a los estudios de doctorado o de posgrado, en función de la \nordenación académica por la que inicie los estudios.\nEn el caso de los estudios realizados parcial o totalmente en el extranjero, el certificado \ndel expediente académico u otro acompañando al mismo, recogerá cuáles son las \ncalificaciones máxima y mínima dentro del sistema de evaluación correspondiente; del \nmismo modo, se hará constar cuál es la calificación mínima necesaria para aprobar. En el \ncaso de las certificaciones académicas extendidas en un idioma distinto del español habrán \nde acompañarla de la correspondiente traducción jurada o traducción certificada por el \nDirector del programa de doctorado de la universidad española a la que vaya a incorporarse \nel candidato.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "277199f2-e6c0-43ae-ab38-694526437417"
}