{
  "message": "SYSTEM: TKE_2008-bnm-het-paper.pdf: Página 14\nBodil Nistrup Madsen & Hanne Erdman Thomsen  \n \n14\n \nconcerning the two concepts concept modelling and conceptual data model-\nling. Furthermore, the concept ontology is often used for a conceptual data \nmodel in the literature on ontologies; cf. Gómez-Pérez et al. (2004: 22) and \nMadsen, Thomsen, Vikner (2005). \nIn the above example all three concepts of the ontology in Figure 10 give \nrise to classes in the data model in Figure 11. However, this is not always the \ncase. An ontology for terminological information categories may comprise \nthe concept “extension”, but it will not be relevant to include e.g. a class “Ex-\ntension” in a data model for a terminological database.  Other concepts of the \nontology will not give rise to classes in the data model, but rather attributes or \neven values of attributes. For example, the concept “delimiting characteristic” \nwill not give rise to a class in a data model, but rather correspond to an attrib-\nute, which belongs to a class “Concept”, or maybe it will be a value of an at-\ntribute “type of characteristic”. \nIn our opinion the distinction between concept model and conceptual data \nmodel is very important, and our recommendation is that the development of \na conceptual data model should always be preceded by the elaboration of a \nconcept model (ontology). This is the most systematic method for clarifying \nthe meaning of the concepts underlying the data model, and to obtain a com-\nmon understanding of the types of information, that will be handled by the IT \nsystem. \n \nConclusion \n \nIn our paper we have argued that when clarifying concepts with a view to \nsetting up an ontology it is an advantage to use terminological principles, \nwhich makes use of feature specifications and subdivision criteria, and which \nadheres to the principles concerning the rules for polyhierarchy. \n We have used these principles to describe examples of the categorization \nof ontologies made by various authors, and have demonstrated that this may \nhelp in getting a better overview of different author’s understanding of on-\ntologies. \nWe have given a first draft of a part of an ontology of ontologies that \nmakes use of the terminological principles, and we have compared this draft \nontology with the description of ontologies presented by other authors. \nFrom our description it may be concluded that it is a good solution to de-\nscribe each concept by means of one characteristic, which means that the \nconcepts may be grouped according to one subdivision criterion. This allows \nfor introducing polyhierarchy, where one concept may be a subconcept of \nseveral superordinate concepts, and therefore inherit characteristics from all \nsuperordinate concepts. \n",
  "speaker": "SYSTEM",
  "uuid": "28813f0b-3b25-4017-85c0-7127208395c4"
}