{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Carlos%27_Tasks/GSoCApplication \n\nContents\n[\nhide\n]\n1\nGoogle Summer of Code Application\n1.1\nGeneral Information\n1.2\nBackground\n1.3\nProjectGoals\n1.4\nProject Description\n1.5\nYour skill set\n1.6\nReferences\nGoogle Summer of Code Application\n\nhttp://socghop.appspot.com/gsoc/org/show/google/gsoc2010/omii_uk\nGeneral Information\n\nTitle for your Project: SPARQL-DQP\nStudent Name: Carlos Buil Aranda\nStudent Email: cbuil@fi.upm.es\nPrimary Mentor: Bartosz Dobrzelecki (bartosz@epcc.ed.ac.uk)\nSecondary Mentor: Steven Lynden (steven.lynden@aist.go.jp)\nOMII-UK Connection: OGSA-DAI/DQP\nBackground\n\nMy name is Carlos Buil-Aranda and I'm a PhD student at the Ontology Engineering Group, at the Universidad Politécnica de Madrid (Spain). My PhD is topic is about federation and access optimisation of RDF datasets by means of SPARQL. Currently there are almost no systems that allow users to query a set of RDF repositories (by means of SPARQL endpoints). Some of the current approaches are [1], [2], [3] or [4] but the optimisations offered by them are very basic. As part of my PhD thesis I extended OGSA-DAI, a data access, integration and sharing tool developed in the context of the OMII-UK project with a new data resource. This data resource (data abstraction) to accesses RDF datasets using SPARQL. I also extended OGSA-DQP with SPARQL so now it is possible to federate access to several SPARQL endpoints. OGSA-DQP now is able to process a SPARQL query to a set of SPARQL endpoints, partition it to send the subqueries to the specified SPARQL endpoints and optimise its access. Finally a data workflow to these SPARQL endpoints is created and executed.\nI also work in the ADMIRE project (\nhttp://www.admire-project.eu/\n) working in the ontological representation of the ADMIRE elements. Previously to start my PhD I worked at iSOCO (Intelligent Software Components)for almost three years as researcher. I worked mainly in research projects like Ontogrid (\nhttp://www.ontogrid.net\n) or NeOn (\nhttp://www.neon-project.org\n) and commercial projects related with ontologies RDF, the Semantic Web and Web services.\nProjectGoals\n\nI have three goals for the GSoC:\nFirst, to improve the efficiency of SPARQL-DQP. Currently its performance can be improved and this is one of the first things to improve if I want to demonstrate that it is possible to use SQL optimisers and DQP techniques to SPARQL.\nSecond, to implement specific SPARQL optimisers (or adapt existing SQL ones) for SPARQL-DQP and demonstrate that it is possible to use SQL operators, optimisers and systems for processing SPARQL queries.\nThird, contribute and integrate the code that I have developed as a PhD student into the OGSA-DAI project. Currently, part of the code already developed (the new RDF data resource) is available at the OGSA-DAI sourceforge SVN.\nProject Description\n\nCurrently I have developed two extensions to OGSA-DAI/DQP:\nThe first extension is a new data resource that accesses RDF datasets using SPARQL (available at\nhttp://sourceforge.net/projects/ogsa-dai/\nand in process of being included in one of the next releases). This extension is composed by a new data resource + supporting activities. These new activities will allow users to integrate the SPARQL query results to other OGSA-DAI workflows since the results are converted to the OGSA-DAI tuples format.\nThe second existing extension is an extension to OGSA-DQP. Using the previous RDF data resource we extended OGSA-DQP with SPARQL. Now OGSA-DQP accepts a SPARQL query, process it, creates a workflow and applies the existing optimisers (one specific for SPARQL which accesses RDF datasets and two others from OGSA-DQP). Not all the SPARQL language is covered by the tools, currently only part of the SELECT operation.\nThe project will consist in first improving the performance of the existing system and complete the most important missing elements of the SPARQL language. The second part will be devoted to adapt existing OGSA-DQP (SQL) optimisers for SPARQL-DQP. Currently there only exist one specific optimiser for SPARQL. This optimiser is the RDFTableScanImplosion optimiser which creates the most concrete query to a RDF dataset possible. In this second goal it would be studied the validity of using existing OGSA-DQP optimisers and adapt them for the SPARQL semantics.\nYour skill set\n\nHigh level knowledge of Java. All the projects I have worked in had developments in Java. High level of knowledge of RDF, RDF(S), OWL, SPARQL, reasoners and other Semantic Web related technologies. Experience in ontology development environments like Protégé, NeOn toolkit, Swoop or TopBraid composer. Experience in other development environments like Eclipse or Netbeans. Experience in Web and Grid services (I have collaborated with the OGF's DAIS-WG), Globus toolkit, Axis, JAX-WS, etc. I also have the following publications [5], [6], [7] and [8].\nReferences\n\n[1]\tHartig O, Bizer C, Freytag JC (2009) Executing SPARQL Queries over the Web of Linked Data. Proceedings of the 8th International Semantic Web Conference (ISWC2009)\n[2] Langegger A, Wöß W, Blöchl M (2008) SemWIQ – Semantic Web Integrator and Query Engine. In Lecture Notes in Informatics, International Applications of Semantic Web Workshop (AST'08), Gesellschaft für Informatik, Bonn\n[3] Quilitz B, Leser U (2008) Querying distributed RDF data sources with SPARQL. In: Proceedings of the 5th European Semantic Web Conference (ESWC2008). LNCS 5021:524-538. Springer-Verlag\n[4] Schenk S, Staab S (2008) Networked graphs: a declarative mechanism for SPARQL rules, SPARQL views and RDF data integration on the Web. In Proc. of the International World Wide Web Conference (WWW2008), pp. 585–594\n[5] C. Buil-Aranda, O. Corcho, A. Krause., Robust service-based semantic querying to distributed heterogeneous databases, 8th International Workshop on Web Semantics - WebS '09\n[6] J.J. Valverde, J.M. Gómez, C. Buil-Aranda. WEASEL: Vodafone Corporate Semantic Web. 1st European Semantic Technology Conference 2007. (\nhttp://www.w3.org/2001/sw/sweo/public/UseCases/Vodafone-es/\n).\n[7] M. Dzbor, E. Motta, C. Buil Aranda, J.M. Gomez, O. Goerlitz, and H. Lewen. Developing ontologies in OWL: An observational study. Online Proceedings of the Workshop on OWL: Experiences and Directions 2006.\n[8] Sari E. Hakkarainen and Anders Kofod-Petersen and Carlos Buil Aranda. Situated Support for Choice of Representation. In: Proc. of WI-2005 – Web Intelligence Conference, Springer, LNCS.",
  "speaker": "SYSTEM",
  "uuid": "2943b212-addb-4bcc-8cfb-4e90e3739638"
}