{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/EKAW2010 \n\nVolver a semanticweb\n17th International Conference on Knowledge Engineering and Knowledge Management EKAW 2010\nLisbon, Portugal,\nhttp://ekaw2010.inesc-id.pt\n<\nhttp://ekaw2010.inesc-id.pt\n>\nThe 17th International Conference on Knowledge Engineering and Knowledge Management is concerned with all aspects of eliciting, acquiring, modeling and managing knowledge, and its role in the construction of knowledge-intensive systems and services for the semantic web, knowledge management, e-business, natural language processing, intelligent information integration, etc.\nThe focus of the 17th edition of EKAW will be on \"Knowledge Management and Engineering by the Masses\".\nCall for paper in PDF available at\nhttp://ekaw2010.inesc-id.pt/docs/cfpEkaw2010.pdf\n<\nhttp://ekaw2010.inesc-id.pt/docs/cfpEkaw2010.pdf\n>\nImportant dates\nSubmission: 19th of March 2010\nNotification: 14th of May 2010\nCamera Ready: 11th of June 2010\nOrganizing Committee\nGeneral and PC chairs:\no Sofia Pinto (INESC-ID, Lisbon)\no Philipp Cimiano (CITEC, Universität Bielefeld)\nWorkshop chair: Siegfried Handschuh (DERI, NUI Galway)\nTutorial chair: Victoria Uren (University of Sheffield)\nDemonstration chairs:\no Oscar Corcho (UPM, Madrid)\no Johanna Völker (University of Mannheim)\nThe proceedings of the conference will be published by Springer Verlag in the LNCS series. The LNCS volume will contain contributed papers.\nEKAW 2010 will also feature a tutorial and workshop program, as well as a poster and demo track. Poster/demo notes and workshop/tutorial notes will be published separately in a companion booklet.\nPaper submission and reviewing for EKAW 2010 will be electronic via the EasyChair conference submissions site. Submissions should be 15 pages long (max) formatted according to Springer Verlag LNCS guidelines.\nEKAW 2010 welcomes papers dealing with theoretical, methodological, experimental, and application aspects. In particular, but not exclusively, we solicit papers about methodologies, models, and tools for the following topics:\n1) Knowledge Management\nMethodologies and tools for knowledge management\nAspects of collaboration, distribution and evolution of knowledge in KM\nAdvanced knowledge modeling languages and tools\nBest practices / experiences in KM\nFoundations of KM\nEntity-oriented approaches to KM\nLayered intelligence in knowledge management\nProvenance, reliability and trust in knowledge management\nKnowledge management for collaboration and decision support\nMethods for accelerating take-up of KM technologies\nCorporate memories for KM\nCase-based reasoning for KM\n2) Knowledge Engineering and Acquisition\nMethodologies for knowledge engineering\nKnowledge acquisition, ontology learning\nKnowledge sharing\nKnowledge evolution\nCollaborative knowledge engineering\nDesign patterns\nTechniques for knowledge acquisition based on machine learning, NLP etc.\nUncertainty and vagueness in knowledge modeling\nKnowledge engineering and software engineering\nOntology localization\nOntology alignment\nEvolution of knowledge (including ontology evolution)\nKnowledge acquisition from non-ontological resources (thesauri, folksonomies, lexica etc.)\nKnowledge acquisition and knowledge integration from heterogeneous sources (multimedia and 3D data, databases, sensor data streams, social interaction data)\nKnowledge authoring and knowledge markup languages\nOntology evaluation\nDynamic, distributed and process knowledge (including web services, grid services, P2P systems, rules and business processes, problem solving methods, procedural knowledge)\nAgent-based approaches to knowledge management\nKnowledge mashups\n3) Knowledge In Use:\nknowledge management and engineering for\nRetrieval and proactive delivery of pertinent knowledge\nMultimedia applications\nLife and E-sciences\nE-Government and public administration\nHealth and medicine\nAutomotive and manufacturing industry\nSemantic desktop applications\nThe legal domain\nCultural heritage applications\nDigital broadcasting and film, game and 3D media content production and sharing\nDigital libraries\nVirtual worlds\nStorytelling\nManagement in critical applications\nOrganizing user-contributed content\nTransition across organizations\n4) Social and Cognitive Aspects of Knowledge Engineering\nSustainability and cost analysis of knowledge engineering\nHuman-knowledge interaction\nCognitive systems and knowledge engineering\nKnowledge ecosystems\nKnowledge and social network analysis & modeling\nKnowledge in trust networks\nPersonal sphere in knowledge engineering and management\nCollaborative and social approaches to knowledge management and acquisition\n5) Special focus knowledge management and engineering by the masses\nHuman-machine synergy in knowledge acquisition\nIncentives for knowledge creation and semantic annotation\nEnhancing human productivity (e.g. knowledge workers)\nSocial and human factors in knowledge management\nCollective and collaborative intelligence in knowledge management\nSocial tagging and folksonomies, social networks\nWeb2.0 approaches to KM (including semantic wikis, folksonomies, etc.)\nGames with a Purpose and KM\nLinked Open Data / Web of Data\nAs an important difference to earlier conferences, EKAW will accept different types of papers. The papers will all have the same status and follow the same formatting guidelines in the proceedings but will receive special treatment during the reviewing phase. In particular, each paper type will be subject to own evaluation criteria. The PC will also make sure that there is a reasonable balance of the paper types accepted.\nAt submission time the paper has to be clearly identified as belonging to one of the following categories.\nA) Standard research papers\nThese are \"standard\" papers presenting a novel method, technique or analysis with appropriate empirical or other types of evaluation as proof-of concept. The main evaluation criteria here will be originality, technical soundness and validation.\nB) In-use papers\nHere we are expecting papers describing applications of knowledge management and engineering in real environments. Applications need to address a sufficiently interesting and challenging problem on real and large datasets, involving many users etc. The focus is less on the originality of the approach and more on presenting real, large-scale and complex systems that solve a significant problem. Technical details to understand how the problem is solved are required. Evaluations should involve real users of a system rather than representing a pure academic exercise.\nThe papers will be evaluated according to the significance and practical relevance of the described research as well as with respect to the technical soundness of the described solution and accompanying evaluation.\nC) Problem Analysis papers\nWe invite researchers to also publish problem analysis papers which do not present any novel method, technique or approach to solving a problem, but help to understand the problem itself. Understanding the characteristics of a problem itself is an important task in research and can benefit many people working on the same or at least similar problems. We expect in-depth discussions and analysis of a certain phenomenon or problem, with clear definitions as well as qualitative and quantitative analyzes of the main characteristics of the problem. We also expect a reasonable review of the state-of-the-art stating in how far current solutions fall short. Papers will mainly be evaluated with respect to how general and technically sound their problem analysis is and how useful it will be for other researchers working on the same problem. We expect that such papers will guide future research by highlighting critical assumptions, motivating the difficulty of a subproblem or explaining why current techniques are not suficient, all corroborated by quantitative and qualitative arguments. Evaluation criteria will also include appropriate categorization of the problem area and description of present solutions and approaches; and appropriate description of the limitations of the present solutions and approaches.\nD) Validation papers",
  "speaker": "SYSTEM",
  "uuid": "2b63808f-369e-457b-b20e-6c2339fe05f1"
}