{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 166\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n172\n225.- Sumarios IME-Biomedicina. Instituto de Historia de la Ciencia\ny la Documentación López Piñeiro (IHCD)\nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do?tabla=docu&bd=\nIME&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple y avanzada\nMateria: Sanidad.\nDescripción y comentarios: Referencias de artículos de revistas científicas de biomedici-\nna editadas en España. Base de datos de sumarios. \n226.- Sumarios ISOC. Consejo Superior de Investigaciones Científicas (CSIC)\nDirección Web:\nhttp://bddoc.csic.es:8080/inicioBuscarSimple.do;jsessionid=FC72D40D9F4484F57C444\n6AB7B9E9E5A?tabla=docu&bd=ISOC&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple y avanzada\nMateria: Ciencias sociales y humanidades.\nDescripción y comentarios: Referencias a artículos sobre CC. Sociales y Humanidades.\nTipología: Base de datos referencial y bibliográfica que fundamentalmente recoge referen-\ncias de artículos publicados en revistas españolas del ámbito de las ciencias sociales y\nhumanas. Cobertura temática: Antropología, Arqueología, Bellas Artes, Biblioteconomía\ny Documentación, CC. Políticas, Derecho, Economía, Educación, Filosofía, Geografía,\nHistoria, Lingüística, Literatura, Psicología, Sociología, Urbanismo y América Latina.\nFuentes: 2.288 publicaciones periódicas editadas en España especializadas en estas áreas,\nfundamentalmente revistas, además de monografías, actas de congresos, informes y tesi-\nnas. Crecimiento anual: 23.000 referencias. Periodo de cobertura: Aunque en alguna mate-\nria recoge información desde 1960, esta base cubre desde 1975 hasta la actualidad, con una\nactualización diaria. Volumen : 532.268 registros. La base de datos ISOC se puede consul-\ntar completa o por áreas temáticas. \nBASES DE DATOS  1/1/04  03:39  Página 172\n",
  "speaker": "SYSTEM",
  "uuid": "2ba68ef0-8d6f-402d-88fb-5ca3bd8e5ac8"
}