{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 14\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97739\nmemorias que para cada caso recoge las presentes bases o de los informes de seguimiento \ny de documentación adicional, conllevará la devolución de las cantidades percibidas por el \nperíodo no justificado.\ne)  En ningún caso podrán concederse ayudas a quienes no hubieran justificado las \npercibidas con anterioridad.\nf)  El incumplimiento de las medidas de difusión establecidas, en los términos del \nartículo 31.3 del reglamento de la Ley General de Subvenciones, será causa del reintegro \nparcial del importe asociado a dicho incumplimiento.\ng)  La no declaración de haber disfrutado de cualquier otra ayuda o beca de análoga \nnaturaleza o falsear los datos de la misma será causa del reintegro parcial o total del \nimporte asociado a dicho incumplimiento, y en su caso, de pérdida del derecho al cobro de \nlas cantidades pendientes de percibir.\nArtículo 20.  Régimen jurídico.\nLa presente convocatoria se regirá por lo dispuesto en:\na)  Ley 13/1986, de 14 de abril, de Fomento y Coordinación General de la Investigación \nCientífica y Técnica (BOE del 18 de abril).\nb)  Ley 30/1992, de 26 de noviembre, de Régimen Jurídico de las Administraciones \nPúblicas y del Procedimiento Administrativo Común (BOE del 27 de noviembre), en su \nredacción dada por la Ley 4/1999 (BOE 14 enero).\nc)  Ley Orgánica 6/2001, de 21 de diciembre, de Universidades (BOE de 24 de \ndiciembre), en su redacción dada por la Ley Orgánica 4/2007, de 12 de abril, por la que se \nmodifica la Ley Orgánica 6/2001, de 21 de diciembre, de Universidades (BOE de 13 de \nabril).\nd)  Ley 38/2003, de 17 de noviembre, General de Subvenciones (BOE del 18 de \nnoviembre).\ne)  La Ley 47/2003, de 26 de noviembre, General Presupuestaria (BOE de 27 de \nnoviembre).\nf)  Real Decreto 1497/1987, sobre obtención y homologación de títulos universitarios \n(BOE de 14 de diciembre), modificados parcialmente en el párrafo segundo del apartado 1.5 \ndel anexo I, por el Real Decreto 1044/2003, de 1 de agosto.\ng)  Real Decreto 778/1998, de 30 de abril, por el que se regula el tercer ciclo de \nestudios universitarios, la obtención y expedición del título de Doctor y otros estudios de \nposgrado (BOE de 1 de mayo).\nh)  Real Decreto Real Decreto 56/2005, de 21 de enero, por el que se regulan los \nestudios universitarios oficiales de Posgrado (BOE de 25 de enero).\ni)  Real Decreto 1509/2005, de 16 de diciembre, por el que se modifican el Real \nDecreto 55/2005, de 21 de enero, por el que se establece la estructura de las enseñanzas \nuniversitarias y se regulan los estudios universitarios oficiales de grado y el Real Decreto \n56/2005, de 21 de enero, por el que se regulan los estudios universitarios oficiales de \nPosgrado (BOE de 20 diciembre).\nj)  Real Decreto 1393/2007, de 29 de octubre, por el que se establece la ordenación \nde las enseñanzas universitarias oficiales (BOE de 30 de octubre).\nk)  Real Decreto 63/2006, de 27 de enero, por el que se aprueba el Estatuto del \npersonal investigador en formación (BOE de 3 de febrero).\nl)  Real Decreto 542/2009, de 7 de abril, por el que se reestructuran los departamentos \nministeriales («Boletín Oficial del Estado» de 7 de abril).\nm)  Real Decreto 1086/2009, de 3 de julio, por el que se modifica y desarrolla la \nestructura orgánica básica del Ministerio de Educación («Boletín Oficial del Estado» de 7 \nde julio).\nn)  Orden ECI/3769/2006, de 4 de diciembre, por la que se establece la adecuación \nde las bases reguladoras de las convocatorias de ayudas gestionadas por la Dirección \nGeneral de Universidades, en el marco del Real Decreto 63/2006, por el que se aprueba \nel Estatuto del personal investigador en formación (BOE de 12 de diciembre).\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "2e2fe785-6aa0-4e40-88f1-8854f24d5503"
}