{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ModelosRazonamiento-12-13 \n\nLas clases de teoría se imparten los viernes de 10:00 a 12:00, en la sala 3103. La clase de los miércoles es de tutoría individualizada o en grupo, y se realiza a demanda de los alumnos, simplemente enviando un correo electrónico al profesor correspondiente con anterioridad.\n26/09/2012:\nPresentación de la asignatura\nBLOQUE 1. Razonamiento con taxonomías\n\nReferencias bibliográficas de razonamiento con taxonomías:\nGómez-Pérez A, Fernández-López M, Corcho O.  Ontological Engineering. Springer-Verlag, 2003.\nBaader F, Calvanese D, McGuinness D, Nardi D, Patel-Schneider P. The Description Logic Handbook: Theory, Implementation and Applications. Cambridge University Press, 2003\nClases\n28/09/2012. Introducción a los formalismos de representación de conocimientos (Oscar Corcho).\nTransparencias\n05/10/2012. Introducción a la lógica descriptiva (Oscar Corcho).\nTransparencias\n19/10/2012. Ejercicios de formalización de lógica descriptiva (Oscar Corcho)\nEjercicios\nEjemplo de formalización\n26/10/2012. Ejercicios de formalización y razonamiento con lógica descriptiva (Oscar Corcho)\nEsqueletoDataCenter\nDataCenterCasiTerminado\n2/11/2012. Modularización y depuración en lógica descriptiva (Oscar Corcho)\nTransparencias\nEjemplo a depurar en el dominio de la Informática\nPráctica\nFecha de entrega: final de marzo 2013, aunque se recomienda hacer alguna entrega intermedia.\nDescripción\nOntologías\nBLOQUE 2. Razonamiento cualitativo\n\nProfesores\nJorge Gracia (jgracia at fi.upm.es) Horario de consultas: jueves 12:00-13:00 y viernes 12:00-13:00 (avisar con antelación)\nEsther Lozano (elozano at fi.upm.es) Horarios de consultas: jueves 15:00-16:00 y viernes 15:00-16:00 (avisar con antelación)\nReferencias bilbiográficas\nForbes, K., Qualitative Reasoning. CRC Handbook of Computer Science, 1996\nDynalearn website\nMateriales\nIntroducción\nal sistema DynaLearn de razonamiento cualitativo\nEjercicios\nde DynaLearn (I)\nSolución\na los Ejercicios de DynaLearn (I)\nEjercicios\nde DynaLearn (II)\nSolución\na los Ejercicios de DynaLearn (II)\nInstalador\nde la última versión de DynaLearn\nPara usuarios Linux: es necesario instalar\nSWI-Prolog 6.2.x\nvía package manager.\nVocabulario QR\nClases\n16/11/2012. Introducción al razonamiento cualitativo y a DynaLearn\n23/11/2012. Modelos de razonamiento cualitativo; ejercicios de DynaLearn (I)\n30/11/2012. Ejercicios de DynaLearn (resolución de dudas)\n14/12/2012. Grounding semántico de modelos; ejercicios de DynaLearn (II)\n21/12/2012. Teachable agent; ejercicios de DynaLearn (III)\n11/01/2013. Práctica de DynaLearn (resolución de dudas)\n18/01/2013. Presentación de las prácticas.\nPráctica\nFecha de entrega: 15/01/2013\nENUNCIADO: Inspirándose en cualquiera de los modelos que se han visto en la asignatura (competing processes, agent colonisation, ...), hay que\nimaginar un problema de razonamiento cualitativo\nque pueda ser resuelto por una versión adaptada de dicho modelo. El tema es completamente libre y el problema puede ser de cualquier dominio (ecología, ingeniería, sociedad, física,...). Puede hacerse individualmente o por parejas.  Durante la clase de enero de 2013 habrá una presentación de cada una de los modelos realizados por parte de sus autores (máximo 10 minutos cada uno). Se valorará: la originalidad del enunciado propuesto, su adecuación como problema de razonamiento cualitativo y el dominio de los ingredientes básicos de modelado (entities, configurations, quantities, quantity spaces, proportionalities, influences, etc.). Fecha de entrega: antes del 15/01/2013 por email a los profesores Jorge Gracia y Esther Lozano. Se entregará:\n1. Descripción: documento de como máximo una página que contenga: título del problema, autor/es de la práctica, un breve enunciado planteando el problema y un breve análisis de las principales características del modelo que habéis hecho para representarlo.\n2. Modelo: fichero del modelo de DynaLearn construido. Se tiene que haber hecho el grounding semántico del mismo (el feedback semántico no).",
  "speaker": "SYSTEM",
  "uuid": "30a3dd99-932d-4a9d-9e60-d47896ffb8d5"
}