{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/URI-guidelines \n\nDefinitions and General Principles\n\n@@@ TODO: Trim this! This section has too much URI tutorial material. Present the Linked Data principles with a bit of relevant context, period... @@@\nThe Web makes use of the URI (Uniform Resource Identifiers) as a single global identification system. The global scope of URIs promotes large-scale \"network effects\". There are many benefits to participating in the existing network of URIs, including linking, caching, and indexing by search engines. This section aims at providing recommendations on how to create good URIs for use in government linked data:\nIdentify with URIs\nTo benefit from and increase the value of the World Wide Web, data publishers SHOULD provide URIs as identifiers for their resources.\nA URI can identify any resource or \"thing\" some examples are:\nVocabulary elements\nAgencies\nDatasets\nPeople\n..\nA URI is an identifier consisting of a sequence of characters matching the syntax defined in [URI], each URI begins with a scheme name that refers to a specification for assigning identifiers within that scheme. There exist several URI schemes (e.g. http, ftp, mailto, etc.) However, when publishing linked data it is highly recommended to use \"http\" as URI scheme.\nUsing \"http\" URI scheme means creating URIs that start with \"http\" and that are conformant to both [RFC2616] and [URI]. In this section, we will use the term HTTP URIs to refer to \"http\" scheme URIs. As stated in [LDPrinciples], using HTTP URIs could enable people to \"look-up\" or \"dereference\" a URI in order to access a representation of the resource identified by that URI:\nUse HTTP URIs\nTo benefit from and increase the value of the World Wide Web, governments and agencies SHOULD provide HTTP URIs as identifiers for their resources.\nA URI that returns a representation of the resource it identifies, is often referred to as a \"dereferenceable\" or \"resolvable\" URI. Minting HTTP URIs does not guarantee that the URIs are \"dereferenceable\". In order to enable HTTP URIs to be \"dereferenced\", data publishers (URI owners?) have to set up the neccesary infraestructure elements (e.g. TCP-based HTTP servers) to serve representations of the resources they want to make available.\nA URI owner (data publisher?) may supply zero or more representations of the resource identified by that URI. However, there is a benefit to data users in providing representations:\nWhen possible, provide representations of the resources\nA URI owner (data publisher?) SHOULD provide representations of the resource it identifies\nBy design, a URI identifies one resource. Using the same URI to directly identify different resources produces a URI collision. Collision often imposes a cost in communication due to the effort required to resolve ambiguities.\nWhen minting HTTP URIs, there are important questions that need to be addressed, some of them related to the concepts introduced above. Those questions include:\nWhat are the operational costs of minting URIs that provide representations when \"de-referenced\"?\nHow much can an agent tell about a resource by inspection of a URI that identifies it?\nNOTE:\nArchitecture of the World Wide Web: URI Opacity\nstates, \"Agents making use of URIs SHOULD NOT attempt to infer properties of the referenced resource\"\nCan the resource identified by a URI change over time?\nWhat is the impact of using URIs composed of characters beyond those allowed by [URI]? (Internationalized identifiers)\nRepresentation of Resources\n\nThis section is about providing representations of the resources, also known as \"URI allocation.\"  URI allocation is the process of associating a URI with a resource. Allocation can be performed both by resource owners and by other parties.\n@@TODO@@  Talk about the impact that minting URIs or certain URI namespaces have in the organizations' infrastructure\nThe \"http\" URI scheme ([HTTP]) uses DNS and TCP-based HTTP servers for the purpose of identifier allocation and resolution, therefore it is important to analyse the impact that a certain namespace pattern will have in the back-end systems of the data publisher. URI owners may organize or deploy infrastructure to ensure that representations of associated resources are available and, where appropriate, interaction with the resource is possible through the exchange of representations. There are social expectations for responsible representation management by URI owners.\nURI opacity VS. Metadata in URIs\n\nGeneral advice on how much meaning should one put in URIs, pros/cons\nIt is tempting to guess the nature of a resource by inspection of a URI that identifies it. However, the Web is designed so that agents communicate resource information state through representations, not identifiers. In general, one cannot determine the type of a resource representation by inspecting a URI for that resource. Therefore, it is recognized as good practice that agents making use of URIs SHOULD NOT attempt to infer properties of the referenced resource [WEBARCH].\nHowever, although Web architecture does not require that URIs be easy to understand or suggestive of the resource named, it's handy if those intended for direct use by people are [MDinURI].",
  "speaker": "SYSTEM",
  "uuid": "31b27491-19bd-4200-9c90-70e4b406ed26"
}