{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual08042010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n-- Paper para el ekaw 2010\n-- Evaluación preliminar del proceso de asociación semantica\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Paper sobre descripcion semántica de servicios REST\n- Ejecución de algoritmos para extraccion de datos para el paper.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nSe continúa trabajando en la solución del pool de aplicaciones utilizando un servlet para gestionar los ciclos de vida de cada una delas llamadas y, evitar el exceso de uso de memoria.\nSe están buscando alternativas para consumir menos memoria. Se trata de crear subaplicaciones cerradas con configuraciones predeterminadas que a pesar de tener un uso específico sean más útiles. Dichas subaplicaciones se cargan sobre la aplicación web y se introduce las modificaciones oportuna para su correcta visualización.\nInterfaz Anotación Híbrida\n\n- Se trabaja en la edición inline de las anotaciones para quitar la marca asociada al name entity.\n- Se prueba API rda en php para procesar rdf y presentarlo.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el desarrollo de las interfaces del metaplanificador\n- Se ha incorporado la especificación de trabajos POSIX (<jsdl-posix:POSIXApplication>) a las ya existentes en el conjunto de JSDL usado, ya que en el caso de FURA nos permitirá especificar los ejecutables a correr en los grupos cola (obligatorio en FURA)\nTarea 1.4\n\nPT 4.4\n: Planteamiento del AEI año 2010.\nReplanificación del trabajo para el año 2010 y 2011.\nEsta replanificación tiene como objetivo el adelanto de las tareas del motor de inferencia asociadas al PT 4.1 para poder disponer de un primer prototipo para el hito de presentación de los Activos Experimentales Integrados en octubre de 2010.\nEsta replanificación implica por lo tanto el restraso de las técnicas de descubrimiento de mappings multilingües a 2011.\nPlanteamiento del sistema y búsqueda de ejemplos.\nSe ha desarrollado documentación que soporta el nuevo planteamiento del AEI, incluyendo como novedad tecnológica la aparición de servicios web que puedan ser integrados dentro de la plataforma de servicios que se está manejando en el paquete de trabajo.\nPara la nueva documentación se ha procedido a la búsqueda de ejemplos reales de concatenación de mappings entre los conjuntos de OEGMappings NC-hydrOntology y NGN-hydrOntology y los conjuntos de mappings R2O hydrOntology-BCN200 e hydrOntology-BTN25. Además, para dar mayor realismo a los ejemplos se han buscado instancias de hydrOntology obtenidas a partir de la ejecución de ODEMapster++ con los mappings R2O de BCN200.\nTodo este trabajo ha supuesto el manejo de documentos de texto de gran tamaño (casi 300.000 líneas de texto en el caso de las instancias) que han ralentizado mucho la tarea.\nTarea 7.1\n\n- RDF.\n· Generación de conjuntos de datos con URI armonizadas\n      · Adición del rdf:label en la generación de RDF\n      · Adición del idioma en la geneación de RDF\n- Linked Data.\n· Finalización de página web\n      · Presentación en Tecnimap",
  "speaker": "SYSTEM",
  "uuid": "33819326-22ad-4bfb-bca7-421d7a0d1b1c"
}