{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/GeoBuddies \n\n3.4   Technology transfer\nSe ha registrado el programa de ordenador titulado “GeoBuddies - Camino de Santiago\", presentado en el Registro Territorial de la Propiedad Intelectual de la Comunidad de Madrid con fecha 19 de enero de 2009 y número de registro M-000413/2009, en el que figuran como autores investigadores de la UPM y de la USC.\nSe han establecido contactos con instituciones \nque pueden estar interesadas en los resultados del proyecto, como empresas de telefonía móvil, empresas específicamente relacionadas con el turismo en el Camino de Santiago, empresas proveedoras de contenidos en las zonas geográficas relacionadas con el Camino de Santiago y con el Instituto Geográfico Nacional.\n-\tReunión con el Director de Innovación de Vodafone. Junio 2008. (USC).\n-\tReunión con la Dirección Xeral de Turismo de la Xunta de Galicia. Junio 2008. (USC).\n-       Reunión con el Director de Estrategia Tecnológica de Telefónica I+D. Octubre 2008 (UPM)\n-\tReunión del Grupo de Trabajo de Nuevas Tecnologías en Turismo de la Plataforma Vindeira. Octubre 2008. (USC-UPM).\nTodos estos contactos se han centrado en analizar cómo se pueden incorporar datos en la aplicación para que los usuarios no se encuentren con el “síndrome de la página en blanco” o problema del “cold start”, y cómo se puede conseguir apoyo de empresas de telefonía.\nAlgun contrato o proyecto derivado en \n•\tusc\n3.5   Participation in international projects\nEl Grupo de Ingeniería Ontológica de la UPM ha comenzado durante 2008 y 2009, la ejecución de varios proyectos en ámbitos relacionados con los de este proyecto, para los cuales la experiencia adquirida por el grupo en el transcurso del proyecto ha sido muy relevante:\n-\tEn febrero de 2009, la UPM comenzó el proyecto STREP DynaLearn (FPxxxx), en el dominio del e-learning mediante la utilización de mapas conceptuales que reflejan relaciones de dependencia causal entre unas variables y otras. La relación con este proyecto se encuentra en el área del alineamiento de ontologías y de la recomendación de mapas conceptuales a estudiantes, utilizando los resultados en el alineamiento.\n-\tEn septiembre de 2008, la UPM comenzó a coordinar el proyecto STREP SemsorGrid4Env(FPxxxx), en el dominio de la integración semántica de información procedente de sensores y bases de datos históricas. La relación con este proyecto se encuentra en el área de la integración de información de fuentes de datos heterogéneas y en la utilización de tecnologías Grid para la gestión de la información.\n-\tEn junio de 2009, la UPM comenzó a coordinar el proyecto STREP SEALS(FPxxxx), en el dominio de la evaluación de las tecnologías semánticas. La relación con este proyecto se encuentra en …ASun..\n-\tEn junio de 2009, la UPM comenzó el proyecto ICPS (International Classification of Patient Safety Taxonomy), financiado por la Organización Mundial de la Salud, para el desarrollo colaborativo de ontologías en el área de seguridad del paciente.\nOtros proyectos europeos en los que la UPM participa, pero cuya temática no está relacionada con este proyecto, son: NeOn (FP6-027595), ADMIRE (FPxxxx) and SCALUS (FP7-PEOPLE-238808).\n3.6   Participation in national projects\nEl Grupo de Ingeniería Ontológica de la UPM ha estado involucrado durante 2008 y 2009 en varios proyectos nacionales en ámbitos relacionados con los de este proyecto, para los cuales la experiencia adquirida por el grupo en el transcurso del proyecto ha sido muy relevante.\n- España Virtual (\nhttp://www.españavirtual.org/\n). Proyecto CENIT orientado a la definición de la arquitectura, protocolos y estándares de la futura Internet 3D, con un foco especial en lo relativo a visualización 3D, inmersión en mundos virtuales, interacción entre usuarios y a la introducción de aspectos semánticos, sin dejar de lado el estudio y maduración de las tecnologías para el procesamiento masivo y almacenamiento de datos geográficos. La UPM está trabajando en el área de integración de datos de fuentes geográficas y en la combinación de ontologías y Grids.\n- mIO!: Tecnologías para prestar servicios en movilidad en el futuro universo inteligente. Proyecto CENIT cuyo objetivo es hacer realidad tecnologías que permitan prestar servicios ubicuos en un entorno inteligente y adaptado a cada usuario y a su contexto, usando el terminal móvil como base de interacción tanto con servicios proporcionados por empresas, como con microservicios creados y prestados por los propios usuarios en movilidad. La UPM está trabajando en el aprovisionamiento de tecnologías semánticas y en el desarrollo de ontologías de contexto.\n-\tWebn+1 (U?M)???\n-\tTodos los de USC\nOtros proyectos nacionales en los que la UPM participa, pero cuya temática no está completamente relacionada con este proyecto, son: UPGrid (PROFIT), Buscador semántico para las administraciones públicas (PROFIT).\n3.7   Collaboration with research groups nacionales y extranjeros\nThe Ontology Engineering Group collaborates with all the universities and companies that participate in the projects presented above. These partners are from Austria (1), Belgium (2), France (4), Germany (7), Greece (3), Ireland (1), Italy (8), The Netherlands (3), Poland (1), Slovenia (1), Spain (28), Switzerland (1), and United Kingdom (5). [[ACTUAlizar los numeros .....\n]]\nSantiago-…….\nAdemás faltan todos los nacionales…..\n4  \tReferences\n-\tGómez-Pérez A, Ramos JA, Rodríguez-Pascual AF, Vilches-Blázquez LM The IGN-E case: Integrating through a hidden ontology The 13th International Symposium on Spatial Data Handling (SDH 2008) In Headway in Spatial Data Handling. Lecture Notes in Geoinformation and Cartography, Ruas, A., Gold, C. (Eds.) pp. 417-435. ISBN: 978-3-540-68565-4 Montpellier, Francia 23-25 de junio de 2008.\n-\tGómez-Pérez A, Ramos JA Semantic mappings: out of ontology world limits 1st International Workshop on Ontology Alignment and Visualization (OnAV’08) 3rd International Conference on Availability, Reliability and Security (ARES 2008) 2nd Int. Conf. on Complex, Intelligent and Software Intensive Systems (CISIS 2008) IEEE Press. March 4th - 7th, 2008. Barcelona, Spain. Pages: 907-912. ISBN: 978-0-7695-3109-0\n-\tGarcía-Silva A., Szomszor M., Alani H., Corcho O. Preliminary Results in Tag Disambiguation using DBpedia. En 1st International Workshop in Collective Knowledge Capturing and Representation (CKCaR'09), California, USA, (September 2009)\n-\tRamos JA, Gómez-Pérez A. Mappings for the Semantic Web. IEEE Intelligent Systems. Trends & Controversies (por invitación) Noviembre 2008. Pages: 79-81\n-\tMauricio Espinoza, Asunción Gómez-Pérez and Eduardo Mena, \"Enriching an Ontology with Multilingual Information\", Proc. of 5th European Semantic Web Conference (ESWC'08), Tenerife (Spain), Springer Verlag LNCS, ISBN 978-3-540-68233-2, ISSN-0302-9743, pp. 333-347, June 2008.\n-\tMauricio Espinoza, Asunción Gómez-Pérez and Eduardo Mena, \"LabelTranslator - A Tool to Automatically Localize an Ontology\", Proc. of 5th European Semantic Web Conference (ESWC'08), Tenerife (Spain), Springer Verlag LNCS, ISBN 978-3-540-68233-2, ISSN-0302-9743, pp. 792-796, June 2008. demo paper\n-       Mauricio Espinoza, Elena Montiel-Ponsoda and Asunción Gómez-Pérez, \"Ontology Localization\", in Proc. of the 5th International Conference on Knowledge Capture (K-CAP 2009), California, US (To appear).\n-       Mauricio Espinoza, Asunción Gómez-Pérez, and Elena Montiel-Ponsoda, \"Multilingual and Localization Support for Ontologies\", Proc. of the European Semantic Web Conference (ESWC2009), demo paper, páginas 821-825 (ISBN 978-3-642-02120-6).\n-\tVilches Blázquez, L.M.; Cañete Pérez, J.A.; Corcho, O. y Bernabé Poveda, M.A. Interrelaciones entre las tecnologías de la información geográfica y la ingeniería ontológica para la mejora de la gestión de los recursos geoespaciales. Póster. XIII Congreso Nacional de Tecnologías de la Información Geográfica Web Congreso. Actas del XIII Congreso Nacional de Tecnologías de la Información Geográfica. Hernández Calvento, L.; Parreño Castellano, J.M. (eds.) ISBN: 978-84-96971-53-0. Las Palmas de Gran Canaria, 15-19 de septiembre de 2008.",
  "speaker": "SYSTEM",
  "uuid": "33c23759-e98f-46b0-91cb-3b4333806954"
}