{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Demos_ESWC2014 \n\nAquí se van a subir los datos correspondientes a las demos que se pueden hacer para ESWC2014. Si tienes alguna demo que crees que se puede hacer de tus sistemas, escribe aquí los detalles y algunas instrucciones (mirad ejemplos en\nDemos de Linked Data\ny avisa a Oscar Corcho para que las lleve preparadas antes del viernes 23 de mayo.\nDemos de Linked Data\nMorph-RDB (preferiblemente con bases de datos instaladas en local, para evitar dependencia de puerto 3306 y similares).\nhttps://github.com/oeg-upm/morph-rdb/wiki\nMorph-GFT.\nhttps://github.com/oeg-upm/morph-gft/wiki\nMorph-LDP\nMorph-Streams and earthquakes in Spain (responsable allaves@fi.upm.es): al morph-streams de JP se puede acceder desde donde siempre <\nhttp://streams.linkeddata.es/\n>. Hemos habilitado una demo nueva con los datos del IGN de terremotos en España durante 2013, accesible desde <\nhttp://streams2.linkeddata.es/\n>. En esta nueva URL, el resto de use cases deberían funcionar correctamente. La demo de los terremotos funciona en modo \"Register query\", no he probado el modo \"Listen push\". La primera query devuelve todas las observaciones generadas en los últimos 10 segundos (son observaciones de profundidad del terremoto en km y magnitud, pero no se acompañan del valor); la segunda query muestra la id del terremoto y la profundidad en kms en una ventana de 10 segundos; la tercera query muestra lo mismo que la segunda más la magnitud del terremoto; y la cuarta query muestra lo mismo que la tercera más el timestamp y la localización geográfica del terremoto. Hay que tener en cuenta que actualmente morph-streams no convierte las columnas al datatype especificado en el R2RML mapping, ver <\nhttps://github.com/oeg-upm/morph-streams/issues/1\n>. Los datos utilizados se encuentran en <\nhttps://github.com/allaves/morph-web/blob/master/sparqlstream-web/conf/data/Earthquakes-Spain-2013.csv\n>.\nHelsinki transport visualization (responsable allaves@fi.upm.es): Accesible vía <\nhttp://streams.linkeddata.es/HSLMap/\n>. Muestra la posición de autobuses (azul) y tranvías (verde) en Helsinki en tiempo real. Cuando pulsas en el icono de un vehículo muestra su identificador. Para la implementación se ha utilizado Storm para procesar los datos, RabbitMQ como bus de mensajes y STOMP + WebSockets para mostrar los mensajes de RabbitMQ en el navegador del cliente (Javascript). La API es HSL Live 1.7 y se describe aquí <\nhttp://developer.reittiopas.fi/pages/en/other-apis.php\n>. Se recomienda no abusar del zoom in/out porque el mapa del background se queda bloqueado.\nZaragoza Open Data (\nhttp://www.zaragoza.es/docs-api/\n)\nOops (\nhttp://www.oeg-upm.net/oops\n)\nSem4Tags\nMap4RDF-Web (\nhttp://girtab.dia.fi.upm.es:8180/geosparql/\n,\nhttp://girtab.dia.fi.upm.es:8180/viajero/\n,\nhttp://girtab.dia.fi.upm.es:8180/viajero_spherical/\n)\nMap4RDF-iOS\nBNE: (de manera temporal en\nhttp://valdemoro.dia.fi.upm.es:3000\n)\nQuizás descartadas\n\nHTML Template Generator",
  "speaker": "SYSTEM",
  "uuid": "3419e05f-a79a-48b3-9953-af3f3bba6aae"
}