{
  "message": "SYSTEM: FormularioCPM_ocorcho.pdf: Página 9\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n2.6. Coste estimado del desarrollo de su solución propuesta\n€\n2.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n2.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n2.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n2.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 2.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­9­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n24\n139.992,00\nesDBplus aporta conjuntos de datos para el español más completos, adaptados y de mayor \ncalidad, a partir de los datos enlazados ofrecidos por esDBpedia. Estos datos, así como \nlos servicios mediante los cuales se ofrecen, aportan las siguientes ventajas a nivel \ngeneral: \n \n- Búsquedas. Cuanto más entrelazados están los datos, mayor capacidad de navegar por \nestos, permitiendo obtener más resultados al recuperar información. De esta forma \nesDBplus permitirá desarrollar sistemas de búsqueda con mayor cobertura y precisión, de \nuna forma más eficaz que los sistemas actuales (retos 1 y 2). \n  \n- Enlazado y curado de datos públicos. Ayuntamientos, comunidades autónomas, o \ninstituciones de ámbito nacional proporcionan a la comunidad datasets siguiendo la \niniciativa Open Data. Las tecnologías de enlazado y curado de esDBplus permitirán mejorar \nla calidad de los datasets oficiales y aportar un parámetro de fiabilidad de los datos de cara \nal ciudadano (reto 8). \nesDBplus aporta diversas ventajas para la construcción de servicios de PLN para español. \nTanto los datos ofrecidos como las tecnologías empleadas en esDBplus sustentan, de \nforma transversal, el desarrollo de soluciones en diferentes áreas del análisis de textos, \ncomo la creación de resúmenes (reto 10), desambiguación (reto 8), o la detección de entidades \n(reto 6). En este sentido, esDBplus aporta los siguientes beneficios a nivel industrial: \n \n- Infraestructura lingüística, \naportando el mayor conjunto de datos estructurados en español y \nlenguas cooficiales, así como los medios para su uso (API REST, SPARQL endpoint, etc.). \nLa infraestructura física que sustenta a esDBplus da soporte de alta disponibilidad a \nterceros, para su acceso y uso, facilitando el desarrollo de aplicaciones en cualquier \nlenguaje de programación y plataforma. \n \n- Internacionalización y traducción. La DBpedia del español, en la que se basa esDBplus, es \nactualmente la segunda DBpedia con mayor número de contenidos, sólo superada por la \ninglesa. Los servicios ofrecidos en esta propuesta permiten el acceso de empresas de \nPLN y traducción automática de cualquier lugar del mundo, siendo de especial interés para \naquellas situadas en comunidades hispanohablantes. Asimismo es de especial interés a \nnivel internacional, como demuestra el alto número de consultas recibidas de países como \nEE.UU. o China en la actualidad. El enlazado de esDBplus con otras DBpedias y recursos \ne ternos tanto para leng as e tranjeras como cooficiales da soporte al desarrollo de\nesDBplus se desarrollará siguiendo los estándares de la web semántica, implementando los \nprincipios de los datos enlazados, para publicar online y relacionar entre sí grandes \nvolúmenes de datos. \n  \nLos mecanismos de acceso que implementa esDBplus, ofreciendo tanto acceso mediante \nconsultas SPARQL como mediante APIs REST, hacen que el servicio sea \nmultiplataforma, pudiendo ser usado independientemente del sistema operativo y del \nlenguaje de programación. \n \nLos recursos que aporta esDBplus benefician no sólo a las empresas tecnológicas de \n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "34c1e921-a862-4989-8c02-ee73b5954912"
}