{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 72\n70\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nMiddleware companies, such as Clay Tablet Systems, offer services that connect a variety of translation man‐\nagement systems with the leading content management systems. They have integrated with most of the\npopular corporate CMS platforms. This is an attractive option for translation technology companies, who can\nintegrate once with Clay Tablet’s system, and then automatically inherit support for every CMS platform they\nhave integrated with. \n4.10 Technology for Automatic Machine Translation\nApproaches to Machine Translation\nRules Based\nRules based machine translation, developed several decades ago, was the first practical approach to auto‐\nmatic translation. This type of translation engine works by parsing a source sentence, analysing its structure\n(for example, determining which words are used as verbs or nouns), and then converting this into an inter‐\nmediate, machine‐readable code. This is, in turn, transformed into the target language.\nThe advantage of rules based translation is that a sufficiently sophisticated translation engine can translate\na wide range of texts without having been trained with a large number of examples, as in statistical machine\ntranslation. The disadvantage is that it is necessary to build custom parsing software and dictionaries for\neach language pair, and that it is quite “brittle”. Rules based translation engines don’t deal very well with\nslang or metaphorical texts, for example. For this reason, rules based translation has largely been replaced\nby statistical machine translation or hybrid systems, though it is useful for less common language pairs\n(where there are often not enough parallel texts to train a statistical machine translation engine).\nProducts and Practitioners\nThe two primary providers in this category are Systran (commercial software) and Apertium (open source).\nSystran has been in operation for decades, and was a pioneer in web translation (their translation engine\npowered the Babelfish web translation service back in the 1990s). They cover most major language pairs,\nand most recently Systran has released a hybrid rules/statistical translation engine to upgrade their product\nline.\nApertium is an open source project sponsored by Universitat d’Alacant in Spain. They have developed an\nopen source rules based translation engine that enables users to create custom translation engines for any\nlanguage pair. This solves an important problem for rules based translation engines, as commercial vendors\ndo not invest in development for less common language pairs, such as Spanish ← → Catalan. Developing a\ncustom engine is a large task, as it requires the development of dictionaries, parsing rules, etc., and the\ninvolvement of linguists who are experts in the source and target languages. \nExample Based\nExample based machine translation is similar to statistical machine translation, as it uses a large volume of\nparallel texts (source segments and their translations) to train the system. The logic behind example based\ntranslation is that it treats sentences as a collection of often repeated phrases that can be translated inde‐\npendently and then combined to form a translated sentence. \nThe problem with this approach is that you need a very large corpus of phrases and their translations. This\nrequires a lot of data, and also requires the phrases and translations to be perfectly aligned, which typically\nrequires manual effort, whereas statistical machine translation systems can be trained in a fully automated\nprocess.\nExample based machine translation has not been widely deployed as a commercial service. However, there\n",
  "speaker": "SYSTEM",
  "uuid": "35fc298f-f30a-4a37-8a7b-90142256359f"
}