{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 15\nAs future work, we will especially focus on running usability studies on our ontology-\nbased feedback functionalities. We will also enrich our ontology matching-based tech-\nniques with other advanced metrics that measure the agreement and disagreement de-\ngree between ontologies [12]. We devise also the application of collaborative ﬁltering\ntechniques for model recommendation based on the community of users of the sys-\ntem. We also plan to speciﬁcally use our system in the academic domain to support\nsemantic-guided learning. In this real usage context, more human-based evaluations\nwill be possible for the improvement of our approach.\nFinally, although the semantic data that we generate is accessible on the Web by dif-\nferent means, a natural improvement of our system is to “open” this semantic data to the\nweb of Linked Data, by adhering to the Linked Data principles. This will be favoured\nalso by the preferred use of DBpedia (one of the most important nodes in the cloud of\nLinked Data [2]) in our system.\nAcknowledgments. We thank Thanh Tu Nguyen for her valuable assistance in the im-\nplementation of the experiments. We thank Andreas, Michaela, Petya, Richard, Ian,\nDror, Paulo, Isabella, and Gustavo for their kind help with the grounding evaluation.\nThe work presented in this paper is co-funded by the EC within the FP7 project Dy-\nnaLearn (no. 231526, http://www.DynaLearn.eu).\nReferences\n1. Z. Aleksovski, M. C. A. Klein, W. ten Kate, and F. van Harmelen. Matching unstructured\nvocabularies using a background ontology. In EKAW, volume 4248 of LNSC, pages 182–197,\nOctober 2006.\n2. C. Bizer, J. Lehmann, G. Kobilarov, S. Auer, C. Becker, R. Cyganiak, and S. Hellmann.\nDbpedia - a crystallization point for the web of data. Web Semantics: Science, Services and\nAgents on the World Wide Web, 7(3):154–165, September 2009.\n3. B. Bredeweg and K. Forbus. Qualitative modeling in education. AI Magazine, 24(4):35–46,\n2004.\n4. B. Bredeweg, J. Liem, F. Linnebank, R. B¨uhling, M. Wißner, J. Gracia, P. Salles, W. Beek,\nand A. G´omez-P´erez. Dynalearn: Architecture and approach for investigating conceptual\nsystem knowledge acquisition. In Intelligent Tutoring Systems, volume 6095, chapter 42,\npages 272–274. Springer, Berlin, Heidelberg, 2010.\n5. B. Bredeweg, F. Linnebank, A. Bouwer, and J. Liem. Garp3 - workbench for qualitative\nmodelling and simulation. Ecological Informatics, 4(5-6):263–281, 2009.\n6. B. Bredeweg and P. Salles. Qualitative models of ecological systems – editorial introduc-\ntion. Ecological Informatics, 4(5-6):261 – 262, 2009. Special Issue: Qualitative models of\necological systems.\n7. B. Bredeweg and P. Struss. Current topics in qualitative reasoning (editorial introduction).\nAI Magazine, 24(4):13–16, 2003.\n8. A. Ca˜nas, M. Carvalho, M. Arguedas, D. B. Leake, A. Maguitman, and T. Reichherzer.\nMining the web to suggest concepts during concept mapping: Preliminary results. In Proc.\nof the ﬁrst international conference on concept mapping, Pamplona, Spain, 2004.\n9. A. J. Ca˜nas, G. Hill, R. Carff, N. Suri, J. Lott, G. G´omez, T. C. Eskridge, M. Arroyo, and\nR. Carvajal. Cmaptools: A knowledge modeling and sharing environment. In Proc. of the\nﬁrst international conference on concept mapping, pages 125–133, Pamplona, Spain, 2004.\n",
  "speaker": "SYSTEM",
  "uuid": "36d21dc6-0de0-4dae-8b0a-126d85aa07e6"
}