{
  "message": "SYSTEM: D5.3.2.pdf: Página 41\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 41 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n5. gOntt: NeOn plug-in for the Scheduling Activity  \ngOntt is the NeOn plug-in that will support the scheduling activity having the following main \nfunctionalities:  \n\u0001 To help software developers and ontology practitioners to decide which ontology network life \ncycle model is the most appropriate for their ontology network. \n\u0001 To help software developers and ontology practitioners to decide which concrete process and \nactivities should be carried out in the ontology network development and in which order they \nshould be performed. \n\u0001 To help software developers and ontology practitioners to include human resources and time \nrestrictions in the ontology network life cycle. \n\u0001 To inform software developers and ontology practitioners about how to carry out a particular \nprocess or activity, including methodological guidelines and a reference of which concrete \nNeOn plug-in should be used for each process and activity. \nIn summary, the gOntt plug-in should help to schedule an ontology network development. \nAdditionally, the gOntt plug-in should be a NeOn meta-tool with the goal of providing \nmethodological guidelines for each process and activity and information about the existing \nNeOn plug-ins for each process and activity \nIn this chapter, we include the main users and functionalities of the gOntt plug-in. \nThe gOntt plug-in should allow three different roles or type of users: \n\u0002 \ngOntt Administrator \n\u0002 \nOntology Project Manager \n\u0002 \nOntology Development Team \nAdditionally, gOntt should have two different views: \n\u0001 Administrative View for being used by gOntt administrator. \n\u0001 Gantt View for being used by ontology project manager and ontology development team. \nThe main requirements for gOntt plug-in can be divided into 4 groups: general requirements, \nrequirements for gOntt administrator, requirements for ontology project manager, and requirements \nfor ontology development team.  \nThe list of requirements for gOntt plug-in were obtained (1) from previous experiences in \nscheduling in software engineering projects, (2) from interviews with experts in scheduling ontology \nprojects, and (3) based on the scheduling guidelines presented in Chapter 4.  \nGeneral Requirements: \n\u0001 To create, modify, and delete gOntt projects, that is, both (1) default templates for \nscheduling that provide initial scheduling and (2) particular schedules for ontology projects. \n\u0001 To save all gOntt projects in files with .got extension, this must be based on xml standard.  \n\u0001 To save and open .got files. \n\u0001 To create and include new phases composed by processes and activities in a gOntt project. \n\u0001 To create and include processes and activities (both from the NeOn Glossary or new \nactivities not included in the glossary) in a gOntt project. \n\u0001 To have different visualizations for phases, processes and activities. \n",
  "speaker": "SYSTEM",
  "uuid": "36f9b80c-3411-41be-a3b3-6b444bf88e49"
}