{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 11\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11160\nArtículo 23.  Obligaciones del personal investigador en formación.\n1.  De manera general, el personal investigador en formación tendrá las siguientes \nobligaciones:\na)  Realizar su labor en el Centro de I+D en el que se encuentre incorporado, \ncumpliendo con aprovechamiento las distintas etapas del proceso de formación, de \nrealización de la tesis así como ajustarse a las normas propias de funcionamiento del \ncentro de adscripción, en cuanto a la dedicación, función que debe desempeñar, horarios \ny vacaciones.\nb)  Cumplimentar los informes, formularios y demás documentos que, a los efectos \ndel disfrute de la ayuda, le sean requeridos por el órgano concedente del subprograma \nreflejado en el artículo 3.2 y las entidades que colaboran en su gestión. Con carácter \ngeneral, estos documentos se cumplimentaran de acuerdo a los modelos e instrucciones \npublicados en la página web del órgano concedente del subprograma.\nc)  Comunicar al órgano concedente del subprograma la renuncia a la beca, al contrato \no a las ayudas que le hayan sido concedidas, así como cualquier incidencia que se oponga \no menoscabe la obtención de los objetivos de la ayuda.\nd)  Las restantes obligaciones establecidas en el artículo 6 del Real Decreto 63/2006, \nde 27 de enero.\ne)  Cumplir, en su caso, la normativa comunitaria de los Fondos Estructurales y las \ninstrucciones específicas del órgano concedente.\n2.  La aceptación de la ayuda por parte del personal investigador en formación implica \nel respeto de las normas fijadas en esta convocatoria, así como las que el órgano \nconcedente del subprograma y los centros de adscripción de las ayudas determinen, en el \námbito de sus competencias, para supervisar y evaluar el desarrollo de su trabajo\n3.  En relación con los derechos de propiedad industrial así como los derechos de \ncarácter patrimonial que integran la propiedad intelectual que puedan generarse durante \ntodo el período de la ayuda, ya sea en fase de beca o de contrato, se aplicará la normativa \nvigente en la materia, por lo que los mismos pertenecerán única y exclusivamente al centro \nde adscripción del personal investigador en formación, sin perjuicio de lo dispuesto en la \nnormativa de dichos centros de adscripción sobre la participación en los beneficios \nderivados de los mencionados derechos.\nArtículo 24.  Obligaciones de los Centros de I+D.\nLos Centros de I+D tendrán las siguientes obligaciones:\na)  Proporcionar al personal investigador en formación el apoyo necesario y facilitarle \nla utilización de los medios, instrumentos o equipos que resulten precisos para el normal \ndesarrollo de su actividad.\nb)  Velar por el desarrollo adecuado del programa de formación del personal \ninvestigador en formación, sin que pueda exigírsele la realización de cualquier otra actividad \nque no esté relacionada con el desarrollo de su investigación o de la formación específica \nrequerida para ésta durante su transcurso.\nc)  Comunicar al órgano concedente del subprograma, la obtención del grado de \ndoctor del personal investigador en formación incorporado al Centro de I+D en el plazo \nmáximo de 10 días hábiles desde la fecha de su obtención.\nd)  Comunicar al órgano concedente del subprograma las renuncias, interrupciones y \ndemás incidencias de las becas y contratos financiados con cargo a este subprograma en \nel plazo máximo de 15 días naturales desde la fecha en que se produzcan.\ne)  Las restantes obligaciones establecidas en el artículo 7 del Real Decreto 63/2006, \nde 27 de enero.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "3782c766-19a5-4920-b9f0-1e2243aa26d5"
}