{
  "message": "SYSTEM: D31_-_SEEMP_Platform_specifications%28v1%29.pdf: Página 8\n \nD31 –                        Version 1.1 \n \nProject IST-4-027347-STP \nPage 8 of 21\n \nCQ55. Given the age (30 years old) and the desired salary (equal or greater than 14000 €) \nof the job seeker, what job offers are the most appropriate? \nCQ56. Given the employer information, economic activity of the employer and the job offer \nprofile (job, contract type, salary, work condition, contract duration), what job seekers are \nthe most appropriate? \nCQ57. Given the age (20 years old) and the desired salary (equal or greater than 14000 \nzlotes) of the job seeker, what job offers posted in last month are the most appropriate? \nCQ58. Given the employer information, economic activity of the employer and the job offer \nprofile (job, contract type, salary of 3400 €, work condition, contract duration), what job \nseekers are the most appropriate? \nCQ59. Given the time spend for his/her degree (8 years) and the desired salary (equal or \ngreater than 14000 €) of the job seeker, what job offers posted in last 7 days are the \nmost appropriate? \nCQ60. Given the time spend for his/her degree (8 years) and the desired salary (equal or \ngreater than 14000 €) of the job seeker, what job offers posted in last 24 hours are the \nmost appropriate? \n \nAs we mentioned before, each competency question is useful as a base for obtaining \nassumptions, constraints, the necessary input data, etc. Figure 4-3 shows the assumption: \njob offer’s salary is equal or lower than 1400 €, the constraint: the employer wants Spanish \npeople and the necessary input data for the competency question related to the job offer. \nFigure 4-4 shows the assumption: job seeker’s age is lesser than 30 years, the constraint: \nthe job seeker wants 1400 € of salary and the necessary input data for the competency \nquestion related to the job seeker. \n \n \n \n \n \n \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "387e35c0-76a0-4146-ae47-ea8cdde74171"
}