{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 45\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 45 of 111 \ndisagrees with a statement can very easily modifiy it, delete it, comment it, etc [57]. We created a \nnon public space in the NeOn wiki for discussing the ontology engineering terminology, expressing \nand exchanging different opinions among different partners involved in NeOn, and reaching a final \nagreement. Meetings and mailing lists were also employed for agreeing on the activity definitions \nat final stages.  \nFor the time being, the NeOn Glossary of Activities is addressed to the Ontology Engineering \ncommunity, but during the project we will include comments, examples, etc., to make the glossary \nmore user-friendly and complete for software developers and users. \nSummarizing, in this chapter we present:    \n1. The consensus reaching process for the identification and definition of the activities involved in \nthe ontology network development process (Section 3.1).  \n2. The NeOn Glossary of Activities Version 1 (Section 3.2), which identifies and defines the \nactivities involved in ontology network construction. Definitions in the glossary have been \ncollaboratively built and consensuated by all NeOn partners, by means of the consensus \nreaching process explained in Section 3.1. \n3. A classification of the activities, included in the NeOn Glossary of Activities, into those that are \nrequired for the development of ontology networks and those that are applicable (depending on \nthe cases), but not required, and, therefore, they are non-essential or dispensable. This \nclassification is summarized in a “required-if Applicable” table version 1 (Section 3.3.). \n3.1. Consensus Reaching Process \nIn this section we sketch the roles and the overall process gone through by the NeOn consortium \nto reach a consensus on the activities for developing ontology networks. During the process we \nhave tried to achieve a consensus on the list of activities and on the activity definitions.  \nRoles in the process: a varied number of skilled people, geographically dispersed (called ‘NeOn \nGlossary’ team), participated collaboratively in our consensus reaching process. The ‘NeOn \nGlossary’ team has a well-balanced and representative participation of the different people \ninvolved in the process: ontology engineers, ontology editors, and users within the NeOn project. \nThe ‘NeOn Glossary’ team members had the following concrete roles (or functions):  \n UPM was in charged of creating the NeOn wiki page5 dedicated to the consensus reaching \nprocess. UPM also created and publicated in the wiki a template for gathering information \nabout activities. UPM was in charged of creating the initial list of activities with initial \ndefinitions based on the study of the state of the art in ontology engineering. \n CNR, FAO, INRIA, iSOCO, JSI, OU, UKARL, UPM, and USFD introduced several \ncomments in the activity definitions. \n CNR, FAO, JSI, OU, UKARL, UPM, and USFD participated in some of the ad-hoc meetings \ncarried out to reach consensus.  \nProcess Stages: Before beginning with the consensus reaching process, the meanings of \nconsensus and consensus reaching process were explained. The proposed process of achieving \nconsensus on the activities was also explained and reviewed by the ‘NeOn Glossary’ team. After \nthat, the team agreed on a targeted time period (one year) to reach a consensus. And finally, the \nteam followed the general process, shown in Figure 13, to achieve consensus on the activities \ninvolved in the development of ontology networks. We achieved consensus after the third round of \nthe process.  \n                                                 \n5 http://www.neon-project.org/wiki/index.php?title=WP5D5.3.1 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "3aeda935-42dd-4ee9-8e1c-161abfcc61a0"
}