{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle MR1: \"Implementing a smart Query Prefetching System for SPARQL endpoints\".\n- Description MR1: Recent works point out machine learning based techniques to create more effective SPARQL endpoints. These techniques are based on predicting the structure of the incoming queries as well as catching augmented triple patterns. The experiments show that these techniques can provide an effective mechanism to avoid the execution of the incoming SPARQL queries and a fast response exploiting the cached information. This \"TFM\" would implement these techniques in order to achieve a prefetching layer for current SPARQL endpoint engines like Virtuoso or Fuseki.\n- Funding schema: not funded\nTitle MR2: \"Analysis on new features for a smart Query Prefetching System for SPARQL endpoints\".\n- Description MR2: Recent works point out machine learning based techniques to create more effective SPARQL endpoints. These techniques are based on predicting the structure of the incoming queries as well as catching augmented triple patterns. The experiments show that these techniques can provide an effective mechanism to avoid the execution of the incoming SPARQL queries and a fast response exploiting the cached information. This \"TFM\" would study new features (like time between queries) [see\nhere\nhere\nand\nhere\n] that could enhance the current results.\n- Funding schema: not funded\nTitle MR3: \"Detection of types in DBpedia based on machine learning techniques\"\n- Description MR3: Recent works have pointed out the benefits of machine learning approaches to predict the type of DBpedia resources. This \"TFM\" will focus on analyzing new approaches to improve the current state of the art. The supervisor will provide some suggestions but the student will have the chance to propose new approaches.\n- Funding schema: not funded\nTitle MR4: \"Generation of semantic information from natural language sources\"\n- Description MR4: With the recent advances (e.g. SyntaxNet) in the analysis of texts in natural language, the conversion of texts into RDF triples is becoming a real possibility. This \"TFM\" will analyze the state of the art and its application to a real use case: DBpedia. From the textual information about a given resource, many new triples will be generated. This new information must be analyzed to validate its correctness before being added to the DBpedia. This work can apply to the Google Summer of Code (GSoC) 2020 to get prestige and additional funding. GSoC 2019 funded this project.\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle MR5: \"Extended Spanish DBpedia\"\n- Description MR5: the Spanish DBpedia is the source of semantic data for the Spanish language. Aimed at linking this valuables source with data from other sources, the DBpedia foundation has created\nDBpedia Data Bus\naimed at providing a common place where users can provide and retrieve data. This TFM will be focused on this software engineering problem and the solutions provided, initially for the Spanish DBpedia but, potentially, for any DBpedia.\n- Funding schema: perhaps DBpedia Foundation\nTitle MR6: \"Data Analytics applied to DBpedia error detection\"\n- Description MR6: gamification techniques are a valuable method to detect errors in DBpedia (or any other knowledge graph). This TFM will use Data Analytics techniques over the logs of\nan existing mobile application\nto extract potential errors. These potential errors will feed a web application in which human users will verify these issues. Download the app\nhere\n- Funding schema: perhaps DBpedia Foundation\nTitle MR7: \"A new visualization paradigm to visualize RDF data\"\n- Description MR7: RDF data can be visualized as a graph. Most approaches focus on visualizing the concepts (T-box) or the instances (A-box), or both\nAntoniazzi 2018\n. However, in day-to-day activities, in which we create knowledge graphs (typically from external sources), we miss a visualization paradigm that show us simplified visualizations of the RDF graph. This TFM will be focused on providing this new visualization paradigm by using RDF data from\nSlideWiki\n, an European research project. Proficient knowledge of JavaScript language and web development is a must.\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle MR8: \"User evaluation of a web tool to assist users on creating terminologies\"\n- Description MR8: There is a lack of research on the user interaction carried out on the tools used for terminology extraction. This project is aimed at overcoming these deficiencies with a user interaction study on a specific tool developed in our research group.\n- Funding schema: perhaps AInnoSpace (Accenture).\nTitle MR9: \"Applying Deep Learning techniques to terminology extraction in specific domains\"\n- Description MR9: The recent application of Deep Learning techniques to keyphrase extraction (\nSahrawat 2019\n) by using deep contextual language models such as ELMo and BERT have enhanced the performance in the domain of Automatic Term Extraction. This TFM is aimed at applying these techniques to specific domains such as technology, bio or law.\n- Funding schema: perhaps AInnoSpace (Accenture).\nTitle MR10: \"A user experience evaluation of multi-term searching techniques in specific domain corpora\"\n- Description MR10: Using the latest UX (user experience) methods we will evaluate a search engine based developed by our research group in the AInno Space research group (funded by Accenture). A comparison to classical keyword search engines will be carried out paying attention to specific domains such as technology, bio or law.\n- Funding schema: perhaps AInnoSpace (Accenture).\nTitle MR11: \"Allergies and Contamination: an study based on Open Data and Machine Learning\"\n- Description MR11: The Open Data initiative is increasing the number of data sources. In this TFM we will focus on extending the data sources beyond pollutant levels (PL) provided by several local administrations. We plan to extend it with data about temperature, barometric pressure, wind direction, or polen concentration data. These data will be added to our model in order to increase the predictive model created for each user based on his/her historic episodes (itching, coughing, migraine headaches, etc.). A mid-level background on data science and/or machine learning is required.\n- Funding schema: perhaps AInnoSpace (Accenture).\nTitle MR12: \"esDBpedia data analytics and error reporter tool\"\n- Description MR12: esDBpedia (the Spanish chapter of DBpedia) needs an error reporter tool. Anybody who detects a wrong data in esDBpedia could use the proposed web tool (integrated inside the web site of esDBpedia) to report the error. This error will be labeled as \"possible error\" and the tool will have to analyze the error reported in order to verify it. This problem can be approached in several ways, but we propose initially a \"collaborative\" approach, by using other users to validate statistically the error. The student should have solid skills on web development.\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle MR13: \"esDBpedia SPARQL query analytics dashboard\"\n- Description MR13: esDBpedia (the Spanish chapter of DBpedia) stores the queries made to its SPARQL endpoint during one year. It would get very useful for the DBpedia community to have a dashboard (web application) capable of analyzing the queries in terms of numbers (number of queries per hour/day/week/month), type (the type of a query is described\nhere\n) and other metrics. As the number of queries per week are in the range of several million, this is a great dataset for \"big data\" analysis and visualization. The recommended language is R and the\nwebreadr\npackage for reading apache logs.\nAs this work can be easily extend to any DBpedia chapter, this project is suitable for GSoC funding.\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle MR14: \"Semantic technologies applied to an efficient management of Research Groups\"",
  "speaker": "SYSTEM",
  "uuid": "3c22d5a2-36d8-4e6d-a608-6a9c8d7930ab"
}