{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 28\nPage 28 of 124\nNeOn Integrated Project EU-IST-027595\n– Discovering semi-automatically mappings between the database and ontology elements, user\ninteraction is necessary in some special cases.\n– Expressing those mappings in a formal language, R2O.\n– Evaluating and verifying those mappings, this is done manually.\n– Exploiting those mappings for retrieving the data using ODEMapster.\nThis method produces one single ontology and generates ontology instances. The ontology in-\nstances are expressed in RDF.\nMethods for Transforming XML Files into Ontologies\nThe three main methods for transforming XML ﬁles into ontologies are presented in [GC05, AM05, CXH04].\nNext, we describe them.\n• García et al. in [GC05] introduce a method to create an ontology from the XML schema and populate\nit with instances created from the XML data.\nThis method follows the approach for transforming the resource schema into the ontology\nschema, and then resource content into instances of the ontology. It uses a formal speciﬁ-\ncation of the conversions between entities of the resource and the ontology. The method consists of\nthe following steps:\n– XSD2OWL Mapping. In this step the semantics implicit in the schema is captured. This semantics\nis determined by the combination of XML Schema constructs. This step is quite transparent\nand captures a great part of XML Schema semantics. To check the resulting ontologies OWL\nvalidators have been used; it has also been used the XSD2OWL tool. For checking the resulting\nontologies, the user interaction is necessary.\n– XML2RDF Mapping. In this step a structure-mapping approach has been selected. This ap-\nproach is based on translating XML metadata instances to RDF instances that instantiate the\ncorresponding constructs in OWL. To do this, the XML2RDF tool has been used\nThis method has been applied to the MPEG-730 XML Schemas generating a MPEG-7 ontology31. The\nonly adjustment that has been made to the automatically generated ontology has been done to resolve\na name collision between OWL class and a RDF property.\nThe method produces one single ontology. The ontology components generated are classes, at-\ntributes, relations, and instances and they are expressed in RDF/OWL Full.\n• An et al. in [AM05] An et al. present a method to translating an XML web document into an instance\nof an OWL-DL ontology.\nHere the authors take advantage of the semi-automatic mapping discovery tool [ABM05] for the rela-\ntionship between XML schema and the ontology. They deﬁne a formal model for the mapping formulas.\nThis method follows the approach to transforming the resource schema into the ontology schema,\nand the resource content into instances of the ontology. The method uses a formal speciﬁca-\ntion of the conversions between entities of the XML and the ontology. It contemplates syntactic\ntransformation aspects, and how symbols are structured in the XML and ontology formats. It also\ncontemplates semantic transformation aspects, and the semantic interpretation of the resource\nelements when deﬁning transformations to ontology elements.\nThe method produces one single ontology. The ontology components generated are classes, at-\ntributes, relations, and instances and they are expressed in OWL-DL.\n30http://www.chiariglione.org/mpeg/standards/mpeg-7/mpeg-7.htm\n31http://rhzomik.upf.edu/ontologies/mpeg7ontos\n",
  "speaker": "SYSTEM",
  "uuid": "3fe15f2f-883d-45f8-9d81-dd447a241f2a"
}