{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Marseillesjan2011 \n\nJOB TITLE:Biodiversity Informatics / Semantic Web Engineer\nREPORTS TO:CEO, Director of Innovation\n_________________________________________________________________________\nCONTEXT\nNatural Solutions is a young innovative company specialized in advanced information technologies. We focus on creating a set of modern software solutions to handle the current biodiversity crisis.\nNatural Solutions technology deals with each step of the scientific process with the great care:\n- Data acquisition: electronic field guide and on-line data entry\n   - Data storage and modeling: Databases and GIS\n   - Data analysis and visualization: Online and offline communication.\nIn the last year Natural solutions have been focusing its RD effort in the area of knowledge representation and Semantic web technologies as a firm believer that these technologies will improve biodiversity knowledge in the future.\nJOB SUMMARY\nWhile reporting to the RD lead, the engineer will be able to create complex pieces of software around the advanced concepts of Biodiversity Informatics.\nDUTIES&  ESSENTIAL JOB FUNCTIONS\n- Analyze and understand advance technologies and RD Concepts\n   - Produce software prototype\n   - Participate in the RD project Specification\n   - Write project proposal\n   - Promote the project and company at international conferences\n   - Interact with research partners\nREQUIREMENTS\n- Prior experience in international research program\n   - Have demonstrated an effective programming experience\n   - Demonstrated ability for rapid analysis of complex issues, strong\n   decision-making, and translation of programmatic priorities into\n   operational strategies.\n   - Excellent organizational, interpersonal, and communication skills.\n   - Must be comfortable working as part of a team in a complex\n   technological environment.\n   - Ability to travel frequently to client sites.\n   - Fluent in English and French.\nQUALIFICATIONS\nThe Candidate will have holding a Master’s or a PHD qualification degree in on the following fields:\n- Semantic Web\n   - GIS\n   - Knowledge representation\n   - Biodiversity Informatics\nTECHNOLOGIES\nRequired\n- Protegé\n   - RDF, OWL, RDFa\n   - SPARQL, Triple Store (Virtuoso)\n   - Java (Hibernate, Spring)\nPreferred\n- RIA: Flex / Flash\n   - PHP, Drupal, Dojo, JQuery\n   - XSLT, XSD\n   - SQL Server/ PostGres /MySQL\n   - SOA/Rest Web services\n   - Design Pattern\nOptional\n- Knowledge of the GBIF and TDWG standards\n   - Some GIS knowledge\n   - Interest in Biodiversity and Environment Sciences\nREPORTING RELATIONSHIPS\nThe engineer will be asked to mentor junior programmer and trainee within the company.\nSALARIES\n30 to 40 K€ (French annual wages before taxes) according to experience\nDEADLINE: asap!",
  "speaker": "SYSTEM",
  "uuid": "3fe2f315-955b-45c6-855a-2cd6cd8e023f"
}