{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 13\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n13\n1\n2\n3\n4\n5\nU-L1\nU-L2\nU-L3\nU-L4\nU-A1\nU-A2\nU-A3\nU-A4\nU-A5\nU-F1\nU-F2\nU-F3\nU-F4\nAverage  response value\nQuestion ID\n(a) Usability part of the questionnaire\n1\n2\n3\n4\n5\n6\n7\nS-O1\nS-O2\nS-O3\nS-O4\nS-O5\nS-O6\nS-P1\nS-P2\nS-P3\nS-I1\nS-I2\nS-I3\nS-I4\nS-L1\nS-L2\nS-L3\nS-L4\nS-L5\nS-L6\nS-C1\nS-C2\nS-C3\nS-C4\nS-C5\nAverage response value\nQuestion ID\n(b) Satisfaction part of the questionnaire\nFig. 6: Mean value of the user's responses in the questionnaire (circles). Thin\nbars show standard deviation. Thick bars show the 90% con\u001cdence interval of\nthe mean. Dark dotted line shows the average value of the responses, and light\ndotted lines show standard deviation bounds.\nusability part of the questionnaire, and questions S-P1, S-L1 and S-L6) we get\nmuch more reasonable values. These questions are related with aspects such as\nhelp, documentation, and speed of the system. These aspects have not been\ncovered because our Control Point is still a prototype instead of a \u001cnal product.\nConsidering this, we can conclude that our Control Point provides reasonable\nvalues for usability and user satisfaction concerning the user interface for a wide\nrange of users.\n7\nConclusions and Future Work\nWe have described an extension to a multimedia management system infrastruc-\nture that is currently being used in the context of home environments to share\nand render multimedia resources. This extension allow us to perform these shar-\ning and rendering tasks across homes, in a WAN setting, with authentication\nand authorization control, overcoming some of the inherent limitations to the\nUPnP-based infrastructures.\nBesides the basic extensions needed for the exchange of multimedia resources\nacross homes, we have given users the possibility of providing rich ontology-\nbased annotations of their resources, as they can do in other existing multimedia\nannotation tools [4,2,13], with simple search interfaces over the Web of Data in\norder to retrieve and copy or link to existing URIs and annotations. The major\ninnovation in this aspect is the use of a Semantic Grid-based architecture and\ninfrastructure for the distributed management of this metadata.\nWe o\u001ber users the possibility of publishing their annotations in Linked-Data,\ntaking into account that their multimedia resources have global URIs and that\nour metadata servers can perform the corresponding content negotiation in order\nto return RDF information when needed.\n",
  "speaker": "SYSTEM",
  "uuid": "456dad3d-60d2-4be3-a67a-a69a15da3496"
}