{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Art%C3%ADculos_relacionados_con_el_data_provenance \n\nAutores :\nJun Zhao, Oscar Corcho, Paolo Missier, Khalid Belhajime, David Newmann, David de Roure y Carole A Goble\nFecha :\n???, universiades de Oxford, Politécnica de Madrid, Manchester y Southampton.\nCapítulo donde se describen una serie de proyectos e-science semánticos y se resumen algunas de las áreas que se están investigando y se han de investigar en el futuro.\nLos autores comienzan explicando que hay mucha información producida por la interacción en los workflows científicos, y que no se puede almacenar toda en un solo lugar. Sin embargo, si se distribuye surgen otros problemas, como que el formato en el que está la información.\nSe hace hincapié en la importancia del provenance: grabar los experimentos nos permite no sólo reporducirlos posteriormente, (con el ahorro que eso conlleva), sino analizar si son correctos con todos los metadatos que tenemos y la capacidad de ver si partes de los mismos son compatibles con otras de otros lugares. (Viendo por ejemplo si las entradas y las salidas coinciden).\nSin embargo, aunque el provenance tenga los datos y metadatos distribuidos en varias fuentes, los usuarios que accedan a él han de verlo como un único almacén. Para ellos la gestión de la información que ocurre por debajo ha de ser transparente, tan solo les interesa la respuesta a su consulta.\nA continuación se describen las necesidades de la e-Science, que son las siguientes:\nGestión de los datos: cada vez tenemos más datos, que van creciendo sin parar.\nNecesidad de soportar la naturalidad colaborativa multidisciplinaria de la ciencia: varios experimentos de varios equipos que han de trabajar juntos, por ejemplo.\nLa necesidad de reusar y reinterpretar información, y de entender su calidad.\nDescubrir información y herramientas que mejor le vengan a los científicos.\nIntegrar, operar agregar y comparar nueva información e información heredada.\nAcabar con la división entre datos, experimentos y publicaciones científicas.\nOrganizar e indexar la información obtenida con la investigación\nApoyar una investigación colaborativa multidisciplinaria\nSoportar, reusar y reinterpretar los recursos de los experimentos, y analizar su calidad.\nBuscar los recursos para los datos y herramientas de los científicos\nEl capítulo continúa enumerando varios proyectos relacionados y qué es lo que hace cada uno. También explica los problemas que trata y las herramientas semánticas que usa.\nGestión datos de investigación: el Observatorio Solar-Terrestre Virtual: Proyecto en el que se muestra cómo las tecnologías semánticas pueden ser aplicadas para proveer a los científicos acceso a conjuntos de datos observacionales.\nSoporte a investigación colaborativa multidisciplinaria: el entorno social virtual de investigación myExperiment: Aunque en un principio surgió como una simple red social para científicos, con el tiempo se ha convertido en un entorno social virtual de investigación basado en web. Sus 3 principales características son gestión del contenido, anotación de objetos e intarcción como si de una red social se tratase. Todo el modelo de datos está expresado en RDF, para ser reusable por otros proyectos, y los usuarios pueden subir nuevos contenidos para actualizar los workflows de sus experimentos. De esta manera podemos hacer un seguimiento de sus progresos.\nReusabilidad, reinterpretación y calidad de los experimentos : Qurator: Proyecto en el que se usa el modelado semántico para formalizar nociones de calidad de información en el contexto de e-Science, y para llevar a cabo la especificación de procesos formales que codifican la computación de métricas de calidad definidas por el usuario.\nDescubrimiento de datos y herramientas: el (BioCatalogue Web Service Registry) y el servicio web de anotación semántica QuAsar: el proyecto Biocatalogue tiene el objetivo de construir un servicio web de registro dedicado a la vida de la comunidad científica, ofreciendo una descripción semántica de los servicios web. Por otra parte, el proyecto QuAsar desarrolló un método para el aprendizaje de la anotación semántica en servicios web que una diferentes fuentes de información.\nCross-linking of Data Sources: Linked Open Data:La integración de datos científicos es un problema conocido. La información está esparcida por la red, en diferentes bases de datos y en diferentes formatos, haciendo muchas veces que obtengamos información incompatible. Sin embargo, para rellenar estos huecos de acceso se han ido desarrollando una seria de servicios web que sirvan de puente entre un tipo de datos y otro.\nEl proyecto Linking Open Drug Data intenta adoptar este modelo, favoreciendo la interoperabilidad.\nAcabando con la división entre datos, experimentos y publicaciones científicas: el proyecto Prospect: La división con la que se plantea acabar este proyecto es la que impide reusar y reciclar las investigaciones pasadas para que sean completamente explotadas. Se centra en el área de la Química, y mediante el uso de RDFS y Ontologías permite a los científicos buscar fácilmente artículos relacionados con el tema que están tratando, e incluso de acuerdo a la estructura jerárquica de clasificación de los términos usados en la búsqueda.\nEn último lugar, se habla de los recursos relacionados, que aportan otros puntos de vista interesantes para la visión de la e-Science semántica, y culmina haciendo un resúmen de los asuntos que aún quedan pendientes por resolver:\nUsabilidad de las tecnologías: lo útlimo que esperan los usuarios es tener que aprender complejas herramientas a la hora de realizar el proceso de revisión.\nIdentidades heterogéneas implican que los enlaces cruzados se compliquen: actualmente existen varios intentos de hacer homogéneas las identidades, pero esto no se puede conseguir a menos que se llegue a un consenso general.\nMejor soporte para buscar en la Web: la meta que se ha de proponer la web semántica es ser comparable a los motores de búsquedas actuales. La gente no va a cambiar a menos que esté convencida de las mejoras.\nConfianza y calidad: las aplicaciones construidas en la web semántica no servirán de mucho si la calidad y confianza de la información que encontramos es subjetiva. Para ello sirven todos los metadatos asociados a la información, que se han de recoger y gestionar de manera automática en la medida de lo posible.\nTransferencias de conocimiento para involucrar a los científicos: son los propios científicos los que necesitan aprender a organizar e indexar la información y el conocimiento que generan sus experimentos, así como compartirlos con el resto de la comunidad. Si no se implican en los métodos y prácticas de investigación propuestos, toda la maquinaria descrita anteriormente no serviría para mucho.\nTransferencia de conocimiento y educación: no solo hay que difundir las novedades obtenidas a otros científicos, sino también a nuevos estudiantes que empiecen a interesarse por las mismas.\nAssessing Information Quality Using Web Data Provenance",
  "speaker": "SYSTEM",
  "uuid": "461b71e2-22d7-4dc6-b58f-3cf614951923"
}