{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle: \"Applying latest Deep Learning techniques to terminology extraction in specific domains\"\n- Description: The recent application of Deep Learning techniques to keyphrase extraction (Sahrawat 2019, Grootendorst 2020, Abulaish 2022) by using deep contextual language models have enhanced the performance in the domain of Automatic Term Extraction. This TFM is aimed at applying these techniques to specific domains such as technology, bio or law.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: esDBTypes: Inferring resource type(s) in a Knowledge Graph  -\n- Description: In a Knowledge Graph (KG), like DBpedia, the challenge \"Entity Typing\" aims at inferring the type of the untyped resource in the KG. This challenge has been faced in previous works with good results. However, recent papers show a big performance enhancement by the combination of NLP and KG techniques, the so-named RDF2vec approaches. This work is focused on applying these new techniques to the Spanish DBpedia.\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle: Text2RDF:Language generation to generate RDF from DBpedia abstracts -\n- Description: Generating triples from natural language text has had recently a big push due to the rise of relation extraction by using generative language models (like BART or T5). The objective of this work will be to use such advancements to create a system that can generate DBpedia triples given a Wikipedia abstract (or even the complete page).\n- Funding schema: perhaps GSoC (\nGoogle Summer of Code\n)\nTitle: TUChecker:Advances techniques to validate Translation Units -\n- Description: Translation Units (TUs) are a cornerstone in Machine Translation (MT). Each TU is a pair of sentences from one source language to a target language. MT systems require millions of these TUs for training and testing translation models. However, these TUs use to have many kinds of errors that down-perform the translation model. The objective of this work will be to apply several Machine Learning & Natural Language Processing techniques to detect such problematic TUs and remove them from the TUs datasets.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: MachineHelper: Humans teach machines the subtle details of languages -\n- Description: Idioms (\nmodismos\nor\nclichés\nin Spanish) are a nightmare for language students. Also machines can get confused by the subtle meaning of these words. The objective of this work is to provide a web application in which users can contribute and validate these special sets of words. Additionally, a REST API will provide an efficient communication with external applications. We will use NLP techniques and Machine Learning / Statistics, and we will apply this tool to different ongoing research projects.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: SummaryValidator: Humans teach machines how to summarize -\n- Description: Generative models like T5 allow us to summarize texts beyond extractive summarization (selection of most relevant sentences in a text), allowing the so called abstractive summarization (creating new sentences not found in the text). However, the training of these neural models depends on high-quality training and validation datasets. The objective of this work is to create a web application (ideally, a reactive application using the shiny package) to \"lint\" (clean up) these datasets. You can re-use a tool created by other TFM in the course 21-22, enhance it and include new functionality (like data exchange with an ecosystem of services). A perfect TFM for people skilled on language models and curious about latest techniques in software development.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: Smart Focused Crawling: IA for parallel corpus creation -\n- Description: In the context of Neural Machine Translation (NMT), Prabha's 2021 work shows a hybrid focused crawler that improves the performance of focused web crawlers. This system integrates an approach based on semantic similarity with the probabilistic similarity model and takes various text characteristics as features. Experimental results show that this algorithm outperforms previous algorithms, like Breadth-First-Crawler (BFS), Vector Space Model Crawler (VSM), among others, in terms of harvest rate, precision rate and irrelevance ratio. This TFM will study these techniques in the context of an active research project.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: On Feature Decay Algorithms: Filtering parallel corpus -\n- Description: The Feature Decay algorithms have proven to be the most efficient in the selection of data for the training of neural translators in the selection of corpora for small training sets (between 2 and 4 million sentences pairs). This TFM will determine which dataset is optimal to reach the best results using the least time and computational resources for the sake of quality and efficiency of the process. This TFM will study these algorithms in the context of an active research project.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nTitle: On cleaning algorithms for Spanish -\n- Description: This TFM will review the SotA in corpus cleaning for Spanish, from BETO to MarIA models, applied in the context of Neural Machine Translation.\n- Funding schema: if good results are achieved in the first 3 months of the TFM, is it possible to achieve a student grant in our research group (OEG).\nCourse 21/22\n\nCarlos Badenes\n\nTitle: Relation extraction between biomedical entities from scientific texts\n- Description: The CORD-19 collection contains scientific publications on coronaviruses. From a fine tuning on the BioBERT language model we have created a named entity identifier that has annotated the scientific publications with the drugs, diseases, proteins and genes mentioned in their text. The goal of this TFM is to infer relationships between these entities, using both the content of scientific publications and external knowledge bases.\n- No funding available\nOscar Corcho\n\nTitle: Knowledge discovery from the combination of mobility, meteorological and traffic data in the region of Madrid\n- Description: Since 2017 CRTM (Consorcio Regional de Transportes de Madrid) is accumulating data related to the usage of the public transport card in the region of Madrid. We have been doing several MSc theses in the last three years analysing several aspects related to persons with reduced mobility and senior citizens, and now in this thesis we will focus on understanding whether there are any relationships between public transport usage patterns and meteorology and traffic, using open data sources available for the region of Madrid.\n- No funding available\nDaniel Garijo",
  "speaker": "SYSTEM",
  "uuid": "49955b20-dbca-4dd8-8eaa-7a393f413d76"
}