{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 25\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11174\n2.  Para la realización del mencionado seguimiento los Centros de I+D de adscripción \nde las ayudas deberán presentar a la Dirección General de Investigación y Gestión del Plan \nNacional de I+D+i una memoria descriptiva de la actividad realizada en la estancia, mediante \nlos medios habilitados para ello en la página web del MICINN y siguiendo las instrucciones \nque allí se indiquen. Esta justificación deberá ser presentada antes del 1 de abril de 2012 y \ndirigida a la Dirección General de Investigación y Gestión del Plan Nacional de I+D+i.\nPreviamente, el personal investigador en formación, en el plazo de 15 días naturales a \ncontar desde el siguiente a su regreso, cumplimentará a través de los medios habilitados \npara ello en la página web del MICINN el formulario de justificación, que deberá imprimir y \npresentar, con la correspondiente firma original y junto con la documentación adicional \ncorrespondiente, en su Centro de I+D receptor.\n3.  Los beneficiarios de ayudas estarán sujetos a las actuaciones de control que lleven \na cabo las instituciones facultadas para ello por la Ley General de Subvenciones y, en su \ncaso, por la normativa comunitaria de los Fondos Estructurales.\nCAPÍTULO V\nDisposiciones específicas de las ayudas para los precios públicos por matrícula en \nel máster o doctorado del Subprograma FPI-MICINN\nArtículo 48.  Objeto.\nEl objeto de estas ayudas es la compensación por la exención del pago de los precios \npúblicos, o equivalente, de las matrículas del personal investigador en formación, en fase \nde beca, que tengan una ayuda al amparo de la presente convocatoria o anteriores, \ncorrespondientes a los cursos 2009-10 y/o 2010-11, para los conceptos de matrícula del \ncorrespondiente programa de doctorado o máster que forme parte del programa de \ndoctorado realizado en la universidad española.\nArtículo 49.  Beneficiarios.\nPodrán ser beneficiarios de estas ayudas, las universidades públicas y las universidades \nprivadas sin fin de lucro, en las cuales el personal investigador en formación, en fase de \nbeca, esté matriculado en el correspondiente programa de doctorado o máster que forme \nparte del programa de doctorado.\nArtículo 50.  Cuantía y pago de los precios públicos.\n1.  El Ministerio de Ciencia e Innovación abonará a las universidades, con posterioridad \na la publicación de la resolución de concesión, el importe que justifiquen por tal concepto, \ncon las siguientes limitaciones por becario:\na)  Cuando se trate de estudios de cursos de doctorado, organizados conforme a la \nnormativa del Real Decreto 778/1998, se abonarán hasta 32 créditos, de los cuales un \nmáximo de 20 corresponderá al primer año de matrícula en los cursos de doctorado y un \nmáximo de 12 en el segundo.\nb)  Cuando se trate de estudios de doctorado organizados conforme a la normativa de \nlos reales decretos 56/2005 y 1397/2007 respectivamente, se abonarán hasta 60 créditos \ncorrespondientes al periodo formativo del programa de doctorado.\nEn el caso de becarios que hayan cambiado de programa de posgrado, se podrán \njustificar los importes correspondientes a las matrículas de tales programas, con los límites \nindicados en el párrafo anterior.\nEn el caso de las universidades privadas sin fin de lucro, las cuantías subvencionables \npor crédito no podrán superar los precios públicos por la prestación de servios académicos \nuniversitarios establecidas por la correspondiente Comunidad Autónoma para las \nuniversidades públicas.\n2.  El gasto resultante será imputado a las aplicaciones presupuestarias indicadas en \nel artículo 4.2 para el subprograma FPI-MICINN.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "4b8fd85d-1e89-4ed6-8453-aa470574f501"
}