{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 6\nnoticed a couple of months later he was made the head of the department. I noticed the other day he was a\nMember of the National Academy of Engineering. I noticed he has succeeded. I have never heard the\nnames of any of the other fellows at that table mentioned in science and scientific circles. They were unable\n&\nto ask themselves, ``What are the important problems in my field?''\n\f\nIf you do not work on an important problem, it's unlikely you'll do important work. It's perfectly obvious.\nGreat scientists have thought through, in a careful way, a number of important problems in their field, and\n*\nthey keep an eye on wondering how to attack them. Let me warn you, `important problem' must be phrased\n\f\ncarefully. The three outstanding problems in physics, in a certain sense, were never worked on while I was\n\u0007\nat Bell Labs. By important I mean guaranteed a Nobel Prize and any sum of money you want to mention.\n\t\nWe didn't work on (1) time travel, (2) teleportation, and (3) antigravity. They are not important problems\n\u0019\nbecause we do not have an attack. It's not the consequence that makes a problem important, it is that you\n\u001d\nhave a reasonable attack. That is what makes a problem important. When I say that most scientists don't\nwork on important problems, I mean it in that sense. The average scientist, so far as I can make out, spends\n\nalmost all his time working on problems which he believes will not be important and he also doesn't believe\n\t\nthat they will lead to important problems.\n\f\nI spoke earlier about planting acorns so that oaks will grow. You can't always know exactly where to be,\n\u000b\nbut you can keep active in places where something might happen. And even if you believe that great\n\u001d\nscience is a matter of luck, you can stand on a mountain top where lightning strikes; you don't have to hide\n\u0006\nin the valley where you're safe. But the average scientist does routine safe work almost all the time and so\nhe (or she) doesn't produce much. It's that simple. If you want to do great work, you clearly must work on\nimportant problems, and you should have an idea.\nAlong those lines at some urging from John Tukey and others, I finally adopted what I called ``Great\n\u0004\nThoughts Time.'' When I went to lunch Friday noon, I would only discuss great thoughts after that. By\n$\ngreat thoughts I mean ones like: ``What will be the role of computers in all of AT&T?'', ``How will\n\u0017\ncomputers change science?'' For example, I came up with the observation at that time that nine out of ten\n\u0007\nexperiments were done in the lab and one in ten on the computer. I made a remark to the vice presidents\n\b\none time, that it would be reversed, i.e. nine out of ten experiments would be done on the computer and one\n\u000e\nin ten in the lab. They knew I was a crazy mathematician and had no sense of reality. I knew they were\n\u001e\nwrong and they've been proved wrong while I have been proved right. They built laboratories when they\n\ndidn't need them. I saw that computers were transforming science because I spent a lot of time asking\n \n``What will be the impact of computers on science and how can I change it?'' I asked myself, ``How is it\ngoing to change Bell Labs?'' I remarked one time, in the same address, that more than one-half of the\n\u0017\npeople at Bell Labs will be interacting closely with computing machines before I leave. Well, you all have\n\u000f\nterminals now. I thought hard about where was my field going, where were the opportunities, and what\n\f\nwere the important things to do. Let me go there so there is a chance I can do important things.\n\nMost great scientists know many important problems. They have something between 10 and 20 important\nproblems for which they are looking for an attack. And when they see a new idea come up, one hears them\n\u000f\nsay ``Well that bears on this problem.'' They drop all the other things and get after it. Now I can tell you a\n\u0006\nhorror story that was told to me but I can't vouch for the truth of it. I was sitting in an airport talking to a\n\u001a\nfriend of mine from Los Alamos about how it was lucky that the fission experiment occurred over in\n+\nEurope when it did because that got us working on the atomic bomb here in the US. He said ``No; at\n\"\nBerkeley we had gathered a bunch of data; we didn't get around to reducing it because we were building\n\u0002\nsome more equipment, but if we had reduced that data we would have found fission.'' They had it in their\n\u0006\nhands and they didn't pursue it. They came in second!\nThe great scientists, when an opportunity opens up, get after it and they pursue it. They drop all other\nthings. They get rid of other things and they get after an idea because they had already thought the thing\n\f\nthrough. Their minds are prepared; they see the opportunity and they go after it. Now of course lots of\n\f\ntimes it doesn't work out, but you don't have to hit many of them to do some great science. It's kind of easy.\n\f\nOne of the chief tricks is to live a long time!\n\u001c\nAnother trait, it took me a while to notice. I noticed the following facts about people who work with the\ndoor open or the door closed. I notice that if you have the door to your office closed, you get more work\n \ndone today and tomorrow, and you are more productive than most. But 10 years later somehow you don't\n \nknow quite know what problems are worth working on; all the hard work you do is sort of tangential in\n,\n",
  "speaker": "SYSTEM",
  "uuid": "4bf4d921-fd32-4f5e-9522-a346033725ec"
}