{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 10\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97735\npara su incorporación. Los períodos de aplazamiento no serán recuperables del período \nmáximo de disfrute de la ayuda.\n3.  El alta se tramitará previa presentación por los interesados, a través de los \norganismos de adscripción, de los siguientes documentos:\na)  Acta de toma de posesión y de aceptación de las obligaciones como beneficiario \nde una subvención de esta convocatoria, con el VºBº del Director de la Tesis, del Director \ndel Departamento universitario o similar en el caso de otros centros o instituciones, y del \nresponsable legal de la entidad a la que pertenezca el centro de adscripción de la ayuda.\nb)  Número de afiliación a la Seguridad Social.\nc)  Declaración responsable de becas o ayudas disfrutadas de naturaleza semejante \nen cuanto a sus objetivos y su cuantía, a efectos del período máximo de disfrute de la \nbeca.\nLa documentación se presentará directamente en el centro de adscripción de la ayuda \npara que sea enviada a la Dirección General de Política Universitaria, dentro de los diez \ndías hábiles siguientes al de la fecha de incorporación.\nCualquier variación en las condiciones tenidas en cuenta para la evaluación de las \nsolicitudes interrumpirá el trámite de alta y, en su caso, dará lugar a la anulación de la beca \nprevia audiencia del interesado.\n4.  En el caso de necesidad de ausentarse temporalmente del centro de adscripción \ndeberá autorizarse previamente por la Dirección General de Política Universitaria; la \nsolicitud deberá contar con la conformidad del director de la tesis y que la finalidad de la \nausencia este relacionada con las actividades de formación y de investigación, que deberá \njustificarse con una memoria detallada de la actividad a realizar durante la misma. Tales \nausencias no podrán modificar el calendario formativo ni extenderse por períodos que \npuedan retrasarlo, así mismo no podrá fundamentarse en actividades con objetivos \ndiferentes a la realización del doctorado.\nPara las ausencias con motivo de la asistencia a congresos, reuniones o jornadas \ncientíficas, se requerirá solamente la autorización del vicerrector o responsable orgánico \ncompetente del centro de adscripción de la ayuda.\n5.  El cambio que afecte director o proyecto de tesis deberá contar previamente con \nla autorización de la Dirección General de Política Universitaria, que resolverá a la vista del \ninforme del director de tesis, del departamento y del responsable orgánico competente del \ncentro de adscripción de la ayuda. En ningún caso, se autorizarán cambios durante el \nprimer año de permanencia en el programa, salvo que concurran circunstancias de fuerza \nmayor apreciadas por la Dirección General de Política Universitaria. En todo caso, los \ncambios que se autoricen lo serán en términos que no desequilibren las circunstancias \nque motivaron la concesión de la ayuda y, en especial, las calificaciones otorgadas en \ncada uno de los criterios de evaluación.\nLos cambios de organismos, que en su caso puedan solicitar lo beneficiarios de las \nayudas, solo podrán concederse, si procediera, con efectos de primero de año en virtud de \nlos efectos económicos del convenio de colaboración suscrito con el Ministerio de \nEducación.\n6.  Los efectos económicos, administrativos de las altas y bajas se producirán en \nfunción de la fecha de comunicación, considerándose en todos los casos meses de 30 \ndías. La percepción de la ayuda en el mes de su finalización se hará con efectos del último \ndía que corresponda, siempre y cuando no se produzca la renuncia con anterioridad a esa \nfecha o existan otras causas de revocación o baja. En el supuesto excepcional de \nincorporación o baja en fechas diferentes a las señaladas, el importe a percibir en ese mes \nserá proporcional al período cubierto desde esa fecha.\n7.  El cambio de la situación de beca a contrato en practicas por la universidad, centro \no institución a la que estuviera adscrita la ayuda, se producirá con efectos del cumplimiento \nde los 24 meses de beca, una vez acreditados los requisitos establecidos en el artículo 6.2 \na) y b).\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "4d300bdf-27a9-40be-94cf-7012d716273d"
}