{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 4\n50 \nO. Corcho \nRelation instances that relate two concept instances by \nsome domain specific relation. For example, the flight \nAA7615_Feb08_2003 and the location Madrid can be \nconnected by the relation departurePlace. \n2.2 Relationships between different annotation \napproaches \nAs shown in the previous examples, there are some \nsimilarities and differences between the different groups of \nannotations. We detail below some of these relationships: \nDublin Core annotations mainly describe properties of \nthe document itself without providing too many details \nabout its content (only some keywords and natural language \ndescriptions in properties like subject or description). \nOntology based annotations are instead devoted to describe \nthe content of the document, and not its general properties. \nFinally, thesauri and controlled vocabularies can be used in \nboth approaches to provide agreed terms in specific \ndomains. Consequently, all the approaches complement \neach other. \nIn general, Dublin Core annotations are more ambiguous \nthan annotations based on a thesaurus or controlled \nvocabulary, and these are also more ambiguous, in general, \nthan the annotations based on ontologies. For instance, \nDublin Core recommends best practices (nonnormative) for \nmost of the values to be used when describing documents; \nannotations based on thesauri give clear guidelines on the \nterms to be used; and finally ontology based annotations \nnormally include relation instances that give ‘refer to clear’, \nwhile in ontology based approaches some of these values \nwill be references to other instances in the ontology. \nFinally, the more heavyweight an ontology is, the easier \nit will be to check constraints in its related document \nannotations, since heavyweight ontologies define more \nrestrictions on the allowed values of the annotations, on \ntheir relationships, etc. \n3 \nOntology languages for metadata annotation \nAs commented in the introduction, metadata can be \nexpressed in many different languages, from natural to \nformal ones. In this section we will focus on those formal \nlanguages used so far to annotate metadata based on \nontologies. \nIn the preSemantic Web approaches followed by the \n(KA)2 initiative and by the SHOE project, the languages \nused to express metadata were HTML and SHOE (Luke and \nHeflin, 2000) respectively. In its turn, SHOE used HTML \nfirst and XML (Bray et al., 2000) later as their underlying \nsyntax. Let us see some examples based on the example \npresented in Section 2. \n \n \n \n \n \n(KA)2 proposed to use an extension of HTML to insert \nontology based annotations in Web pages. As described in \n(Benjamins et al., 1999), this extension was to be \nunderstood by agents aware of such extended language, \nlike Ontobroker (Fensel et al., 1999). However, this \napproach does not specify the language in which the \nreferred ontology must be implemented. Below we  \npresent an example of the kind of annotation proposed in \n(KA)2, applied to the description of our motivating  \nexample, where we say that we are describing an  \ninstance of the class AA7462, that its departure  \ndate is 8th February 2003, and that the arrival place is \nSeattle. \n<html> \n<head> \n<TITLE>Flight \nDetails</TITLE> \n<a ONTO=\"flight:AA7462\"/> \n</head> \n<body> \non Saturday <a ONTO=”flight[departureDate=body]”>08 \nFebruary 2003</a> at <b>11:50</b> \nArriving in <a ONTO=”flight[arrivalPlace=body]”>Seattle \n</a> – Seattle/Tacoma International \n</body> \n</html> \nThe SHOE approach is similar to (KA)2. It consists in an \nextension of HTML that can be used to describe Web \nresources. Instead of using the ONTO property inside  \nthe A tag for expressing annotations, SHOE proposes to use \na set of predefined tags like INSTANCE, CATEGORY, \nRELATION, etc., which are inserted inside the HTML code \nof the Web page. Below we show the same example  \nused for illustrating (KA)2 using the HTML version of \nSHOE. The code presented should be inserted in the  \nsource code of the Web page. This approach imposes  \nto use ontologies implemented also in the SHOE  \nlanguage. \n<INSTANCE KEY=\"AA7462-Feb08-2003\"> \n  <USE-ONTOLOGY ID=\"Travel-Ontology\" \n    URL=\"http://delicias.dia.fi.upm.es/SHOE/travel.html\" \n    VERSION=\"1.0\" PREFIX=\"travel\"> \n  <CATEGORY NAME=\"travel.AA7462\"> \n  <RELATION NAME=\"travel.departureDate\"> \n    <ARG POS=1 VALUE=\"me\"> \n    <ARG POS=2 VALUE=\"Feb8-2003\"> \n  </RELATION> \n  <RELATION NAME=\"travel.arrivalPlace\"> \n    <ARG POS=1 VALUE=\"me\"> \n    <ARG POS=2 VALUE=\"Seattle\"> \n  </RELATION> \n</INSTANCE> \n \n \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "4d5cd5a4-99a1-410a-a185-d8969a449253"
}