{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Participaci%C3%B3n_en_grupos_del_W3C \n\nURL:\nMain page\nDescription:\nThe mission of the Semantic Web Health Care and Life Sciences Interest Group, part of the Semantic Web Activity, is to develop, advocate for, and support the use of Semantic Web technologies for health care and life science, with focus on biological science and translational medicine. These domains stand to gain tremendous benefit by adoption of Semantic Web technologies, as they depend on the interoperability of information from many domains and processes for efficient decision support.\nStart date:\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nOne member of the OEG (Mikel Egaña Aranguren) is currently participating in the weekly discussions\nEnrolled:\nMay 2011\nW3C Linked Data Platform Working Group\n\nURL:\n[3]\nDescription:\nThe mission of the Linked Data Platform (LDP) Working Group is to produce a W3C Recommendation for HTTP-based (RESTful) application integration patterns using read/write Linked Data. This work will benefit both small-scale in-browser applications (WebApps) and large-scale Enterprise Application Integration (EAI) efforts. It will complement SPARQL and will be compatible with standards for publishing Linked Data, bringing the data integration features of RDF to RESTful, data-oriented software development.\nStart date:\nJune 2012\nDue date:\nJune 2014\nCurrent status of the group:\nOpen\nRole in the group:\nThree members of the OEG (Raúl García, Miguel and Nandana) are actively participating\nEnrolled:\nJune 2012\nW3C Government Linked Data Working Group\n\nURL:\n[4]\nDescription:\nThe mission of the Government Linked Data (GLD) Working Group is to provide standards and other information which help governments around the world publish their data as effective and usable Linked Data using Semantic Web technologies. The group, a part of the eGovernment Activity and closely connected with the Semantic Web Activity, will collect and make available information about government Linked Data activities around the world. It will use that information and the experience of its participants to develop W3C Recommendations for Best Practices and for RDF Vocabularies necessary for publication of government data in RDF, as Linked Data. Concurrently with this Working Group, W3C has chartered the eGovernment Interest Group for broad community discussion of government use of the Web\nStart date:\nJune 2011\nDue date:\nMay 2013\nCurrent status of the group:\nOpen\nRole in the group:\nTwo members of the OEG (Boris Villazón-Terrazas and Daniel Vila-Suero) participated in the weekly discussions, and development of documents\nEnrolled:\nAdditional information:\nThe group's\nwiki\n.\nW3C Ontology Lexica Comunnity Group\n\nURL:\n[5]\nDescription:\nThe mission of the Ontology-Lexicon community group is to: (1) Develop models for the representation of lexica (and machine readable dictionaries) relative to ontologies. These lexicon models are intended to represent lexical entries containing information about how ontology elements (classes, properties, individuals etc.) are realized in multiple languages. In addition, the lexical entries contain appropriate linguistic (syntactic, morphological, semantic and pragmatic) information that constrains the usage of the entry. (2) Demonstrate the added value of representing lexica on the Semantic Web, in particularly focusing on how the use of linked data principles can allow for the re-use of existing linguistic information from resource such as WordNet. (3) Provide best practices for the use of linguistic data categories in combination with lexica. (4) Demonstrate that the creation of such lexica in combination with the semantics contained in ontologies can improve the performance of NLP tools. (5) Bring together people working on standards for representing linguistic information (syntactic, morphological, semantic and pragmatic) building on existing initiatives, and identifying collaboration tracks for the future. (6) Cater for interoperability among existing models to represent and structure linguistic information. (7) Demonstrate the added value of applications relying on the use of the combination of lexica and ontologies.\nStart date:\nJuly 2011\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nThree members of the OEG (Elena Montiel, Lupe Aguado, Jorge Gracia) participated in the bi-weekly discussions, identification of use cases and requirements, and development of documents.\nEnrolled:\nJuly 2011\nAdditional information:\nThe group's\nwiki\n.\nW3C Best Practices for Multilingual Linked Open Data Community Group\n\nURL:\n[6]\nDescription:\nThe target for this group is to crowd-source ideas from the community regarding best practises for producing multilingual linked open data. The topics for discussion are mainly focused on naming, labelling, interlinking, and quality of multilingual linked data, among others. Use cases will be identified to motivate discussions. Participation both from academia and industry is expected. The main outcome of the group will be the documentation of patterns and best practices for the creation, linking, and use of multilingual linked data.\nStart date:\nApril 2013\nDue date:\nCurrent status of the group:\nOpen\nRole in the group:\nOne member of OEG acts as co-chair (Jorge Gracia) and jointly to other OEG members (Daniel Vila, Elena Montiel, Lupe Aguado) will participate actively in the discussions and development of documents.\nEnrolled:\nApril 2013",
  "speaker": "SYSTEM",
  "uuid": "50d70797-d762-4f58-8c0b-21e73feeec37"
}