{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 4\n4\nAndr´es Garc´ıa-Silva et al.\nThe most related work to our proposal is [20]. In that work, authors aim at\nassociating semantics to user tags assuming that each tag has been used in a\nunique sense by each user. In contrast, our work assumes that each user can use\neach tag in distinct senses. In addition, Tesconit et al. use as context the set of\nuser tags plus those popular tags extracted from Delicious for the set of user\nresources. Instead, we use the co-occurring tags in the same user annotation.\nWe want to note that in our disambiguation activity we use the cosine simi-\nlarity function instead of a custom formula used in [20], to measure the overlap\nof terms in the tag context with respect to the terms in each sense. The cosine\nfunction is a well studied similarity measure in Information Retrieval. Finally,\nthis approach uses Tagpedia as sense repository. However, Tagpedia just deal\nwith English tags, while our approach is multilingual.\n3\nSem4Tags a Process for the Semantic Grounding of\nCross-lingual Folksonomies\nAs discussed in the introduction, one of our objectives is to be able to iden-\ntify the meaning of a tag by associating this tag with a resource in DBpedia.\nIn this process, we take into account the tag context, understood as the set of\nuser tags co-occurring when annotating a resource. It is important to note that\nthe tag and the tags included in its context may be written in diﬀerent lan-\nguages. To accomplish this cross-lingual semantic grounding of tags, we propose\nSem4Tags[9], a process capable of choosing the semantic entity that better de-\nﬁnes the tag meaning in the context where it is used. Therefore, the input is a\ntag, its context, and, optionally, the language of the tag, while its output is the\ncorresponding semantic entity.\nSem4Tags\nTag, Context, [Language]\nTag Preprocessing\nActive Context Selection\nWikipedia\nEnglish and Spanish\nSense Retrieval\n \nMSR\nMultilingual Sense \nRepository\nSense Disambiguation\nSemantic Entity\nFig. 1. Sem4Tags architecture.\nSem4Tags (see Figure 1) preprocesses the tag to ﬁnd a normalized representa-\ntion based on Wikipedia article titles. For doing this, we modify morphologically\n",
  "speaker": "SYSTEM",
  "uuid": "51e41d06-020c-42b6-9702-5f50b87e95a2"
}