{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 117\nBÚSQUEDA \n \n117 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nUna vez conocido el árbol de juego podemos propagar hacia arriba las etiquetas P, \nG, E de las posiciones terminales, según el siguiente método de etiquetado. Si N es \nuna posición MAX no terminal, entonces Etiqueta (N) = G, si algún sucesor de N \ntiene etiqueta G; Etiqueta (N) = P, si todos los sucesores de N tienen etiqueta P; y \nEtiqueta (N) = E, en otro caso. Si N es una posición MIN no terminal, entonces \nEtiqueta (N) = G, si todos los sucesores de N tienen etiqueta G; Etiqueta (N) = P, si \nalgún sucesor tiene etiqueta P; y Etiqueta (N) = E, en otro caso. \nLa etiqueta de una posición nos indica lo mejor que podría jugar MAX en caso de \nque se enfrentáse a un oponente perfecto. \nResolver un árbol de juego significa asignar, siguiendo el proceso anterior, una \netiqueta G, P o E a la posición inicial. En al figura 5 aparece la resolución del árbol \nde juego de la figura 4. Un árbol solución para MAX es un subárbol del árbol de \njuego que contiene a la raíz y que contiene un sucesor de cada posición MAX no \nterminal que aparezca en él y todos los sucesores de cada nodo MIN que aparezca \nen él. (En la literatura, es más frecuente hablar de \"estrategias\" en lugar de \"árboles \nsolución\"; hemos preferido esta terminología para evitar confusiones con la noción \nde \"estrategia de control\" en sistemas de producción.) Un árbol solución para MAX \ndebe ser interpretado como un plan (una estrategia) de los movimientos que debe \nrealizar MAX, ante cualquier movimiento posible de MIN. Conociendo un árbol \nsolución para MAX, podemos programar a un computador para que juegue con un \ncontrincante MIN, humano o máquina . Sin embargo, en general, un árbol solución \npara MAX no asegurará que éste gane (ni siquiera que juegue con un mínimo de \nhabilidad). Un árbol solución para MAX se llamará árbol ganador para MAX (o \nestrategia ganadora para MAX) si todas las posiciones terminales del árbol solución \ntienen etiqueta G. Evidentemente, un árbol ganador para MAX asegura que el \njugador MAX ganará, haga lo que haga MIN. En general, existirá un árbol ganador \npara MAX si y sólo si al resolver el árbol de juego la etiqueta de la posición inicial es \nG. En la figura 5, el subárbol definido por las aristas punteadas es un árbol ganador \npara MAX. \n",
  "speaker": "SYSTEM",
  "uuid": "5308d31e-4aa7-40c2-8b94-b8211672cafd"
}