{
  "message": "SYSTEM: GeneralOntologies-v3_%28mariano%29.pdf: Página 69\nBased on Mariano Fernández-López, Asunción Gómez-Pérez and Mª Carmen Suárez Figuereoa’s work\nMULTI-FCA ANALYSIS. INTEGRATION EFFORT (I)\n\u0001 \nIntegration Effort. It refers to the estimate of the effort needed for integrating the candidate ontology\ninto the ontology being developed. In this case, the following criteria should be analyzed: \n• \nAdequacy of knowledge extraction. It refers to whether it is easy to identify parts of the candidate \nontology to be reused and to extract them. For example, in large and not modularized ontologies \n(e.g. SUO) it is extremely  difficult  to extract the part of the knowledge we are interested in.  \n• \nAdequacy of naming conventions. It refers to whether both ontologies (the candidate and the one \nbeing developed) follow the same rules for naming the different ontology components (e.g., \nconcept names should start with capital letters, relation names should start with non-capital \nletters). \n• \nAdequacy of the implementation language. It refers to whether both languages (the candidate \nontology’s and the ontology’s being developed) are the same, or at least are able to represent \nsimilar knowledge with the same granularity. \n• \nKnowledge clash. It refers to whether there are contradictory bits of knowledge between the \ncandidate ontology to be reused and the ontology being developed (e.g., having density in a time \nontology and requiring no density in the ontology being developed). \n• \nAdaptation to the reasoner. It refers to whether the adaptation of definitions and axioms that \nsatisfy the existing restrictions of the reasoner are needed (e.g., explicit definitions can be \nincluded in OWL ontologies; however, this kind of definitions can not be included in ontologies \nwritten in Prolog). \n• \nNecessity of bridge terms. It refers to whether it is necessary to create new linking axioms and/or \nrelations to integrate the candidate ontology to be reused into the ontology being developed. \n",
  "speaker": "SYSTEM",
  "uuid": "53a2e555-b954-4f86-bdf1-844f855956b0"
}