{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 18\nPage 18 of 111 \nNeOn Integrated Project EU-IST-027595 \nfeasibility study is used to analyse the idea or need, the potential approaches, and all life cycle \nconstraints and benefits. Justification for each recommendation shall be fully documented and \nformally approved by all concerned organizations (including the user and the developer). This \ngroup is divided into three activity subgroups: Concept Exploration, System Allocation, and \nSoftware Importation. \n3. Development Activity Group [4]. This group includes the activities performed during the \ndevelopment and enhancement of a software project. For example, Design activity has as main \ngoal to develop a coherent, well-organized representation of the software system that meets the \nsoftware requirements. This group is divided into three subgroups: Software Requirements, \nDesign, and Implementation. \n4. Post-Development Activity Group [4]. This group includes the activities that install, operate, \nsupport, maintain, and retire a software product. For example, the Installation activity consists of \nthe transportation and installation of a software system from the development environment to the \ntarget environment(s); and the Operation and Support activities involve user operation of the \nsystem and ongoing support. Support includes providing technical assistance, consulting with the \nuser, and recording user support requests by maintaining a Support Request Log. This group is \ndivided into four subgroups: Installation, Operation and Support, Maintenance, and Retirement. \n5. Support Activity Group [4]. This group includes activities that are necessary to assure the \nsuccessful completion of a project, but that are considered as supporting activities rather than as \nactivities directly oriented to the development effort. In other words, the Support Activity Group \nincludes the set of activities necessary to ensure that a system fulfils its original requirements and \nany subsequent modifications to those requirements. For example, the Documentation \nDevelopment activity for software development and usage has as purpose to plan, design, \nimplement, edit, produce, distribute, and maintain the documents that are needed by developers \nand users. This group is divided into four subgroups: Evaluation, Software Configuration \nManagement, Documentation Development, and Training. \n2.2.2. ISO development process \nISO 12207 [7] establishes a software development process including processes, activities and \ntasks applied during the acquisition and configuration of the services of the system. Each process \nwithin the life cycle has a set of outcomes associated with it. The structure of the standard reflects \na flexible, modular way that is adaptable to the needs of whoever uses it. The standard \nemphasises two basic principles: modularity and responsibility. Modularity means processes with \nminimum coupling and maximum cohesion. Responsibility means establishing a responsibility for \neach process, facilitating the application of the standard to projects in which many people can be \nlegally involved.  \nThis International Standard [7] groups the activities that may be performed during the life cycle of a \nsoftware system into seven process groups. Each of the processes within those groups is \ndescribed in terms of its purpose and desired outcomes and lists activities and tasks that need to \nbe performed to achieve those outcomes. The purposes and outcomes of these processes \nconstitute a process reference model. \nThe seven process groups, shown in Figure 1, are the following: \n1. Agreement Processes define the activities necessary to establish an agreement between two \norganizations. These processes are the acquisition process and the supply process. \n2. Project-Enabling Processes manage the organization’s capability to acquire and supply \nproducts or services through the initiation, support and control of projects. \n3. Project Processes. There are two categories of Project Processes: project management \nprocesses and project support processes. The Project Management Processes are used to \n \n",
  "speaker": "SYSTEM",
  "uuid": "55ff71eb-db9c-48c1-a641-6dcc6fd2a25b"
}