{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 1\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13909\nI.  DISPOSICIONES GENERALES\nMINISTERIO DE EDUCACIÓN\n2541\nReal Decreto 99/2011, de 28 de enero, por el que se regulan las enseñanzas \noficiales de doctorado.\nLa Ley Orgánica 6/2001, de 21 de diciembre, de Universidades, en su nueva redacción \ndada por la Ley Orgánica 4/2007, de 12 de abril, por la que se modifica la anterior, define \nla estructura de las enseñanzas universitarias en tres ciclos: Grado, Máster y Doctorado. \nLos estudios de doctorado, correspondientes al tercer ciclo, conducen a la obtención del \ntítulo oficial de Doctor o Doctora, de carácter oficial y validez en todo el territorio nacional. \nSegún establece la citada Ley, los estudios de doctorado se organizarán y realizarán en la \nforma que determinen los estatutos de las universidades, de acuerdo con los criterios que \npara la obtención del título de Doctor apruebe el Gobierno, previo informe del Consejo de \nUniversidades.\nEl desarrollo del tercer ciclo dentro de la construcción del Espacio Europeo de \nEducación Superior (EEES) debe tener presente las nuevas bases de la Agenda Revisada \nde Lisboa, así como la construcción del Espacio Europeo de Investigación (EEI) y los \nobjetivos trazados para éste en el Libro Verde de 2007. De este modo, el doctorado debe \njugar un papel fundamental como intersección entre el EEES y el EEI, ambos pilares \nfundamentales de la sociedad basada en el conocimiento. La investigación debe tener una \nclara importancia como parte integral de la educación superior universitaria y la movilidad \ndebe ser valorada tanto en la etapa doctoral como Postdoctoral, como pieza esencial en la \nformación de jóvenes investigadores.\nEl proceso del cambio del modelo productivo hacia una economía sostenible necesita \na los doctores como actores principales de la sociedad en la generación, transferencia y \nadecuación de la I+D+i. Los doctores han de jugar un papel esencial en todas las \ninstituciones implicadas en la innovación y la investigación, de forma que lideren el trasvase \ndesde el conocimiento hasta el bienestar de la sociedad.\nDesde el punto de vista europeo, desde el comunicado de Berlín en 2003, hasta el \núltimo comunicado de Lovaina en 2009, los ministros europeos responsables de la \neducación superior han ido avanzando en el desarrollo de aquellos aspectos que deben \ncaracterizar un programa de doctorado en el marco de los Espacios Europeos de Educación \nSuperior e Investigación. De igual manera, los diferentes encuentros y actividades de la \nEuropean University Association (EUA) han realizado un conjunto de estudios y \nrecomendaciones para el desarrollo de los programas de doctorado.\nEn el Comunicado de Berlín (2003) se trata, dentro de las acciones adicionales, el papel \ndel doctorado en la relación entre el EEES y el EEI. El proceso de concreción del doctorado \ncomo tercer ciclo se percibe de forma clara a partir del proyecto piloto «Doctoral Programmes \nfor the European Knowledge Society» promovido por la European University Association \n(EUA) que es utilizado de base del Comunicado de la Conferencia de Bergen (2005), donde \nse establece definitivamente el doctorado como tercer ciclo de los estudios europeos, \ndiferenciado del máster. En dicho comunicado los ministros europeos responsables de la \neducación superior destacan la importancia de la educación superior universitaria en la \nmejora de la I+D+i y la importancia de la investigación en el apoyo de la función docente \nuniversitaria, todo ello para mejorar el desarrollo económico y cultural de nuestras sociedades, \nasí como de forma fundamental defender su papel como elemento de cohesión social. El \ncomponente fundamental de la formación doctoral es el avance del conocimiento científico a \ntravés de la «investigación original». Además, se considera que en este tercer ciclo los \nparticipantes en programas de doctorado no son sólo estudiantes sino investigadores en \nformación. Con ello se enlaza en este momento del Proceso de Bolonia la formación doctoral, \nla carrera investigadora y la transmisión del conocimiento a la sociedad.\ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "570bc252-f8bb-4aea-9162-08cf6b99a7ca"
}