{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual29042010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n1. Instalación de la ultima versión de DBpedia (español e inglés) en servidores virtouso y sdb.\n2. Analisis de los resultados del experimento para la implementación de las mejoras. Se han identificado las siguientes mejoras al algoritmo:\n- Escoger siempre el significado preferido por los usuarios de wikipedia para una palabra a menos de que haya evidencia de que no es el significado de la etiqueta.\n- Utilizar información de coordenadas geograficas en el proceso de desambiguación\n- Utilizar información semántica extraida de DBpedia dentro del proceso de desambiguación.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Modelado del algoritmo de asignanción semantica de atributos de fuentes REST.\n- Implementación parcial del algoritmo. Cabe indicar que se esta implementando un sistema de cache para evitar consultas a dbpedia, servicio de sinonimos y servicio de sugerencias\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nEl problema del consumo de memoria se ha solventado parcialmente eliminando los documentos analizados incluso antes de introducirles las anotaciones en la página de salida, eliminando los procesos y el corpus antes de salir del sistema, etcétera. Sin embargo, no se devuelve toda la memoria que se usa. Se sigue buscando el fallo.\nInterfaz Anotación Híbrida\n\n- Se esta Implementando por modulos el Sistema Web, para que se permita anotaciones sociales. Para ello se viene Trabajando en Yii framework, para lograr este objetivo. Se ha creado un nuevo modelo de datos mas liviano, y se añaden funcionalidades progresivamente.\n- Se espera poder presentar un release completamente funcional el martes 11 de Mayo.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha continuado con el desarrollo de las interfaces del metaplanificador, comenzando con la implementación mediante GridFTP de la interfaz de envío de ficheros al grid.\n- Se ha continuado con el testeo del funcionamiento de las interfaces ya implementadas.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSiguiendo el método de parametrización para conjuntos de referencias, se han etiquetado los conjuntos de referencia construidos hasta la fecha para realizar la evaluación parcial en las condiciones adecuadas a la misma.\nEl uso de este método permitirá obtener unos resultados no sesgados\n(ni para bien ni para mal) en la evaluación que se llevará a cabo en\nlas siguientes semanas.\nTarea 7.1\n\n- Preparación de paper para Workshop on Linked Spatiotemporal Data 2010\n- Linked Data.\n· Difusión\n      · Actualización web",
  "speaker": "SYSTEM",
  "uuid": "5759cfe7-7cac-4e2b-a9e1-8a73df4a2a89"
}