{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Large-scale_data_integration \n\nhttp://static.lod2.eu/Deliverables/Deliverable_4.3.1_FP7_LOD2_20110131.pdf\n(to be presented by José Mora on 17/03/2011) (\npresentation\n)\nD. Le-Phuoc, JX Parreira, M Hausenblaus, M. Hauswirth. Continuous Query Optimisation and evaluation over unified linked stream data and linked open data. DERI Technical report 2010-09-27 (to be presented by Oscar?JeanPaul? on 31/03/2011)  -->> Oops, not available that day since I am at the DynaLearn review, so probably some other paper can be presented.\nD. Kossmann. The state of the art in distributed query processing. ACM Computing Surveys, 32(4):422{469, 2000.\nhttp://www.computer.org/cms/Computer.org/ComputingNow/homepage/2011/0311/W_IC_ClientandCloud.pdf\ne-Science oriented\nG. Konstantinidis and J. L. Ambite, “Scalable Query Rewriting: A Graph-Based Approach,” presented at the not yet in press.\nBasca C., Bernstein A. Avalanche: Putting the Spirit of the Web back into Semantic Web Querying. Submitted to SSWS2010.\nD. Le-Phuoc, J. X. Parreira, M. Hausenblas, Y. Han, and M. Hauswirth, “Live linked open sensor database,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nP. N. Mendes, A. Passant, and P. Kapanipathi, “Twarql: tapping into the wisdom of the crowd,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nS. Speiser and A. Harth, “Taking the LIDS off data silos,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nP. E. Salas, K. K. Breitman, J. V. F, and M. A. Casanova, “Interoperability by design using the StdTrip tool: an a priori approach,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nR. Troncy, B. Malocha, and A. T. S. Fialho, “Linking events with media,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010. Also submitted to COLD2010\nO. Hassanzadeh et al., “BibBase triplified,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nB. Haslhofer, E. Momeni, M. Gay, and R. Simon, “Augmenting Europeana content with linked data resources,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nP. Dudchuk, V. P. Klintsov, and D. Hladky, “Ontos clip and share,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-2, 2010.\nT. Lebo and G. T. Williams, “Converting governmental datasets into linked data,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nR. Cyganiak, F. Maali, and V. Peristeras, “Self-service linked government data with dcat and gridworks,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nA. D. León, V. Saquicela, L. M. Vilches, B. Villazón-Terrazas, F. Priyatna, and O. Corcho, “Geographical linked data: a Spanish use case,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nA. Fogarolli and P. Bouquet, “Linking data for public administrations,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-3, 2010.\nC. Böhm et al., “Linking open government data: what journalists wish they had known,” in Proceedings of the 6th International Conference on Semantic Systems, pp. 1-4, 2010.\nG. Ladwig and D. T. Tran, “Linked Data Query Processing Strategies,” in Proceedings of the 9th International Semantic Web Conference (ISWC '10), 2010.\nR. Fink et al., “SPROUT 2: A Squared Query Engine for Uncertain Web Data” (2011). (\npaper\n) (\nsite w/ description\n)\nLDIF (\nmail\n) (\nlink\n)\nCarlos Buil-Aranda, Marcelo Arenas and Oscar Corcho. Semantics and Optimization of the SPARQL 1.1 Federation Extension. To appear in Proceedings of the 8th Extended Semantic Web Conference (ESWC'11), Heraklion, Greece, 2011.\nS. Stefanova and T. Risch, “Optimizing Unbound-property Queries to RDF Views of Relational Databases,” in The 7th International Workshop on Scalable Semantic Web Knowledge Base Systems (SSWS 2011), n.d., 43. (\npdf\n)\nO. Curé, M. Lamolle, and C. Le Duc, “Ontology Based Data Integration Over Document and Column Family Oriented NOSQL stores,” in The 7th International Workshop on Scalable Semantic Web Knowledge Base Systems (SSWS 2011), n.d., 122. (\npdf\n)\nR. Rosati, “Prexto: Query Rewriting under Extensional Constraints in\nDL\n−\nLite\n,” in The Semantic Web: Research and Applications, vol. 7295, E. Simperl, P. Cimiano, A. Polleres, O. Corcho, and V. Presutti, Eds. Springer Berlin / Heidelberg, 2012, pp. 360–374. (\npdf\n)\nM. Rodríguez-Muro and D. Calvanese, “Dependencies: Making ontology based data access work in practice.” (\npdf\n)",
  "speaker": "SYSTEM",
  "uuid": "577c7ebd-8e77-4f59-852b-647e98fee850"
}