{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/LinkedData-12-13 \n\nInformación de la asignatura optativa \"Web Semántica y Linked Data\" del Grado en Informática. La guía de aprendizaje completa se encuentra en\n[1]\nContents\n[\nhide\n]\n1\nResultados de aprendizaje esperados\n2\nEvaluación\n3\nPlanificación y materiales\n3.1\nTema 1. Introducción a la Web de Linked Data y Web Semántica\n3.2\nTema 2. Lenguajes, protocolos y tecnologías asociadas\n3.3\nTema 3. Ontologías\n3.4\nTema 4. Aplicaciones\n4\nPrácticas\nResultados de aprendizaje esperados\n\nEstos son los resultados de aprendizaje que se esperan de esta asignatura:\nSer capaz de identificar y resolver tipos de problemas en el mundo real a los que se pueda aplicar con éxito las tecnologías de Web Semántica y Linked Data.\nSer capaz de utilizar los diferentes lenguajes, técnicas, métodos y metodologías que permiten la construcción de ontologías y de datos de la Web Semántica.\nSer capaz de generar datos en el formato utilizado en la Web Semántica y Web de Linked Data, y de publicarlos para su uso por terceros.\nSer capaz de construir ontologías que sirvan como vocabulario a los datos disponibles en la Web Semántica y de Linked Data.\nSer capaz de crear aplicaciones que hagan uso de los datos disponibles en la Web Semántica y Web de Linked Data.\nSer capaz de manejar fuentes bibliográficas en el área, incluyendo manuales, documentación online, y artículos científicos.\nEvaluación\n\nLa evaluación se basará en distintas entregas de trabajos prácticos sobre creación y publicación de datos en formato de Linked Data a partir de fuentes de datos heterogéneas (35%, semana 10), creación de ontologías que proporcionen vocabularios para dichos datos (15%, semana 12), desarrollo de una aplicación que explote datos y ontologías (25%, semana 15) y la exposición oral del trabajo realizado (25%, semana 16).\nTodos los trabajos prácticos deben ser enviados a Oscar Corcho: ocorcho@fi.upm.es\nPlanificación y materiales\n\nLas clases tendrán lugar todos los martes del primer semestre en el aula 3101, de 13:00 a 15:00. Las fechas que se proponen son orientativas, e irán cambiando a lo largo del curso según el avance de los grupos de trabajo.\nTema 1. Introducción a la Web de Linked Data y Web Semántica\n\nSemana 1. 18/09/2012. Tema 1.1. Motivación y fundamentos, y Tema 1.2 Iniciativas de datos abiertos en organismos públicos y privados (Oscar)\n[2]\nTema 2. Lenguajes, protocolos y tecnologías asociadas\n\nSemana 2. 25/09/2012. Tema 2.1. Redes semánticas y taxonomías (Oscar)\n[3]\ny\nTema 2.2. RDF(S) (Oscar)\n[4]\nEjemplos RDF(S)\nSemana 3. 02/10/2012. Tema 2.2. Prácticas sobre RDF(S) (Esther Lozano)\nJenaTutorial (Solved project)\nFurther Info\nJena API\nSemana 4. 09/10/2012. Tema 2.3. SPARQL  (Oscar)\n[5]\nPara los ejercicios, se puede utilizar el endpoint\nhttp://sandbox.linkeddata.es/sparql\n, con el grafo:\nhttp://sandbox.linkeddata.es/Grado_20122013\nSemana 5. 16/10/2012. Tema 2.3. Prácticas con SPARQL (Esther Lozano)\n(el material es continuación del de la semana 3)\nSemana 6. 23/10/2012. Tema 2.4. Metodología para la generación de Linked Data a partir de fuentes de datos heterogéneas  (Oscar)\n[6]\nSemana 7. 30/10/2012. Tema 2.4. Sistemas de generación de RDF a partir de fuentes de datos heterogéneas. Hojas de cálculo (Esther Lozano)\n[7]\nEjemplo PDF\nSemana 8. 06/11/2012. Tema 2.4. Sistemas de generación de RDF a partir de fuentes de datos heterogéneas. Hojas de cálculo y DataCube (Esther Lozano)\n[8]\nNor2o\nEjercicios resueltos\nSemana 9. 20/11/2012. Tema 2.4. Sistemas de generación de RDF a partir de fuentes de datos heterogéneas. Bases de datos relacionales (Oscar)\n[9]\nDatos en SQL\nSemana 10. 27/11/2012. Tema 2.5. Sistemas de enlazado de datos en Linked Data (Oscar, Esther)\n[10]\nLinks a los endpoints que se han propuesto en esta clase:\nhttp://www.fao.org/figis/flod/endpoint/sparql.html\nEjemplo de descripción de un pez:\nhttp://www.fao.org/figis/flod/entities/page/codedentity/fb383282-7b0b-461f-b111-117966e680c5\nLinks a la herramienta SILK ya instalada:\nhttp://oeg-dev.dia.fi.upm.es:8080/workbench/\nSemana 11. 04/12/2012. Tema 2.6. Sistemas de publicación de datos en Linked Data (Esther Lozano, Oscar)\n[11]\nVirtuoso\nPubby\nEjemplo RDF (cambiad la extensión a .rdf)\nTema 3. Ontologías\n\nSemana 12. 11/12/2012. Tema 3.1. Ontologías relevantes en la Web de datos (Asun)\n[12]\nTema 4. Aplicaciones\n\nSemana 13. 18/12/2012. Tema 4.1. DBpedia (Oscar)\nDescripción general de DBpedia chapter español:\nhttp://es.dbpedia.org/\nAlgunas consultas interesantes en:\nhttp://es.dbpedia.org/sparql\nEjemplo de conceptos que están cubiertos en la DBpedia en español:\nhttp://es.dbpedia.org/sparql?default-graph-uri=&query=select+distinct+%3FConcept+where+%7B%5B%5D+a+%3FConcept%7D&format=text%2Fhtml&timeout=0&debug=on\nEjemplo de página en Wikipedia con un infobox:\nhttp://es.wikipedia.org/wiki/Metallica\n(infobox: Ficha de artista musical)\nLista de mappings en español (a la izquierda, menú con más idiomas):\nhttp://mappings.dbpedia.org/index.php/Mapping_es\nFicha de artista musical:\nhttp://mappings.dbpedia.org/index.php/Mapping_es:Ficha_de_artista_musical\nEjemplo de transformación de la página wikipedia española anterior:\nhttp://es.dbpedia.org/resource/Metallica\ncurl -iH \"Accept: application/rdf+xml\"\nhttp://es.dbpedia.org/resource/Metallica\nMás ejemplos:\nhttp://mappings.dbpedia.org/server/mappings/es/extractionSamples/Mapping_es:Ficha_de_artista_musical\n¿Cómo sabemos qué fichas existen?\nhttp://es.wikipedia.org/wiki/Categor%C3%ADa:Wikipedia:Fichas\nhttp://es.wikipedia.org/wiki/Plantilla:Ficha_de_artista_musical\nRecursos relevantes\nDBpedia Ontology:\nhttp://wiki.dbpedia.org/Ontology\nDBpedia Language Race:\nhttp://mappings.dbpedia.org/sprint/index.php\nEstadísticas por idiomas:\nhttp://mappings.dbpedia.org/server/statistics/\n, en español:\nhttp://mappings.dbpedia.org/server/statistics/es/\nEstadísticas para artista musical:\nhttp://mappings.dbpedia.org/server/templatestatistics/es/?template=Ficha%20de%20artista%20musical\nTutorial sobre creación de mapeos:\nhttp://wimmics.inria.fr/projects/dbpedia/doc/index.php/Tutoriel_%C3%A9dition_de_mappings\nDetalles de datos de la Wikimedia Foundation:\nhttps://meta.wikimedia.org/wiki/Research:Data\nSemana 14. 08/01/2013. No se impartirá clase, dada la cercanía con los exámenes\nPrácticas\n\nEl objetivo de la práctica a realizar para esta asignatura es el de generar Linked Data a partir de al menos tres fuentes de datos abiertos, que deberán ser convenientemente enlazadas y publicadas, y opcionalmente generar alguna aplicación sobre estas fuentes de datos. Algunas de las fuentes de datos que se pueden tener en consideración, sólo de manera orientativa, son:\nProgramación de TVE:\nhttp://www.rtve.es/api/agrupadores/42170/programas.xml\no\nhttp://www.rtve.es/api/agrupadores/42170/programas.json\nPara esta fuente de datos, puede ser útil analizar lo que se ha hecho hasta ahora en\nhttp://vista-tv.eu/\nDatos del Consorcio Regional de Transporte de Madrid. Se proporcionarán cuando se cuente con estos datos.\nDatos de la EMT. Se proporcionarán detalles de la API correspondiente a los interesados.\nDatos del censo de locales de Madrid.\nhttp://www.madrid.es/portales/munimadrid/es/Inicio/Ayuntamiento/Estadistica/Censo-de-locales/Censo-de-Locales?vgnextfmt=detNavegacion&vgnextoid=4ba708e2a77bd210VgnVCM2000000c205a0aRCRD&vgnextchannel=2bd6eea8e3e5d210VgnVCM1000000b205a0aRCRD\nDatos del portal de datos abiertos del Ayuntamiento de Zaragoza.\nhttp://www.zaragoza.es/ciudad/risp\nInformación de contactos de comunicación proporcionada por el Gobierno de España:\nhttp://www.lamoncloa.gob.es/nr/rdonlyres/120271bf-7c97-422e-b6b0-3938b9be2e5f/0/agenda2012.pdf\nPara ello, los alumnos dispondrán si lo desean de acceso a alguno de los servidores que el profesor tiene disponibles. Los datos se proporcionarán en clase.",
  "speaker": "SYSTEM",
  "uuid": "57c6cc0e-2711-4dfc-aec0-1727fbe8d86d"
}