{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 23\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 23 of 124\n– Manual restitution of consistency. If inconsistencies or cyclic knowledge structures are encoun-\ntered, a biomedical domain expert resolves the inconsistencies or cycles. After that, the classi-\nﬁer has to be re-run for checking whether the modiﬁed knowledge base is inconsistent with the\nchanges made.\n– Manual modiﬁcation of the knowledge base. In this step relations that were not taking into account\nin previous steps (e.g. siblingOf or associatedWith) are included.\nThe method produces a single ontology. The ontology components generated are classes and rela-\ntions. and they are expressed in a formal description logic system, LOOM.\n• van Assem et al. in [vAMSW04] present a method for converting thesauri from their native format\nto RDF(S) and OWL Full. This method deals with resources implemented in (1) a proprietary text\nformat, (2) a relational database, and (3) an XML representation.\nThe method semi-automatically transforms the entire resource content into an ontology schema.\nThe authors use an ad-hoc wrapper for the transformation. The method does not contemplate the\ninternal data model of the thesaurus nor does it explain how the resource data is represented and\naccessed for the transformation. Nor does it inform about the resource provenance information,\nso the resultant ontology does not keep the reference to the thesaurus. This method consists of the\nfollowing steps:\n– Preparation. The following characteristics of a thesaurus are analysed: (1) conceptual model, (2)\nrelation between the conceptual and digital model, (3) relations to standards, and (4) identiﬁcation\nof multilinguality issues.\n– Syntactic conversion.\nThis step focuses on the syntactic aspects of the conversion process\nfrom the source implementation to RDF(S). This step consists of the following substeps: (1) a\nstructure-preserving translation that should reﬂect the source structure as closely as possible\nand should be complete; and (2) explication of the syntax of the resource.\n– Semantic conversion. In this step the class and property deﬁnitions are augmented with addi-\ntional RDF(S) and OWL constraints. The output of this step should be used in applications as a\nspeciﬁc interpretation of the thesaurus, not as a standard conversion. This step consists of (1)\nexplication of semantics, which is similar to the explication of syntax one, but now more expres-\nsive RDF(S) and OWL constructs may be used; and (2) speciﬁc interpretations are introduced\nas some application-speciﬁc requirement, e.g. an application wants to treat a broaderTerm\nhierarchy as a class hierarchy.\n– Standardization. This optional step consists of mapping a thesaurus onto a standard schema.\nOne possible option is to map to SKOS [MB05].\nThe method produces one single ontology. The ontology components generated are classes, at-\ntributes, and relations and they are expressed in RDF(S)/OWL Full.\n• van Assem et al.\nin [vAMMS06] present a method for converting thesauri to the SKOS [MB05]\nRDF/OWL schema. This SKOS schema is a proposal for a standard being developed by W3Cs Se-\nmantic Web Best Practices Working Group.\nThe development of this method is based on a process with the following components:\n– The general goal of this method is to support interoperability of thesauri encoded in RDF/OWL.\nThe requirements are the following: (1) To produce programs that convert the digital representa-\ntions of a speciﬁc thesaurus to SKOS. The resulting conversion program should produce SKOS\nRDF. (2) To perform a full conversion of the thesaurus (i.e. the resultant ontology has all in-\nformation that is present in the original thesaurus) as long as this does not violate the previous\nrequirement.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "5a405bb8-3d1e-41f7-965c-1a52f05552bf"
}