{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ManchesterJPC \n\nContents\n[\nhide\n]\n1\nResearch Internship\n1.1\nObjectives\n1.2\nResearch Resumé\n1.3\nWork Methodology\n1.4\nWork environment\n1.5\nHousing\n1.6\nComments\nResearch Internship\n\nStudent\n: Jean-Paul Calbimonte\nPeriod\n: 21.05.2010 - 29.07.2010\nInstitution\n: School of Computer Science, The University of Manchester\nResearch contact\n: Alasdair Gray\nProfessors\n: Norman Paton, Alvaro Fernandes\nObjectives\n\nThe goals of the interniship were:\nStudy the existing approaches on distributed SPARQL query processing.\nStudy the existing SPARQL query optimization approaches.\nStudy the existing streaming SPARQL query processing approaches.\nPropose a coherent solution for streaming distributed query processing using SPARQL extensions.\nPropose a study use-case in the context of the SSG4E project that highlights the streaming query processing capabilities.\nPrepare a formal publishable version of the proposal for the consideration of the community\nResearch Resumé\n\nAccording to the objectives, we have revisited the existing works on the subject, read and sudied the relevant works and captured the state of the art techniques for each of the selected Areas.\nWe have presented our findings and written them in the attached doucments:\nDistributedSPARQLRelatedWork\nSPARQL Streams\nSPARQL_optimization\nSPARQL_optmimization_slides\nThe proposal of our integrator approach, including details and discussion have been presented in the following document:\nIntegratorDesignDocument\nThe Use Case scenarios and identified datasources to be used in the scope of the SSG4E project have been presented in the following document:\nIntegrator_UseCase\nWork Methodology\n\nAll the research work done in the internship has been performed in close collaboration with our research partner Alasdair Gray. Paper and related work reading and analysis have been distributed between him and me, with joint meeting to describe our findings. In case of questions or clarifications of certain works, we have exchanged the readings for cross-checking.\nIn case of need for expertise in subjects such as query optimization, we have requested tha aid of the professors, especially that of Alvaro Fernandes with exlcusive meeting for that purpose.\nFor elaboration of proposals, we have used brainstorming sessions, first between the two of us and then including the presence of both Norman Paton and Alvaro Fernandes. We have required weekly and bi-weekly sessions with both professors for that puropose.\nDue to the dynamic and impredictable nature of the research work we have set a weekly-based planning approach for assigning individual tasks.\nA short time during certian days has been assigned to discuss concrete implementation and coding issues.\nWork environment\n\nUniman's School of Computer Science provides all the required infrastructure and enviroment to perform the research work without any perturbances or noticeable inconveniences.\nStaff is eager to help with any contingency.\nSenior researchers are collaborative and help with time and useful advice.\nCoffee time is nice.\nHousing\n\nUniman's Opal Gardens Student accommodation is clean, nice and near to the faculty.\nComments\n\nOverall nice and enriching experience",
  "speaker": "SYSTEM",
  "uuid": "5a90d4aa-ca0f-4086-95e6-b8c46a52732a"
}