{
  "message": "SYSTEM: Iswc10_gracia.pdf: Página 8\nof such a population, while another model establishes the opposite effect, that is, a\ngrowing size would decrease the demand of natural resources. If we are able to es-\ntablish that both models are referring to the same concepts (size, population, natural\nresources, etc.), the contradiction between the shared concepts can be discovered\nand pointed out.\n4. Additional knowledge and resources can be incorporated to the system. For exam-\nple, DBpedia contains rich multilingual textual descriptions, links to pictures and\nweb pages, etc. as part of a term description. This information can be imported\nif the term is grounded on that knowledge source, and shown to the user in the\nmodelling tool.\nMost of the previous features are exploited in our system for enabling knowledge-\nbased feedback, as we will see in the following section.\n5\nOntology Based Feedback\nAs aforementioned, the repository of semantically grounded models created in our sys-\ntem is intended to support feedback during the model creation process. For such a pur-\npose, we devise the use of ontology matching techniques [16], semantic reasoning, and\nQR speciﬁc comparisons between models. Depending on the particular technique, our\nsystem provides different types of feedback (See Figure 5). Notice, however, that these\ntypes of feedback are not mutually exclusive and can be combined.\nOntology \nMatching\nSemantic \nReasoner\nMissing/Superfluous\nOntology Elements\nSuggestions\nStructure \nComparison\nGrounding-Based \nAlignment\nUser Model\n+\nReference Model\nInconsistencies \nbetween Hierarchies\nDifferences between \nModel Structures\nImprovement of \nTerminology \nFig. 5. Data Flow Diagram of the Ontology-Based Feedback techniques\nThe input to the feedback process is a pair of QR models: one corresponding to the\nuser model (under construction) and other corresponding to a reference model made by\nan expert and already stored in the repository (we do not enter here in the particular\ntechnique utilized for selecting the reference model, i.e., if manually or if based on a\ndynamic evaluation of relevance).\nThe ﬁrst step in the process is to derive mappings from the shared groundings. Since\nthe concepts of both models are grounded to a common vocabulary, we can use these\n",
  "speaker": "SYSTEM",
  "uuid": "5adcad57-a18d-4234-a970-235991f52ed6"
}