{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual25032010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nNuevas Actividades:\nEscritura de articulo para el EKAW-2010. Deadline: 18 de abril.\nImplementación de una versión básica de un programa para recopilar datos de fotos y etiquetas multilingües a partir de información de Flickr.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\nModificación de los ficheros del TreeTagger para su incorporación en la aplicación. El fichero TreeTagger\\\\bin\\\\tag-spanish.bat estaba con una configuración errónea. Y, por esta razón, la aplicación no era capaz de reconocerlo como Processing Resource. Gracias al TreeTagger el reconocimiento lingüístico de los textos en español ha mejorado su calidad.\nConsumo de memoria:\n-Uno de los punto donde se podría estar quedando un proceso ligado a la aplicación y, por lo tanto, es imposible liberar su memoria es dentro del ANNIE en la creación de recursos propios.\n-Se han buscado soluciones realizables para resolver este problema y la solución que se va a llevar a cabo de entre las planteadas durante estas semanas es crear un pool de aplicaciones e ir creando y eliminando cada vez que terminen de ejecutar.\nEstudio sobre el lenguaje RDF-RDFa y XHTLM para la creación de tablas RDF con la información extraída de TreeTagger.\nPara poder utilizar ontologías dentro de la aplicación, es necesario incorporar un proceso que pases de ontología a Gazetteer de GATE. Exiten vario procesos que trabajan con ontologías OWLIM2 y OWLIM Ontology LR, OntoGazetteer. Utilizando este último se pueden realizar el trabajo, pero ante se ha de poder cargar el proceso. La carga y utilización se ha trabajado esta semana.\nInterfaz Anotación Híbrida\n\nMejoras al Interfaz.\n- Se ha implementado el Drag and Drop entre el widget con nube de etiquetas.\n- Se ha reparado el menu contextual.\n- Se empezará a reestruccturar los modulos de la interfaz.\n- Se investigará como presentar de mejor manera los datos en que entrega el Servicio Web de Sigma. Utilizando una API para RDF con PHP.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha implementado el repositorio de metadatos en JENA, separando los datos RDF de la ontología OWL. En ambos casos el almacenamiento se realiza en mySQL.\n- Se ha continuado con la implementación de las interfaces de notificación de tareas y recursos.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nConstrucción manual de conjuntos de referencia para la medición del valor de exhaustividad en la evaluación del descubrimiento de mappings.\nLos cunjuntos abordados son:\nhydrOntology_tildes2 - Nomenclátor Conciso\nhydrOntology_tildes2 - Nomenclátor Geográfico Nacional\nhydrOntology_tildes2 - Lexicón de BCN200\nhydrOntology_tildes2 - Lexicón de BCN25\nTarea 7.1\n\n- RDF.\n· Generación de mappings con mayor cobertura de fenómenos (revisión exhaustiva de fuentes)\n      · Generación de conjuntos de datos con URI armonizadas\n- Linked Data.\n· Continuación de página web\n      · Generación de Endpoints",
  "speaker": "SYSTEM",
  "uuid": "5b8e51f0-8ea4-404e-b424-01e139487792"
}