{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 26\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97751\npresentarla firmada por el interesado y el director de la tesis en el centro de adscripción, \nquienes las remitirán a la Dirección General de Política Universitaria antes del 20 de febrero \nde 2010, por el procedimiento indicado en el artículo 22.4.\nArtículo 42.  Evaluación y selección de solicitudes.\n1.  Las solicitudes serán evaluadas por una Comisión de Evaluación integrada por un \nmínimo de un experto por cada área científica, que será designada por el Director General \nde Universidades y estará presidida por el titular de la unidad instructora del procedimiento. \nLa evaluación de solicitudes tendrá como criterios de valoración el objeto de la estancia, la \nduración, la idoneidad y calidad del centro de destino con relación a la mejora de la \nformación de los beneficiarios, el plan de trabajo y de la situación de desarrollo del proyecto \nde tesis.\n2.  La unidad instructora del procedimiento, podrá solicitar información complementaria \na la vista de los informes de evaluación de las solicitudes.\n3.  La Comisión de selección, compuesta conforme a lo establecido en el artículo 32 \nde esta convocatoria, elevará el correspondiente informe al órgano instructor quién \nefectuará la propuesta de concesión a la vista de las disponibilidades presupuestarias. No \nse podrán conceder estancias breves a los solicitantes que no hubieran presentado las \nmemorias de estancias breves disfrutadas con anterioridad o a los que hubieran tenido \ninformes desfavorables o con reparos en la memoria de seguimiento anual del año \nanterior.\nArtículo 43.  Resolución.\n1.  La resolución de la concesión de estancias breves, sobre la base de la propuesta \nde la Comisión de Selección, se efectuará por la Secretaría General de Universidades en \nel plazo máximo de cuatro meses contados desde la fecha de terminación de presentación \nde las solicitudes por los organismos de adscripción, salvo para las solicitudes a las que \nse requiriera información adicional como consecuencia de la evaluación.\n2.  El gasto resultante será imputado a la aplicación presupuestaria indicada en el \nartículo 3.1 acuerdo con las disponibilidades presupuestarias.\nArtículo 44.  Pago y justificación de las ayudas para estancias breves.\n1.  El importe de las ayudas concedidas para la realización de estancias breves, será \ntransferido por anticipado a los organismos y entidades de los centros de adscripción de \nlos afectados, que deberán justificar su aplicación de conformidad con lo establecido en la \nnormativa aplicable.\n2.  Los organismos y entidades de los centros de adscripción de beneficiarios con \nestancias breves concedidas, entregarán por adelantado las cantidades concedidas a los \nbeneficiarios; dicha entrega se llevará a cabo con fecha anterior al inicio de la estancia.\n3.  Una vez concluida la estancia y en el plazo de quince días contados desde el día \nsiguiente a su regreso, los beneficiarios justificarán la realización de la misma. El formulario \nde justificación deberá presentarse por los becarios ante los órganos competentes de los \norganismos y entidades de adscripción de las ayudas, con la siguiente documentación:\na)  Certificación del responsable del grupo receptor en la que constará el día de inicio \ny el de finalización de la estancia.\nb)  Justificantes del gasto por desplazamiento desde el lugar de disfrute de la beca al \ncentro receptor de la estancia breve y regreso.\nc)  Memoria descriptiva con una extensión máxima de 1.000 palabras, en la que \nfigurará el visto bueno del director de la tesis; dicha memoria irá encabezada por el título \ndel proyecto de tesis y por la referencia del becario.\n4.  En el plazo de un mes desde la presentación de la justificación de la estancia por \nel beneficiario, los centros de adscripción remitirán a la Dirección General de Política \nUniversitaria la memoria descriptiva y la certificación del centro receptor de la estancia.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "5ca9bd45-affd-4824-8def-ff50d67ab0ef"
}