{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 5\n1.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n1. Solución I\n1.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n1.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n1.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­5­\n(*) Campos obligatorios\nversión 1.2.\nLas ontologías  son piezas clave en el desarrollo de las tecnologías del lenguaje en dos \nvertientes: \n \n1) Proporcionan la capa semántica  en el procesamiento de lenguaje natural al representar \nel significado de las expresiones lingüísticas    \nmediante estructuras formales. \n2) Representan soluciones de base para los problemas de interoperabilidad al tiempo que \nfavorecen la integración entre fuentes de datos y de conocimiento implementado en \ndistintos formatos, idiomas y modelos.  \n \nTeniendo en cuenta que las tecnologías del lenguaje se aplican a dominios concretos, es \nnecesario disponer de ontologías para cada uno de los dominios. No obstante, aunque se \ncuenta con ontologías que cubren diferentes dominios, hay muchos dominios para los que \nno existe una conceptualización implementada en forma de ontología con la suficiente \nprofundidad como para ser útil  en aplicaciones concretas de tecnologías del lenguaje. \nAdemás, otro problema es la falta de ontologías disponibles en el idioma que manejan los \nsistemas en los que se han de utilizar dichas ontologías. En este sentido, en numerosas \nocasiones será necesaria la adaptación de ontologías existentes así como de las nuevas a \nlas cuatro lenguas que se hablan en España. Dado que no hay una coincidencia exacta en \nlos conceptos manejados por las diferentes comunidades de hablantes, para llevar a cabo \nesta adaptación de ontologías no es suficiente con la mera traducción   de términos   y \ncomentarios, sino que también son necesarias adaptaciones de las estructuras de \nconceptos y relaciones. \n \nEn definitiva, se considera que el desarrollo de ontologías así como la aplicación de \ntecnologías semánticas   representan una pieza clave para impulsar la industria del \nprocesamiento del lenguaje natural, al menos en relación con los siguientes retos: \n \n- “Reto 6: Perfilado automático de expertos, investigadores, centros de investigación y \nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones \ncientíficas, etc.”. A la hora de abordar este reto, nuestra propuesta consiste en el \ndesarrollo de ontologías como capa conceptual, consensuada e implementada siguiendo \nlos estándares de la Web para el modelado de expertos, centros de investigación y \nempresas y sus relaciones con los proyectos, patentes y publicaciones. Esta solución no \nsólo permite estructurar los datos, sino también integrar información de las diferentes fuentes \nque se utilicen para resolver el problema, por ejemplo, en aplicaciones de vigilancia \ntecnológica. Además, dichos datos anotados semánticamente pueden ser publicados \nsiguiendo las buenas prácticas de publicación de datos abiertos y enlazados en la Web \nsiguiendo así la política de Reutilización de la Información del Sector Público (RISP) y la \nNorma Técnica de Interoperabilidad. \n- “Reto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción \nde taxonomías y recursos semánticos multilingües”. Con el objetivo de abordar este reto, la \nexistencia de un modelo inicial que sirva de base para la extracción terminológica se \n#\n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "5cea45d6-5dcf-485d-94c0-5f93e5a4e1d3"
}