{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PropuestasTesisMaster \n\nTitle MP1: Explotation of Semantic Graphs for Entity Linking and Word Sense Disambiguation\n- Description MP1: El objetivo de este proyecto es desarrollar un algoritmo capaz de explotar grafos semánticos para tareas de Entity Linking y Word Sense Disambiguation. El proyecto partirá de los grafos BabelNet y WordNet para dichas tareas pero el objetivo final es que dicho algoritmo pueda ser exportado y adaptado (con cambios mínimos) a otros grafos semánticos (e.g., SNOMED-CT). El proyecto parte de algoritmos ya implementados para ambas tareas y se pretende mejorar su precisión y adaptabilidad mediante nuevas técnicas para el procesamiento del lenguaje natural y navegación por grafos que han aparecido en los últimos años.\n- Funding schema: not funding available so far\nVíctor Rodríguez Doncel\n\nTitle VRD1: Description of datasets in terms of their personal data status and possibles purposes\n- Description VRD1: El objetivo de este proyecto es desarrollar los vocabularios y ontologías que sean necesarios para describir un conjunto de datos en términos del impacto jurídico, ético y social que su explotación pudiera desencadenar. En particular, los vocabularios y ontologías deberán ser capaces de describir si el conjunto de datos tiene datos personales, de qué carácter son (si los tiene) y si suponen un riesgo para la reidentificación (si no los tiene). Asimismo, deberán ser capaces de describir los usos potenciales que el conjunto de datos podría tener, el impacto que dicho uso supondría, y los riesgos de un uso malicioso de los mismos. Gracias a esta descripción, se facilitará la \"evaluación del impacto en protección de datos\" (DPIA) y la evaluación del impacto ético, jurídico y social de proyectos derivados.\n- Funding schema: not funding available so far\nMaría Poveda - Serge Chávez\n\nTitle MPSC1: Explotation of Semantic Graphs for Entity Linking and Word Sense Disambiguation\n- Description MPSC1: El objetivo de este proyecto es realizar un estado del arte de los modelos de datos y ontologías sobre BPMN y generar un conjunto de mappings RML para la anotación sémantica de datos BPMN. Business Process Model Notation (BPMN) is a standard for business process modeling. It provides a common visual language so the steps and workflow of a process can be communicated seamlessly to all the stakeholders involved in a project or activity.\n- Funding schema: not funding available so far\nCarlos Badenes-Olmedo\n\nTitle CB1: \"Smart Bibtex\"\n- Description CB1: Enrichment of bibliographic references through natural language processing techniques. The student will build an intelligent system that expands the content of a reference list, in bibtex format, using external data sources.\n- Funding schema: not funded\nTitle CB2: \"Explainable QA over KG\"\n- Description CB2: Creation of an Extractive Question/Answering (EQA) system that continuously updates its knowledge from a KG. The student will use language models (e.g. BERT) to build a RESTful service that responds to natural language queries.\n- Funding schema: not funded\nTitle CB3: \"Unsupervised Topic Labelling\"\n- Description CB3: Most text mining algorithms represent documents in a common feature space that abstracts away from the specific sequence of words used in them. Probabilistic Topic Models reduce that feature space by annotating documents with thematic information. However, this information is expressed as probability distributions over the complete vocabulary, making it more difficult to interpret. The student will design an algorithm that summarizes the meaning of a topic through multi-lingual concepts.\n- Funding schema: not funded\nCourse 19/20\n\nMariano Rico",
  "speaker": "SYSTEM",
  "uuid": "5cfc2b0f-3b79-4caa-92ee-78d72a967c47"
}