{
  "message": "SYSTEM: FeedbackOEGWebsite.pdf: Página 2\nInstead of having just one person that updates the content, everyone could change their own \ninformation, having a user name and password that everyone could have access.  \nIntroduce expertise in a section called “Use cases” / “Successful stories” where we can put the \nprojects that we are working on and the results that we are having. Videos for that successful \nstories. Succesfull stories but very speciﬁc. Some projects that they have done they are not so \nproud of them, they are not so important for the group. In the other hand, there are some speciﬁc \nprojects that they are very proud of (Smaller list of successful stories that they are really proud of). \nNot to put it in awards as that is more speciﬁc and more university related. Maybe in a diﬀerent \ntab in the menu.  \nPublications sections are the ones that are already in the OpenAx(?), because it not is going to be \nused. When you want to see a publication you go to Google Scholar, but we don’t use the website \nfor that. It is important to have the list of publication for positioning purposes, but no one is going \nto use it.  \nHighlighted publications for each person of the team and then a “View all” that is a link that goes \nto the Archive. Each team member can choose the most relevant publications of theirselves and \nput it in their proﬁle layout and then would be a link to the rest of them. For Oscar should be the  \nIn a visual way to relate the projects with the publications and authors or workers on that \nproject… It has to be really easy to navigate from the project layout ant the people… In that layout \nit should be another box called “Other Relevant resources” were we can have the GitHub \nrepository or the API or links to other parts of the website, ontologies… etc.  \nOther solution could be having Tags. In that way every related projects, publications, members of \nthe OEG that share the same tag could be visualized simply by clicking in that speciﬁc tag. This \ntags could be found in the project layout, the team members, the ontology… etc.  \nHow to arrive to the Lab? It is something that it is currently in the website and they all agree that is \nimportant for people coming to the conference.  \nIn the project layout it has to be all the information related to the project. Also the wiki the \ndashboard… but this ones are private so only people from the Group could access to them.   \nA section more informal with the fun staﬀ that they are doing all together, informal photos, the \nparties that they are doing, or the football team…  \nCollaboration section, right now it is done by email.  \nPrivate area inside the website? Not a good idea for Oscar because it leads to a login part that it \nis not desirable.  \nProposals section, with the CV of the members of the group and that kind of but they all agree to \nhave it in  XCloud, not in the website.  \n",
  "speaker": "SYSTEM",
  "uuid": "5fe43d83-51f9-43c9-b322-0aac5fc6958a"
}