{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual18022010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nActividad: Desambiguación usando Dbpedia local en Español e Ingles\nSubActivdad: Adaptación del servicio de desambiguación en Español\nDepuración del algoritmo de asociación de semántica a etiquetas en español. \nEn la etapa de prueba de unidad se detectaron errores relacionados con acentos en las etiquetas que se han ido solucionando en el transcurso de la semana.\nPor ejemplo la etiqueta losAngeles se asociaba a la pagina wikipedia /wiki/los_angeles que es una página de desambiguación, mientras la etiqueta los\nÁ\nngeles se asociaba a la pagina wikipedia wiki/Los_Ángeles que es una página de información. Además, etiquetas en el contexto que incluían una ñ no eran tenidas en cuenta en el proceso de desambiguación.\nPor otra parte, se han desarrollado algunas mejoras con respecto al resultado del proceso de desambiguación. En el XML de salida se incluye además del concepto dbpedia y el valor de similitud, la pagina wikipedia asociada al concepto dbpedia y además información de si esta página es la pagina por defecto que devuelve wikipedia al ser consultada con la etiqueta a desambiguar.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\n- Los problemas con los caracteres han sido subsanados introduciendo en la aplicación una distinción entre los tipos de caracteres en los que las distintas páginas están codificados. Tanto los caracteres codificados con UTF-8 como con ISO-8859-1 se pueden mostrar bien. Sin embargo, y, aunque no afecta a la visualización, la respuesta del servidor es incorrecta. El problema reside en el tratamiento que realiza  el propio servidor.\n- Se ha actualizado en la la máquina regulo el servicio.\nInterfaz Anotación Híbrida\n\nSe han buscado elementos para mostrar en la carga del resultado de la anotación, como loading o espere mientras carga...\nSe esta probando progress bar de JqueryUI y blockUI de Jquery.\nSe han buscado elementos para no construir un autocomplete de urls y hasta el momento no funciona nada liviano se terminará esta semana con dicha labor.\nSe piensa validar el URL y la seleccion de entidades. Tarea aun no completada.\nSe sigue trabjando en como agregar el drag and drop y simular la interfaz sigma para editar la anotación.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha comenzado con la implementación del adaptador de Fura, empezando por la API se encargará de enviar el trabajo recibido a un GrupoCola determinado en base a lo establecido por el adaptador.\n- Se ha vuelto a instalar el portal Fura que había en la maquina Linux pues había interrumpido su servicio y no podía volver a arrancar. Actualmente se encuentra funcionando sin problemas al igual que el resto de componentes.\nTarea 1.4\n\nEscritura del entregable 1.4.5.\nTarea 7.1\n\n- Linked Data. Difusión de la generación de Linked Data\n- RDF. Continuación de generación de mappings\n- Entregable Hito 5. Inicio de la redacción del documento",
  "speaker": "SYSTEM",
  "uuid": "5ffe2498-e812-4437-8d5c-dfd312befa55"
}