{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Licencias \n\nContents\n[\nhide\n]\n1\nApplying the Apache License\n1.1\nAdd a licence header to all the source files\n1.2\nAdd a LICENCE file at the top of level of distributions\n1.2.1\nSource Distribution\n1.2.2\nBinary Distribution\n1.3\nAdd a NOTICE file at the top level of distributions\n1.3.1\nSource Distribution\n1.3.2\nBinary Distribution\n2\nChecking the license comparability of the third-party dependencies\n2.1\nLicenses compatible with Apache License\n2.2\nLicenses incompatible with Apache License\n2.3\nHandling dual licensed dependencies\n3\nTools that can help with software licenses\nApplying the Apache License\n\nWhen distributing your software under Apache Licence (or any licence) it is important to include the license header in all the source files (in general, all the human readable files in the source tree). This is to let the users know under which license the source is distributed. In addition, you must include\nLICENSE and NOTICE files\nin all the distributions that you deliver. LICENSE and NOTICE must always be tailored to the content of the specific distribution they reside within.\nAdd a licence header to all the source files\n\nTo apply the Apache License to your work, attach the\nfollowing boilerplate notice\n. The text should be enclosed in the appropriate comment syntax for the file format.\nCopyright 20xx-20xx Ontology Engineering Group, Universidad Politécnica de Madrid, Spain\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\nAdd a LICENCE file at the top of level of distributions\n\nThis file can be named as LICENCE.txt but the LICENCE\nis preferred\n.\nSource Distribution\n\nIf your source distributions contain only the files that you have written and all of them are licensed under Apache License 2.0, LICENSE should only contain\nthe text of the Apache Licence v2\n.\nIf your source distributions contain source files that are licensed under difference licenses, for example some example file from W3C working group or any source file that was contributed to you by someone under different license, In LICENSE file, add a pointer to the to the location within the source tree and a short note summarizing its licensing. A complete example can be found\nhere\n.\nBy any chance if you source distribution bundles any third party libraries as binaries, the conditions in the following section apply equally to your source distribution too.\nBinary Distribution\n\nBinary distributions follow the same pattern as in the source distributions. However, in contrast to the source distribution binary distributions generally bundle third-party dependencies that are required for your software.\nIf your binary distribution only contains software you have developed, then LICENSE should only contain\nthe text of the Apache Licence v2\n.\nIf you binary distribution bundles and redistribute third-party dependencies (which is the common case) that are under different but compatible license,\nadd a short note summarizing its licensing and a pointer to it's license\n. Following example shows a LICENCE file of a product that bundles two third-party dependencies.\nApache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n  ... REST OF THE APACHE LICENCE REMOVED FOR BREVITY OF THE EXAMPLE ...\n\n  END OF TERMS AND CONDITIONS\n\n  --------------------------------------------------------------------------------\n\n  This software contains the D3.js Javascript library, which is available under a\n  \"New BSD\" license.  Copyright (c) 2012, Michael Bostock.\n  For details, see http://d3js.org/.\n\n  This software contains unmodified binary redistributions of the Logback\n  Core and Classic Module, which are available under Eclipse Public License\n  (EPL 1.0). Copyright (c) 1999-2012 QOS.ch\n  For details, see http://logback.qos.ch/\nAdd a NOTICE file at the top level of distributions\n\nThe NOTICE file is described in\nsection 4.4 of the Apache License version 2.0\n. It presence is not mandated by the license itself, but it is considered as a good practice. Following is the\nminimal boilerplate template\nfor the NOTICE file.\n[PRODUCT_NAME]\nCopyright [20xx-20xx] Ontology Engineering Group, Universidad Politécnica de Madrid, Spain\n\nThis product includes software developed at\nthe Ontology Engineering Group (http://www.oeg-upm.net/).\nSource Distribution\n\nBinary Distribution\n\nBundling a dependency which is issued under one of the following licenses is straightforward, assuming that said license applies uniformly to all files within the dependency. In LICENSE, add a\npointer\nto the dependency's location within the source tree and a short note summarizing its licensing:\nThis product bundles SuperWidget 1.2.3, which is available under a\n\"3-clause BSD\" license.  For details, see deps/superwidget/.\nChecking the license comparability of the third-party dependencies\n\nLicenses compatible with Apache License\n\nLicenses incompatible with Apache License\n\nHandling dual licensed dependencies\n\nTools that can help with software licenses\n\nApache Rat\n- A release audit tool\nmaven-license-plugin\n- Maven plugin to update and verify header licenses of source files\nEclipse Code Templates\n- automatically adds the pre-configured license header to each new file [Window > Preferences > Java > Code Style > Code Templates > Comments > Files]",
  "speaker": "SYSTEM",
  "uuid": "625f36bd-2e97-479f-bf85-c7489f5835ea"
}