{
  "message": "SYSTEM: StreamingDataAccess_ISWC2010.pdf: Página 1\nEnabling Ontology-based Access to Streaming\nData Sources\nJean-Paul Calbimonte1, Oscar Corcho1, and Alasdair J G Gray2\n1Ontology Engineering Group, Departamento de Inteligencia Artiﬁcial, Facultad de\nInform´atica, Universidad Polit´ecnica de Madrid,\nCampus de Montegancedo s/n 28660, Boadilla del Monte, Spain\njp.calbimonte@upm.es,ocorcho@fi.upm.es\n2School of Computer Science, The University of Manchester,\nOxford Road, Machester M13 9PL, United Kingdom\na.gray@cs.man.ac.uk\nAbstract. The availability of streaming data sources is progressively\nincreasing thanks to the development of ubiquitous data capturing tech-\nnologies such as sensor networks. The heterogeneity of these sources in-\ntroduces the requirement of providing data access in a uniﬁed and co-\nherent manner, whilst allowing the user to express their needs at an\nontological level. In this paper we describe an ontology-based streaming\ndata access service. Sources link their data content to ontologies through\nS2O mappings. Users can query the ontology using sparqlStream, an ex-\ntension of sparql for streaming data. A preliminary implementation of\nthe approach is also presented. With this proposal we expect to set the\nbasis for future eﬀorts in ontology-based streaming data integration.\n1\nIntroduction\nRecent advances in wireless communications and sensor technologies have opened\nthe way for deploying networks of interconnected sensing devices capable of\nubiquitous data capture, processing and delivery. Sensor network deployments\nare expected to increase signiﬁcantly in the upcoming years because of their\nadvantages and unique features. Tiny sensors can be installed virtually anywhere\nand still be reachable thanks to wireless communications. Moreover, these devices\nare inexpensive and can be used for a wide variety of applications including\nsecurity surveillance, healthcare provision, and environmental monitoring.\nAs an example, consider a web application which aids an emergency planner\nto detect and co-ordinate the response to a forest ﬁre in the Castilla y Le´on\nregion of Spain. This involves retrieving relevant data from multiple sources,\ne.g. weather data from aemet (Agencia Espa˜nola de Meteorolog´ıa)1, sensor data\nfrom sensor networks deployed in the region, and any other relevant sources of\ndata such as the esa satellite imagery providing ﬁre risks2. Typically sources\n1 http://www.aemet.es accessed 25 June 2010.\n2 http://dup.esrin.esa.int/ionia/wfa/index.asp accessed 25 June 2010.\n",
  "speaker": "SYSTEM",
  "uuid": "63e4b6a2-8866-443f-bd57-909043bf876f"
}