{
  "message": "SYSTEM: Sauper2007.pdf: Página 1\nIncorporating Content Structure into Text Analysis Applications\nChristina Sauper, Aria Haghighi, Regina Barzilay\nComputer Science and Artiﬁcial Intelligence Laboratory\nMassachusetts Institute of Technology\n{csauper, aria42, regina}@csail.mit.edu\nAbstract\nIn this paper, we investigate how modeling\ncontent structure can beneﬁt text analysis ap-\nplications such as extractive summarization\nand sentiment analysis. This follows the lin-\nguistic intuition that rich contextual informa-\ntion should be useful in these tasks.\nWe\npresent a framework which combines a su-\npervised text analysis application with the in-\nduction of latent content structure. Both of\nthese elements are learned jointly using the\nEM algorithm.\nThe induced content struc-\nture is learned from a large unannotated cor-\npus and biased by the underlying text analysis\ntask. We demonstrate that exploiting content\nstructure yields signiﬁcant improvements over\napproaches that rely only on local context.1\n1\nIntroduction\nIn this paper, we demonstrate that leveraging doc-\nument structure signiﬁcantly beneﬁts text analysis\napplications.\nAs a motivating example, consider\nthe excerpt from a DVD review shown in Table 1.\nThis review discusses multiple aspects of a product,\nsuch as audio and video properties. While the word\n“pleased” is a strong indicator of positive sentiment,\nthe sentence in which it appears does not specify the\naspect to which it relates. Resolving this ambiguity\nrequires information about global document struc-\nture.\nA central challenge in utilizing such informa-\ntion lies in ﬁnding a relevant representation of con-\ntent structure for a speciﬁc text analysis task. For\n1Code and processed data presented here are available at\nhttp://groups.csail.mit.edu/rbg/code/content structure.html\nAudio Audio choices are English, Spanish and French\nDolby Digital 5.1 ... Bass is still robust and powerful,\ngiving weight to just about any scene – most notably\nthe ﬁlm’s exciting ﬁnal ﬁght. Fans should be pleased\nwith the presentation.\nExtras This single-disc DVD comes packed in a black\namaray case with a glossy slipcover. Cover art has\nclearly been designed to appeal the Twilight crowd ...\nFinally, we’ve got a deleted scenes reel. Most of the\nexcised scenes are actually pretty interesting.\nTable 1: An excerpt from a DVD review.\ninstance, when performing single-aspect sentiment\nanalysis, the most relevant aspect of content struc-\nture is whether a given sentence is objective or sub-\njective (Pang and Lee, 2004).\nIn a multi-aspect\nsetting, however, information about the sentence\ntopic is required to determine the aspect to which\na sentiment-bearing word relates (Snyder and Barzi-\nlay, 2007). As we can see from even these closely re-\nlated applications, the content structure representa-\ntion should be intimately tied to a speciﬁc text anal-\nysis task.\nIn this work, we present an approach in which a\ncontent model is learned jointly with a text analy-\nsis task. We assume complete annotations for the\ntask itself, but we learn the content model from raw,\nunannotated text. Our approach is implemented in\na discriminative framework using latent variables to\nrepresent facets of content structure. In this frame-\nwork, the original task features (e.g., lexical ones)\nare conjoined with latent variables to enrich the fea-\ntures with global contextual information. For ex-\nample, in Table 1, the feature associated with the\n",
  "speaker": "SYSTEM",
  "uuid": "6560971f-4eb0-4aff-a920-686bcc4f041c"
}