{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 26\n \n \nPág. 28 \n \nPlan de Impulso de las Tecnologías del Lenguaje \ndisponer de las infraestructuras lingüísticas que tiene el inglés. La situación de las lenguas \ncooficiales es aún peor. Por ello, es necesario desarrollar infraestructuras lingüísticas en español  \ny lenguas cooficiales para que sirvan de combustible para el desarrollo de la industria española \nde procesamiento de lenguaje natural y de traducción automática. \nEstas infraestructuras lingüísticas deberán ponerse a disposición de los usuarios con licencias \nabiertas para lograr los ahorros económicos derivados de la reutilización de componentes y la \ncompartición de costes, así como los beneficios cualitativos del mantenimiento colaborativo de \nlos recursos abiertos. \nLas Administraciones Públicas son el actor idóneo para desarrollar infraestructuras lingüísticas \npor su tamaño, por las sinergias con la política de Reutilización de la Información del Sector \nPúblico (RISP) y por garantizar el acceso abierto a las mismas. \nObjetivos: \nLos objetivos principales que persigue este eje son los siguientes: \n \nImpulsar la industria del procesamiento del lenguaje natural en español y lenguas \ncooficiales poniendo a su disposición infraestructuras lingüísticas de propósito general. \n \nReducir la distancia que separa las infraestructuras lingüísticas en español y las lenguas \ncooficiales respecto del inglés en lo que se refiere a la cantidad, calidad y disponibilidad \nde infraestructuras lingüísticas de propósito general para procesamiento de lenguaje \nnatural y traducción automática. \n \nAsegurar la disponibilidad pública gratuita o a bajo coste (al menos para PyMEs \ninnovadoras, sector investigador y Administraciones Públicas) de infraestructuras \nlingüísticas de calidad en español y lenguas cooficiales. \n \nLlevar la industria a la frontera de la innovación facilitando el uso abierto de \ninfraestructuras lingüísticas básicas. \n \nAsegurar la coordinación en el desarrollo de infraestructuras lingüísticas, evitando \nduplicidades y buscando sinergias. Disponer de herramientas comunes para la generación \ny evaluación de infraestructuras lingüísticas. \n \nAdoptar normas técnicas de interoperabilidad, una política de licencias adecuada, y \nmecanismos de protección de datos personales en la generación de recursos lingüísticos. \n \nPotenciar métodos de generación automática de recursos lingüísticos.  \nMedidas: \n- Medida 1: Seleccionar normas técnicas de interoperabilidad, políticas de licencias y \nmecanismos de protección de datos personales adecuados para la generación de recursos \nlingüísticos. \n- Medida 2: Adquirir o desarrollar herramientas comunes para la generación y evaluación \nde infraestructuras lingüísticas. \n",
  "speaker": "SYSTEM",
  "uuid": "68a3ee2b-df36-4a01-b4ca-789ab99cfd55"
}