{
  "message": "SYSTEM: NeOn-Methodology-OntologySpecificationGuidelines.pdf: Página 13\nNeOn Methodology for Building Ontology Networks: Ontology Specification \nPage 13 of 18 \nTask 6. Validate the set of requirements. \nDuring the overall process we received recommendations, suggestions and advices from the \ndomain experts, and we iterated several times until we got the final approval by the end users. \nThey used the following criteria for validating the competency questions: \n\u0001 Correctness. Domain experts checked the correctness of each competency question, \nverifying that its formulation and answers were correct. \n\u0001 Consistent. Domain experts also verified that the competency questions did not have any \npossible inconsistency. For example, a Job Seeker who does not speak English cannot find \na job offer in England. \nTask 7. Prioritize requirements. \nWithin the SEEMP Reference Ontology specification we did not carry out this step. This means the \nfirst version of the ontology must be able to represent the knowledge contained in all the \ncompetency questions. \nTask 8. Extract terminology and its frequency. \nFrom the competency questions, we manually extracted the terminology that will be formally \nrepresented in the ontology by means of concepts, attributes and relations. We identified the terms \nand the objects in the universe of discourse. \nExamples of the terms related to job seeker are shown in Table 3. \nTerm \nFrequency \nJob Seeker \n27 \n• \nCV \n 2 \n• \nPersonal Information \n 3 \nName \n 4 \nGender \n 1 \nBirth Date \n 1 \nAddress \n 1 \nNationality \n 1 \nContact (phone, fax, mail) \n 3 \n• \nObjective \n 3 \nJob Category \n 3 \nActivity Sector \n 3 \nLocation \n 3 \nWork Condition \n 2 \nContract type \n 2 \nSalary \n 3 \n• \nEducation and training \n 3 \n• \nWork Experience \n 3 \n• \nCompetencies \n 3 \nKnowledge \n 3 \nAbilities \n 3 \nSkills \n 3 \n• \nPublication \n 1 \n",
  "speaker": "SYSTEM",
  "uuid": "69b495bb-e422-486e-9b73-4a7cc805803f"
}