{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 8\n8\nAndrea Cal`ı, Georg Gottlob and Andreas Pieris\n1.2.3 Dependencies.\nA tuple-generating dependency (TGD) σ over R is a ﬁrst-order formula of the\nform ∀X∀Yϕ(X,Y) →∃Zψ(X,Z), where ϕ(X,Y) and ψ(X,Z) are conjunctions\nof atoms over R, called the body and the head of σ, denoted as body(σ) and\nhead(σ), respectively. Henceforth, for notational convenience, we will omit the\nuniversal quantiﬁers in front of TGDs. Such σ is satisﬁed by an instance I for R\nif whenever there exists a homomorphism h such that h(ϕ(X,Y)) ⊆I, then there\nexists an extension h′ of h, i.e., h′ ⊇h, such that h′(ψ(X,Z)) ⊆I.\nA key dependency (KD) κ over R is an assertion of the form key(r) = A, where\nr ∈R and A is a set of attributes of r. Such κ is satisﬁed by an instance I for R if for\neach pair of distinct tuples t1,t2 ∈r(I), t1[A] ̸= t2[A], where t[A] is the projection\nof tuple t over A.\nA negative constraint (NC) ν over R is a ﬁrst-order formula ∀Xϕ(X) →⊥,\nwhere ϕ(X) is a conjunction of atoms over R, called the body of ν and denoted as\nbody(ν), and ⊥is the truth constant false. For brevity, we will omit the universal\nquantiﬁers in front of NCs, and assume such a quantiﬁcation implicitly. Such ν is\nsatisﬁed by an instance I if there is no homomorphism h such that h(ϕ(X)) ⊆I.\nGiven an instance I and a dependency δ, we write I |= δ (resp., I ̸|= δ) if I satisﬁes\n(resp., violates) δ. Given a set of dependencies Σ, we say that I satisﬁes Σ, written\nas I |= Σ, if for each δ ∈Σ it holds that I |= δ. Conversely, we say that I violates Σ,\nwritten as I ̸|= Σ, if there exists δ ∈Σ such that I ̸|= δ.\n1.2.4 Query Answering under Dependencies\nLet us now introduce the problem of query answering under dependencies. Given\na database D and a set of dependencies Σ, the answers we consider are those that\nare true in all models of D with respect to Σ, i.e., all instances that contain D and\nsatisfy the dependencies of Σ. Formally, the models of D with respect to Σ, denoted\nas mods(D,Σ), is the set of all instances I such that I |= D ∪Σ. The answer to\na CQ q/n with respect to D and Σ is the set of n-tuples ans(q,D,Σ) = {t | t ∈\nq(I), for each I ∈mods(D,Σ)}.\nThe decision problem associated to conjunctive query answering under depen-\ndencies, dubbed CQ-Ans, is deﬁned as follows: given a CQ q/n over a schema R,\na database D for R, a set Σ of dependencies over R, and an n-tuple t ∈Γ n, de-\ncide whether t ∈ans(q,D,Σ). Following Vardi’s taxonomy [31], the data complex-\nity of the above problem is the complexity calculated taking only the database as\ninput, while the query and the set of dependencies are considered ﬁxed. The com-\nbined complexity is the complexity calculated considering as input, together with\nthe database, also the query and the set of dependencies.\nFor the moment we put NCs aside and deal only with TGDs and KDs; we shall\nreturn to consider also NCs in Section 1.6.\n",
  "speaker": "SYSTEM",
  "uuid": "6a0a8630-8a8d-4b52-a729-d1512da05ef8"
}