{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 1\nRichard Hamming\n``You and Your Research''\nTranscription of the\nBell Communications Research Colloquium Seminar\n7 March 1986\n\u0000J. F. Kaiser\n\u0001\nBell Communications Research\n\u0002\n445 South Street\nMorristown, NJ 07962-1910\njfk@bellcore.com\n\u0003\nAt a seminar in the Bell Communications Research Colloquia Series, Dr. Richard W. Hamming, a\n\u0004\nProfessor at the Naval Postgraduate School in Monterey, California and a retired Bell Labs scientist, gave a\nvery interesting and stimulating talk, \n\u0005\nYou and Your Research to an overflow audience of some 200 Bellcore\n\u0002\nstaff members and visitors at the Morris Research and Engineering Center on March 7, 1986. This talk\n\u0006\ncentered on \n\u0007\nHamming's observations and research on the question ``Why do so few scientists make\nsignificant contributions and so many are forgotten in the long run?'' From his more than forty years of\n\u0006\nexperience, thirty of which were at Bell Laboratories, he has made a number of direct observations, asked\n\b\nvery pointed questions of scientists about what, how, and why they did things, studied the lives of great\n\u0005\nscientists and great contributions, and has done introspection and studied theories of creativity. The talk is\n\u0006\nabout what he has learned in terms of the properties of the individual scientists, their abilities, traits,\n\t\nworking habits, attitudes, and philosophy.\n\nIn order to make the information in the talk more widely available, the tape recording that was made of that\n\u000b\ntalk was carefully transcribed. This transcription includes the discussions which followed in the question\n\f\nand answer period. As with any talk, the transcribed version suffers from translation as all the inflections of\n\t\nvoice and the gestures of the speaker are lost; one must listen to the tape recording to recapture that part of\n\u0005\nthe presentation. While the recording of Richard \n\f\nHamming's talk was completely intelligible, that of some\n\r\nof the questioner's remarks were not. Where the tape recording was not intelligible I have added in\n\u000e\nparentheses my impression of the questioner's remarks. Where there was a question and I could identify the\n\u000f\nquestioner, I have checked with each to ensure the accuracy of my interpretation of their remarks.\n\u0010\nINTRODUCTION OF DR. RICHARD W. HAMMING\nAs a speaker in the Bell Communications Research Colloquium Series, Dr. Richard W. Hamming of the\n\u0004\nNaval Postgraduate School in Monterey, California, was introduced by Alan G. \n\u0011\nChynoweth, Vice\n\u0012\nPresident, Applied Research, Bell Communications Research.\nAlan G. \n\u0013\nChynoweth: Greetings colleagues, and also to many of our former colleagues from Bell Labs who,\nI understand, are here to be with us today on what I regard as a particularly felicitous occasion. It gives me\n\u000b\nvery great pleasure indeed to introduce to you my old friend and colleague from many \n\u0005\nmany years back,\n\u0014\nRichard Hamming, or Dick Hamming as he has always been know to all of us.\n\u0015\nDick is one of the all time \n\u0016\ngreats in the mathematics and computer science arenas, as I'm sure the audience\n\u0017\nhere does not need reminding. He received his early education at the Universities of Chicago and Nebraska,\nand got his Ph.D. at Illinois; he then joined the Los Alamos project during the war. Afterwards, in 1946, he\n\t\njoined Bell Labs. And that is, of course, where I met Dick - when I joined Bell Labs in their physics\n\u0003\nresearch organization. In those days, we were in the habit of lunching together as a physics group, and for\n\u0018\nsome reason, this strange fellow from mathematics was always pleased to join us. We were always happy\n\u0006\nto have him with us because he brought so many unorthodox ideas and views. Those lunches were\n\f\nstimulating, I can assure you.\n\u0006\n",
  "speaker": "SYSTEM",
  "uuid": "6ae6b286-f0a4-43f8-8ea7-cc10deba1fcf"
}