{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 122\nPage 122 of 124\nNeOn Integrated Project EU-IST-027595\n[MBC]\nD. Maynard, K. Bontcheva, and H. Cunningham. Towards a semantic extraction of named\nentities. pages 255–261. http://gate.ac.uk/sale/ranlp03/ranlp03.pdf.\n[MBC03]\nD. Maynard, K. Bontcheva, and H. Cunningham. Towards a semantic extraction of Named\nEntities. In Recent Advances in Natural Language Processing, Bulgaria, 2003.\n[MC03]\nD. Maynard and H. Cunningham. Multilingual Adaptations of a Reusable Information Ex-\ntraction Tool. In Proceedings of the Demo Sessions of EACL’03, Budapest, Hungary, 2003.\nACL.\n[MDA07a]\nM. Zied Maala, A. Delteil, and A. Azough. A conversion process from ﬂickr tags to rdf\ndescriptions. In SAW, 2007.\n[MDA07b]\nM. Zied Maala, A. Delteil, and A. Azough. A conversion process from ﬂickr tags to rdf\ndescriptions. In 10th International Conference on Business Information Systems, Poznan,\nPoland, 2007.\n[Mil05]\nA. Miles. Quick Guide to Publishing a Thesaurus on the Semantic Web. Technical report,\nWorld Wide Web Consortium (W3C), May 2005.\nhttp://www.w3.org/TR/2005/WD-swbp-\nthesaurus-pubguide-20050510/.\n[MLP08]\nDiana Maynard, Yaoyong Li, and Wim Peters. Nlp techniques for term extraction and ontol-\nogy population. In P. Buitelaar and P. Cimiano, editors, Bridging the Gap between Text and\nKnowledge - Selected Contributions to Ontology Learning and Population from Text. IOS\nPress, 2008.\n[MMG99]\nA. Mikheev, M. Moens, and C. Grover. Named Entity recognition without gazetteers. In\nProceedings of the Ninth Conference of the European Chapter of the Association for Com-\nputational Linguistics (EACL’99), pages 1–8, 1999.\n[MS01]\nA. Maedche and S. Staab. Ontology learning for the semantic web. IEEE Intelligent Sys-\ntems, 2001.\n[MSY+07]\nD. Maynard, H. Saggion, M. Yankova, K. Bontcheva, and W. Peters. Natural Language\nTechnology for Information Integration in Business Intelligence. In 10th International Con-\nference on Business Information Systems (BIS-07), Poznan, Poland, 25-27 April 2007.\n[MTB+03]\nD. Maynard, V. Tablan, K. Bontcheva, H. Cunningham, and Y. Wilks. Muse: a multi-source\nentity recognition system. Submitted to Computers and the Humanities, 2003.\n[MTBC03]\nD. Maynard, V. Tablan, K. Bontcheva, and H. Cunningham.\nRapid customisation of an\nInformation Extraction system for surprise languages. Special issue of ACM Transactions\non Asian Language Information Processing: Rapid Development of Language Capabilities:\nThe Surprise Languages, 2:295–300, 2003.\n[MTC+02]\nD. Maynard, V. Tablan, H. Cunningham, C. Ursu, H. Saggion, K. Bontcheva, and Y. Wilks.\nArchitectural Elements of Language Engineering Robustness. Journal of Natural Language\nEngineering – Special Issue on Robust Methods in Analysis of Natural Language Data,\n8(2/3):257–274, 2002.\n[MYKK05]\nD. Maynard, M. Yankova, A. Kourakis, and A. Kokossis. Ontology-based information extrac-\ntion for market monitoring and technology watch. In ESWC Workshop \"End User Aspects\nof the Semantic Web\"), Heraklion, Crete, 2005.\n[MZ06]\nE. Malinowski and E. Zimányi. Hierarchies in a multidimensional model: From conceptual\nmodeling to logical representation. Data and Knowledge Engineering, 2006.\n",
  "speaker": "SYSTEM",
  "uuid": "6c08b5b5-40d5-4bed-9f39-204c92c6aa8f"
}