{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ICPS \n\nEste proyecto está financiado por la Organización Mundial de la Salud, en el contexto de la alianza World Alliance for Patient Safety\n[1]\n, y más concretamente dentro del subproyecto International Classification for Patient Safety\n[2]\n.\nEl objetivo global del proyecto es el de desarrollar una clasificación international sobre seguridad del paciente que pueda ser utilizada por todos los agentes mundiales relacionados con este subárea de la Sanidad (gobiernos, hospitales, médicos, etc.) en diversos tipos de aplicaciones (informes sobre eventos relacionados con seguridad del paciente, búsquedas de artículos científicos, propuestas de mejoras de protocolos, etc.).\nEl proyecto se divide en un conjunto de subobjetivos, o\nwork threads\n(\núltima versión, aunque no actualizada\n), de los cuales la UPM está centrado en el número 4, denominado\nFormalism and Knowledge Engineering\n[3]\n. A su vez, cada paquete de trabajo tiene objetivos anuales, que se irán renovando si los resultados son los esperados. De momento el primer bloque de trabajo se realiza entre el 15/06/2009 y el 31/01/2010.\nContents\n[\nhide\n]\n1\nDocumentation\n2\nRelated background papers\n3\nTasks to be performed by UPM (June 2009 - January 2010)\n4\nDetails about services currently available in algiedi.dia.fi.upm.es\n5\nImportant support notes\nDocumentation\n\nLa documentación de partida para este proyecto es el resultado de un esfuerzo de varios años con expertos de dominio para la creación de un documento que recoge una clasificación inicial sobre aspectos a tener en cuenta en la seguridad del paciente\n[4]\n. Estos documentos fueron presentados a la comunidad hispano-hablante en una reunión en Madrid en Octubre de 2008 y hubo amplias discusiones sobre la idoneidad de algunos de los términos usados y de las definiciones proporcionadas en español.\nTambién se utilizan como documentos de partida los de otras clasificaciones y terminologías, y normas ISO sobre terminologías:\n[5]\nRelated background papers\n\nTowards an International Classification for Patient Safety: a Delphi survey. Thomson R, Lewalle P, Sherman H, Hibbert P, Runciman W, Castro G. Int J Qual Health Care. 2009 Feb;21(1):9-17.\n[6]\nA classification for incidents and accidents in the health-care system. Runciman WB, Helps SC, Sexton EJ, Malpass A. J Qual Clin Pract 1998; 18(3):199-211\nA classification for adverse drug events. Malpass A, Helps SC, Sexton EJ, Maiale D, Runciman WB. J Qual Clin Pract 1999; 19(1):23-6\nTasks to be performed by UPM (June 2009 - January 2010)\n\nThis set of tasks (which can be dynamically updated depending upon conversations held with the different stakeholders) is based on the work programme summary available in this document:\nT4.0. Setup a set of HTML forms to allow capturing knowledge from domain experts, which should be encoded finally in a wiki.\nDeadline\n: 30/06/2009.\nResponsible\n: Adrián.\nInput form (\nWord\n,\nHTML\n)\nCurrent website:\n[7]\nT4.1.1. Ontology Specification Requirement Document v0.5 (OSR v0.5) in one topic.\nDeadline\n: 15/09/2009.\nResponsible\n: Elena (helped by María).\nInputs for this task\nICPS documents\n[8]\nOther classifications (ICD, etc.)\n[9]\nResults of the knowledge capture effort from domain experts, which will be available in a wiki (currently in\n[10]\n)\nCurrent OWL ICPS files, which have been developed by the Australian National Health Service. Waiting for them, to be sent by Bill Runciman (leader of thread 3).\nT4.1.2. OSRD v1.0.\nDeadline\n: 30/09/2009.\nResponsible\n: Elena (helped by Mari Carmen and María)\nT4.2.1. Ontology network conceptualisation. Domain 1.\nDeadline\n: 31/10/2009.\nResponsible\n: Elena (helped by María and Mari Carmen)\nT4.2.2. Ontology network conceptualisation. Domain 2.\nDeadline\n: 30/11/2009.\nResponsible\n: Elena (helped by María and Mari Carmen)\nT4.3. Ontology network formalisation and implementation in both domains.\nDeadline\n: 31/01/2010.\nResponsible\n: Elena (helped by María and Mari Carmen)\nThere will be one trip around October/November to Geneva for discussion.\nDetails about services currently available in algiedi.dia.fi.upm.es\n\nEl apache esta en la localización C:\\apache-tomcat-6.0.18-ICPSOntology\nEn webapps esta todo el desarrollo web\nJSPWiki:\nEn el directorio C:\\apache-tomcat-6.0.18-ICPSOntology\\webapps\\JSPWiki\\templates\\default existen los siguientes archivos interesantes:\nHoja de estilo: jspwiki.css, en especial la línea \"div.branding img {height: 70px;}\" (tamaño de los iconos ;))\nHeader: localheader.jsp, esta el logo de la OMS\nFooter: Footer.jsp, estan los logos de OEG y UPM\nEn conf esta la configuración:\nUsuarios: tomcat-users.xml (Hay que reiniciar el servidor para que coja los cambios)\nC:\\backup_ICPS.bat realiza la copia de seguridad en caliente\nC:\\indexRedo.bat para el servidor web, destruye los indices y arranca otra vez el servidor\nC:\\jspwikiICPSOntology contiene las páginas wiki del JSPWiki\nImportant support notes\n\nNEVER edit tomcat-user.xml with notepad. This editor corrupt the xml format.\nSome special characters are not supported. In this case, server will launch correctly, but appears a format error in tomcat-users (look info about passwd charactres not supported by tomcat)\nto recover the system due to an error:\n- Stop the tomcat server (in this case installed as an apache service)\n   - Delete all files containes in C:\\tmpICPSOntology\n   - restart server (or service)",
  "speaker": "SYSTEM",
  "uuid": "6d44afe2-4bf4-44f5-88ac-641714d0b298"
}