{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 18\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13926\nQue el personal investigador participante en el programa tenga experiencia contrastada \nen la dirección de tesis doctorales en los últimos 5 años.\nLa existencia en la universidad de mecanismos claros de reconocimiento de la labor \nde tutorización y dirección de tesis.\n[7]  Recursos materiales y apoyo disponible para los doctorandos.\nSe valorará:\nSi los recursos materiales y otros medios disponibles son adecuados para garantizar \nel desarrollo de la investigación a realizar por el estudiante.\nLos recursos externos y las bolsas de viaje dedicadas a ayudas para asistencia a \ncongresos y estancias en el extranjero.\nLa financiación de seminarios, jornadas y otras acciones formativas nacionales e \ninternacionales.\nEl porcentaje de doctorandos que consiguen ayudas o contratos post-doctorales.\n[8]  Revisión, mejora y resultados del programa.\nSe valorará:\nQue el programa de doctorado disponga de un órgano responsable así como que \narticule procedimientos y mecanismos para supervisar su desarrollo, analizar los resultados \ny determinar las actuaciones oportunas para su mejora. La opinión de los estudiantes y la \nde los doctores egresados será de especial importancia a la hora de definir e implantar \nacciones de mejora.\nSe valorará la existencia de un procedimiento que analice los resultados del programa \nde movilidad, mecanismos para publicar información sobre el programa, su desarrollo y \nresultado.\nEn el caso de los programas en los que participe más de una universidad, se valorará \nla existencia de mecanismos y procedimientos que aseguren la coordinación entre las \nuniversidades participantes.\nLos datos relativos a los últimos 5 años o la estimación prevista en función de su \njustificación y contexto. En la fase de renovación de la acreditación se revisarán dichas \nestimaciones, atendiendo a las justificaciones aportadas y las acciones derivadas de su \nseguimiento.\nLa empleabilidad de los doctorandos durante los tres años posteriores a la lectura de \nsu tesis o previsión de la misma, en el caso de nuevos programas.\ncve: BOE-A-2011-2541\nhttp://www.boe.es\t\nBOLETÍN OFICIAL DEL ESTADO\t\nD. L.: M-1/1958 - ISSN: 0212-033X\n",
  "speaker": "SYSTEM",
  "uuid": "6e6723ce-f9c1-4b40-b72c-ce87ba0b48e5"
}