{
  "message": "SYSTEM: RD99_2011_28Enero_Ense%C3%B1anzas_Oficiales_Doctorado.pdf: Página 8\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 35\t\nJueves 10 de febrero de 2011\t\nSec. I.   Pág. 13916\nuniversidades y entidades promotoras bien con el auxilio de profesionales externos, \nprofesores o investigadores visitantes. En todo caso las Escuelas de Doctorado deberán \ngarantizar un liderazgo en su ámbito y una masa crítica suficiente de doctores profesores \nde tercer ciclo y doctorandos en su ámbito de conocimiento.\n5.  Las Escuelas de Doctorado podrán organizarse centrando sus actividades en uno \no más ámbitos especializados o interdisciplinares. Asimismo, de acuerdo con lo que \nestablezca los estatutos de la universidad y la normativa de la comunidad autónoma \ncorrespondiente, podrán incluir enseñanzas oficiales de Máster de contenido \nfundamentalmente científico, así como otras actividades abiertas de formación en \ninvestigación.\n6.  Las Escuelas de Doctorado contarán con un Comité de Dirección, que realizará \nlas funciones relativas a la organización y gestión de las mismas y que estará formado por, \nal menos, el director de la Escuela, los coordinadores de sus programas de doctorado y \nrepresentantes de las entidades colaboradoras. El director de la Escuela será nombrado \npor el Rector, o por consenso de los rectores, cuando se establezca por agregación de \nvarias universidades. Debe ser un investigador de reconocido prestigio perteneciente a \nuna de las universidades o instituciones promotoras. Esta condición debe estar avalada \npor la justificación de la posesión de al menos tres períodos de actividad investigadora \nreconocidos de acuerdo con las previsiones del Real Decreto 1086/1989, de 28 de agosto, \nanteriormente citado. En el caso de que dicho investigador ocupe una posición en la que \nno resulte de aplicación el citado criterio de evaluación, deberá acreditar méritos \nequiparables a los señalados.\n7.  Las Escuelas de Doctorado contarán con un reglamento de régimen interno que \nestablecerá, entre otros aspectos, los derechos y deberes de los doctorandos, de \nconformidad con lo establecido en el Real Decreto 1791/2010, de 30 de diciembre, por el \nque se aprueba el Estatuto del Estudiante Universitario, y de los tutores y de los directores \nde tesis, así como la composición y funciones de las comisiones académicas de sus \nprogramas.\n8.  Todas las personas integrantes de una Escuela de Doctorado deberán suscribir su \ncompromiso con el cumplimiento del código de buenas prácticas adoptado por dicha \nEscuela.\nArtículo 10.  Verificación, seguimiento y renovación de la acreditación de los Programas \nde doctorado.\n1.  Los programas de doctorado conducentes a la obtención del título oficial de Doctor \ndeberán ser verificados por el Consejo de Universidades y autorizados por las \ncorrespondientes Comunidades Autónomas, de acuerdo con lo dispuesto en el Real \nDecreto 1393/2007, de 29 de octubre, por el que se establece la ordenación de las \nenseñanzas universitarias oficiales, con las particularidades a que se refiere el presente \nreal decreto.\n2.  A efectos de su verificación los programas de doctorado se ajustarán a la memoria \nque figura como Anexo I del presente real decreto.\n3.  Los programas de doctorado deberán someterse a un procedimiento de evaluación \ncada seis años a efectos de la renovación de la acreditación a que se refiere el artículo 24 \ndel Real Decreto 1393/2007, de 29 de octubre.\n4.  Para garantizar la calidad del doctorado y el correcto desarrollo de la formación \ndoctoral la universidad deberá justificar la existencia de equipos investigadores solventes \ny experimentados en el ámbito correspondiente.\n5.  De acuerdo con lo establecido en el Anexo II, los criterios de evaluación para la \nverificación y acreditación de los programas de doctorado tendrán en cuenta el porcentaje \nde investigadores con experiencia acreditada, los proyectos competitivos en que participan, \nlas publicaciones recientes y la financiación disponible para los doctorandos. Asimismo se \nvalorará el grado de internacionalización de los doctorados, con especial atención a la \nexistencia de redes, la participación de profesores y estudiantes internacionales, la \nmovilidad de profesores y estudiantes, y los resultados tales como cotutelas, menciones \ncve: BOE-A-2011-2541\n",
  "speaker": "SYSTEM",
  "uuid": "6fc27636-0062-492e-a31e-839ed3aa45d4"
}