{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Post-doctoral2010 \n\nSkeletome - A Curated Online Knowledge Base Integrating Clinical and Biological Information\n\nPosition Information \nOne post-doctoral research fellowship position is available in the eResearch Lab, School of ITEE, the University of Queensland (UQ) Australia. The successful candidate will work in the ARC-funded Skeletome project and undertake cutting-edge, interdisciplinary research in Bioinformatics, Semantic Web and social networking.\nThe UQ eResearch Lab is a leading research group within the School of ITEE renowned for its high quality, innovative and cross-disciplinary research into ICT methods for the management and preservation of large collections of digital data and information. The Lab is renowned for developing semantic interoperability and data integration frameworks to enable searching, correlation, analysis and visualization across large-scale, distributed cross-disciplinary collections within the cultural and scientific domains.\nThis is a full-time, fixed-term position for three years at Postdoctoral Research Fellow level (Academic Level A\nhttp://www.uq.edu.au/current-staff/index.html?page=123704&pid=11893\n). The remuneration package will be commensurate with skills and experiences and also include employer superannuation contributions of 17% of salary. The position will be based in the St Lucia campus of UQ.\nProject Summary \nSkeletal dysplasias are a heterogeneous group of genetic disorders affecting skeletal development. They affect up to 10,000 children and adults in Australia and 4,000,000 patients worldwide suffer from one of these debilitating disorders. Molecular genetic research on skeletal dysplasias has advanced considerably over the years. However, the lack of a comprehensive information repository about skeletal dysplasias hinders collaborative research and diagnosis in this area.\nThis project aims at creating an online, expert-curated, community-driven knowledge base that uses Semantic Web technologies to integrate information about skeletal dysplasias, including molecular genetic causes, clinical features, diagnosis and management information. The specific aims of this project include:\n- Create an ontology-enabled Wiki for collaborative authoring and automated knowledge acquisition and management\n- Develop semantic annotation, integration, inferencing and querying services\n- Develop semantic-based image classification, search and retrieval services\n- Develop social-networking capabilities for mapping domain expertise\nDuties\n- Work with project PIs on the Skeletome project, investigating into semantics-based information annotation, integration, visualization, inferencing and querying problems\n- Publish in prestigious conferences and journals\n- Take part in student supervision within the project\n- Participate in the supervision of undergraduate and postgraduate students\nEligibility\n- The successful candidate should have strong research experiences and excellent publication track record in areas such as ontologies (development, reasoning), RDF processing (triple stores), machine learning, text processing and social networking analysis\n- Applicants should have either completed a PhD or have recently submitted the PhD thesis in computer science, information technology, bioinformatics or a related discipline from a reputable university\n- Experiences with software design and development\n- Both domestic and international candidates are welcome to apply\nContact\nAll inquiries should be sent to:\n- Prof. Jane Hunter (\nhttp://www.itee.uq.edu.au/~jane/\n)\n- Dr. Yuan-Fang Li (\nhttp://www.itee.uq.edu.au/~liyf/\n)",
  "speaker": "SYSTEM",
  "uuid": "733df2c2-0139-4ea9-899c-0309fbdc9450"
}