{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 9\nÁmbito 2: Sanidad\nOtro(s) Ámbito(s):\nÁmbito 3: Justicia\n2.6. Coste estimado del desarrollo de su solución propuesta\n€\n2.8. Beneficios aportados por la solución propuesta para el impulso de la industria de las tecnologías del\nlenguaje (máx. 3.000 caracteres)\n2.5. Duración estimada para la ejecución de la propuesta planteada\n(meses)\n2.7. Beneficios aportados por la solución propuesta para el servicio público (máx. 3.000 caracteres) *\n2.9. Otros beneficios aportados por la solución propuesta (máx. 3.000 caracteres)\nReto 9: Herramientas de análisis textual aplicadas a la medición del impacto de ayudas\nI+D+i, optimización de recursos en el apoyo a la innovación industrial, investigación, etc.\nReto 10: Procesamiento automático de noticias. Confección automatizada de dossiers de\nprensa. Extracción de hechos relevantes de un sector dado, área geográfica. Agregación de\nnoticias provenientes de distintos medios (web, twitter, etc.).\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nEn caso de haber seleccionado en el apartado 2.3 que su solución no existe en el mercado o bien que no\nse ha aplicado a alguno de los ámbitos, indique:\n­9­\nOtro(s) Retos(s):\n(*) Campos obligatorios\nversión 1.2.\n12\n70.000,00\nUno de los principales beneficios aportados por OnToology para el servicio público   es \nfacilitar el acceso a las ontologías y vocabularios consensuados mediante la \nimplementación   de buenas prácticas   de acuerdo a la Norma Técnica   de Interoperabilidad \ny siguiendo las políticas de Reutilización   de la Información del Sector Público   (RISP). De \nesta manera se impulsa la reutilización   y compartición   de estándares   en la Web. \n \nPor otra parte, el enfoque seguido para alinear las prácticas   de desarrollo software con los \nproyectos de ingeniería ontológica,   permite allanar el camino para la colaboración  entre los \ndistintos perfiles que pueden interactuar en equipos interdisciplinares de forma abierta. \nEste acercamiento de distintos perfiles mediante herramientas de edición   colaborativa \ninvolucra no solo a desarrolladores web e ingenieros ontológicos, sino también   a otros \nexpertos de dominios concretos como lingüistas, médicos, juristas, etc. En este sentido \nOnToology permite también   la incorporación   de modificaciones en los modelos, que \npueden ser propuestos por cualquier usuarios, una vez probadas, facilitando la gestión   de \nlos mismos. \n \nAdemás   del hecho de hacer disponibles en la Web los vocabularios, ontologías y \ntaxonomías, su reutilización se facilita gracias a la documentación   asociada a dichos \nrecursos y a la variedad de formatos en los que se presenta (serializaciones RDF, \ndocumentación HTML, diagramas, etc.). \n \nPor último, pero no menos importante, el hecho de utilizar GitHub como sistema de control \nde versiones permite aprovechar la experiencia de una amplia comunidad que ya utiliza \nsistemas de este tipo en numerosos escenarios (por ejemplo, GitHub está   siendo utilizado \ntanto en versionado de canciones o compartición de recetas a edición  de tipografías, como \nse describe en http://goo.gl/CrHGXG), evitando así la curva de aprendizaje necesaria \ncuando se intenta implantar un nuevo paradigma, tecnología o metodología.\nEl principal beneficio de incorporar herramientas como OnToology en los proyectos \nrelacionados con la industria de las tecnologías  del lenguaje que necesiten desarrollar  \nontologías es la capacidad de gestionar parte del ciclo de vida y automatizar diversas \nactividades del desarrollo de ontologías  de forma integrada y por tanto el consiguiente \nahorro de recursos. Este beneficio afecta tanto a usuarios, que podrán   aportar \nmodificaciones y participar en el desarrollo de las ontologías de forma colaborativa, como \nempresas privadas y las administraciones públicas, que podrán beneficiarse del proceso de \ntransferencia tecnológica   al mercado fruto de más   de 20 años de investigación    en \ningeniería ontológica. \n \nUn segundo beneficio es la  disponibilidad en la Web de ontologías documentadas en los \ndiferentes formatos presentados por OnToology a través   de diagramas o documentación \nHTML hace que estas sean más   accesibles y fáciles   de comprender para los diferentes \nequipos interdisciplinares involucrados en el plan de impulso de las tecnologías de \nlenguaje, facilitando así su reutilización por desarrolladores software o expertos de dominio. \n*\n*\n",
  "speaker": "SYSTEM",
  "uuid": "76fa03ae-dfd4-445d-9744-8cefa9e16847"
}