{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual04022010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nSiguiendo el cronograma presentado, se está trabajando en la actividad\nAdaptación del servicio de desambiguación en Español\n.\nLas dos subtareas\nUtilizar versiones Dbpedia local en Español\ny\nUtilizar información local lingüística de las paginas wikipedia\nse han realizado con éxito.\nSin embargo, no se había tenido en cuenta en el cronograma la creación del servicio web que publiqué el servicio de desambiguación. Esta semana se ha empezado a trabajar en la creación de este servicio pero se han encontrado nuevamente problemas debido a los diferentes sets de caracteres que se utilizan en el procesamiento de las etiquetas. Existen problemas pendientes de solucionar  en este sentido.\n1)\tEl mensaje SOAP que retorna el servicio web al contener caracteres que incluyen tildes presenta un conflicto de codificación. Es relevante comentar que cuando el programa se ejecuta directamente sin usar el servicio web este problema no ocurre.\n2)\tPor otra parte, también hay problemas en el momento de ejecutar la fase de “parsing” de las paginas wikipedia. Parece que hay un conflicto entre el set de caracteres de la pagina wikipedia que es utf-8, con el set de caracteres del servidor de web. Estamos analizando la posibilidad de modificar el set de caracteres del servidor web para evitarnos estos inconvenientes.\nPor último, la dbpedia en español se genera a partir de un dump de la wikipedia en español. Ha salido una nueva versión de la dbpedia en español y es necesario entonces la carga de los datos.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\nTarea: Patrones de reconocimiento básicos para su uso en desambiguación.\n- Se han realizado modificaciones en los servicios web para que los tiempos de latencia se disminuyesen. Sin embargo, y a pesar de la eliminiación de la creación de fichero para tratamiento interno de la aplicación y la eliminación de los ficheros finales, salidas por pantalla para el control del proceso, etcétera, el tiempo es excesivo. La espera en la respuesta es bastante elevada. Se está trabajando en la depuración del código, para reducir estos tiempos.\nSubtarea:Gazetteers\n- La configuración correcta de los parámetros del analizador en español sigue en proceso: se sigue trabajando en las diferentes áreas de la configuración para poder acceder de forma adecuada a esta aplicación. Se está trabajando en la búsqueda de la solución. Por ejemplo: se ha de probas Tagger_Framework PR y cargar alguno de los ejemplos dentro de la lista de procesos de la aplicación de GATE; en concreto TreeTagger-ES-No_Tokenization.gapp y TreeTagger-ES-Tokenization.gapp. Además, como estas aplicaciones son ejemplos se ha de trabajar con el TreeTagger en su fichero taggerBinary modificando los parámetros necesarios para su uso junto con TaggerFramework PR. Las ubicaciones de cada uno de estos elementos son importantes, ya que uno de los problemas actuales es la aparición de rutas inexistentes de ficheros inexistentes.\nPorcentaje 45%.\nInterfaz Anotación Híbrida\n\nMejora Interfaz.\nSe han refaccionado los widgets jquery para que todos se muestren o se cierren a la vez que el usuario lo desee.\nSe esta mejorando la interfaz de la respuesta del webservice para mostrar los name entitys de distintos colores en la pagina resultante. y Asi tener una mejor presentación al usuario de los resultados.\nSe esta mejorando el diseño las ventanas emergentes para poder hacer drag and drop.\nSe esta mejorando la interfaz de terminos seleccionados para hacer drag and drop a un widget.\nSe ha testeado yii framework para la siguiente tarea de gestión de usuarios e internacionalización\nTarea 2.4\n\nPersonal de viaje (Asistencia a curso)\nTarea 1.4\n\nSubtarea 2.2.1. Técnica 10\n: Pruebas de la implementación del filtro asociado a la Técnica 10.\nLa Técnica 10 no es una comparación de elementos mediante la cual se generan nuevos\nmappings\n, sino que establece un filtro para el preprocesado de las equitas a comparar. En sí, esta Técnica (o filtro) afecta al resultado de las técnicas de comparación de cadenas de caracteres, al modificar las cadenas a comparar.\nEn las pruebas se ve que se incrementan los\nmappings\ngenerados por las técnicas 1 y 2, es decir, las técnicas de comparación sintáctica que generan\nmappings\nde equivalencia. También se aprecia que disminuyen los\nmappings\ngenerados por la técnica 3, es decir, la técnica de comparación sintáctica que genera\nmappings\nde subclase y superclase por detección de inclusión de una cadena en otra.\nEjemplo:\nDescubrimiento de\nmappings\nentre PhenomenOntology 3.6 y BCN25:\nEn PhenomenOntology 3.6 aparece el concepto \"Salinas\". En BCN25 aparece el concepto \"Salinas. Contorno\".\nRealizando el descubrimiento con las técnicas 1 y 3, se obtiene un\nmapping\ndescubierto por la técnica 3: \"Salinas. Contorno\" subclase de \"Salinas\".\nRealizando el descubrimiento con las técnias 1, 3 y 10, se obtiene un\nmapping\ndescubierto por la técnica 1: \"Salinas. Contorno\" equivalente a \"Salinas\".\nComo se puede ver, el filtro de la técnica 10 elimina la partícula sintáctica \"Contorno\" puesto que es información gráfica y no descriptiva del fenómeno. Así, el término \"Salinas. Contorno\" a efectos de comparación de las otras técnicas quedará como \"Salinas\". Es por esto que la técnica 3 no detecta una inclusión de cadena como en el primer descubrimiento. Sin embargo, en el segundo descubrimiento la técnica 1 detecta la igualdad exacta de los nombres de fenómenos.\nTarea 7.1\n\nPublicación de Linked Data\n- Instalación de servicio Virtuoso (versión 6)\n- Generación SPARQLEndpoints (Procedente de los conjuntos de datos RDF de NGCE) en fase de pruebas\n- Creación de queries SPARQL sencillas",
  "speaker": "SYSTEM",
  "uuid": "77d9ffa9-00ea-4d70-a318-c43475d6fec9"
}