{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Propuestas \n\nShort CV María Poveda\nDr. María Poveda-Villalón is and assistant professor in the Artificial Intelligence Department  of the Universidad Politécnica de Madrid and is also part of the Ontology Engineering Group research lab. Her research activities focus on Ontological Engineering, Ontology Evaluation, Knowledge Representation and the Semantic Web. Previously she finished her studies in Computer Science (2009) by Universidad Politécnica de Madrid, and then she moved to study the Artificial Intelligence Research Master finished in 2010 in the same university. She has worked in the context of Spanish research projects as well as in European projects such as ETSI STF for SAREF extensions, VICINITY (H2020-688467), READY4SmartCities (FP7-608711), and NeOn (FP6-027595). She has contributed to the organization of the \"Linked Data in Architecture and Construction Workshop\" since 2015 edition, the \"13th OWL: Experiences and Directions Workshop and 5th OWL reasoner evaluation workshop\" in 2016, the \"Linked Energy Data Vocamp\" in 2015 and the \"Catching up with ontological engineering: To git-commit and beyond\" tutorial at EKAW2018. Finally, she is part of the W3C Web of Things Working Group.\nRelevant publications:\nM. Poveda-Villalón, M.C. Suárez-Figueroa, A. Gómez-Pérez. Validating ontologies with OOPS!. 18th International Conference on Knowledge Engineering and Knowledge Management. (EKAW2012) Galway, Irland, 8 - 12 October 2012.\nVandenbussche, P. Y., Atemezing, G. A., Poveda-Villalón, M., & Vatant, B. (2017). Linked Open Vocabularies (LOV): a gateway to reusable semantic vocabularies on the Web. Semantic Web, 8(3), 437-452.\nRadulovic, F., Poveda-Villalón, M., Vila-Suero, D., Rodríguez-Doncel, V., García-Castro, R., & Gómez-Pérez, A. (2015). Guidelines for Linked Data generation and publication: An example in building energy consumption. Automation in Construction, 57, 178-187.\nAlobaid, A., Garijo, D., Poveda-Villalón, M., Santana-Perez, I., Fernández-Izquierdo, A., & Corcho, O. (2019). Automating ontology engineering support activities with OnToology. Journal of Web Semantics, 57, 100472.\nShort CV Ahmad Alobaid\nAhmad is a PhD student in Universidad Politécnica de Madrid. His work focuses on semantic  labeling of tabular data and the generation of knowledge graphs from tabular data. He also  worked on [\nOnToology\n] to automatically generate documentation, virtualization, evaluation report,  JSON-LD, and validation of the ontology against set rules. He also developed an online mapping editor [\nOME\n] to annotate tabular data and generate mappings (e.g., RML and R2RML). It is integrated with the tada service to automatically suggests the classes and properties from ontologies.\nRelevant publications:\n“Exploiting Declarative Mapping Rules for Generating GraphQL Servers with Morph-GraphQL”, IJSEKE\nAlobaid, A., & Corcho, O. (2018, November). Fuzzy semantic labeling of semi-structured numerical datasets. In European Knowledge Acquisition Workshop (pp. 19-33). Springer, Cham.\nAlobaid, A., Kacprzak, E., & Corcho, O. (2020) . Typology-based Semantic Labeling of Numeric Tabular Data. Semantic Web Journal\nPriyatna, Freddy & Chaves-Fraga, David & Alobaid, Ahmad & Corcho, Oscar. (2019). morph-GraphQL: GraphQL Servers Generation from R2RML Mappings. 10.18293/SEKE2019-055.\nAlobaid, A., Garijo, D., Poveda-Villalón, M., Santana-Perez, I., Fernández-Izquierdo, A., & Corcho, O. (2019). Automating ontology engineering support activities with OnToology. Journal of Web Semantics, 57, 100472.\nDescripciones en Español",
  "speaker": "SYSTEM",
  "uuid": "7a4a1a8e-66b6-426a-a9c3-6e1fabe6ca74"
}