{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 18\nTítulo: mIO!. Entregable 1.1.1 Especificación de requisitos de las ontologías para la representación de la interacción usuario-\nmóvil-servicios/entorno \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Diciembre 2008 \n \n \nAutores (p.o. de firma): García-Castro R. et al. \nTítulo: España Virtual. Entregable 7.2.1 Estudio del Estado del Arte en Semántica y Web Inteligente \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Diciembre 2008 \n \n \nAutores (p.o. de firma): García-Castro R. \nTítulo: NeOn. Deliverable 6.8.2 Testing the NeOn Toolkit interoperability \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Noviembre 2008 \n \n \nAutores (p.o. de firma): Cabrerizo Sánchez A.; García Castro R.; Blázquez Cívico M.; Roldán M.M.; González Cabero R.; \nGonzález M.  \nTítulo: PLATA. Entregable 3.1.1 Ingeniería de Ontologías, Anotación y Acceso Inteligente a Contenidos \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Marzo 2008 \n \n \nAutores (p.o. de firma): Iglesias C.; Muñoz García O.; Gómez Pérez A.; Corcho García O.; García Castro R.; Suárez de \nFigueroa M.C.; González Cabero R.; Aldana Montes J.F.; Navas Delgado I.; Cabrerizo Sánchez A.; Fernández Vilas A.;  \nRentería de Dios M.; López-Cobo J.M.; Martínez Rodríguez I.; Blázquez Cívico M.; Santos Ellacuría I.; Alonso Ibarra J. \nTítulo: PLATA. Entregable 2.1 La Web Semántica y la Web 2.0 \nClave: S  \nVolumen:  \n  \n \nPáginas, inicial: \n  \n final: \n  \n  \nFecha: Marzo 2008 \n \n \nAutores (p.o. de firma): García-Castro R.; Suárez-Figueroa M.C.; Espinoza M.; Sini M.; Leven H.; Blomqvist E. \nTítulo: NeOn. Deliverable 5.6.1 Experimentation with the NeOn methodologies and methods \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Marzo 2008 \n \n \nAutores (p.o. de firma): García-Castro R.; Muñoz-García O.; Suárez-Figueroa M.C.; Gómez-Pérez A.; Costache S.; Maynard \nD.; Dasiopoulou S.; Palma R.; Novacek V.; Lécué F.; Ding Y.; Kaczmarek M.; Piskac R.; Zyskowski D.; Euzenat J.; Dzbor M. \nTítulo: Knowledge Web. Deliverable 1.2.5 Architecture of the Semantic Web Framework v2 \nClave: S  \nVolumen:  \n  \n \nPáginas, inicial: \n  \n final: \n  \n  \nFecha: Diciembre 2007 \n \n \nAutores (p.o. de firma): García-Castro R.; David S.; Prieto-González J. \nTítulo: Knowledge Web. Deliverable 1.2.2.1.2 Benchmarking the interoperability of ontology development tools using OWL \nas interchange language \nClave: S  \nVolumen:  \n  \n \nPáginas, inicial: \n  \n final: \n  \n  \nFecha: Septiembre 2007 \n \n \nAutores (p.o. de firma): García-Castro R. \nTítulo: NeOn. Deliverable 6.8.1 Testing the NeOn Toolkit interoperability \nClave: S  \nVolumen:  \n  \n \nPáginas, inicial: \n  \n final: \n  \n  \nFecha: Agosto 2007 \n \n \nAutores (p.o. de firma): Muñoz García O.; Buil Aranda C.; Brockmans S.; Catenacci C.; Esteban-Gutiérrez M.; García-Castro \nR.; Gómez-Pérez A.; Haase P.; Lehmann J.; Lewen H.; López Atau P.; López A.; Montiel E.; Palma R.; Presutti V.; Sabou \nM.; Suárez-Figueroa M.C.; Waterfeld W.; Weiten M.; Wang Y. \nTítulo: NeOn. Deliverable 5.2.1 NeOn protocols for exchanging and sharing ontologies \nClave: S  \nVolumen:  \n  \n \nPáginas, inicial: \n  \n final: \n  \n  \nFecha: Marzo 2007 \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "7aa70825-c9ce-4d24-818b-796f4e3ce41f"
}