{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual20052010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nPruebas de la aplicación web que se va a utilizar para realizar la evaluación masiva del sistema de asociación de semántica a etiquetas.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nInicio de la implementacion de un modulo para hacer cache de servicios REST.\nTarea 3. Modelo de anotación híbrido\n.\nReorganización del código hasta ahora hecho.\nCreación de un modelo Jena para representar las anotaciones obtenidas por medio del ANNIE y TreeTagger. Inclusión de cada una de ellas en tripletas RDF.\nPersistencia de los problemas de codificación con TreeTagger.\nInterfaz Anotación Híbrida\n\n- Se ha dejado la versión 3 funcional de la interfaz de Anotacion en Regulo. En la direccion\nhttp://regulo.dia.fi.upm.es/anotador\n. En esta versión, se encuentran mejoras, como la busqueda de una URI se puede realizar en todas las paginas, tambies se puede editar un palabra en el resultado, quitandole el highlight (marcado) si se considera que dicha palabra no corresponde a la clasificación del entity name, tambien se genera automaticamente una nuve de tags con las palabras encontradas en la anotación (Folksonomy widget). Dichos terminos (nuve de tags), pueden arrastrarse al widget que llama a una busqueda en sigma con un termino asociado (Sigma Search Widget), una vez que el termino es arrastrado a este widget, de momento se muestra todo el resultado, se trabaja en filtrar esto. Tambien cuenta con 2 botones arriba de la ventana de resultado con la página anotada, los que sirven para para mostrar las leyendas si se desea ocultar dicho widget, y el boton que abre el widget mis cajitas, en el que se puede pegar texto seleccionado y utilizando un menu contextual. Este ultimo boton aun no guarda en la base de datos, el texto copiado, esto se implementara para la siguiente versión.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Tras el proceso de instalación del servidor gridFTP se han detectado fallos en el funcionamiento de los componentes de Fura. La causa de dichos fallos, que provocan que ni los servidores ni los agentes arranquen, no se ha podido determinar. Actualemnte se trabaja en buscar una solución que permita restaurar el funcionamiento del sistema.\nTarea 1.4\n\nSubtarea 2.1.6. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre  hydrOntology y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSubtarea 2.1.7. Evaluación de las técnicas de mappings II: Precisión y exhaustividad de mappings entre PhenomenOntology 3.6 y fuentes IGN (NC, NGN, BCN200 y BCN25)\n: Conjuntos de referencia.\nSe sigue con la implementación del evaluador automático de conjunto de mappings respecto a los conjuntos de referencia.\nImplementación del conversor a formato OEGMappings de los conjuntos de referencia en formato desarrollado.\nTarea 7.1\n\n- Envío del paper para Workshop on Linked Spatiotemporal Data 2010\n- Linked Data.\n· Difusión\n- RDF.\n· Continuación del pintado RDF en mapa\n      · Desarrollo de ontologías para nuevos dominios (redes, unidades administrativas)\n      · Generación de RDF para otros dominios (playas)\n      · Inclusión de Sistema de Referencia en RDF",
  "speaker": "SYSTEM",
  "uuid": "7b3d7d6b-f198-47e8-9ceb-18d762ac3c1f"
}