{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 1\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97726\nIII.  OTRAS DISPOSICIONES\nMINISTERIO DE EDUCACIÓN\n18342\nOrden EDU/3083/2009, de 6 de noviembre, por la que se convocan ayudas \npara becas y contratos de Formación de Profesorado Universitario del Programa \nNacional de Formación de Recursos Humanos de Investigación, en el marco \ndel Plan Nacional de Investigación Científica, Desarrollo e Innovación \nTecnológica 2008-2011.\nEl Ministerio de Educación en el ejercicio de sus competencias, hace pública la presente \nconvocatoria de becas y ayudas del Programa de Formación de Profesorado Universitario \n(FPU), conducentes a la formación docente e investigadora en el marco del Estatuto del \npersonal investigador en formación, aprobado por el Real Decreto 63/2006, de 27 de \nenero.\nEste programa se integra en una política global, con un amplio ámbito de actuación, \nestablecida como Acción horizontal en el marco del Plan Nacional de I+D+I (2008-2011), y \ntiene como propósito promover la formación específica para aquellos que deseen orientar \nsu actividad profesional hacia la investigación y/o la docencia universitaria. Todo ello de \nacuerdo con la Recomendación de la Comisión de las Comunidades Europeas relativa a \nla Carta Europea del Investigador y al Código de conducta para la contratación de \ninvestigadores (EEE/2005/251/CE). En dicho documento se hace referencia a la formación \nde los investigadores en el Espacio Europeo de Investigación, desde el inicio de la misma \ncomo estudiantes de posgrado.\nEste programa pretende incrementar la cantidad y calidad de lo nuevos doctores, por \nlo que las universidades y centros de investigación y particularmente sus grupos de \nformación e investigación con solvencia académica y científica, deben concentrar sus \nesfuerzos y atraer a los mejores candidatos para formarlos al más alto nivel, como mejor \ngarantía de la calidad del programa.\nCabe destacar en esta convocatoria la gestión de los organismos de adscripción de los \nbeneficiarios de las ayudas, que asumen la condición de entidades colaboradoras de \nacuerdo con lo dispuesto en la Ley 38/2003, de 17 de noviembre, General de Subvenciones, \ndesde el inicio de la actividad formativa del beneficiario de la ayuda. Ello supone un refuerzo \nal marco establecido en el Estatuto del Personal Investigador en Formación, aprobado por \nReal Decreto 63/2006, de 27 de enero.\nIgualmente se contempla en la presente convocatoria el nuevo marco de las enseñanzas \nuniversitarias oficiales de acuerdo con el Real Decreto 1393/2007, de 29 de agosto y el \ncalendario de extinción de las enseñanzas de las ordenaciones del Real Decreto 56/2005 \nde 21 de enero, del Real Decreto 778/1998, de 30 de abril y el Real Decreto 189/2007, \nde 9 de febrero, sin perjuicio de la continuación de estudios iniciados conforme a \nordenaciones anteriores. Ello ha supuesto adaptar algunos requisitos de los candidatos y \nhomogenizar algunos aspectos que hagan objetivos los méritos académicos que se tienen \nen cuenta en la concurrencia competitiva. Por otra parte, se reduce la presentación de \nalgunos documentos para aquellos que han participado en la convocatoria del año 2008 \nque el órgano gestor solicitará de oficio para la acreditación de determinados requisitos.\nSe introducen en la presente convocatoria como novedades, por un lado, la reserva de \nplazas para estudiantes con una discapacidad igual o superior al 65 por ciento y, por otro, \nse acentúa la exigencia de la formación docente que deben realizar sus beneficiarios, en \nvirtud de que la finalidad de la beca debe compaginar adecuadamente la formación docente \ny la investigadora de acuerdo con el perfil profesional del profesorado universitario.\nLas bases de esta convocatoria se adaptan a lo establecido en ORDEN ECI/266/2008, \nde 6 de febrero, por la que se establecen las bases reguladoras de la concesión de \nsubvenciones públicas en el marco de la línea instrumental de actuación en recursos \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "7b5da18a-eae7-424a-86be-ce42578e5a8e"
}