{
  "message": "SYSTEM: Jmora-cicyt.pdf: Página 4\n \n \nParticipación en Proyectos de I+D financiados en Convocatorias públicas.  \n \n \n(nacionales y/o internacionales) \n \nTítulo del proyecto: OntoGrid: Paving the way for Knowledgeable Grid Services and Systems (FP6-511513) \nEntidad financiadora: Unión Europea \nEntidades participantes: Universidad Politécnica de Madrid; University of Liverpool; University of Manchester; Intelligent \nSoftware Components S.A., Y´All B.V., Technical University of Crete, DEIMOS Space S.L., Boyd International B.V.i.o \nDuración,  desde: 24-10-2006 \n \nhasta: 31-12-2006        \n \n \nInvestigador responsable: Asunción Gómez Pérez \nNúmero de investigadores participantes: 36 \n \n \nTítulo del proyecto: Extensiones a portales semánticos con wikis semánticos. (CCG06-UPM/INF-284) \nEntidad financiadora: Ayudas para apoyar las líneas de i+d en el programa de creación y consolidación de grupos de \ninvestigación de la Universidad Politécnica de Madrid   \nEntidades participantes: Universidad Politécnica de Madrid \nDuración,  desde: 01-01-2007 \n \nhasta: 31-12-2007  \n \nInvestigador responsable: Asunción Gómez-Pérez \nNúmero de investigadores participantes:  \n \n \nTítulo del proyecto: Single European Employment Market-Place. (FP6-027347) \nEntidad financiadora: Unión Europea \nEntidades participantes: TXT e-solutions, University Milano Bicocca, Universite' Joseph Fourrier  Grenoble, Leopold-\nFranzens University Innsbruck, Universidad Politécnica de Madrid, ICT Centre of Excellence for Research, Innovation, \nEducation and Industrial Labs partnership, European Dynamics SA, Agenzia Regionale per il Lavoro Regione Lombardia, \nPublic Employment Agency of Wallonia, Public Employment Service of Catalonia, Municipality of Marseille, Foundation \nPolska-Europe-Polonia \nDuración,  desde: 01-01-2008 \n \nhasta: 31-12-2008  \n \nInvestigador responsable: Asunción Gómez-Pérez \nNúmero de investigadores participantes:  \n \nTítulo del proyecto: SemsorGrid4Env Semantic Sensor Grids for Rapid Application Development for Environmental \nManagement FP7-223913 \nEntidad financiadora: Unión Europea \nEntidades participantes: Universidad Politécnica de Madrid (coordinator); University of Manchester; National and \nKapodistrian University of Athens; University of Southampton; DEIMOS Space S.L., Emu Ltd.y TechIdeas \nDuración, desde: 01-09-2008 hasta: 31-08-2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \n1 \n                                                      \nNota: Si necesita más casos, añádalos utilizando las funciones de copiar y pegar con el 2º caso. \n",
  "speaker": "SYSTEM",
  "uuid": "7b89dd3a-1c60-44f4-8131-fdbbe949f0e0"
}