{
  "message": "SYSTEM: CV_Raul_formato_CICYT.pdf: Página 17\n \n \nAutores (p.o. de firma): García-Castro R. \nTítulo: NeOn. Deliverable 6.8.3 Testing the NeOn Toolkit interoperability \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Enero 2010 \n \n \nAutores (p.o. de firma): García Castro R.; Rucabado-Rucabado G., Hill C., Izquierdo A., Corcho O. \nTítulo: SSG4Env. Deliverable 4.3 Sensor network ontology suite \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Diciembre 2009 \n \n \nAutores (p.o. de firma): García Castro R.; Grimm S.; Schneider M.; Kerrigan M.; Stoilos G. \nTítulo: SEALS. Deliverable 10.1 Evaluation Design and Collection of Test Data for Evaluating Ontology Engineering Tools v1 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Noviembre 2009 \n \n \nAutores (p.o. de firma): García Castro R.; Martín Recuerda F. \nTítulo: SEALS. Deliverable 3.1 SEALS Methodology for Evaluation Campaigns v1 \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Noviembre 2009 \n \n \nAutores (p.o. de firma): Grimm S; Nixon L.; García Castro R. \nTítulo: SEALS. Deliverable 2.4 First Report for Community Building and Dissemination \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Noviembre 2009 \n \n \nAutores (p.o. de firma): Gray A.; Galpin I.; Fernandes A.; Paton N.; Page K.; Sadler J.; Koubarakis M.; Kyzirakos K.; \nCalbimonte J.P.; Corcho O.; García Castro R.; Díaz V., Liébana I. \nTítulo: SSG4Env. Deliverable 1.3 SemSorGrid Architecture – Phase I \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Agosto 2009 \n \n \nAutores (p.o. de firma): Poveda-Villalón M.; García-Castro R.; Ruiz C.; Gómez-Pérez J.M. \nTítulo: mIO!. Entregable 1.1.5 Extensión de la metodología de desarrollo de ontologías NeOn  \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Marzo 2009 \n \n \nAutores (p.o. de firma): Poveda-Villalón M.; García-Castro R.; Ruiz C.; Gómez-Pérez J.M. \nTítulo: mIO!. Entregable 1.1.3 Formalización e implementación de las ontologías mIO!  \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Marzo 2009 \n \n \nAutores (p.o. de firma): Muñoz-García O.; García-Castro R.; Gómez-Pérez A. \nTítulo: NeOn. Deliverable 5.5.1 NeOn Methodology for the Development of Large-Scale Semantic Applications  \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Enero 2009 \n \n \nAutores (p.o. de firma): Poveda-Villalón M.; García-Castro R.; Ruiz C.; Gómez-Pérez J.M. \nTítulo: mIO!. Entregable 1.1.2 Planificación y selección del ciclo de vida del desarrollo de las ontologías mIO!  \nClave: S  \nVolumen:  \n     \n \nPáginas, inicial: \n     \n final: \n     \n  \nFecha: Enero 2009 \n \n \nAutores (p.o. de firma): Cadenas A.; Lamsfus C.; Martín D.; Larizgoitia I.; García Castro R.; Poveda M.; Ruiz Moreno C.; \nGonzález Rodríguez M. \n",
  "speaker": "SYSTEM",
  "uuid": "7bd83be9-590a-4b8b-af09-5965281b7491"
}