{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 165\nMINISTERIO DE CIENCIA E INNOVACIÓN\n171\n223.- Revistas de Biomedicina. Instituto de Historia de la Ciencia\ny la Documentación López Piñeiro (IHCD)\nDirección Web: http://bddoc.csic.es:8080/inicioBuscarSimple.do;jsessionid=\n8B82B9BF63CFFFF9B3B02BCD7A2DA79C?tabla=revi&bd=IME&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple y avanzada\nMateria: Sanidad.\nDescripción y comentarios: Biomedicina (Administración sanitaria, Farmacia clínica,\nMedicina experimental, Microbiología, Psiquiatría, Salud pública). Fuentes: 321 publica-\nciones periódicas editadas en España. Volumen: 263.206 registros. En algunos registros se\nincorpora la posibilidad de obtener el texto completo del artículo. \n224.- Sumarios ICYT-Ciencia y Tecnología. Consejo Superior de Investigaciones\nCientíficas (CSIC)\nDirección Web:\nhttp://bddoc.csic.es:8080/inicioBuscarSimple.do;jsessionid=75808BB8F38B41E440DE1\n2DBED908DFF?tabla=docu&bd=ICYT&estado_formulario=show\nOrganismo editor: Instituto de Estudios Documentales sobre Ciencia y Tecnología (IEDCYT).\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple y avanzada\nMateria: Ciencia y tecnología.\nDescripción y comentarios: Referencias a artículos sobre ciencia y tecnología. Agrono-\nmía, Astronomía, Astrofísica, Ciencias de la Vida, Ciencias de la Tierra y del Espacio, Far-\nmacología, Física, Matemáticas, Química y Tecnologías tales como: Aeronáutica, Alimen-\ntación, Bioquímica, Biotecnología, Carbón y petróleo, Construcción, Eléctricas, Electróni-\nca, Energética, Espacio, Ferrocarriles, Industrial, Instrumentación, Materiales, Mecánica,\nMédica, Medio Ambiente, Metalúrgica, Minera, Naval, Nuclear, Ordenadores, Planifica-\nción urbana, Productos metálicos, Química, Telecomunicaciones, Textil y Transportes. Ba-\nse de datos referencial y bibliográfica que recoge la literatura científica contenida en publi-\ncaciones españolas de ciencia y tecnología. Todos los documentos están localizables en la\nBiblioteca del CINDOC, sede Ciencia y Tecnología, en la calle de Joaquín Costa, 22, Ma-\ndrid. Fuentes: 747 publicaciones periódicas editadas en España especializadas en estas áre-\nas, fundamentalmente revistas además de monografías, actas de congresos, informes y tesi-\nnas. Crecimiento anual: 8.000 referencias. Volumen: 173.094 registros. En algunos regis-\ntros se incorpora la posibilidad de obtener el texto completo del artículo.\nBASES DE DATOS  1/1/04  03:39  Página 171\n",
  "speaker": "SYSTEM",
  "uuid": "7c85dd4b-9079-497f-a9b9-c6358bb988b9"
}