{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 12\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n12 \n \n \nEjercicio 9: Clasificación de Peces \nDadas las siguientes reglas: \n \nR1.- \nSi el pez tiene la boca pequeña y dientes puntiagudos y vive en ríos de muchas partes del mundo \nENTONCES estamos hablando de un ejemplar del orden de los Ciprinodontiformes. \n \nR.2.- Si tenemos un individuo del orden de los Ciprinodontiformes y que vive en los ríos de América del \nSur y que en el caso de ser macho posee Gonopodio ENTONCES el pez es de la familia de los \nPoecilidos y la hembra es 3 cm. más grande que el macho. \n \nR.3.- Si tenemos un individuo del orden de los Ciprinodontiformes y que vive en los ríos de América del \nSur y que es hembra ENTONCES el pez es de la familia de los Poecilidos y el macho es 3 cm. más \npequeño que la hembra. \n \nR.4.- Si tenemos un individuo de la familia de los Poecilidos que tiene manchas a lo largo del cuerpo \nENTONCES estamos ante un pez de la raza de la Gambusia affinis. \n \nR.5.- Si tenemos un individuo de la familia de los Poecilidos que tiene color gris y rayas verdes a lo \nlargo del cuerpo ENTONCES tenemos un ejemplar de raza de Gambusia Punctata. \n \nR.6.- Si el pez es de tamaño medio, tiene dientes puntiagudos, vive en ríos de todo el mundo y posee \ncanales laberínticos para respirar fuera del agua ENTONCES pertence al orden de los anabatidos. \n \nR.7.- Si el pez es del orden de los anabatidos, es de color azul, tiene rayas rojas y vive en ríos de Asia \nENTONCES tenemos un pez de la raza luchadores de Sian. \n \nR.8.- Si el pez es del orden de los anabatidos, mide 25 cm., no tiene rayas ENTONCES es una perca \ntrepadora. \n \nR.9.- Si el pez tiene la boca pequeña, vive en ríos de todo el mundo tiene la cola redondeada \nENTONCES es un ejemplar del orden de los Ciclidos. \n \nR10.- Si el pez es del orden de los Ciclios, vive en los ríos de Africa y es de color rojo con manchas \nnegras ENTONCES es pez joya. \n \nModelícelasen un sistema de producción \n",
  "speaker": "SYSTEM",
  "uuid": "7d29ade5-5dfd-4f5b-9382-4aeabd0140ec"
}