{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/DeustoTechnov2010 \n\nCall for Post-Doc Position at MoreLab Research Group\nThe MoreLab Research Group (\nhttp://www.morelab.deusto.es\n), belonging to DeustoTech INTERNET unit, focuses its activity around the theme “Ubiquitous Intelligent Systems of Services”. DeustoTech – Deusto Institute of Technology (\nhttp://www.deustotech.eu/\n), is the research institute associated to the Faculty of Engineering of the University of Deusto. MoreLab was created in 2004 and since then has grown rapidly. We are now 30 members of staff and we are currently running about 10 applied research projects, most of them as part of big consortiums in FP7, CELTIC, ITEA2 and Spanish Avanza programs. We are also running 2 basic research projects, one financed by the Spanish Government and another one for the Basque Government. The most senior members of our team belong to the research team DEUSTEK2 (led by MoreLab’s Principal Researcher Dr. Diego López-de-Ipiña) which is an official research team recognized by the Basque Government’s University System. For details about our members, current and past projects and publications visit the “Members”, “Projects” and “Publications” sections of our site (\nhttp://www.morelab.deusto.es\n).\nThe main research topics tackled by our group are Ambient Intelligence (concretely Semantic Reasoning and Learning Methods targeted to user understanding and environment reaction), Internet of Things, mobile-mediated human-environment interaction, semantic middleware for Intelligent Environments, WebLabs, RFID and NFC, or Internet of Services. Notably, we have been working on Ambient Intelligence since 2003 when the SmarLab research lab (\nhttp://www.smartlab.deusto.es\n) was created. In this lab, we carry out our research on both hardware and software technologies that allow the intelligent instrumentation of environments (e.g. homes, offices or cities). Multi-device, multi-object intelligent adapted (personalized) service provision, consumption, orchestration and coordination within those Smart Environments aided by Semantic Web is our current main research focus.\nWe are currently seeking for a PostDoc. The main role of the candidate will be to identify the most scientific elements of the projects we are carrying out and contribute to the team with the production of high quality, high impact publications. Additionally, the PostDoc will help the Principal Researcher Dr. Diego López-de-Ipiña (\nhttp://paginaspersonales.deusto.es/dipina\n), identifying new strategic research opportunities. The PostDoc will also co-supervise some of the PhD dissertations currently underway in the team, in the area of machine learning and reasoning for more adaptive and personalized semantically-modeled Intelligent Environments. Finally, the PostDoc will take active part in the preparation of new scientifically challenging European proposals, supervising at most one highly relevant project for him/her per year. The following aspects will be taken into account, in the order given, when assessing the suitability of the candidate:\n- Have a significant research experience and publication record.\n  - Alignment of the candidate research interests with our research group interests. In particular, we want an expert on AI, learning, reasoning and semantic user modeling, with a strong background in distributed systems.\n  - Have ideally worked in research for 3 years after obtaining his/her PhD.\n  - Be first author in at least 1 JCR-indexed journal per year starting from the date when the candidate finished his/her PhD.\n  - Previous participation in international research teams, projects and research networks, dealing with Semantic Web, Ambient Intelligence, Distributed and/or Embedded Systems.\n  - Be proficient in English is a must. Knowledge of Spanish and even Basque will be valued positively.\nThe conditions for the position will be the following:\n- The PostDoc position will be for a period of 3 years and as a full-time job.\n  - The wage will be in the range 30-45K €.\nFor more details about the postdoctoral call under which this PostDoc position is offered, please visit:\nhttp://www.fundacion-deusto.deusto.es/servlet/Satellite/Page/1287998384707/_ingl/%231115650289076%231287998384707/UniversidadDeusto/Page/PaginaCollTemplate\nInterested candidates should contact the Principal Researcher Dr. Diego López de Ipiña by email (dipina [at] deusto [dot] es), providing the following information:\n- A letter reasoning why the candidate believes that he/she would be a suitable PostDoc for the position announced.\n  - Detailed Scientific CV of the candidate.\n  - Names and emails of two people who could give feedback about the candidate.\nCandidates should also fill in the following webform:\nhttp://www.fundacion-deusto.deusto.es/servlet/Satellite/FrSolicitud/1287998403194/_ingl/%231/0/cx/UniversidadDeusto/comun/render\n, selecting in the Research Team dropbox, the option “9. Deustek”",
  "speaker": "SYSTEM",
  "uuid": "7d6202e2-a0f1-4017-b1f2-4726772dd150"
}