{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual16092010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nMigración del ambiente de desarrollo a Netbeans 6.9.1. Se han presentado múltiples problemas en la migración de la plataforma actual (6.7) a la ultima versión (6.9.1). Con respecto a la aplicación web, la versión de ICEFaces, que es el framework que utilizamos, ha cambiado y por tanto el despliegue de la aplicación no se ha realizado automáticamente. En estos momentos se esta trabajando específicamente en esta migración.\nEsta migración ha hecho que los servicios no estén disponibles y que por tanto las tareas para esta semana se hayan tenido que aplazar. Una vez terminada la migración de la aplicación se procederá a migrar los servicios web SOAP que tampoco se van a migrar automáticamente debido a que el API JAX-SW que se utiliza también ha cambiado.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 3. Modelo de anotación híbrido\n.\n- Locuciones.\nSe ha estudiado la aplicación de técnicas de Latent Semantic Analysis (LSA) para su aplicaión a la corrección de errores ortográficos en las locuciones.\nTarea 2.3\n\n- Corrección de los errores detectados en el H6.\n- Finalización de las pruebas sobre el entorno.\n- Instalación de librerías para video del AEI.\nTarea 1.4\n\nSubtarea 2.2.2. Mejoras en técnicas existentes\n.\nTécnica 7. Aumento de tasa de reconocimiento de palabras sobre el fichero de información semántica.\nIGNMapDiscover 2.0\nImplementación de mejora en técnica 7.\nTarea 7.1\n\n- Heurísticas\n· Mejora heurísticas desarrolladas\n      · Revisión de resultados obtenidos\n      · Generación de gold standard\n- Web/Difusión\n. Noticia GeoLinked Data\n      · Envío de la versión camera-ready al ACM SIGSPATIAL'10",
  "speaker": "SYSTEM",
  "uuid": "7f8d8225-1d83-4966-81f3-26de624fd170"
}