{
  "message": "SYSTEM: Planing_Scheduling.pdf: Página 3\nThis model is recommended in projects that  \n Have closed, non-ambiguous, unchangeable and \ncompletely known requirements at the beginning \nof the ontology development.  \n Do not last long (e.g., 2 months). \n Re-implement an existing ontology or part of it in \na different formalism or language. \n Transform a particular knowledge resource (e.g., \nISO standards or thesauri) into an ontology. \n Cover a small and well-understood domain. \n \n3.2. Iterative-incremental life cycle model \n \nThis model organizes the ontology development in a \nset of iterations (or short mini-projects with a fixed \nduration). Any iteration is scheduled as an ontology \ndevelopment project that uses one of the waterfall \nmodel versions shown in Section 3.1. \nThe model proposes the successive improvement \nand extension of the ontology by means of performing \nmultiple iterations with feedback and adaptation. Thus, \nthe \nontology \ngrows \nincrementally \nalong \nthe \ndevelopment. In each iteration, new or modified \nrequirements are allowed for. The number of iterations \nwill depend on the knowledge we may have of the \nrequirements at the beginning of the project. The result \nof any iteration in this model is an ontology that meets \nthe requirements identified in the iteration. \nIt should be noted that when using this model, no \nbacktracking is allowed between the phases of a \nparticular iteration because the refinement should be \nperformed in the next iteration, and that in the \ninitiation phase of each iteration revisions of ontology \nrequirements and schedule should be carried out.  \nThis model is recommended in ontology projects \n With large groups of developers in which \ncomplex scenarios are considered, such as \nreengineering \nnon-ontological \nresources \nor \naligning ontological resources. \n In which requirements are not completely known \nat the beginning or can change during the \nontology development. \n In which requirements have different priorities. \n \n4. \nMethodological \ngroundings \nfor \nscheduling ontology development projects \n \nWe propose to carry out the scheduling of ontology \ndevelopment projects based mainly on the scenarios \nidentified in the NeOn Methodology [9]. For this \nreason and to be able to answer the first three questions \npresented in Section 2, we did some research that \nyielded the following results: (1) a set of questions that \nhelp to select the most appropriate version of the \nwaterfall life cycle model; (2) the correspondences \nbetween the phases of the life cycle model and the \nprocesses and activities; and (3) the order and \ndependencies between processes and activities. \n \n4.1. The most appropriate model version \n \nTo select a particular waterfall model version from \nthose presented in Section 3.1, we propose the set of \nnatural language questions displayed in Table 1. These \nquestions are related to the different scenarios \nidentified in the NeOn Methodology [9]. If one or \nmore questions of those proposed are answered \naffirmatively, then several candidate models could be \nused. In that case, the model version selected should be \nthe most specific one (e.g., 5-phase is more specific \nthat 4-phase, 6-phase + merging phase is more specific \nthan 6-phase). Otherwise, if all answers are negative, \nthen the 4-phase waterfall model is selected by default. \nTable 1. Questions and model versions  \nWill you use any non-ontological resource \n(NOR) in your ontology development? \n6-Phase \nWill you use any ontological resource in your \nontology development? \n5-Phase \nWill you use and modify any ontological \nresource in your ontology development? \n6-Phase \nWill you use and merge a set of ontological \nresources in your ontology development? \n5-Phase + \nMerging Phase \nWill you use, merge, and modify a set of \nontological \nresources \nin \nyour \nontology \ndevelopment? \n6-Phase + \nMerging Phase \nWill you use ontology design patterns in your \nontology development? \n5-Phase \nWill you restructure your ontology? \n4-Phase \nWill you develop your ontology in different \nnatural languages? \n4-Phase \n \n4.2. Model phases and processes and activities \n \nProcesses and activities should be carried out in a \nparticular phase of the selected ontology network life \ncycle model to fulfill the purpose and outcome of that \nphase. Table 2 presents an excerpt of the matching \nbetween model phases and process and activities. The \nprocesses and activities are defined in the NeOn \nGlossary [7] whereas the phases are defined in our \nrepository of models and these are the initiation phase, \nthe reuse phase, the merging phase, the reengineering \nphase, the design phase, the implementation phase, and \nthe maintenance phase.  \n",
  "speaker": "SYSTEM",
  "uuid": "80a07f8c-6d43-497a-888b-62494d0809d1"
}