{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 6\n \n \n6\n    UNIVERSIDAD POLITÉCNICA DE MADRID \n5.2. Los beneficiarios podrán asistir a congresos, seminarios o conferencias de corta \nduración, para presentación de trabajos o asistencia a “Workshops” para los que \npodrán solicitar ayuda a las convocatorias de la UPM, según lo señalado en el punto \n10.9 y la convocatoria publicada para tal fin.  \n5.3. Colaboraciones docentes.- Los beneficiarios que se encuentren en su período de \ncontrato podrán ser autorizados a realizar colaboraciones, con fines formativos, en las \ntareas docentes de un Departamento, Centro de I+D o Instituto  Universitario de la \nUPM, previa conformidad del Director y del Departamento en cuyo seno se realice y \ncon la autorización de la Dirección de la Escuela, Facultad, Centro de I+D o Instituto  \nUniversitario, hasta un máximo  de 60 horas/año, debiendo certificarse dicha \ncolaboración sin que ello implique remuneración adicional. Para ello, además, deberá \ncontarse con la autorización del Vicerrectorado de Investigación, especialmente \nrespecto del tipo de tareas encomendadas y de la duración de las mismas. \n5.4. Tasas académicas.- Los becarios estarán exentos, o con posterioridad al pago se \nprocederá a su devolución, de los créditos del período de formación de programas de \ndoctorado de la UPM.  Se define período de formación de un Programa de Doctorado \ncomo los créditos necesarios para obtener el DEA, en el caso de RD 778/1998, los 60 \nECTS que sean últimos de un título de máster o un conjunto de 60 ECTS de varios \ntítulos de máster que sean últimos respectivamente en cada título en el caso del RD \n56/2005, y lo que se explicita con tal nombre en el caso del RD 1393/2007, para el \ncurso 2009-2010. \nA estos efectos, los beneficiarios que se incorporen serán eximidos de las tasas del \ncurso académico iniciado presentando su credencial de becario o bien tendrán \nderecho a la devolución del importe correspondiente a dichas tasas cuando su fecha \nde incorporación sea anterior al 1 de mayo. Los becarios incorporados con \nposterioridad a esa fecha, lo serán en el curso académico siguiente. \nLa devolución, en su caso, se realizará de oficio por el Vicerrectorado de Investigación \nuna vez finalizado el curso académico, con anterioridad al mes de septiembre, siempre \nque el becario presente la carta de pago original de dichas tasas. \n5.5. Acción Social.- Los beneficiarios en fase de contrato tendrán derecho a los beneficios \nde las prestaciones de la Acción Social de la UPM, establecida en la normativa \nespecífica para el Personal Investigador en Formación, una vez que sea aprobada por \nla Universidad para el próximo ejercicio presupuestario 2010 y siguientes. \n \nSEXTO.-  TEMÁTICA DE LAS AYUDAS \n \n6.1. Para solicitar una de las treinta y cinco becas hay que optar por una sola de las \nsiguientes temáticas, en el caso de señalar más opciones la solicitud será anulada. \na) \nTemas relacionados con cualquiera de las áreas de conocimiento o áreas \ntemáticas del profesorado de la UPM \nb) \nSe convocan dos becas con la temática relacionada con áreas de actividad \ninvestigadora en cooperación internacional para el desarrollo. \n                        \n \n",
  "speaker": "SYSTEM",
  "uuid": "81106375-d4d0-46e7-aedf-4dfb1b4177a9"
}