{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 143\nMINISTERIO DE CULTURA\n149\n182.- Base de datos de bienes inmuebles. Patrimonio Cultural\nDirección Web:\nhttp://www.mcu.es/bienes/cargarFiltroBienesInmuebles.do?layout=bienesInmuebles&cache\n= init&language=es\nOrganismo editor: Subdirección General de Protección del Patrimonio Histórico.\nMinisterio de Cultura.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Patrimonio cultural.\nDescripción y comentarios: Contiene los bienes inmuebles inscritos en el Registro de Bienes\nde Interés Cultural. En cada consulta se obtendrá una “ficha básica” de identificación y descrip-\nción del bien e indicación de su situación jurídico-administrativa. Excepción: No se encuentran\nen esta base de datos los siguientes Bienes de Interés Cultural declarados por ministerio de la\nLey 16/1985: bienes inmuebles destinados a la instalación de archivos, bibliotecas y museos de\ntitularidad estatal, así como los bienes muebles custodiados en su interior; cuevas, abrigos y\nlugares que contengan manifestaciones de arte rupestre; castillos; emblemas; cruces de térmi-\nno y otras piezas similares, y hórreos o cabazos antiguos existentes en Asturias y Galicia. \n183.- Base de datos de bienes muebles. Patrimonio Cultural\nDirección Web:\nhttp://www.mcu.es/bienes/cargarFiltroBienesMuebles.do?layout=bienesMuebles&cache=\ninit&language=es\nOrganismo editor: Subdirección General de Protección del Patrimonio Histórico.\nMinisterio de Cultura.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nSimple\nMateria: Patrimonio cultural.\nDescripción y comentarios: Información sobre los bienes muebles inscritos en el\nRegistro de Bienes de Interés Cultural. Excepción: No se encuentran en esta base de datos\nlos siguientes Bienes de Interés Cultural declarados por ministerio de la Ley 16/1985:\nbienes inmuebles destinados a la instalación de archivos, bibliotecas y museos de titulari-\ndad estatal, así como los bienes muebles custodiados en su interior; cuevas, abrigos y luga-\nres que contengan manifestaciones de arte rupestre; castillos; emblemas; cruces de térmi-\nno y otras piezas similares; y hórreos o cabazos antiguos existentes en Asturias y Galicia.\nSólo aparecerán aquellos que en su momento se ha formalizado una solicitud individuali-\nzada, para su inclusión en el Registro de Bienes de Interés Cultural.\nBASES DE DATOS  1/1/04  03:39  Página 149\n",
  "speaker": "SYSTEM",
  "uuid": "813b2f0f-e045-4f62-8745-774e9d534e33"
}