{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 19\n17\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n2.3 Trends & Growth by Segment\nSpeech Technology Market\nTrends – Speech Technology\nSpeech Technology is being deployed on new platforms opening new channels and markets, as well as in\nanalytics applications that bring the technology into new areas of the Enterprise. Speech search, audio min‐\ning, speech analytics and applications enhanced by emotion detection and “NLU” (natural language under‐\nstanding, a term being used generally to describe dialogue) add spice to offerings being developed.\nThe market is heavily dominated by speech recognition, with a long history of commercial use. Positioned as\ncost‐saving technology, Automatic Speech Recognition(ASR) sales were little affected by the recession;\nclaims of 50% ‐ 90% cost reduction in call centres are reported, and call centre penetration is extremely high.\nSpeech transcription services (e.g. in the healthcare domain) are increasingly offered through cloud servic‐\nes. \nImprovements in the quality of Text to Speech (TTS), combined with platforms requiring interactivity (such\nas mobile, gaming) are driving new opportunities for speaking applications. Notable features are naturalis‐\ntic voices in many more languages, used in education and gaming environments, as well as interactive access\nto the web (Voice Portals).\nVoice biometrics (the smallest segment of the market) is quietly gaining both market interest and invest‐\nments. The performance of speaker verification products, and the ubiquity of digital access, is also boosting\ntake‐up in biometrics; the Nuance VoiceVault has 50 million voiceprints, and growing; a small bevy of niche\nplayers have emerged in this space, including the Spanish company Agnitio, and there is growing interest\nfrom the military/security sector.\nOperator revenue from voice (fixed line) is in decline, and the explosion of VOIP further drives opportunity\nto embed speech applications. On‐premise IVR solutions are also fading, cloud Interactive Voice Response\n(IVR) is on the rise creating scope for collecting and deploying vast stores of speech data. This, in turn, will\ndrive quality and market acceptance. Open standards support interoperability (notably more advanced than\nin other LT segments), but certification regimes from major platform vendors suppress opportunities for new\nentrants.\nMajor markets for Speech:\n• Call Centre is a core global market\n• Medical reporting and transcription is growing (especially in the USA for compliance with new\nElectronic Health Records regulations)\n• Large and stable government customer base (including specialised defence applications)\n• Speedy growth in consumer markets on devices and social platforms.\nMajor gaps and opportunities for speech technology:\n• Language coverage, need to develop a competitive market for  languages beyond English\n• Asian markets, high digital growth and low penetration outside Japan\n• Speech data for developers, competitive choices on open platforms\n",
  "speaker": "SYSTEM",
  "uuid": "81a87c90-a140-4b61-a57e-abec646aac0d"
}