{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/GeoVoCamp2011 \n\nEn esta URL\n[1]\naparece la Wiki donde se recogen los detalles generales del\nGeoVoCamp2011\n, organizado en el\nOrdnance Survey (Southampton)\n.\nA continuación se recogen los principales detalles del\nDía 1\n:\n- Presentación inicial de los asistentes.\n- Breve introducción del scope del GeoVoCamp'11, algunas referencias a la edición anterior (Washington - 2009) y breve referencia al survey recodigo en\n[2]\n.\n- División en grupos de interés (\ntemporal\n,\nfuzzy relations\n,\ngeometry\nand\nmetadata\n). Considerando los trabajos en el contexto de GeoLinked Data nos centramos en el grupo de\ngeometría\n, donde participan miembros de Karlsruhe, IBM, Leipzig, UPM y puntualmente Barry Norton, John Goodwin y personal de Ordnance Survey.\n- Partimos de una hipotética query que contempla relaciones topológicas (within)\n- Se expone el tratamiento de la geometría como\nLiteral\ny\nRDF\n. En RDF se considera los enfoques que incluyen orden (LinkedGeoData y GeoLinkedData). Además, se considera la inclusión de la geometría como un rdf:list\n- Utilización de\nWGS84 vs. otros tipos de representación\n. Se menciona la transformación de coordenadas (aunque no se conocen en detalles las implicaciones del proceso de transformación de coordenadas en los datos) y se habla de convertir todo a WGS84. La transformación es una cuestión a investigar.\n- Múltiples geometrías:\n· Diferentes resoluciones/escalas\n     · Dimensiones 2D,2'5D y 3D (con metadatos asociados)\n     · Diferencias de composición de geometrías (e.g. multi-polygon)\n- Generación de pseudo modelo geometría con las clases principales (punto, curve -LineString & LinearString- y polygon)\n- Discusión de geometría como elementos contínuos o puntos\n- GeoSPARQL (desconocimiento entre los miembros del grupo)\n- Utilización del\nContent Negotiation\npara obtener geometría en formato deseado (RDF, GML, etc.) como alternativa a los literales. Esto está en relación con una idea que teníamos hace algún tiempo de relacionar un Triple Store y una BBDD geoespacial. En este sentido, para el día 2, vamos a proponer un caso de uso utilizando Geometry2RDF.\nImpresión general\n: De este GeoVoCamp no va a salir ningún documento de referencia, dado que nuestra impresión es que los miembros participantes (y los grupos que hay detrás) se encuentran en un estado inicial de los trabajos en este área. Así, están comenzando a detectar algunos problemas que nosotros ya hemos identificado hace tiempo. Además, entre los miembros asistentes se detecta cierto desconocimiento de cosas básica en el dominio geoespacial, de ahí que tiendan a reinventar cosas.",
  "speaker": "SYSTEM",
  "uuid": "822fac9e-8039-491c-89d2-9a84979c0170"
}