{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 26\nPage 26 of 124\nNeOn Integrated Project EU-IST-027595\nschema. The method employs an ad-hoc wrapper. It contemplates, on the one hand, syntactic\ntransformation aspects, and on the other, how symbols are structured in the thesaurus and ontology\nformats. It also contemplates semantic transformation aspects and the semantic interpretation\nof the resource elements when deﬁning transformations to ontology elements. The method tackles\nthe internal data model of the thesaurus and describes how the resource data is represented and\naccessed for the transformation. This method does not provide the resource provenance informa-\ntion, so the resultant ontology does not keep the reference to the thesaurus. The purpose here is to\nhave a computer-assisted approach where a human editor teaches a computer program rules for the\nreﬁnement of relationship, FAO26 has a program where some of the re-engineering is done primarily\nby people.\nThe steps of the transformation process are\n– To deﬁne the ontology structure.\n– To ﬁll in values from one or more legacy KOS to the extent possible.\n– To edit manually using an ontology editor and make existing information more precise by adding\nnew information.\nIn order to automate the process Soerger et al. plan to build an inventory of patterns, namely,\ncontent ontology design patterns speciﬁc for the agricultural domain. They also review a set of speciﬁc\nrelationships, e.g. subClassOf and ad-hoc relations, that can be included in the resultant ontology.\nLauser et al.\npresent the basic OWL model, which was extracted manually from the analysis of\nAGROVOC schema, using the results of the Soergel et al.’s work; and they point out as future work the\nconversion of the AGROVOC content into ontology instances. They plan to develop a Web based tool\nfor maintaining the resultant ontology.\nThe method produces one ontology. The generated ontology components are classes, attributes,\nand relations and they are expressed in OWL DL.\n2.3.2\nMethods Centered in the Non-ontological Resource Implementation\nIn this section we present the most relevant methods we have found in the literature related with the re-\nengineering of non-ontological resources centered in their implementation. Research works to transform\ndatabases, XML ﬁles, ﬂat ﬁles and spreadsheet ﬁles into ontologies are commented in this section.\nMethods for Transforming Databases into Ontologies\nThe three main method for transforming databases are presented in [SSV02, BCGP04, Bar07]. Next we\ndescribe them.\n• Stojanovic et al. in [SSV02] present an integrated and semi-automatic approach to generating shared-\nunderstable metadata of data-intensive Web applications.\nThis method is based on mapping the given relational schema into ontologies using a reverse engi-\nneering process. The method deals with any non-ontological resources stored in a database and\ntransforms the database content into instances of an existing ontology (in form of RDF ﬁles) on\ndemand dynamically by applying the generic mapping rules speciﬁed by the authors. A formal spec-\niﬁcation of the conversions between entities of the resource and the ontology is used. This method\ncreates mapping rules for (1)concepts, (2)inheritance, and (3) relations. The method contem-\nplates syntactic transformation aspects and how symbols are structured in the database and ontol-\nogy formats. It also contemplates semantic transformation aspects and semantic interpretation of\n26http://www.fao.org\n",
  "speaker": "SYSTEM",
  "uuid": "8579b1d7-be06-4cfc-a454-62e5d17294b5"
}