{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 4\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97729\nevaluación de las memorias anuales que deberán presentar los beneficiarios como \nacciones de seguimiento.\nDel período máximo de disfrute de la beca y, en su caso, de contrato, se descontarán \nlos períodos en que se haya disfrutado de otras becas o ayudas equivalentes en su objeto, \nsu similar cuantía, proceso de selección o naturaleza. El establecimiento de la equivalencia \nde ayudas anteriores disfrutadas, será propuesto por el órgano instructor a la Dirección \nGeneral de Política Universitaria quien resolverá previa audiencia del interesado.\nEn los supuestos de baja por incapacidad temporal (enfermedad o accidente), riesgo \ndurante el embarazo y descanso por maternidad o paternidad, los períodos interrumpirán \nel computo en las condiciones señaladas en el artículo 14.7 y el artículo 15.2 de esta \nconvocatoria.\n2.  Las ayudas se estructuran en dos períodos diferenciados, el primero en régimen \nde beca y el segundo de contrato en prácticas, de conformidad con lo dispuesto en el \nartículo 4.1 y el art.8.1 ambos del Real Decreto 63/2006, por el que se aprueba el Estatuto \ndel personal investigador en formación.\na)  En el primer período, con una duración de 24 meses, la ayuda será en régimen de \nbeca y durante el mismo deberá obtener el Diploma de Estudios Avanzados (DEA) en el \ncaso de los programas de doctorado regulados por el Real Decreto 778/1998. En el caso \nde estudios regulados por el Real Decreto 56/2005, durante el primer año de este período \ndeberán superarse los 60 créditos u obtener el título de Máster en el programa oficial de \nposgrado que incluya el máster y doctorado. En el caso de los estudios de doctorado \niniciados por la ordenación de las enseñanzas universitarias oficiales del Real Decreto \n1393/2007, de 29 de octubre, superar las actividades del período formativo al que se \nrefiere al artículo 18 del mismo.\nAunque el beneficiario de la ayuda hubiera obtenido el DEA, documento equivalente o \nel título de Máster con anterioridad a la finalización de los dos primeros años de beca, no \naccederá a la fase de contrato hasta que no haya completado el período de veinticuatro \nmeses de beca, incluidos, en su caso, los períodos de becas anteriores declarados \nequivalentes conforme a lo establecido en el punto 1 de este mismo artículo.\nb)  El segundo período comprenderá como máximo los 24 meses siguientes a la \nfinalización del período de beca. Cuando el beneficiario de la ayuda en período de beca, \ncumpla los requisitos para pasar a contrato en prácticas, el centro de adscripción lo \nformalizará sin que exista interrupción en la actividad, en virtud del cual el beneficiario \nquedará vinculado al centro de adscripción donde desarrolle la tesis doctoral, asumiendo \nambas partes las obligaciones contractuales que del mismo se deriven y que, en todo \ncaso, se adecuarán de la presente convocatoria.\nEn los casos de beneficiarios que les fuera aplicado una reducción del período máximo \nde la ayuda por haber disfrutado de otras becas o ayudas equivalentes, accederán al \nrégimen de contrato en el momento que se cumplan los requisitos establecidos para ello.\nCon carácter excepcional, y siempre que se hayan cumplido los dos años de beca, el \ncentro de adscripción del personal investigador en formación podrá celebrar un contrato \ncon los beneficiarios de las ayudas que no hayan obtenido el DEA o documento equivalente, \nsiempre que su actividad científica sea evaluada positivamente por la Comisión Nacional \nde la Actividad Investigadora, todo ello de conformidad con la Orden CIN/2657/2008, de 18 \nde septiembre.\nc)  A los efectos de lo establecido en el artículo 8 del Estatuto del Personal Investigador \nen Formación, aprobado por Real Decreto 63/2006, de 27 de enero, en relación con el \nartículo 11.1 del texto refundido del Estatuto de los Trabajadores, aprobado por Real Decreto \nLegislativo 1/1995, de 24 de marzo, de conformidad con el apartado 4 del Artículo 20 del \nReal Decreto 1393/2007, se considerará como condición habilitante para el contrato en \nprácticas del personal investigador en formación, el certificado acreditativo del inicio del \nperíodo de investigación que expidan las universidades.\nd)  En los casos de obtención del título de doctor dentro del período de ayuda \nconcedido, podrán continuar con la ayuda hasta completar la fase de beca o de contrato. \ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "859d1665-cf8c-4000-b01d-3bea10f3e3c1"
}