{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Herramientas_y_proyectos_relacionados_con_el_data_provenance \n\nEl “Third Provenance Challenge” se inauguró en Marzo de 2009, para evaluar el OPM de manera práctica. Aún no ha terminado.\nPASOA\nProyecto creado para investigar el concepto de provenance y su uso para el razonamiento acerca de la calidad y precisión de los datos y servicios en el contexto de e-Science. En sus objetivos entra la definición de ejecución y servicio en relación a la divulgación del workflow, la creación de algoritmos que razonen sobre datos provenance, el diseño de un protocolo de cooperación distribuida que genere datos provenance o investigar propiedades de valor añadido que puedan ser deducidas de dichos datos.\nPegasus\nProyecto que explora lo relevante a la gestión de workflows científicos y que trabaja con dominios científicos para soportar sus datos y cálculos distribuidos de una manera eficiente. Una de las herramientas resultante del proyecto, Pegasus WMS (Workflow Management System), se utilizó junto al sistema Wings para responder con éxito a todas las consultas aparecidas en el “First Provenance Challenge”.\nWings\n“Workflow INstance Generation and Selection”: Sistema workflow diseñado para asistir a los científicos a diseñar experimentos.Razona sobre el conjunto de datos y sobre las restricciones de los componentes para crear y validar workflows y generar metadatos para nuevos productos. Se utiliza con Pegasus, que hace las veces de motor de ejecución para workflows distribuidos.\nKepler\nEl proyecto Kepler está dedicado al mantenimiento y soporte de la herramienta de software libre para workflows científicos Kepler. Kepler puede operar sobre datos almacenados en una variedad de formatos amplia, tanto a nivel local como en Internet, y es un entorno efectivo para integrar distintos componentes software. Usando la interfaz gráfica de Kepler, los usuarios simplemente seleccionan y conectan sus componentes y datos para crear un “workflow científico”. El software de Kepler ayuda a los usuarios a compartir y reutilizar sus datos, workflows y componentes desarrollados por la comunidad científica para satisfacer las necesidades comunes.\nPASS\n“Provenance Aware Software Systems”: Se define una nueva clase de sistema de almacenamiento, que soporta la recolección y mantenimiento automático de provenance. PASS recolecta provenance tan pronto como objetos nuevos son creados en el sistema, y mantiene ese provenance al igual que archivos convencionales de meta-datos. Asimismo, el sistema soporta consultas sobre el provenance.\nORCHESTRA\nCentrado en el ámbito científico, sobre todo en el área de bioinformática, en donde existen varias bases de datos “estandarizadas”, con información superpuesta, similar pero no idéntica, que se diferencian por la calidad de sus datos y el público al que van dirigidas. El sistema colaborativo de compartición de datos ORCHESTRA está orientado al soporte del acuerdo de los distintos esquemas, con usuarios que no están de acuerdo entre sí. Para ello cada participante especifica en quien confía, resolviendo los conflictos de manera local.\nProyectos\nProyecto\nDescripción\nResultado\nHerramientas\nThe Provenance Challenge\nMás que un proyecto es un evento que se lleva celebrando desde 2006 debido a la importancia que ha ido cobrando el provenance estos últimos años. Se presentan y se discuten los aspectos comunes y las fiferencias de las distintas propuestas.\nLos modelos de provenance que se han presentado.\nPASOA\n“Provenance Aware Service Oriented Architecture”. Es un proyecto creado para investigar el concepto de provenance y su uso para el razonamiento acerca de la calidad y precisión de los datos y servicios en el contexto de e-Science.\nModelo de provenance, un protocolo de guardado de la información y el desarrollo de una metodología para implementar aplicaciones con provenance.\nLEAD\n“Linked Environments for Atmospheric Discovery”. Almacena datos metereológicos y modelos de predicciones. Además presenta herramientas de análisis y visualización para que cualquiera que quiera averiguar cómo evoluciona el clima pueda acceder interactivamente.\nEl resultado relevante para este proyecto es el desarrollo de la herramienta Karma para el la recolección y almacenamiento de provenance\nKarma\nPegasus\nSe explora lo relevante a la gestión de flujos de ejecución científicos y se trabaja con dominios científicos para soportar sus datos y cálculos distribuidos de una manera eficiente.\nHerramientas como Pegasus WMS(Workflow Management System), un sistema de gestión de flujos de ejecución para la comunidad científica.\nPegasus WMS, Pegasus Mapper, Pegasus GUI, Ensemble Manager, Corral Glidein Service y Metadata Catalog\nKepler\nProyecto creado para ayudar a científicos, analistas y programadores a crear, ejecutar y compratir modelos y análisis de todas las disciplinas científicas mediante la ampliación de los flujos de ejecución en sus aplicaciones.\nLa herramienta Kepler\nKepler\nPASS\n“Provenance Aware Storage Systems”. Se busca que los proyectos que tratan con provenance lo gestionen como un objeto de primera clase, haciendo que tanto la recolección de información como su mantenimiento y consulta se realicen de manera automática.\nHerramienta PASS, que captura el provenance para cualquier programa que se ejecute en Linux 2.4\nPASS\nORCHESTRA\nProyecto centrado en escenarios de compartición de datos, en concreto los científicos y el área de la bioinformática.\nOrchestra System, herramienta que usa la información del provenance sobre quien efectúa una actualización y los pasos seguidos durante la misma para decidir si deberíamos aceptar o rechazar una actualización de un nodo\nOrchestra",
  "speaker": "SYSTEM",
  "uuid": "85b0542b-aab2-4739-8f3d-88e4412e8050"
}