{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ModelosRazonamiento-11-12 \n\nLas clases de teoría se imparten los viernes de 10:00 a 12:00, en la sala 3203. La clase de los miércoles es de tutoría individualizada o en grupo, y se realiza a demanda de los alumnos, simplemente enviando un correo electrónico al profesor correspondiente con anterioridad.\nPresentación de la asignatura\nBLOQUE 1. Razonamiento con taxonomías\n\nReferencias bibliográficas de razonamiento con taxonomías:\nGómez-Pérez A, Fernández-López M, Corcho O.  Ontological Engineering. Springer-Verlag, 2003.\nBaader F, Calvanese D, McGuinness D, Nardi D, Patel-Schneider P. The Description Logic Handbook: Theory, Implementation and Applications. Cambridge University Press, 2003\nClases\n30/09/2011. Introducción a los formalismos de representación de conocimientos (Oscar Corcho).\nTransparencias\n30/09/2011. Introducción a la lógica descriptiva (Oscar Corcho).\nTransparencias\n14/10/2011. Ejercicios de formalización de lógica descriptiva (Oscar Corcho)\nEjercicios\nFichero OWL generado en clase\n21/10/2011 y 28/10/2011. Modularización y depuración en lógica descriptiva (Oscar Corcho)\nTransparencias\nPráctica\nFecha de entrega: final de marzo 2012, aunque se recomienda hacer alguna entrega intermedia.\nDescripción\nOntologías\nVersión de Protégé que contiene la herramienta \"Explanation Workbench\"\nhttp://dl.dropbox.com/u/1406775/4.ISWC2008.zip\nBLOQUE 2. Razonamiento cualitativo\n\nReferencias bilbiográficas\nRazonamiento espacial: Worboys, M.F. and Duckham, M. (2004). GIS: A Computing Perspective, Second Edition, CRC Press, ISBN: 0415283752.\nhttp://worboys.duckham.org/\nMateriales\nIntroducción\nal sistema DynaLearn de razonamiento cualitativo\nEjercicios\nde DynaLearn (I)\nSolución\na los Ejercicios de DynaLearn (I)\nInstalación\nde la versión v0.9.8 de DynaLearn\nEjercicios\nde DynaLearn (II): Communicating Vessels\nPráctica\nLa\nprimera parte\nde la práctica para evaluar este bloque es la realización del ejercicio \"\ncommunicating vessels\n\" en DynaLearn. El objetivo principal del ejercicio es demostrar un conocimiento básico de la herramienta, de sus principales opciones y de los ingredientes básicos de modelado. Fecha de entrega: del 5 al 7 de Diciembre. Una vez realizado el ejercicio, debe enviarse por email a Jorge Gracia (jgracia at fi.upm.es) lo siguiente:\n1. Nombre y apellidos del alumno (el ejercicio se realizará individualmente).\n2. Nombre de los compañeros con los que se colaboró en el análisis inicial del problema durante la clase (si no se hizo individualmente).\n3. Modelo obtenido (*.hgp).\n4. El documento word con la hoja \"Results sheet\" rellena con la evaluación del feedback (si la tabla que aparece en dicha hoja se queda corta se puede copiar y pegar dentro del documento tantas veces como se desee).\nComo\nsegunda parte\nde la práctica se pide hacer el siguiente ejercicio. Inspirándose en cualquiera de los modelos que se han visto en la asignatura (competing processes, agent colonisation, ...), hay que\nimaginar un problema de razonamiento cualitativo\nque pueda ser resuelto por una versión adaptada de dicho modelo. El tema es completamente libre y el problema puede ser de cualquier dominio (ecología, ingeniería, sociedad, física,...). Puede hacerse individualmente o por parejas.  Durante la clase del 13/1/2012 habrá una presentación de cada una de los modelos realizados por parte de sus autores (máximo 10 minutos cada uno). Se valorará: la originalidad del enunciado propuesto, su adecuación como problema de razonamiento cualitativo y el dominio de los ingredientes básicos de modelado (entities, configurations, quantities, quantity spaces, proportionalities, influences, etc.). Fecha de entrega: antes del 10/01/2012 por email al profesor Jorge Gracia. Se entregará:\n1. Descripción: documento de como máximo una página que contenga: título del problema, autor/es de la práctica, un breve enunciado planteando el problema y un breve análisis de las principales características del modelo que habéis hecho para representarlo.\n2. Modelo: fichero del modelo de DynaLearn construido. Se tiene que haber hecho el grounding semántico del mismo (el feedback semántico no).\nClases\n11/11/2011. Introducción al razonamiento cualitativo\n18/11/2011. Introducción a DynaLearn\n25/11/2011. Ejercicios de DynaLearn (I): modelos de razonamiento cualitativo\n02/12/2011. Ejercicios de DynaLearn (II): grounding semántico de modelos\n16/12/2011. Dudas práctica de DynaLearn\n13/01/2012. Presentación de las prácticas. Ejercicios de DynaLearn (III): teachable agent\n20/01/2012. (No habrá clase al ser la última antes de los exámenes)",
  "speaker": "SYSTEM",
  "uuid": "87ad9b80-331b-472f-b3ea-a97cc19535a7"
}