{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/GeoLinkedDataBrowser \n\nContents\n[\nhide\n]\n1\nProject Goals\n2\nData Integration\n3\nUse Case\n4\nREST API\n5\nUI Requirements\n6\nDatasets\n7\nOntologies\n8\nPlanning\n9\nIssues\n10\nPeople Involved\n10.1\nLuis\n10.2\nBoris\n10.3\nAlex\n10.4\nCarlos\n10.5\nJose\n10.6\nConclusions\n10.7\nTODOs\nProject Goals\n\nMap-driven visualization of geographic resources.\nOntology-driven Facet browsing.\nData export in GEO standars (GeoRSS, KML, etc.)\nData Integration\n\nTODO: How will we integrate data from multiple sources?\nUse Case\n\nWe agreed to consider as use case the \"unemployment people in Spain\".\nThe basic idea is to render the information related with \"employment\" for every province in Spain.\n...\nREST API\n\nThe API should permit queries between spatial regions. In this case the signature may be something like this:\ngetResources( LAT, LONG, RAD, FILTERS)\nHowever, this implies that we need spacial reasoning in our RDF query engine. If this is not feasible then we can provide the following API:\ngetResources( FILTERS)\nThis, however, can return the entire database if the FILTER is empty. Therefore, we need some kind of pagination mechanism:\ngetResources(FILTERS, FROM, MAX)\nUI Requirements\n\nUse of Google Maps\nAsynchronous updates by filtering using facets (Similar to\nExhibit\n)\nInitial Draft of the GUI\nDatasets\n\nDatos del paro\n[1]\nOntologies\n\nDemo de la ontología para el dataset del paro\n[2]\nIncluye las instancias de las provincias y trimestres (como vienen en el fichero excel).\nPlanning\n\nThe project includes four main tasks. For every task there are two task leaders.\nT1. GUI (Alexander/Victor/Carlos)\nT2. Datasets / Ontologies (Luis/Boris)\nT2.1 Identification of the datasets\n1.\nhttp://mccarthy.dia.fi.upm.es/challenge/ontologies/paro/Paro.xls\n2.\nhttp://mccarthy.dia.fi.upm.es/challenge/ontologies/poblacion/poblacionprovincia2009.xls\n3.\nhttp://mccarthy.dia.fi.upm.es/challenge/ontologies/poblacionactiva/pcaxis-1297520615.xls\nT2.2 Generation/Creation of the ontologies\n1.\nhttp://mccarthy.dia.fi.upm.es/ontologies/statistical.owl\nT2.3 Generation of the RDF Instances\n1.\nhttp://mccarthy.dia.fi.upm.es/ontologies/spain.owl\n2.\nhttp://mccarthy.dia.fi.upm.es/ontologies/year.owl\n3.\nhttp://mccarthy.dia.fi.upm.es/ontologies/buildingTrade.owl\n4.\nhttp://mccarthy.dia.fi.upm.es/ontologies/industry.owl\n5.\nhttp://mccarthy.dia.fi.upm.es/ontologies/population.owl\n6.\nhttp://mccarthy.dia.fi.upm.es/ontologies/unemployment.owl\nT3. Link to existing datasets in the cloud (Carlos/José/Boris)\nÓscar escribió al responsable de sameAs.org para incluir nuestro dataset.\nSilk - A Linking Framework for the Web of Data (\nhttp://www4.wiwiss.fu-berlin.de/bizer/silk/\n) podria servirnos para enlazar internamente los diferentes datasets del IGN, si se da el caso de ser necesario.\nT4. Modelado de la Geometria (Victor/Alex/Luis/Boris)\nT5. Paper (Jean-Paul?/Freddy?/Boris/Todos)\nhttp://dl.dropbox.com/u/2197609/isemantics.zip\nIssues\n\nData for Playas have invalid lat long values. Their literal values are asserted as having datatype xsd:string when it should be xsd:decimal\nPeople Involved\n\nLuis\n\nHe enviado información estadística a Boris, para que comience a generar el RDF\nHe enviado a la lista dos URL de interés para pintar los recursos en mapas\nEstoy tratando de conseguir información del IGN\nPara el owl:sameAs hay que revisar esta web\nhttp://sameas.org/\ny buscar si hay alguna API que podamos utilizar. Tenemos el contacto del responsable para cualquier cosa.\nBoris\n\nLuis me ha mandado unos ficheros excel con la información del paro por comunidades autonomas/provincias. Los ficheros serviran para generar RDF instances. Tendremos que hacer una onto light a mano.\nLuis también sugiere que consideremos la presentación del timeline de los datos.\nAlex\n\nCompleted first version of the Web Application:\nhttp://geo.linkeddata.es:8181/GeoLinkedDataBrowser/\nFor now, only up to 500 resources are shown on the map. This need to limited by the geographic area shown on the map.\nFor this we need to model the data using:\nhttp://www.w3.org/2003/01/geo/\nThe following can be used for converting between coordinate systems:\nhttp://docs.codehaus.org/display/GEOTDOC/Coordinate+Transformation+Services+for+Geotools+2.0\nUsing this vocabulary then we can perform SPARQL on which we can say give me all resources between 1Km radius of the center of the map.\nThe visible area of the map is not as easy to calculate. Equation related to the Mercator projection used by Google and their pixel-based scaling.\nWe need to do a serious review of the data model/ontology\nI have some ideas as to how to implement the facet browsing features, but I would prefer to wait and discuss this in the next meeting.\nCarlos\n\nFaceted browsing\nFaceted browsing clasifies into categories the data to be visualised. So it is mainly oriented to visualize large amounts of data. Some history,\nFlamenco projecy\n(nice demo about Nobel price winners),\nLongwell\n,\nExhibit\nfrom MIT. Longwell seems easy to install and to use, but it fits all the screen. I guess that this is easily configurable. To paint the hierarchy in a side of the browser screen should be relatively easy. Alex working on that.\nI've also been looking at examples of how to visualise government data such as\ndata.gov\n. They have many examples of how to vusliase statistical data, using charts, maps, or just text. It has many tutorials like how to use Google visualizarion API to create charts (\nhttp://data-gov.tw.rpi.edu/wiki/How_to_render_SPARQL_results_using_Google_Visualization_API\n). Another useful website is\nJenni Tennison's blog\nwho works in data.gov.uk.\nSome demos\nhttp://data-gov.tw.rpi.edu/wiki/Demo:_State_Gross_Income_Versus_Medicare_Claims_%282007%29\nhttp://data-gov.tw.rpi.edu/wiki/Demo:_Comparing_US-USAID_and_UK-DFID_Global_Foreign_Aid\nAs a conclusion I would suggest to focus on drawing some maps (since everything is based on geographical data) and from there add some charts, small facet browsing connecting to other data resources, providing something useful. If we focus in INE data (which as Boris said is possible to convert to RDF) it would be a good demo, such as combining turism with non working people data, and maybe using some queries to DBPedia, using query rewritting or any other resource in facets which would show additional information. Basically like\nhttp://linkedgeodata.org/About\nJose\n\nResultados\nde la evaluación ralizada con REQUIEM sobre la ontología\nhydrOntology_tildes\n:\nClausulas con una expresividad no recogida por REQUIEM: 37%\nClausulas usadas para la inferencia: 63%\nClausulas inferidas: 19%\nSe aprecia la conveniencia de la explicitación de la inferencia realizada con un razonador más potente. La eficiencia disminuiría en memoria pero no en tiempo. Para una evaluación más directa con respecto de los resultados que puede esperar un usuario sería conveniente una muestra de las consultas que podría realizar.\nEn\nabredatos\nse mencionan tres meta-repositorios de fuentes principales,\naporta\n,\ninternet invisible\ny\njottit\n. En ellos la fuente aparentemente más prometedora en las líneas de datos geográficos y económicos es la\ninformación\ndel ministerio, un\nzip con excel\n.\nResultado\nde la búsqueda de ontologías para enlazar con las existentes.\nConclusions\n\nI think we should build something based on the INE data as soon as we can. First thing is to have the data in RDF -> to build a lightweight ontology and then to import the data. Boris, can you do this? then, create the visualisation, based on the map drawed by Alex and using query rewriting in the ontology and adding other queries to other linked data sources. Victor said that the Sem Web API was not that useful. Right now I'd discard sameas.org because none our data URIs is in its index, so if we query for sameas\nhttp://oeg.dia.fi.upm.es/Madrid\nwe get nothing.\nBoris: I can create a basic model (ontology) and generate one dataset in RDF.\nAlex: Visualization\nAlternatives for sameas.org?\nTODOs",
  "speaker": "SYSTEM",
  "uuid": "88cf3d78-80b9-440a-80e6-2ccfec960608"
}