{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 10\nLa Directiva establece una definición del Documento, acorde con la actual Sociedad\nde la Información. “Considera documento conservado por un organismo del sector públi-\nco todo documento cuya reutilización puede ser autorizada por dicho organismo del sec-\ntor público”8.\nEn su primer capítulo establece el marco de aplicación. La Directiva propone un con-\njunto de normas que “regulen la reutilización y los instrumentos prácticos que faciliten la\nreutilización de los documentos existentes conservados por organismos del sector público\nde los Estados miembros”. En el mismo capítulo se exponen los sectores excluidos por la\nDirectiva: documentos que se inspiran de una actividad que no se enmarca entre las acti-\nvidades del sector público; los documentos con derecho de propiedad intelectual asigna-\ndo; documentos con imposibilidad de acceso, por motivos de “protección de la seguridad\nnacional” del Estado, defensa o seguridad pública, “confidencialidad estadística o comer-\ncial”; los documentos conservados por “las empresas de redifusión de servicio público”;\nlos documentos conservados por instituciones educativas y de investigación; los documen-\ntos conservados por instituciones educativas y de investigación, por instituciones cultura-\nles. En el mismo capítulo, la Directiva establece definiciones para organismo del sector\npúblico, organismo de Derecho público, documento, reutilización y datos personales. \nEn el segundo capítulo se presentan los requisitos para el tratamiento de solicitudes de\nreutilización.\nEn el capítulo III, la Directiva se refiere a las condiciones de reutilización, como: los\nformatos disponibles, los principios de tarificación, transparencia, licencias, dispositivos\nprácticos. \nEl siguiente capítulo habla de no discriminación y prácticas comerciales justas, así\ncomo de la prohibición de acuerdos exclusivos. \nEl último capítulo abarca las disposiciones finales de la Directiva: incorporación al\nDerecho interno, revisión, entrada en vigor y destinatarios. \n2.1. Revisión de la Directiva\nLos Estados miembros tenían que transponer la Directiva hasta el 1 de julio de 2005.\nLa Comisión está supervisando la aplicación de la Directiva en los Estados miembros.\nEl mismo texto de la Directiva incluye un artículo que prevé la revisión de la Directiva\nantes del mes de junio de 2008 y la comunicación de los resultados al Parlamento Europeo\ny al Consejo.\n“En dicha revisión se abordará en particular el ámbito de aplicación y las repercusio-\nnes de la presente Directiva, señalando la medida en que haya aumentado la reutilización\nde documentos del sector público, los efectos de los principios de tarifación aplicados y de\nla reutilización de textos oficiales de carácter legislativo y administrativo, así como otras\nformas de mejorar el correcto funcionamiento del mercado interior y el desarrollo de la\nindustria europea de contenidos”9. \nEl programa eContent, a través de su red temática europea, ePSIplus (creado especial-\nmente por la Comisión Europea para apoyar y supervisar del proceso de implantación de\nMETODOLOGÍA DE TRABAJO Y ANÁLISIS GENERAL DE LA REUTILIZACIÓN DE INFORMACIÓN…\n14\n8 Directiva 2003/98/CE del Parlamento Europeo y del Consejo, de 17 de noviembre de 2003, relativa a la reutiliza-\nción de la información del sector público / Diario Oficial N.º L 345 de 31/12/2003, p. 0090–0096. En: http://eur-\nlex.europa.eu/LexUriServ/LexUriServ.do?uri=CELEX: 32003L0098:ES:HTML (última consulta: 04.07.08).\n9 Ídem.\nBASES DE DATOS  1/1/04  03:39  Página 14\n",
  "speaker": "SYSTEM",
  "uuid": "88f7f05e-3ec7-467b-b7d8-c0b329b60141"
}