{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Propuestas \n\nContents\n[\nhide\n]\n1\nPropuestas\n2\nPresupuesto\n3\nCurriculum\n3.1\nDescripción UPM\n3.2\nDescripción OEG\n3.3\nShort CVs\n4\nDescripciones en Español\n4.1\nDescripcion del Grupo para los Avanza\n4.2\nCVs formato cicyt\n4.3\nShort CVs\n5\nDocumentación\nPropuestas\n\nPropuestas-Cenits-Avanzas\nIBM-Software\nTIN2014\nTIN2017\nPresupuesto\n\nPara hacer los presupuestos hay que tener en cuenta varias cosas:\nModelo de costes:\nActual Inderect Cost'\nEsto quiere decir que la EC Contribution es: (a confirmar por Ana)\n- Investigación: 75% sobre total\n- Gestión: 100% sobre total\n- Demostración: 50% sobre total\n- Coordinación: 100% costes directos + 7% de indirectos sobre (directos-subcontratación)\n- Otros: 100% sobre total\nPersonal:\nContrato\nCoste anual (12 PM)\nSuper A1\n52.442,35€\nA1\n44.624,17€\nA2\n41.118,30€\nFichero para calcular coste según personalización de sueldos A1 y A2\nOverheads:\n71,13%\n(sobre el presupuesto de Personal de la Fac. Informática)\nSubcontratación:\nAuditorías\n(en Gestión)\nConsumibles:\nTóner, papel, material de oficina, encuadernaciones, ratones, etc.\nOtros gastos:\nSeguros de viaje, organización local de reuniones, etc.\nCostes de personal para propuestas (Asun 2-1-2012):\nLos costes de rtd son de 5000 euros\nLos costes de gestion son de 4000 euros\nViajes:\n9K euros en el proyecto para meetings por 36PM:  minimo de 3000 euros por persona al año para meetings de research.\n3K euros en el proyecto para meetings para review por cada 36PM\n5K euros en el proyecto para asistir a conferencias, por cada 36PM\nEquipos\nIntentad sacar 6K euros para servidores\nAuditoria\n2K euros por cada multiplo de 370K euros si dura tres años\n2,5k euros por cada multiplo de 370K euros si dura 4 años\nPara proyectos superiores a 740K euros, poned 5k euros de auditoria\nCurriculum\n\nCurricula\nde los miembros del grupo.\nDatos útiles de\nPDI\n.\nDescripción UPM\n\nUPM: Universidad Politécnica de Madrid, Facultad de Informática, Madrid, Spain\nThe Universidad Politécnica de Madrid (UPM) is the oldest and largest of the Spanish Technical Universities and covers most Engineering disciplines. UPM has a strong commitment to R&D and Innovation, with more than 200 Research Groups and several Research Institutes and Technological Centres in different knowledge areas. The Ontology Engineering Group (OEG, www.oeg-upm.net), led by Prof. Asunción Gómez-Pérez, has been working on the provision of semantic infrastructure since 1995, and is currently composed of researchers from different fields: Ontological Engineering, Data Integration, Semantic Web, Semantic Grid and Computational Linguistic. Some of the most important results of the OEG group in the previous areas are: Methontology and the NeOn methodologies, WebODE and Oyster (in Ontological Engineering), Linguistic Information Repository model, LabelTranslator for localizing ontologies (in Computational Linguistic); R2O, ODEMapster and EgoIR (in semantic-based data integration); ODESeW and ODESWS (in Semantic Web); and WS-DAIOnt-RDF(S) and ODESGS (in Semantic Grid). Besides, it has participated or is participating in the following EU IST projects: MKBEEM, OntoWeb, Esperonto, OntoGrid as coordinator, NeOn, SEEMP, Knowledge Web, ADMIRE, DynaLearn, SemSorGrid4Env as coordinator, SEALS as coordinator, and MONNET.\nLogo UPM vectorial:\nfile\nDescripción OEG\n\nThe Ontology Engineering Group, established in 1995, carries out research in the areas of Ontological Engineering, Natural Language Processing, Semantic Web, Semantic e-Science and the Real World Internet. It is ranked third in the official UPM ranking of research groups, with an average of three Ph.D. theses and five M.Sc. theses read every year. The group maintains active contact with a large number of international institutions, including groups from top-ranked universities and research centres (e.g. Stanford University, University of Edinburgh, Oxford University, University of Manchester, UK National e-Science Centre, Open University, Universitat Karlsruhe, DERI). Furthermore, group members frequently visit these institutions for research stays.\nSome of the most important achievements obtained by the group are Methontology and  the  NeOn Methodology, methodologies for creating ontologies on ontology networks;  the latter is  based on a set of scenarios that include the collaborative development of the ontology, the reuse of ontological and non ontological resources, and the development and maintenance of the ontology network; it also contains WebODE and NeOn Toolkit (tools for ontology development), ODESeW ( an ontology-based application that automatically generates and manages knowledge-based portals), R2O, NOR2O and SPARQL-STR (mapping and query languages for transforming relational Databases, spreadsheets and sensor network data in RDF and Linked Data), and GeoLinkedData.es (the official Linked Data resource for the Spanish cartography). Finally, the group has developed applications in a wide range of areas, such as knowledge management, electronic commerce, finance job search, geo-location, project management, R&D and media library management.\nText‎\nShort CVs",
  "speaker": "SYSTEM",
  "uuid": "8983bca3-8a12-441b-a87c-1bf4e644fc08"
}