{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 3\nYou see again and again, that it is more than one thing from a good person. Once in a while a person does\nonly one thing in his whole life, and we'll talk about that later, but a lot of times there is repetition. I claim\n\u000e\nthat luck will not cover everything. And I will cite Pasteur who said, ``Luck favors the prepared mind.''\n\f\nAnd I think that says it the way I believe it. There is indeed an element of luck, and no, there isn't. The\n\u0004\nprepared mind sooner or later finds something important and does it. So yes, it is luck. The particular thing\n\u000f\nyou do is luck, but that you do something is not.\n!\nFor example, when I came to Bell Labs, I shared an office for a while with Shannon. At the same time he\nwas doing information theory, I was doing coding theory. It is suspicious that the two of us did it at the\n\nsame place and at the same time - it was in the atmosphere. And you can say, ``Yes, it was luck.'' On the\n\u0006\nother hand you can say, ``But why of all the people in Bell Labs then were those the two who did it?'' Yes,\n\u000e\nit is partly luck, and partly it is the prepared mind; but `partly' is the other thing I'm going to talk about. So,\n\u001e\nalthough I'll come back several more times to luck, I want to dispose of this matter of luck as being the sole\n\t\ncriterion whether you do great work or not. I claim you have some, but not total, control over it. And I will\n\u0007\nquote, finally, Newton on the matter. Newton said, ``If others would think as hard as I did, then they would\n\u0010\nget similar results.''\n\u0017\nOne of the characteristics you see, and many people have it including great scientists, is that usually when\n\u001c\nthey were young they had independent thoughts and had the courage to pursue them. For example, Einstein,\n\f\nsomewhere around 12 or 14, asked himself the question, ``What would a light wave look like if I went with\n\u0006\nthe velocity of light to look at it?'' Now he knew that electromagnetic theory says you cannot have a\n\f\nstationary local maximum. But if he moved along with the velocity of light, he would see a local maximum.\n\u0006\nHe could see a contradiction at the age of 12, 14, or somewhere around there, that everything was not right\nand that the velocity of light had something peculiar. Is it luck that he finally created special relativity?\n\t\nEarly on, he had laid down some of the pieces by thinking of the fragments. Now that's the necessary but\n\"\nnot sufficient condition. All of these items I will talk about are both luck and not luck.\nHow about having lots of `brains?' It sounds good. Most of you in this room probably have more than\nenough brains to do first-class work. But great work is something else than mere brains. Brains are\n\b\nmeasured in various ways. In mathematics, theoretical physics, astrophysics, typically brains correlates to a\n\u0014\ngreat extent with the ability to manipulate symbols. And so the typical IQ test is apt to score them fairly\n\u0017\nhigh. On the other hand, in other fields it is something different. For example, Bill \n\u001a\nPfann, the fellow who\n#\ndid zone melting, came into my office one day. He had this idea dimly in his mind about what he wanted\n \nand he had some equations. It was pretty clear to me that this man didn't know much mathematics and he\n\t\nwasn't really articulate. His problem seemed interesting so I took it home and did a little work. I finally\n\nshowed him how to run computers so he could compute his own answers. I gave him the power to compute.\n\u0006\nHe went ahead, with negligible recognition from his own department, but ultimately he has collected all the\n\r\nprizes in the field. Once he got well started, his shyness, his awkwardness, his inarticulateness, fell away\n\u000f\nand he became much more productive in many other ways. Certainly he became much more articulate.\n\t\nAnd I can cite another person in the same way. I trust he isn't in the audience, i.e. a fellow named Clogston.\n\u0012\nI met him when I was working on a problem with John Pierce's group and I didn't think he had much. I\nasked my friends who had been with him at school, ``Was he like that in graduate school?'' ``Yes,'' they\n\t\nreplied. Well I would have fired the fellow, but J. R. Pierce was smart and kept him on. \n\u0018\nClogston finally did\n\u0012\nthe \n\f\nClogston cable. After that there was a steady stream of good ideas. One success brought him confidence\n\u0012\nand courage.\n\t\nOne of the characteristics of successful scientists is having courage. Once you get your courage up and\n\u001c\nbelieve that you can do important problems, then you can. If you think you can't, almost surely you are not\n\u001d\ngoing to. Courage is one of the things that Shannon had supremely. You have only to think of his major\n\u0017\ntheorem. He wants to create a method of coding, but he doesn't know what to do so he makes a random\n\f\ncode. Then he is stuck. And then he asks the impossible question, ``What would the average random code\n\u0007\ndo?'' He then proves that the average code is arbitrarily good, and that therefore there must be at least one\n \ngood code. Who but a man of infinite courage could have dared to think those thoughts? That is the\n\u0017\ncharacteristic of great scientists; they have courage. They will go forward under incredible circumstances;\n\u0007\nthey think and continue to think.\n\f\nAge is another factor which the physicists particularly worry about. They always are saying that you have\ngot to do it when you are young or you will never do it. Einstein did things very early, and all the quantum\n\u0017\n",
  "speaker": "SYSTEM",
  "uuid": "8a0e2c58-ad11-45be-b8f6-64518facc8f7"
}