{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 101\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 101 of 111 \nresources and vocabularies are taking into account in the Semantic Nomenclature case study as \nsource of knowledge of the domain [31].  \nThe main scenario in the Semantic Nomenclature case study is to create the Nomenclature \nontology network. The preliminary Semantic Nomenclature workplan for developing the \nNomenclature ontology network is the following:  \n First, to model and built the ontologies related to the main pharmaceutical databases of the \ncase study (Digitalis, Integra, BOTPlus) and then, to populate them.  \n From this point on, the following step planned was to model a reference ontology based in the \nprevious ones.  \n Finally, these ontologies were connected via mappings and provided with means for adding \nnew domain-related ontologies to the network. \nHowever, after holding several bi-lateral ad-hoc meetings between ATOS and UPM, the ATOS \nteam agreed to modify the initial workplan for developing the ontology network in the Nomenclature \nuse case; the modified plan is shown in this section. During such meetings, the ATOS team \nexplained the Nomenclature use case whereas the UPM team described the methodological \nguidelines carried out in WP5.  \n6.3.2. Selected ontology network life cycle model \nOne of the first tasks the ATOS team carried out to obtain the Nomenclature ontology network life \ncycle was to identify which type of ontology network life cycle model was the most appropriate for \nthe Semantic Nomenclature case study. Such identification was done by following the guidelines \nand suggestions being developed in WP5 and included in this deliverable (Section 5.3).  \nAfter studying and identifying the different requirements and restrictions of the ontology network \ndevelopment, reviewing the possible ontology network life cycle models and taking into \nconsideration the past experiences of the ATOS team, the model selected was the incremental \nontology network life cycle model, following a seven phase waterfall model.  \nThe reason behind this decision was that the pharmaceutical scene is more or less static in their \nmodels and that the pharmaceutical sector has a low frequency of change in knowledge level (not \nin data level); therefore, the ATOS team deduced that nobody has planned to make changes in the \nontology network requirements. Other main reason that motivated this decision was that there was \nalready a plan to produce different versions of the ontology network and of the corresponding \nsemantic application in the near future.  \n6.3.3. Selected activities  \nBased on the guidelines and suggestions provided in WP5 (see Section 5.3) and on the ATOS \nteam experience (some members of the team have developed more than 5 ontologies), the ATOS \nteam selected directly the activities to be carried out during the ontology network life cycle from the \n“Required-if Applicable” table.   \nActivities identified as “required” in the “Required-if Applicable” table (table 3 in Section 3.3) are \nselected automatically in the table whereas the ATOS team only selected those “if applicable” \nactivities needed for the development of the Nomenclature ontology network. So, Table 7 shows \nonly those “if applicable” activities selected by the ATOS team. \nTable 7. Selected “If Applicable” Activities in the Nomenclature Use Case \n \nIf Applicable \nSelected \nOntology Aligning \nX \nX \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "8a6afcd5-8b35-453a-a710-dbe224b93ec3"
}