{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 66\nPage 66 of 111 \nNeOn Integrated Project EU-IST-027595 \n4.2. Scenario 2: Building Ontology Networks by Reusing Non Ontological Resources \n Assumptions: In this scenario it is supposed that software developers and ontology \npractitioners “want” to develop the ontology network by means of reusing existing non \nontological resources (i.e., thesauri, glossaries, etc). \n Prerequisite resources: Knowledge of the domain (general or specific) of the ontology \nnetwork to be developed should be available for the building of the ontology network. \nAdditionally, non ontological resources, related to the domain that the ontology network must \ncover, should be made available.  \n Sequence of activities: Currently, software developers and ontology practitioners are often \nconsidering reusing existing non ontological resources (e.g., thesauri, glossaries, data bases, \netc.) for speeding up the ontology building process. The non ontological resource reuse \nactivity, as defined in the NeOn Glossary of Activities (Section 3.2), refers to the activity that \ntakes available non ontological resources (data bases, controlled vocabularies, etc.) for the \ndevelopment of ontologies. Being ontologies the key element in ontology engineering, we treat \nthe reuse of ontologies as a different activity. \nAs Figure 20 shows (by arrows with number 2), in this scenario software developers and \nontology practitioners should carry out the non ontological resource reuse activity; in this \nactivity they should analyse whether existing resources (thesauri, glossaries, data bases, etc.) \ncan be reused to build the ontology network or not. If software developers and ontology \npractitioners decide that one or more non ontological resources are useful for the ontology \nnetwork development, then the non ontological resource reengineering activity should be \ncarried out.  \nNon ontological resource reengineering is defined in the NeOn Glossary of Activities (Section \n3.2) as the process of retrieving and transforming an existing non ontological resource (data \nbases, controlled vocabularies, etc.) into an ontology. In this scenario, the idea is to transform a \nnon ontological resource into an ontology that could be reused in the ontology network being \ndeveloped. Being ontologies the key element in ontology engineering, we treat the \nreengineering of ontologies as a different activity. \nAfter carrying out the non ontological resource reengineering activity, software developers and \nontology practitioners should use the output of such activity as input of some of the activities \nincluded in scenario 1 (explained in Section 4.1) as shown in Figure 20.  \n Outcomes: The principal output is an ontology network that represents the expected domain \nimplemented in an ontology language (OWL, F-Logic, etc.). Furthermore, a broad range of \ndocuments containing the requirements specification, the ontology documentation, the ontology \nevaluation, etc. will be generated as output of different activities. \nAdditionally, the non ontological resources selected to be reused have been “ontologized”, by \nmeans of the non ontological resource reengineering activity. \n4.3. Scenario 3: Building Ontology Networks by Reusing Ontologies or Ontology \nModules \n Assumptions: In this scenario it is supposed that software developers and ontology \npractitioners “want” to use existing ontologies in the same or similar domain than that of the \nontology network to be developed for building the ontology network. The existing ontologies \nmay have been developed by themselves or by others. \n Prerequisite resources: Knowledge of the domain (general or specific) of the ontology \nnetwork to be developed should be available for building the ontology network. \n \n",
  "speaker": "SYSTEM",
  "uuid": "8b52991d-c276-46e7-8182-5dbb6c973465"
}