{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 17\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 17 de 42 \n \nTítulo del proyecto: BuscaMedia: Hacia una Adaptación Semántica de Medios Digitales Multirred-\nMultiterminal (CEN-20091026) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio. Programa CENIT \nEntidades participantes: ATOS Origin, Activa Multimedia, GFI, Indra, CCMA, Bilbomática, Fractalia, \nBMAT, ISID, iSOCO, Daedalus, Universidad Politécnica de Madrid, Universidad Nacional de Educación a \nDistancia, Robotiker Tecnalia, Universitat Pompeu Fabra, Universitat Politécnica de Catalunya, \nUniversidad Carlos III de Madrid, Fundació Barcelona Media, Fundación CTIC \nDuración, desde: 01/10/2009  hasta: 31/12/2012 \nInvestigador responsable por la UPM: Óscar Corcho García \n \nTítulo del proyecto: INTERACTIVEX: Human Computer Interaction Models for Interactive Exploration of \nBehavior Datasets (PIOF-GA-2009-253331) \nEntidad financiadora: Unión Europea \nEntidades participantes: UPM \nDuración, desde: \n02/08/2010 \nhasta: 01/08/2012 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \nCoordinador del proyecto: Asunción Gómez Pérez \nTítulo del proyecto: MONNET: Multilingual Ontologies for Networked Knowledge (FP7-248458) \nEntidad financiadora: Unión Europea \nEntidades participantes: National University of Ireland (Galway), Deutsches Forschungszentrum für \nKünstliche Intelligenz GmbH, Technische Universiteit Delft, Universidad Politécnica de Madrid, SAP AG, \nXBRL Europe, Be Informed, Universität Bielefeld \nDuración, desde: \n01/03/2010 \nhasta: 28/02/2013 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: SCALUS (FP7-238808) \nEntidad financiadora: Unión Europea \nEntidades participantes: University of Paderborn, Barcelona Supercomputing Center, Durham \nUniversity, Ruprecht-Karls-Universitat Heidelberg, Foundation for Research and Technology, Universidad \nPolit´ecnica de Madrid, Ecoles des Mines, INRIA, XLAB Research, NEC Deutschland GmBH, CERN, \nMicrosoft Research Ltd., Fujitsu Siemens Computers, Sun Microsystems. \nDuración, desde: \n01/12/2009 \nhasta: 30/11/2013 \nInvestigador responsable por la UPM: María de los Santos Pérez \n \nTítulo del proyecto: Ayuda para apoyar las líneas de I+D en el programa de creación y consolidación de \nGrupos de Investigación de la UPM \nEntidad financiadora: Universidad Politécnica de Madrid \nEntidades participantes: Universidad Politécnica de Madrid \nDuración, desde: 01-10-2009 hasta: 01-09-2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: Autores 3.0 Registro de Propiedad Intelectual Online con Tecnología Semántica \n(TSI-020110-2009-17) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio \nEntidades participantes: Safe Creative, S.L., Fundación Dialnet, Universidad Politécnica de Madrid \nDuración, desde: 1/06/2009 \n \nhasta: 31/12/2010 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n \nTítulo del proyecto: Nuevos Componentes para el Desarrollo de una nueva Web en la Internet del \nFuturo (WEBn+1)  (TSI-020301-2009-24) \nEntidad financiadora: Ministerio de Industria, Turismo y Comercio \nEntidades participantes: Intelligent Software Components, S.A. Atos Origin Sociedad An´nima \nEspañola, INDRA Sistemas, S.A., Telefónica Investigación y Desarrollo S.A.U., PRISACOM, S.A., \nVILAUMEDIA, S.L., EXENTE SPAIN, S.L:, ASOCIACIÓN CENTRO DE TECNOLOGÍAS DE \nINTERACCIÓN VISUAL Y COMUNICACIONES-VICOMTECH, FUNDACION ROBOTIKER,  Universidad \nPolitécnica de Madrid \nDuración, desde: 1/04/2009 \n \nhasta: 31/12/2011 \nInvestigador responsable por la UPM: Asunción Gómez Pérez \n",
  "speaker": "SYSTEM",
  "uuid": "8cf01746-bffd-4316-b5d0-ecc6dbd4024c"
}