{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 3\nSemantically enhanced UPnP Networks for Multimedia Home Sharing\n3\nis not only based on the navigational structure of these devices, but also on tags\nand ontology-based metadata that can be associated to these resources. In our\nextension, metadata plays a key role, following metadata management principles\nproposed in advanced metadata management architectures, and ontology-based\nannotations are linked to the Web of Linked-Data4 in order to provide additional\nlinks to the Linked Data cloud and to exploit existing information as much as\npossible.\nWe have developed a system that manages these extensions in a distributed\nmanner, as well as a Web-based Control Point that extends the functionalities of\ncommon UPnP Control Points, allowing annotation and ontology-based search.\nCurrently, the system is deployed in Telefónica R&D's Home Environment Lab5.\nIn the following sections we describe the system architecture (section 2), a\ndetailed description of the UPnP extensions developed (section 3), the mecha-\nnisms to provide a unique URI to shared resourced is described in section 4, and\nthe facilities provided by the UpGrid Control Point (section 5). Section 6 shows\na user evaluation carried out in order to test the usability and user satisfaction\nwith the UpGrid Control Point. Finally, conclusions and further work can be\nfound in section 7.\n2\nSystem Architecture\nIn order to cope with all the requirements described in the Introduction, we\nhave designed the architecture depicted in Fig. 1. It contains a set of distributed\ncomponents (located in each home) and a set of centralized components, which\nare deployed by the network provider.\nThe distributed components can be divided into two groups: those deployed\nin the Home Gateway and those that are common in UPnP-based environments,\nand provide support for the di\u001berent UPnP-enabled functions.\n\u0015 Home Gateway components. The Home Gateway (also known as residential\ngateway) is the networking device that is used as a gateway to connect\ndevices in the home to the Internet or to other WAN. Inside the Home\nGateway we need to install the following additional components:\n• Metadata Server: It stores ontology-based annotations created by users\nfrom the home where the server is deployed (i.e. local users, although they\ncan refer to local or remote multimedia resources). As it will be described\nlater in section 5, this component follows the S-OGSA architecture for\nmetadata management [6] and will allow ontology-based searches over\nthe whole set of ontology-based metadata available in the participating\nsystems (as long as the authorization restrictions allow access to it).\n• IMS User Agent (IMS UA). It establishes IMS remote sessions between\nhomes and updates the home presence status, using the functions pro-\nvided by a centralized IMS Enabler.\n4 See http://linkeddata.org/\n5 Further tests are currently being performed and as a result we expect the system to\ngo into large-scale production soon.\n",
  "speaker": "SYSTEM",
  "uuid": "8d7c6c51-138b-42ee-a877-18f48aecbaff"
}