{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 19\n1 The Return of the Entity-Relationship Model: Ontological Query Answering\n19\nis equal to idn. Since, by induction hypothesis, hk−1(µ(b)) ∈chase(D,ΣT), we\nget that hk−1(µ(c)) ∈chase(D,ΣT). Finally, suppose that c is such that pred(c) ∈\nfe(R) ∪fae(R) ∪far(R). It is clear that c is obtained starting from some atom\nd ∈chase[k−1](D,Σ) such that pred(d) ∈fr(R) and dom(d) = {c1,c′\n2,...,c′\nn}.\nSince hk−1(µ(d)) ∈chase(D,ΣT), then hk−1(µ(c)) ∈chase(D,ΣT), as needed.\nThe desired homomorphism from chase(D,Σ) to chase(D,ΣT) is eventually h =\nS∞\nk=0 hk.\nBy using Lemma 1.1, it is easy to establish separability of non-conﬂicting CDs.\nTheorem 1.2. Consider a set Σ of CDs over a schema R. If Σ is non-conﬂicting,\nthen it is separable.\nProof. Let Σ = ΣT ∪ΣK, where ΣT are TGDs and ΣK are KDs, and let D be\na database for R. Suppose that chase(D,Σ) does not fail (otherwise the claim\nholds trivially). By Lemma 1.1, we get that there exists a homomorphism that\nmaps chase(D,Σ) to chase(D,ΣT). Moreover, since chase(D,ΣT) is a universal\nmodel of D with respect to ΣT, and chase(D,Σ) ∈mods(D,ΣT), there exists a ho-\nmomorphism that maps chase(D,ΣT) to chase(D,Σ). Therefore, chase(D,Σ) and\nchase(D,ΣT) are homomorphically equivalent, which implies that for each CQ q\nover R, q(chase(D,Σ) = q(chase(D,ΣT)). The claim follows by Theorem 1.1.\nInterestingly, for CDs the property of being non-conﬂicting, it is not only sufﬁ-\ncient for separability, but it is also necessary. This way we precisely characterize the\nclass of separable CDs by means of a graph-based syntactic condition.\nTheorem 1.3. Consider a set Σ of CDs over a schema R. If Σ is not non-conﬂicting,\nthen it is not separable.\nProof. Let Σ = ΣT ∪ΣK, where ΣT are TGDs and ΣK are KDs. We prove this result\nby exhibiting a database D such that chase(D,Σ) does not fail, and show that there\nexists a Boolean CQ q such that ⟨⟩∈ans(q,D,Σ) but ⟨⟩/∈ans(q,D,ΣT). Let G be\nthe CD-graph for R and Σ. We proceed by considering the following two cases.\nSuppose that the ﬁrst condition of the Deﬁnition 1.4 is violated. Thus, there exists\na path v↷\n1 v↷\n2 ...↷vm, for m ⩾2, in G as in the Deﬁnition 1.4 for which the following\nholds. Let v1 = e1[1] and vi = ri[ji], for each i ∈{2,...,m}. Assume that rm is a\npredicate of arity n. There exists a cycle C of only r-nodes in G going through rm[jm]\nsuch that πG(C) ̸= idn. Consider the database D = {e1(c)}. The arc e1[1]↷r2[j2] is\nnecessarily labeled by the TGD\ne(X) →∃X1 ...∃Xj2−1∃Xj2+1 ...∃Xn r2(X1,...,Xj2−1,X,Xj2+1,Xn).\nThus, eventually the atom rm(z1,...,zjm−1,c,zjm+1,...,zn) is obtained during\nthe chase, where, for each i ∈{1,..., jm −1, jm + 1,...,n}, zi ∈ΓN. Since\nthe cycle C exists in G, rm(w1,...,w jm−1,c,w jm+1,...,wn) is generated, where\n",
  "speaker": "SYSTEM",
  "uuid": "8dc473be-640d-42f3-9734-4f1d961891fa"
}