{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/20080121NeOnMinutes \n\nLas acciones a tomar están marcadas con\nACCIÓN\nseguido del nombre del responsable. No se incluyen acciones sobre el trabajo diario de cada uno, sólo temas surgidos en la reunión.\nPróxima reunión\n: No decidida la fecha.\nACCIÓN\n: Asun manda un email con la fecha de la próxima reunión\nContents\n[\nhide\n]\n1\nWP 1\n1.1\nOMV consortium and standarization\n1.2\nD1.3.2\n1.3\nT1.4\n2\nWP 2\n2.1\nCollaboration activities\n2.2\nReingeniería\n2.3\nTerm translator\n2.4\nPráctica master LabelTranslator\n2.5\nImplementación del LIR\n2.6\nAnalizar la inclusión de recursos de traducción en los otros lenguajes de la FAO\n2.7\nProbar la instanciación del modelo LIR con los recursos de la FAO (Agrovoc, Wordnet, etc.)\n2.8\nDeliverable D2.4.1 v2\n2.9\nNoticia sobre el LIR en el portal\n2.10\nT2.5 Library of patterns\n2.11\nOntology Engineering pattern description\n2.12\nLinguistic-Syntactic patterns\n3\nWP 3\n3.1\nIntegración con alignment server\n4\nWP4\n4.1\nNuevo IU para el TermTranslator\n5\nWP 5\n5.1\nNiveles de reingeniería\n5.2\nEspecificación\n5.3\nReuse of ontological\n5.4\nReuse of non-ontological\n5.5\nReingeniería\n5.6\nReuse design patterns for building ontologies\n5.7\nHerramienta de los de Galway\n5.8\nRelación entre los NT Plugins, las actividades del glosario y el Semantic Web Framework\n5.9\nSingle vs networked y federated vs centralized\n5.10\nMetodologías desarrollo aplicaciones\n5.11\nExperimentos:\n5.12\nD5.6.1\n6\nWP 6\n6.1\nPlugins:\n6.2\nInterfaz usuario Oyster\n6.3\nOWL DOC\n6.4\nR2O IU\n6.5\nLabelTranslator\n6.6\nOntology pattern matching plugin\n6.7\nSpecification plugin\n6.8\nScheduling plugin\n6.9\nDocumentación online del NT\n6.10\nRecopilar info de tools al technical website\n7\nWP 7\n7.1\nWizard R2O\n7.2\nWorkflow\n8\nWP 10\n8.1\nTraining plan\n8.2\nPortal\n9\nWP 11\n9.1\nGender issues\n9.2\nNoticias:\nWP 1\n\nOMV consortium and standarization\n\nACCIÓN\n: Raúl Palma hace esta semana la release del OMV consortium.\nACCIÓN\n: Raúl Palma comienza la discusión sobre la estandarización para presentar algo en la review.\nD1.3.2\n\nFalta la implementación del propagation model.\nEs para Bled la primera versión y la segunda para el 30.\nT1.4\n\nEl deliverable D1.4.2 está hecho. Falta de una revisión de Raúl Palma.\nRaúl Palma está trabajando en el prototipo Oyster2. Falta probarlo.\nWP 2\n\nCollaboration activities\n\nKlass dijo que lo pensaría y que volverían a hablar.\nReingeniería\n\nPara el mes 30. No se ha progresado.\nTerm translator\n\nEl plugin está listo con la última versión del modelo de datos (de diciembre).\nLa integración esté retrasada porque no hay versión ejecutable del NT con la última versión del modelo de datos.\nEl NeOn Toolkit usa el sistema de licencias del OntoStudio.\nACCIÓN\n: Mauricio manda un email a Asun en inglés con los problemas existentes de los plugins y de la licencia.\nACCIÓN\n: Asun verá si lo manda al EPMB.\nPráctica master LabelTranslator\n\nSe retrasa la práctica 1 semana.\nACCIÓN\n: Lupe informará a los alumnos sobre el retraso en el wiki por problemas técnicos.\nImplementación del LIR\n\nEn progreso.\nSe acordó implementarlo como ontología OWL.\nEn Bled hay que presentar la maqueta del interfaz de usuario.\nAnalizar la inclusión de recursos de traducción en los otros lenguajes de la FAO\n\nACCIÓN\n: Mauricio se lo prepara para hablarlo en Bled.\nProbar la instanciación del modelo LIR con los recursos de la FAO (Agrovoc, Wordnet, etc.)\n\nEsto se postpone porque es más prioritario lo anterior.\nDeliverable D2.4.1 v2\n\nEs para el M30 (agosto 2008). Todo este trabajo de multilingualidad tiene que estar para antes del verano.\nACCIÓN\n: Elena pregunta a Wim qué pasa con la definición de los mappings entre el LIR y los otros estándares\nNoticia sobre el LIR en el portal\n\nElena se la ha enviado a Asun.\nACCIÓN\n: Asun revisa la noticia.\nT2.5 Library of patterns\n\nPendientes de si quieren utilizar Oyster para esto.\nOntology Engineering pattern description\n\nA la espera de comentarios.\nACCIÓN\n: Asun piensa si manda un email a Aldo diciendo que los patrones de Mari Carmen no están en su repositorio.\nLinguistic-Syntactic patterns\n\nA la espera de comentarios. Lupe ya ha hecho a Elena.\nWP 3\n\nIntegración con alignment server\n\nBoris está generando el documento a partir de las fuentes de Barrasa con la ayuda de Charo.\nBoris ya ha empezado con el software.\nTiene que estar para antes de Bled.\nACCIÓN\n: Boris acaba el documento y el software para el 7 de febrero\nWP4\n\nNuevo IU para el TermTranslator\n\nMauricio está haciendo cambios.\nACCIÓN\n: Mauricio manda el IU cuando esté listo a los de la FAO para que comenten.\nWP 5\n\nNiveles de reingeniería\n\nACCIÓN\n: Andrés manda el texto un poco más elaborado y en inglés.\nEspecificación\n\nNo ha habido progreso.\nACCIÓN\n: Mari Carmen tiene algo para el 31 de enero.\nReuse of ontological\n\nACCIÓN\n: Mari Carmen envía lo que tiene a Asun y Marta el miércoles 23.\nReuse of non-ontological\n\nACCIÓN\n: Mari Carmen y Asun hacen comentarios a Boris y Andrés.\nACCIÓN\n: Boris y Andrés tienen algo para el 31 de enero. Hacer que siga el template para describir la propuesta.\nReingeniería\n\nNo ha habido progreso.\nACCIÓN\n: Mari Carmen tiene algo para el 7 de febrero.\nReuse design patterns for building ontologies\n\nEl documento de Elena habla sobre la técnica seguida para identificar patrones, pero no es una metodología ni un método, es el plugin que está haciendo Yufei.\nACCIÓN\n: Elena lo mete haciendo que se parezca más a un método.\nHerramienta de los de Galway\n\nUna opción es invitar a alguien de Galway a que venga un mes para que las cosas no salgan de aquí.\nDarles los patrones es problemático, si al final hacen lo mismo que nosotros pero lo van a tener antes.\nEstán a la espera de una respuesta nuestra.\nACCIÓN\n: Elena y Asun. Analizar la situación.\nRelación entre los NT Plugins, las actividades del glosario y el Semantic Web Framework\n\nNo ha habido progreso.\nACCIÓN\n: Óscar Muñoz lo tiene para finales de enero.\nACCIÓN\n: Asun propone una reunión WP5-WP6 para Bled.\nSingle vs networked y federated vs centralized\n\nEn progreso.\nMetodologías desarrollo aplicaciones\n\nACCIÓN\n: Óscar Muñoz lo tiene para la reunión del 7 de febrero.\nExperimentos:\n\nACCIÓN\n: Mari Carmen manda definición y resultados del de design patterns. Con estadísticas de correlación entre patrones.\nEl resto de experimentos están en progreso.\nD5.6.1\n\nACCIÓN\n: Raúl García manda un email a la lista pidiendo las colaboraciones retrasadas\nACCIÓN\n: Raúl García mete en las conclusiones el experimento de los de iSOCO como trabajo futuro.\nACCIÓN\n: Mari Carmen pregunta a Marta Sabou si quiere ser el QA.\nWP 6\n\nPlugins:\n\nInterfaz usuario Oyster\n\nDavid va a hacer el plugin del nuevo interfaz de usuario para Oyster.\nOWL DOC\n\nNo se sabe el progreso.\nACCIÓN\n: Óscar Muñoz consigue el plugin para hacer la demo en Bled.\nR2O IU\n\nEn progreso.\nLabelTranslator\n\nEn progreso.\nOntology pattern matching plugin\n\nYufei está aquí hasta mediados-finales de marzo.\nACCIÓN: Yufei must have something ready for making a demo with one or two patterns at the Bled Meeting (7th February)\nSpecification plugin\n\nEl próximo que entre, se encarge de esto.\nScheduling plugin\n\nNo se sabe el progreso.\nDocumentación online del NT\n\nEn progreso. Asun ha enviado un email a Michael.\nRecopilar info de tools al technical website\n\nACTION: Óscar Muñoz se lo envía a la chica encargada.\nWP 7\n\nWizard R2O\n\nEn progreso.\nWorkflow\n\nSe dará soporte al workflow con lo que está desarrollando en el WP 1.3.\nACTION: Raúl Palma confirma con los de UKARL que ellos van a desarrollar el interfaz del workflow ad-hoc para el caso de uso.\nWP 10\n\nTraining plan\n\nFalta.\nPortal\n\nBoris sigue supervisando el portal.\nWP 11\n\nGender issues\n\nACTION: Katy hace los cambios pendientes.\nNoticias:\n\nACTION: Mauricio escribe la noticia del TermTranslator y se la envía a Lupe.\nACTION: Elena escribe la noticia del LIR",
  "speaker": "SYSTEM",
  "uuid": "8e74b79a-cf5a-412b-a1e9-6f568b139314"
}