{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Ayudas_para_la_realizaci%C3%B3n_del_Doctorado_(becas_FPU,_FPI,_UPM) \n\nA continuación se recogen los puntos más relevantes de la reunión informativa dirigida al personal Investigador en Formación (PIF) celebrada el 19 de julio de 2012. Como apunte recordar que para las ayudas FPU y FPI\nsiempre rige la última convocatoria publicada\n, no la del año en que se solicitó. Por lo tanto es recomendable leerse bien las últimas convocatorias para estar al tanto de los cambios en la normativa (estancias breves, memorias, etc.).\nContents\n[\nhide\n]\n1\nActividad docente\n2\nDevolución de tasas\n3\nEstancias breves\n3.1\nUPM\n3.2\nFPI\n3.3\nFPU\n4\nMemorias\n4.1\nUPM\n4.2\nFPI\n4.3\nFPU\n5\nAcción social\n6\nCredenciales de las ayudas\n7\nLo que está por venir\nActividad docente\n\nSólo en fase de contrato (excepto para becas FPI que puede darse en fase de beca también, aunque no lo recomiendan)\nEs un derecho, pero no obligatorio (aunque recomendable si se quiere optar posteriormente a plazas de ayudante doctor, contratado, etc.)\n60h anuales\ncomo máximo, entendiéndose año natural y no curso académico\nNo se pueden impartir clases teóricas, pero si de problemas o prácticas. En cualquier caso ha de estar\nel profesor también en el aula\n.\nSe obtiene un\ncertificado de las horas impartidas\n. Importante que estas horas se acepten en el consejo del departamento y que conste en acta.\nImportante: las horas impartidas por el becario\nno computan en la carga docente del departamento\n(aunque sí se le certifican al becario), sólo computan las de los profesores, que además han de estar en el aula.\nLa normativa está clara al respecto y el vicerrector de investigación ha invitado a que se notifique cualquier anomalía o impedimento.\nDevolución de tasas\n\nDesde el Servicio de Investigación se reclama al ministerio la devolución correspondiente al curso finalizado y una vez aprobado se le abona el importe al becario (en julio). Estas devoluciones se aplican a:\nFPI: para los créditos de máster\nFPU: para la tutela académica\nEstancias breves\n\nUna vez concedida la estancia se ha de llevar la factura del viaje (de haberla) al Servicio de Investigación. Se pagará por adelantado el coste del viaje y la manutención (en base al gasto diario establecido)\nSe ha de solicitar autorización para viajar siempre, sea estancia breve o no\nLas estancias breves se pueden acreditar aunque no haya dinero para financiarlas desde ministerio o UPM (financiándolas con fondos propios del grupo o el becario)\nAntes de iniciar la estancia se ha de comprobar el tipo de seguro que tengamos contratado. En caso de tener la beca UPM hay que llamar a la OTT, para las becas FPU/FPI toca llamar al ministerio.\nUPM\n\nPlazos de solicitud:\ndel 29 de junio al 27 de julio de 2012\nDuración de la estancia:\nde 3 semanas a 3 meses (máximo hasta 6 meses si lo financia el grupo)\nPeriodo de disfrute de la estancia:\ndel 1 de junio de 2012 al 31 de mayo de 2013\nRestricciones:\nA partir del 2º año de la ayuda. Sin límite en el número de estancias breves a realizar (tantas como convocatorias se abran durante la ayuda).\nFPI\n\nPlazos de solicitud:\ndel 13 al 27 de septiembre de 2012\nDuración de la estancia:\nde 2 a 6 meses (se puede hacer en dos periodos)\nPeriodo de disfrute de la estancia:\ndurante todo 2013\nRestricciones:\nDisponibles desde el inicio de la beca\nFPU\n\nPlazos de solicitud:\ncerrado para 2012\nDuración de la estancia:\nde 2 a 4 meses\nPeriodo de disfrute de la estancia:\ndel 1 de noviembre de 2012 al 31 de julio de 2013\nRestricciones:\nA partir del 2º año de la ayuda. Máximo 3 estancias durante la ayuda, sin superar un máximo de 9 meses en total. No puede superponerse a los últimos 6 meses de la ayuda, salvo si la tesis está entregada.\nMemorias\n\nUPM\n\nMemoria de seguimiento: 1 mes antes de cumplir el 1º, 2º y 3º año de la ayuda\nFPI\n\nMemoria de seguimiento anual\nmemoria final como máximo 1 mes más tarde de la finalización de la ayuda\nFPU\n\nMemoria de seguimiento: del 24 de septiembre al 8 de octubre de 2012 a través de la sede electrónica del ministerio\nMemoria final: como máximo 1 mes más tarde de la finalización de la ayuda\nAcción social\n\nSe puede solicitar sólo en fase de contrato e incluyen, entre otros, los siguientes puntos:\nPrestaciones asistenciales como oftalmología, odontología, psicología, etc. (se reembolsaría un porcentaje del gasto hecho)\nAyudas para el cuidado de los hijos\nAyudas para el estudio y el transporte\nLa información completa de estas ayudas, así como los formularios de solicitud, se encuentran en:\nhttp://www.upm.es/institucional/Investigadores/AccionSocial/ProgramasOficiales\nCredenciales de las ayudas\n\nUPM: credencial sólo para el primer año, después se da una carta indicando la renovación de la ayuda\nFPI: suprimidas\nFPU: el Ministerio remite la credencial al Servicio de Investigación y el estudiante las recoge allí personalmente\nLo que está por venir\n\nSe está preparando un nuevo modelo de becas, recogido en el Real Decreto que saldrá en diciembre de 2013: en vez de 2 años de beca + 2 años contrato se hará un contrato por el primer año, extensible hasta un máximo de 4 años.\nSe ha mencionado la creación de una (o varias)\nescuela de doctorado\n. Aunque actualmente aún está todo por concretar, es seguro que ocurrirá. Habrá una reunión informativa al respecto más adelante.",
  "speaker": "SYSTEM",
  "uuid": "921b2831-5cc7-4078-b595-3c8d0d60127c"
}