{
  "message": "SYSTEM: QRVocabulary.pdf: Página 8\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n90 / 103 \nTable 4: The possible plus/min relations between derivative items \nTo \nFrom \nDerivative \nPoint (Derivative) \nPlus/Min \n(Derivative) \nDerivative \n7 \nImpossible \n9 \nPoint (Derivative) \nImpossible \nImpossible \nImpossible \nPlus/Min (Derivative) \n9 \nImpossible \n8 \n \nExamples: \n1. The magnitude of the predation of the hunters is equal to their food need minus \nthe amount of prey. \n2. No example given. \n3. The sum of birth and immigration minus the sum of death and immigration is \nequal to the magnitude of population growth. \n4. No example given. \n5. The intensity of the light plus the concentration of carbon dioxide plus the surface \narea of the leaves is equal to the rate of photosynthesis. \n6. No example given. \n7. No example given. \n8. No example given. \n9. No example given. \nA.6: Behavioural Building Blocks: Correspondences \nCorrespondences are used to indicate that qualitative values of different quantity \nspaces occur at the same time. \nA.6.1 Value Correspondences \nValue Correspondences are relations between qualitative values of quantity spaces \nbelonging to different quantities, and can be either directed or undirected. Directed \nmeans that when value A of quantity space X corresponds to value B of quantity space \nY, the simulator derives that quantity space Y has value B when quantity space X has \nvalue A. If the correspondence is undirected, it also derives the value A of quantity \nspace X when quantity space Y has value B. \nA.6.2 Quantity Space Correspondences \nQuantity Space Correspondences exist between two quantity spaces, indicating that \neach of the values of the quantity spaces of those quantities correspond to each other. \nLike value correspondences these can also be either directed or undirected.  \nA.6.3 Inverse Quantity Space Correspondences \nQuantity space correspondences can also be inversed, indicating that the first value of \nthe first quantity space corresponds to the last value of the second quantity space; the \nsecond value corresponds to the penultimate value, etc. Inverse correspondences can \nalso be either directed or undirected. \nA.6.4 Full Quantity Space Correspondences \nFull Quantity Space Correspondences indicate that there is both a quantity space \ncorrespondence between the quantity spaces of the magnitudes, as well as a quantity \nspace correspondence between the quantity spaces of the derivatives. Full \ncorrespondences can be either directed or undirected. \n",
  "speaker": "SYSTEM",
  "uuid": "94e91593-ed65-4b76-afa9-d33a75b4f66e"
}