{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 4\n4\nMariano Rico, Óscar Corcho et al.\nHome 1\nUPnP\nControl \nPoint\nUPnP \nMedia\nServer\nUPnP \nMedia\nRenderer\nHome\nGateway\nIMS UA,\nPresence \nAgent\nPolicy \nAgent\nUPnP \nRemote \nExtension\nMetadata \nServer\nTag \nServer\nHome 2\nIMS \nEnablers\nCore IMS\nPresence\nAccess Policy \nServer\nOntology \nServer\nFig. 1: UpGrid architecture\n• UPnP Remote Extension. It extends UPnP visibility to all the homes\nthat are part of a remote UPnP session. That is, it allows seeing from\na home those devices or multimedia resources for which we have autho-\nrization as if they belonged to the same LAN.\n• Access Policy Agent. It acts as the Policy Enforcement Point (PEP) for\nauthorization requests, and is used by the UPnP Remote Extension to\nprovide the di\u001berent visibility con\u001cgurations.\n\u0015 Other UPnP-enabled components. These are the components that are usu-\nally found in any UPnP-enabled environment. All of them are those available\nby default, and we have only extended the Control Point in order to support\nour extensions.\n• UPnP Media Server. It stores and shares media content. It can be browsed\nby Control Points, and serves the content that will be rendered by Media\nRenderers. An example of a media server is a hard disk.\n• UPnP Media Renderer. It renders contents coming from Media Servers,\nand can be controlled by Control Points. Examples of Media Renderers\nare TV sets or digital photo frames.\n• Extended UPnP Control Point. Standard Control Points allow browsing\nthrough Media Servers content and sending it to Media Renderers.\nExamples of standard Control Points are Windows Media Player, Cidero,\netc. In this project we have deployed an Extended Control Point that\nis also able to establish UPnP sessions with remote homes, to allow\ncontent search using di\u001berent search patterns, to handle and modify\nauthorization grants through the Access Policy Agent and Server, and\nto annotate multimedia resources using tags and ontologies.\n• Tag server. The tag server stores user-de\u001cned tags related to the multi-\nmedia resources that are stored in each of the homes. The assignment of\n",
  "speaker": "SYSTEM",
  "uuid": "95815b00-fd7f-4d67-9a8e-a7bd0928a00d"
}