{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 22\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 22 de 42 \nSystems, 2010. Editores: H Chen, Y Wang, KH Cheung. Springer-Verlag. Volumen: 11. \nPáginas:99 - 139. Diciembre 2010 \n10. García Castro R, Gómez Pérez A. Interoperability Results for Semantic Web \nTechnologies using OWL as change language. Journal of Web Semantics (ISSN: \n1570-8268). Elsevir (Holanda). Volumen: 8. Páginas: 278 - 291. 2010 \n11. García-Silva A, Corcho O, Gracia J. Associating Semantics to Multilingual Tags in \nFolksonomies (Póster). 17th International Conference on Knowledge Engineering and \nKnowledge Management (EKAW2010). Lisboa (Portugal). Octubre 2010 \n12. Gómez-Pérez A, Corcho O, Vilches LM, Villazón-Terrazas B. Geolinked Data an \nApplication Case. Conference JIDEE 2010. Lisbon, Portugal. Octubre 2010 \n13. Gómez-Pérez A, García Castro R, Esteban M. Executing Evaluations over Semantic \nTechnologies using the SEALS Platform. WOP 2010 – Workshop on Ontology Patterns \nat the 9th International Semantic Web Conference (ISWC2010). ISSN: 1613-0073. \nCEUR Workshop Proceedings. Shanghai, China. 08 Noviembre 2010 \n14. Gómez-Pérez JM, Erdmann M, Greaves M, Corcho O, Benjamins VR. An Intelligent \nComputer System for Knowledge-level Acquisition, Representation, and Reasoning with \nProcess Knowledge. International Journal of Human-Computer Studies. ISSN: \n1071-5819. Elsevier. Volumen: 68. Páginas: 641 - 668. Octubre 2010 \n15. Gracia J, Liem J, Lozano E, Corcho O, Trna M, Gómez-Pérez A, Bredeweg B. \nSemantic Techniques for Enabling Knowledge Reuse in Conceptual Modelling. 9th \nInternational Semantic Web Conference (ISWC2010). Shanghai, China. ISBN: 978-3-\n642-17748-4. Volumen: LNCS 6497. Páginas: 82 - 97. Noviembre 2010 \n16. Herrero P, Katz DS, Pérez MS, Talia D. Special Section: Grid computing, high-\nperformance and distributed applications. Future Generation Computer Systems. Feb. \n2010. Elsevier. pp. 257 - 258 \n17. McCrae J, Aguado de Cea G. The lemon model. Terminology and Knowledge \nEngineering, en el Workshop Standardizing Data Categories in ISOcat: Implementing \nGroup Work for Thematic Domains. Dublin, Ireland. 11-14 agosto 2010 \n18. Montiel-Ponsoda E, Aguado de Cea G, Gómez-Pérez A, Peters W. Enriching \nOntologies with Multilingual Information. Journal of Natural Language Engineering. \nPáginas: 1 - 27. 09 junio 2010 \n19. Pareja Lora A, Aguado de Cea G. Modelling Discourse-related terminology in \nOntoLingAnnot’s ontologies en Actas del Workshop on 'Establishing and using \nontologies as a basis for terminological and knowledge engineering resources', en TKE \n2010. Dublin, Ireland. Páginas 549-575. 11-14 agosto 2010 \n20. Poveda-Villalón M, Suárez-Figueroa MC, García-Castro R, Gómez-Pérez A. A Context \nOntology for Mobile Environments. CIAO2010 - Workshop on Context, Information and \nOntologies at the 17th International Conference on Knowledge Engineering and \nKnowledge Management (EKAW 2010). ISSN: 1613-0073. CEUR Workshop \nProceedings. Lisbon, Portugal. 11 Octubre 2010 \n21. Poveda-Villalón M, Suárez-Figueroa MC, Gómez-Pérez A. A Double Classification of \nCommon Pitfalls in Ontologies. OntoQual 2010 - Workshop on Ontology Quality at the \n17th International Conference on Knowledge Engineering and Knowledge Management \n(EKAW 2010). ISBN: ISSN 1613-0073. CEUR Workshop Proceedings. Lisbon, \nPortugal. 15 Octubre 2010 \n22. Poveda-Villalón M, Suárez-Figueroa MC, Gómez-Pérez A. Reusing Ontology Design \nPatterns in a Context Ontology Network. WOP 2010 – Workshop on Ontology Patterns \nat the 9th International Semantic Web Conference (ISWC2010). ISSN: 1613-0073. \nCEUR Workshop Proceedings. Shanghai, China. 08 Noviembre 2010 \n23. Rico M, Camacho D, Corcho O. A Contribution-based Framework for the Creation of \nSemantically-enabled Web Applications. Information Sciences. ISSN: 0020-0255. \nElsevier. Volumen: 180(10). Páginas: 1850 - 1864. Mayo 2010 \n24. Rico M, Corcho O, Macías JA, Camacho D. A Tool Suite to Enable Web Designers, \nWeb Application Developers and End-users to Handle Semantic Data. International \nJournal of Semantic Web and Information Systems. ISSN: 1552-6283. IGI Global. \nVolumen: 6(3). Páginas: 38 - 60. Octubre 2010 \n25. Salvadores M, Herrero P, Bosque JL, Pérez MS. A Semantic Collaborative Awareness \nModel to deal with Resource Sharing in Grids. Future Generation Computer Systems. \nFeb. 2010. Elsevier. pp. 276 - 280 \n",
  "speaker": "SYSTEM",
  "uuid": "97004e4b-f929-49d3-9faa-4865371b2591"
}