{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Innsbruckjan2011 \n\nDo you consider yourself an expert in the Semantic Web and semantic technologies?\nWe'd be interested in hearing from you.\nSemsphere is now hiring expert semantic technologist to join our growing network of qualified trainers.\nSemsphere is the global semantic technology training company based in Austria, Europe. Our training and certification program has been developed in consideration of the needs and requirements of IT companies and professionals with the endorsement of STI International. Our core certifications, industry courses, and customized training programs precisely meet the demands of the business IT world and enjoy an excellent reputation regarding their contents, quality, strategic usefulness, pragmatism and applicability.\nWe are seeking candidates with:\n•\tA strong background in computer science, particularly in the areas of knowledge representation, logics, formal languages, and ontology engineering\n•\tPractical work experience in software engineering and application development, Web technologies, and service architectures\n•\tA proven track record in teaching and administering training courses in professional settings\n•\tExcellent public speaking, didactic, and pedagogical skills\n•\tWillingness to travel internationally\nWe offer:\n•\tA multicultural working environment with a network of experts from the international semantic technology community\n•\tThe opportunity to educate industry about the business value and practical application of semantic technologies, fulfilling the dual role of trainer and technology evangelist\n•\tThe opportunity to contribute towards a globally verified training curriculum in semantic technologies\n•\tCustomized training to become a certified Semsphere Academy Trainer\nWe'd be interested in hearing from you.\nVisit www.semsphere.com/career and submit your application.",
  "speaker": "SYSTEM",
  "uuid": "9a5d3264-fc39-412c-8f68-5dee85c950dd"
}