{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/FribSwnov2010 \n\nOpen Ph.D. Student and Postdoc Positions Exascale Information Management U. of Fribourg--Switzerland\nhttp://diuf.unifr.ch/xi\nThe eXascale Infolab at the University of Fribourg has several openings for Ph.D. students and Postdocs starting now. XI is a brand new lab focusing on creating next-generation information management infrastructures for scientific, semantic, and social data.\nWe are looking for highly qualified individuals with a MSc or a PhD in Computer Science (or related areas), interested in inventing the future of information management for new application domains (such as for eScience, the Social Web, or the Semantic Web). Candidates must have strong analytical\nand programming skills, a good command of the English language, and a genuine interest in designing, building and publishing innovative approaches\nand systems to manage new types of data in very large-scale environments.\nSalary and social benefits are extremely competitive (salaries start at 41K CHF for new Ph.D. students and 81K CHF for postdocs, 1CHF=1USD). XI is supported by a generous grant from the Swiss National Science Foundation and offers top-notch working conditions and cutting-edge hardware infrastructures. The PhD student or PostDoc will be able to join existing projects but also to establish his or her own research direction with the help of the other lab members. Current projects include building main-memory systems bridging the gap between transactional and analytical tools (project\nin partnership with MIT and the Hasso Plattner Institute), designing new algorithms to mine very large Web logs (in cooperation with VeriSign), and devising new techniques to store and process very large scientific arrays (with MIT, as part of the SciDB project\nhttp://www.scidb.org\n). New projects focusing on the Social Web and the Data Web will begin shortly, in partnership with leading companies and universities in Europe.\nThe lab is hosted by the Faculty of Science at the University of Fribourg.\nThe\nfaculty is currently experiencing a formidable expansion and recently received the largest-ever donation made to a Swiss university. Ideally situated in the heart of Switzerland and at the foot of the Alps, the city of Fribourg lies on the linguistic border between the French and German-speaking parts of the country. In addition to being recognized as a first-class location for business and education, Fribourg is also a delightful and exceptional place to live and is often ranked first for quality of life in Western Switzerland (see for instance\nhttp://tinyurl.com/29e9blw\n).\nIf you are interested in one of these positions or simply would like to get additional information, please visit the XI website:\nhttp://diuf.unifr.ch/xi\nor contact Prof. Philippe Cudre-Mauroux by email:pcm(at)unifr(dot)ch.",
  "speaker": "SYSTEM",
  "uuid": "9bd5791c-7ab4-49e5-b1e0-698c22e9bbb9"
}