{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 14\nstandards/classifications properly, but it also facilitates the creation of the local \nontologies related to this RO, since the building process of these local ontologies can \ntake advantage of the already existing RO. \n \nAcknowledgments. This work has been partially supported by the FP6 EU SEEMP \nProject (FP6-027347).  \nReferences \n1. \nBizer, C., Heese  R., Mochol, M., Oldakowski,  R., Tolksdorf,  R., Eckstein,  R.: The \nImpact of Semantic Web Technologies on Job Recruitment Processes; 7th International \nConference Wirtschaftsinformatik (2005). \n2. \nBourse, M., Leclère, M., Morin, E., Trichet, F.: Human Resource Management and \nSemantic Web Technologies;1st International Conference on Information Communication \nTechnologies: from Theory to Applications (ICTTA), (2004). \n3. \nde Bruijn, J., Lausen, H., Polleres, A., Fensel, D.: The web service modeling language: An \noverview. In: Proceedings of the 3rd European Semantic Web Conference (ESWC2006), \nBudva, Montenegro, Springer-Verlag (2006). \n4. \nFensel, D., Lausen, H., Polleres, A., de Bruijn, J., Stollberg, M., Roman, D., Domingue, J.: \nEnabling Semantic Web Services - The Web Service Modeling Ontology. Springer (2006). \n5. \nFOREM, UniMiB, Cefriel, ARL, SOC, MAR, PEP: User Requirement Definition \nD.1.SEEMP Deliverable (2006). \n6. \nGómez-Pérez, A., Fernández-López, M, Corcho, O.: Ontological Engineering. Springer \nVerlag. (2003). \n7. \nGómez-Pérez, A., Ramírez, J., Villazón-Terrazas, B.: Methodology for Reusing Human \nResources Management Standards. In Nineteenth International Conference on Software \nEngineering and Knowledge Engineering (SEKE'07), Boston, USA, July, (2007) \n8. \nGrüninger, M, Fox, MS.: Methodology for the design and evaluation of ontologies In \nSkuce D (ed) IJCAI95 Workshop on Basic Ontological Issues in Knowledge Sharing, \n(1995) pp 6.1-6.10 \n9. \nGualtieri, A., Ruffolo, M.: An Ontology-Based Framework for Representing \nOrganizational Knowledge. In: Proceedings of I-KNOW ’05. Graz, Austria, June, (2005). \n10. http://proton.semanticweb.org/. Last visited: August 14, 2007. \n11. http://www.hr-xml.org. Last visited: August 14, 2007. \n12. Jarrar, M.: Ontology Outreach Advisory - The Human Resources and Employment \nDomain Chapter. http://www.starlab.vub.ac.be/OOA/OOA-HR/OOA-HR.html \n13. Legge, K.: Human Resource Management: Rhetorics and Realities. Anniversary ed. \nMacmillan. (2005). \n14. LFUI, CEFRIEL, ED, TXT, UJF, UniMib, UPM: Supporting State of the Art. D.3.2 \nSEEMP Deliverable (2006). \n15. Mochol, M., Paslaru, E.: Simperl: Practical Guidelines for Building Semantic \neRecruitment Applications, International Conference on Knowledge Management \n(iKnow'06), Special Track: Advanced Semantic Technologies (2006). \n16. Swartout, W., Patil, R., Knight, K., Russ, T.: Towards Distributed Use of Large-Scale \nOntologies, AAAI-97 Spring Symposium on Ontological Engineering, Stanford \nUniversity, May, (1997). \n \n",
  "speaker": "SYSTEM",
  "uuid": "9bd766d7-1e39-4254-b823-dbbdd592de53"
}