{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 4\nPRESENTACIÓN\nEn este libro los autores hemos elaborado un directorio de las bases de datos de libre\nacceso en Internet de la Administración General del Estado en España. Está actualizado a\nfinales de junio de 2008.\nAl margen del valor documental intrínseco que tiene este trabajo académico, su princi-\npal objetivo es servir de base para la identificación de los activos de información públicos\nque son susceptibles de reutilización por los ciudadanos, las empresas y otras instituciones.\nLa reutilización de la información es un concepto nuevo que se ha introducido en\nEspaña a través de la Directiva 2003 de Reutilización de la información del sector públi-\nco y de la Ley aprobada en Cortes con el mismo título en noviembre de 2007.\nEl objetivo primordial tanto de la directiva como de la ley es el de poner en valor el\ngran volumen de información que poseen las administraciones públicas de la Unión\nEuropea, las cuales, fragmentadas en cuanto a modelos de acceso y requisitos de explota-\nción de la información, pueden construir una industria de la información, como existe en\nEstados Unidos desde hace décadas.\nLa reutilización es un proceso multifacético en el que concurren aspectos jurídicos,\neconómicos, informativo-documentales, comerciales, de sistemas de información, etc.\nQuizás ésta sea la causa por la que es tan difícil avanzar en su desarrollo. Además, en su\nanálisis hay que tener en cuenta elementos muy variados: procedimientos administrativos,\ngestión de archivos, protección de datos personales o titularidad de los derechos de autor.\nEste mismo párrafo da una idea de los obstáculos que hay que remover para al final con-\nseguir un resultado tan sencillo como que la información de naturaleza pública, creada con\nfondos públicos, sea puesta a disposición de los ciudadanos para su uso personal o de los\nactores económicos y sociales. A todo este panorama complejo hay que añadir el nuevo\ncontexto de la Administración electrónica. De todo ello se da cuenta en las tres contribu-\nciones que siguen a esta presentación, en las que se analiza sucesivamente el contexto\ninternacional en el que se desarrolla la reutilización de información, la complejidad admi-\nnistrativa de la Administración General del Estado y los procedimientos seguidos para tra-\ntar de sistematizar las más de 500 bases de datos que se describen. Cualquiera que haya\ntratado de alcanzar un objetivo como el que nos hemos propuesto comprenderá las dificul-\ntades a las que se han hecho frente. \nEl Grupo de Investigación que ha elaborado el repertorio imparte docencia en el área\nde Información y Documentación y desde un principio se ha orientado a analizar los aspec-\ntos documentales de la organización de la información que impulsa la directiva; no en vano\ndicha directiva se llamó en su primera propuesta de Reutilización de la Documentación en\nel Sector Público. En efecto, en paralelo a la constitución del grupo de investigación (for-\nBASES DE DATOS  1/1/04  03:39  Página 7\n",
  "speaker": "SYSTEM",
  "uuid": "9c5d0cf1-9877-4107-a015-254783d16841"
}