{
  "message": "SYSTEM: Upgridiswc2010.pdf: Página 10\n10\nMariano Rico, Óscar Corcho et al.\nresources that it describes. This is supported by the concept of Semantic Bind-\nings, as de\u001cned in Semantic Grid architectures like S-OGSA [6], for the robust\nmanagement of this information. Besides its inherent distributed nature, the use\nof such architecture provides support for the easy disclosure, disposal, modi\u001c-\ncation, and archival of metadata, even in cases where the devices that hold the\nmultimedia resources that are being described are not available. The behaviour\nto be followed in order to maintain the consistency between resources and their\nassociated metadata in a distributed manner can be also speci\u001ced declaratively,\nas described in [6].\nGiven the distributed nature of metadata management in this context, our\nS-OGSA enabled system implements distributed metadata access capabilities,\nproviding a WS-DAI-RDF query interface [8]. It allows not only the simple\nreplication of the same query across available and authorised metadata servers\n(providing links to multimedia resources that solve simple queries like \u0010give me\nall the resources where a person called Adrian appears\u0011), but also complex dis-\ntributed queries where e\u001ecient inter-related query plans across metadata servers\nhave to be issued. For this we use SPARQL-DPQ [3], an extension of the OGSA-\nDQP system [10], which allows solving queries like \u0010give me all the resources\nwhere Adrian appears in places where I have also been\u0011.\nPublication of this metadata is done using a Linked Data approach. Any ex-\nternal content request requiring an RDF view of a speci\u001cc resource will be trans-\nformed by our Home Gateway to a query into the corresponding local metadata\nserver, which will provide the set of annotations that it has about that speci\u001cc\nresource, local or remote.\n5.3\nImplementation of the proposed extensions\nNow we describe how these extensions are implemented in our Control Point.\nStandard Control Points provide a user interface with a media server control and\na renderer control. The media server control provides facilities for searching, list-\ning and browsing the media servers available in our local network. The renderer\ncontrol allows users to execute actions for playing multimedia resources in avail-\nable renderers. Given our UPnP protocol extensions, our UpGrid Control Point\nhas now access not only to Media Servers and Renderers from our local network\nbut also to those available in remote homes for which the user has authorization\nand can establish a session with.\nIn addition, our UpGrid Control Point introduces the concept of UPnP user\ndescribed in section 3. This user is the person using the Control Point at a spe-\nci\u001cc moment, and it has the usual login and password control. Besides, there is a\nstrong connection with social networks like Facebook, which will allow an easier\nbootstrapping of the system in terms of user and authorization right manage-\nment, which is another extension provided to our Control Point user interface,\nas shown in Fig. 5.\nAnother extension is the functionality to establish and \u001cnish sessions with\nauthorized homes. Every time we want to connect with an authorized home, our\n",
  "speaker": "SYSTEM",
  "uuid": "9cf3534b-a109-4319-a56f-bd8c29fb3574"
}