{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 11\nTable 4. SEEMP ORSD Slot 6b. \n6 \nOntology Requirements \n \nb. Functional Requirements: Groups of Competency Questions \nCQG1. Job Seeker (14 CQ) \nCQ1. \nWhat is the Job Seeker’s name? Lewis Hamilton \nCQ2. \nWhat is the Job Seeker’s nationality? British; Spanish; Italian; French;  \nCQ3. \nWhat is the Job Seeker’s birth date? '13/09/1984; 30/03/1970; 15/04/1978 \nCQ4. \nWhat is the Job Seeker’s contact information? Tel: 34600654231. Email: \njsanz@fi2.upm2.es \nCQ5. \nWhat is the Job Seeker’s current job? Programmer; Computer Engineer; \nComputer Assistant \nCQ6. \nWhat is the Job Seeker’s desired job? Radio Engineer; Hardware designer; \nSoftware Engineer \nCQ7. \nWhat are the Job Seeker’s desired working conditions? Autonomous; \nSeasonal Job; Traineeship; Consultant \nCQ8. \nWhat kind of contract does the Job Seeker want? Full time; Partial time; \nAutonomous; Seasonal Job \nCQ9. \nHow much salary does the Job Seeker want to earn? 3000 Euros per month, \n40000 Euros per year \nCQ10. What is the Job Seeker’s education level? Basic education; Higher \neducation/University  \nCQ11. What is the Job Seeker’s work experience? 6 months, 1 year, 2 years \nCQ12. What is the Job Seeker’s knowledge? Java Programming; C Programming, \nDatabase Administration \nCQ13. What is the Job Seeker’s expertise? Software Engineering \nCQ14. What are the Job Seeker’ skills? SQL programming, network administration \nCQG2. Job Offer (11 CQ) \nCQ15. What is the employer’s information? CEFRIEL Research Company, Milano, \nItaly; ATOS, Madrid, Spain \nCQ16. What kind of job does the employer’s offer? Java Programmer; C \nProgrammer, Database administration \nCQ17. What kind of contract does the employer’s offer? Seasonal Job; Autonomous \nCQ18. How much salary does the employer’s offer? 3500 Euros, 3000 USD \nCQ19. What is the economic activity of the employer? Research; Financial; \nEducation; Industrial \nCQ20. What is the description of the job offer? Sun Certified Java Programmer \nCQ21. What are the working conditions of the job offer? Full time; Partial time; \nAutonomous; Seasonal Job \nCQ22. What is the required education level for the job offer? Basic education; \nHigher education/University \nCQ23. What is the required work experience for the job offer? 1 year, 2  years, 3 \nyears, 4 years, 5 or more years \nCQ24. What is the required knowledge for the job offer? Java, Haskell, Windows \nCQ25. What are the required skills for the job offer? ASP Programmer, Data \nwarehouse, Hardware programming \n",
  "speaker": "SYSTEM",
  "uuid": "9d2cf037-a407-4ca0-9c93-63c434ea0bac"
}