{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual24062010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.3\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Paper para el ISWC. Evaluación\nTarea 3. Modelo de anotación híbrido\n.\nTarea Integración y patrones de reconocimiento avanzado 2.\nContinuación de la realización de pruebas sobre un conjunto de páginas web con el fin de obtener resultados y evaluar el servicio REST.\nCorrección de errores en la formación de las URL usadas en la API de Sindice.\nModificación del comportamiento de las llamadas a los recursos externos con el fin de evitar caídas del sistema. Estas caídas del sistemas se producían cuando alguno de los servicios externos no estaba en funcionamiento. Por ejemplo, Sindice ha estado sin servicio en bastantes ocasiones durante esta última semana.\nVer las necesidades para instalar y trabajar con FreeLing.\nInterfaz Anotación Híbrida\n\n- Se ha probado conexión a servicio REST local en servidor Acubens a traves de php, y han sido exitosas.\n- Se ha vuelto a modificar la base de datos, se busca el mejor modelo de datos (critico del sistema social).\n- Se han realizado pequeñas mejoras de usabilidad al portal.\n- la ultima versión del portal se encuentra en\nhttp://regulo.dia.fi.upm.es/next\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha configurado gridFTP en dos máquinas conectadas en red probándose su funcionamiento.\n- Se ha desarrollado la funcionalidad de descarga de ficheros mediante cliente JAVA.\n- Se esta desarrollando la funcionalidad de subida de ficheros mediante cliente JAVA.\nTarea 1.4\n\nEscritura del entregable 1.4.6.\nTarea 7.1\n\n- Linked Data\n· Generación de enlaces entre Endpoint y Pubby\n- Divulgación\n. Envío abstract y redacción de un artículo para el ACM SIGSPATIAL",
  "speaker": "SYSTEM",
  "uuid": "9f1f9ceb-f85d-42c1-91e4-2db680ca11f5"
}