{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 55\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 55 of 111 \n \nFigure 19. History of the Consensus Reaching Process \n3.2. NeOn Glossary of Activities  \nAccording to ISO 12200:1999 [5] and ISO 1087-1:2000 [ ]\n6 , a glossary can be defined as:  \na. A terminological dictionary containing the terminology of a specific subject field or of related \nfields and based on terminology work [5].  \nb. A terminological dictionary that contains designations and definitions from one or more \nspecific subject fields. The vocabulary may be monolingual, bilingual or multilingual [6]. \nAccording to [43] there are three basic principles of defining: “avoid circularity, define every word \nin a definition, and make sure that every word’s definition says what the word means”. However, \napplying these basic rules does not necessarily produce good definitions.  \nThe following principles are also common in lexicographic practice:  \n Conciseness, i.e. every definition should say the most in the least number of words. \n Clarity in that it avoids ambiguity, i.e. words should be used unambiguously. \n Appropriateness, i.e. the definition should be appropriate to the target reader. \n Priority of essential traits, i.e. a definition should highlight the essential features of meaning. \nFollowing the aforementioned definitions and principles, we have collected in the Neon Glossary of \nActivities the main activities involved in the ontology network development process (in the specific \nfield of ontology engineering) and provided agreed natural language definitions and explanations of \nthem. The vocabulary included in the glossary is monolingual (English). \nAs mentioned in the introduction, it is crucial to identify and define which main activities should be \nperformed in the networked ontology development process. 51 activities have been identified and \ndefined as part of the NeOn Glossary of Activities, by means of the consensus reaching process \nexplained in Section 3.1. Apart from the 51 activities resulting of the consensus reaching process, \nin the NeOn Glossary of Activities two new activities (Non Ontological Resource Reengineering \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "a074b96f-7954-4af8-a471-a5a12b4df975"
}