{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 31\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11180\nrealizándose el primer pago a partir del primer día del mes siguiente a la fecha de recepción \nen el órgano instructor del certificado de incorporación, independientemente de los atrasos \nque le corresponda recibir al becario.\n2.  Los Centros de I+D adelantarán el importe de las ayudas para la contratación del \npersonal de investigación en formación que tienen adscritos y el INIA transferirá en el \núltimo trimestre de la anualidad presupuestaria, hasta un máximo del 80% de lo establecido \nen la Tabla Salarial del Convenio Único para el personal laboral de la Administración \nGeneral del Estado, para la contratación de un titulado superior de investigación y \nlaboratorio, grupo profesional 1.\n3.  En aquellos casos que sea exigible, los Centros de I+D beneficiarios deberán \nacreditar estar al corriente de sus obligaciones frente a la Seguridad Social, presentando \nel correspondiente certificado original o fotocopia compulsada expedida por la tesorería de \nla Seguridad Social, de acuerdo con las Órdenes del Ministerio de Economía y Hacienda \nde 28 de abril de 1986 y de 25 de noviembre de 1987.\n4.  Las ayudas a las que se refiere esta convocatoria se financiarán con cargo a las \naplicaciones presupuestarias 21.204.467D.780, 21.204.467D.131 y 21.204.467D.160 o \nequivalentes del presupuesto de gastos del INIA para el año 2010 y posteriores, de acuerdo \ncon las disponibilidades presupuestarias y, en su caso, a las aportaciones procedentes del \nFondo Social Europeo. El INIA anticipará el pago de las becas durante el período de beca \n(dos primeros años) con cargo a la aplicación presupuestaria 21.204.467D.780. La \ndistribución entre créditos presupuestarios y anualidades tiene carácter estimativo, lo que \nse declara a efectos de lo dispuesto en al artículo 58.4 del Real Decreto 887/2006, de 21 \nde julio, por el que se aprueba el Reglamento de la Ley General de Subvenciones.\nArtículo 63.  Justificación de las ayudas en fase de contrato.\nLa justificación de las ayudas se realizará de acuerdo con lo establecido en el artículo 30 \nde la Ley 38/2003, General de Subvenciones, según las disposiciones que sobre \nseguimiento y justificación económica establezcan las resoluciones de convocatorias y de \nconcesión y, en su caso, según lo establecido en la normativa aplicable a la cofinanciación \nde los fondos estructurales de la Unión Europea. La justificación final de las ayudas se \nrealizará mediante cuenta justificativa que, haciendo uso de la facultad otorgada por el \nartículo 72.3 de la Ley General de Subvenciones para limitar el contenido de la cuenta \njustificativa en virtud de la naturaleza de estas ayudas, contendrá con carácter general la \nsiguiente documentación:\na)  Memoria de actuación científico-técnica, justificativa del cumplimiento de las \ncondiciones impuestas en la concesión de la ayuda, con indicación de las actividades \nrealizadas y de los resultados obtenidos.\nb)  Memoria económica justificativa del coste de las actividades realizadas, que \ncontendrá:\n1.º  Fichas justificativas normalizadas y certificación de los gastos y pagos realizados. \nLos documentos acreditativos del gasto y del pago quedarán en poder de los beneficiarios, \na disposición de los órganos de comprobación y control.\n2.º  En su caso, justificación de los costes indirectos imputados, con base en los \ncriterios de reparto de los mismos que se establezcan en las instrucciones de ejecución y \njustificación, que se encontrarán disponibles en la página web del órgano instructor de \ncada subprograma.\n3.º  En su caso, relación detallada de otros ingresos o ayudas percibidas que hayan \nfinanciado la actividad incentivada, con indicación de su importe y procedencia.\n4.º  En su caso, acreditación del reintegro de remanentes no aplicados.\nLa cuenta justificativa deberá presentarse en un plazo no superior a tres meses desde \nla finalización de cada una de las anualidades correspondientes a la actividad incentivada, \no desde la total finalización de la misma si se tratase de la última anualidad.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "a0b4f374-ddc9-4aa3-8657-85f5f0a4d0d5"
}