{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 9\n3.3.2 Enriching the semantic annotations \nSince we request exact matches with DBpedia (and GeoNames) classes and \nproperties, our system does not establish correspondences with ontology classes or \nproperties for all parameters of the RESTful service, since there are many lexical and \nsyntactic variations that the parameter names may have, and because in some cases \nthe information that is being requested may not be available in any of the external \nsources that are consulted. In order to annotate semantically the parameters that did \nnot match any DBpedia resource, we use additional external services to enrich the \nresults. Below we describe the main characteristics of the external services that are \nconsidered in the system. \nSpelling Suggestion Services \nWeb search engines (e.g. Google, Yahoo, and Microsoft) usually try to detect and \nsolve users’ writing mistakes. Suggestions services, also called “Did You Mean”, are \nspelling algorithms which aim at solving these spelling mistakes. For example, when \na user writes ‘countryName’ these algorithms suggest ‘country’ and ‘name’ \nseparately. \nIn our system we use the Yahoo Boss service5 to retrieve suggestions about the \nparameters that we have obtained in the previous steps and for which we have not \nobtained any candidate in our semantic resources. Thus, for each parameter that the \nsystem did not find a correspondence with classes or properties in DBPedia (nor \nGeoNames), this service is invocated for obtaining a list of suggestions to query \nDBpedia (and GeoNames) again. The output is registered and stored into the \nrepository. Following the previous example, the parameter ‘countryName’ is not \nfound in the DBpedia ontology. Nevertheless, the added service allows separating this \nparameter in ‘country’ and ‘name’, and then it calls to the DBpedia SPARQL \nEndpoint for obtaining results. \nUse of Synonyms \nThis external service6 is incorporated into the system to retrieve possible synonyms \nfor a certain parameter. This service tries to improve the semantic annotation process \nwhen our system does not offer results for the previous steps, that is, when we still \nhave parameters in a RESTful service without any potential annotations. \nAs an example, we may have a parameter called ‘address’. The invocation process \nuses the synonyms service to retrieve a set of synonyms of ‘address’ such as \nextension, reference, mention, citation, denotation, destination, source, cite, \nacknowledgment, and so on. These outputs are registered and stored into the \nrepository, and then, the service calls to the DBpedia (and GeoNames) SPARQL \nEndpoints for results. \n                                                           \n5 http://developer.yahoo.com/search/boss/boss_guide/Spelling_Suggest.html \n6 http://www.synonyms.net/ \n",
  "speaker": "SYSTEM",
  "uuid": "a14c9560-8035-43c2-99a6-a4751c89a4cb"
}