{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/DataLift2010 \n\nData geek wanted\nThe computer science research institute from the university of Montpellier in France (LIRMM) is looking for a scientific developer. The position, offered in the context of the Datalift project, is opened to a candidate having knowledge of the french language and owning a Master degree in computer science. The position is for three years.\nThe job will consist of various data manipulation and programming tasks around the topic of linked-data publication, vocabulary and ontology design, data interlinking, and linked-data infrastructures. Newbies to the linked-data world are welcome as soon as they have significant experience in Web engineering, data cleansing, databases.\nSalary ranges between 2 308 € and 2 847 € depending on experience.\nKnowledge of French is required as data will mostly come from french institutions. The candidate should be able to communicate in a dynamic international environment. The work will be performed in cooperation with national and international companies and research institutes. The position might require to do a few trips.\nThe position is to start as soon as possible.\nKeywords: linked-data / web of data, semantic web, RDF, data cleansing, ontology / vocabulary, SPARQL, REST, noSQL, coreference resolution.\nContact: francois.scharffe@inria.fr and\nhttp://www.scharffe.fr\nDatalift project:\nhttp://datalift.org\nLIRMM lab:\nhttp://www.lirmm.fr\nPostdoc Position: Attaching licenses and rights to linked data.\nDatalift is an experimental research project funded by the French national research agency. Its goal is to develop a platform to publish and interlink datasets on the Web of data, and to demonstrate its approach by publishing datasets coming from a network of partners and data providers.\nIn datalift, the involvement of the Edelweiss Research team (INRIA Sophia Antipolis) is centered on a postdoc position to address provenance and rights management when publishing linked data. The idea is to propose and prototype an RDF extension to handle provenance declaration and attach license, copyrights and access right to RDF Graphs. This work will build on past experiences on named graphs and source declaration in RDF to attach licensing information to data and enforce their application during the querying process. More precisely we intend:\n* to attach provenance information to RDF graphs using named graphs and an extension of the RDF model and RDF/XML syntax;\n   * to link licensing information to provenance and named graphs and provide means to retrieve the licensing information linked to a piece of data;\n   * to extend query mechanisms in order to enable traceability of data used in answers;\n   * to link access rights to the graphs stating constraints to be verified for a query to be able to use data from these graphs and provide a formalism to describe the rights;\n   * to extend query mechanisms in order to take into account the access right during the query solving process.\nThe successful candidate will have a PhD in computer science with a strong component on semantic Web technology and linked-data.\nIdeal starting date: February / March 2011\nContact: Fabien.Gandon@inria.fr and\nhttp://fabien.info\nProject :\nhttp://datalift.org/fr/\nhttp://datalift.org/en/jobs.html#licenses",
  "speaker": "SYSTEM",
  "uuid": "a1dedb47-2ebd-4d0c-83c2-16956b3d8de3"
}