{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 85\n83\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\n4.12 Background\nThe starting point of the modern and computational approach to the Intelligent Content industry could be\nfound in the late 1940s when the first computer‐based application related to natural language was devel‐\noped to break enemy codes during World War II, and in the early 50s with the publication of Alan Turing’s\nfamous article «Computing Machinery and Intelligence». \nIntelligent Content technologies aim to solve problems related to human and digital content transformation,\nsearch, analysis, delivery, etc. to produce intelligent content. \n«Intelligent content» refers to content that is structurally rich and semantically aware, and is therefore dis‐\ncoverable, reusable, reconfigurable and adaptable and which is not limited to one purpose, technology or\noutput.\nThese technologies rely on underlying techniques and tools such as natural language processing (NLP), cat‐\negorization and clustering engines, and statistical approaches for processing the outputs of human language,\nsuch as written or spoken texts. \nMany Intelligent Content applications require (or generate) linguistic resources such as word lists, terminolo‐\ngies, dictionaries, thesauri, taxonomies, or ontologies to enhance their semantic accuracy.\nDuring the following decades, the relevance of Intelligent Content technologies has continued to grow with\nthe explosion in digital information and the needs of businesses, consumers, governments, and other stake‐\nholders to find, organize, navigate, publish, and make sense of it. These technologies continued to spread\ntentacles of functionality into any applications that required language understanding: in enterprise applica‐\ntions, in consumer Web businesses, and in online social environments.\nThe Intelligent Content Technologies are specifically designed for unstructured data and usually enable, both\nunstructured and structured content, from across the enterprise to be cleaned, restructured and enriched in\na consistent manner.\nAs a matter of fact, Intelligent Content industry is playing a key role in many growing technology markets.\nFor example, semantics is helping to improve enterprise search systems accuracy or social media analysis\nbased on text mining is helping to understand the voice of the customer. \n4.13 Core Tools and Techniques for Intelligent Content Technology\nNatural Language Processing (NLP)\nNatural Language Processing is a field of computer science, artificial intelligence (also called machine learn‐\ning), and linguistics concerned with the interactions between computers and human (natural) languages.\nSpecifically, the process of a computer extracting meaningful information from natural language input\nand/or producing natural language output.\nThe market globalization puts pressure on the need to address language barriers to trade between countries.\nThose technologies that reduce these barriers automatically become more important in a 24 hours open\nmarket. The customers’ use of online platforms, personal assistants, Interactive Voice Response systems\n(IVR) and other automated systems has increased in the last decade. So, companies depend more and more\non the right interaction between their systems and customers. Natural Language Processing provides mech‐\nanisms to deal with interactions between humans and machines.\n",
  "speaker": "SYSTEM",
  "uuid": "a2805ba5-3bb0-45b0-80e1-c7e511d03ce1"
}