{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 32\n \n \nPág. 34 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nInformación del Sector Público  \nMotivo: \nEl gran valor potencial que tiene buena parte de la información que genera el sector público \ncomo recurso lingüístico representa una extraordinaria oportunidad para el desarrollo de la \nindustria del procesamiento del lenguaje natural. Lo ilustra, a modo de ejemplo, que el elemento \nmás descargado del portal de datos abiertos de la UE es el corpus paralelo de traducciones del \nEURPARL (https://open-data.europa.eu/es/data/).  \nEntre otros recursos, la Administración dispone de: topónimos, nombres de personas, marcas, \nnombres de organizaciones, nombres de empresas, taxonomías, glosarios, textos traducidos \ncon alta calidad (v.g. traducciones juradas), corpus de dominio (legales, médicos, etc.), textos \nclasificados, etc. Es necesario adaptar estos valiosos recursos a formatos reutilizables por \nprocesadores lingüísticos. Además, la política de Reutilización de la Información del Sector \nPúblico (RISP) representa un cauce para el desarrollo de estos recursos lingüísticos, ya que tiene \ncomo objetivo poner a disposición de la sociedad, la información que el propio sector público \ngenera en el ejercicio de sus funciones y ofrecerla de manera abierta como un recurso que \npuede ser explotado económicamente. \nObjetivos: \nLos objetivos de esta línea de actuación son los siguientes:  \n \nImpulsar la industria del procesamiento del lenguaje natural en español y lenguas \ncooficiales poniendo a su disposición recursos lingüísticos generados a partir de la \ninformación del sector público. \n \nAsegurar la disponibilidad pública gratuita o a bajo coste de los recursos lingüísticos \ngenerados a partir de la información del sector público.  \n \nAsegurar la coordinación en el desarrollo de recursos lingüísticos generados a partir de la \ninformación del sector público, evitando duplicidades y buscando sinergias. \n \nDesarrollar y emplear de herramientas comunes para la generación y evaluación de \nrecursos lingüísticos generados a partir de la información del sector público. \n \nAdoptar normas técnicas de interoperabilidad, una política de licencias adecuada, y \nmecanismos de protección de datos personales. \nMedidas: \n- Medida 1: Encuadrar estas actuaciones en el marco de la política de Reutilización de la \nInformación del Sector Público (RISP). \n \nIntroducir en RISP el concepto de datos abiertos de interés lingüístico. \n \nDifundir este concepto en la Administración.  \n",
  "speaker": "SYSTEM",
  "uuid": "a2dbe7ed-3420-4d18-ae9d-47bd14002dcf"
}