{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/PostGalwayfeb2011 \n\nThe extension of the Internet into the physical world (Internet of\nThings) requires the integration of Web, database, distributed\nsystems, and networking research along with light-weight semantics and\nlinked open data as the new general-purpose data-integration\nlayer. Topics of interest (non-exlusive) are linked data and semantics\nfor the IoT, scalable query processing, cross-layer approaches\n(network, middleware, database, Linked Open Data), mobile applications\n(Android),\netc.\nThe successful candidate should be bound to become a leader in\nresearch. In particular, we are looking for candidates with the\nfollowing skills:\nA Ph.D. in a relevant area of computer science or a closely related area.\nDemonstrated excellence in research in large-scale distributed information systems, stream databases, management of time-dependant information, stream query processing systems, provenance, knowledge of semantic web technologies and linked open data are assests but not a must.\nInterest in supervising master and Ph.D. students\nInterest in guiding and managing research groups in national and international research projects\nCreative thinking & proactive working style\nExcellent skills in written and spoken English\nThe position is full-time. Salary is competitive and depends on qualifications and experience. We strongly encourage application with the goal of building up independent research groups.\nThe Digital Enterprise Research Institute, Galway (DERI,\nhttp://www.deri.ie/\n) is a world-wide leading research organization\nwhich actively advances research in this new domain. DERI offers a\nstimulating, dynamic, multi-cultural research environment with\nexcellent ties to research groups and industry worldwide. The\ninstitute is locate in Galway which is one of the most beautiful Irish\ncities shaped by artistic communities, active student life, innovative\nindustry and leading edge research. Galway is located at the beautiful\nwest coast of Ireland within the Galway Bay, 'between' Europe and the\nU.S., making it an ideal hub for national, European and international\nresearch.\nApplications should be sent to manfred.hauswirth@deri.org.",
  "speaker": "SYSTEM",
  "uuid": "a32afa8c-d8b8-4e8c-ad7e-e54c7c32d203"
}