{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD08-09 \n\nBE CAREFUL. LOOK AT THE QUESTIONNAIRE FIRST TO CHECK WHAT YOU HAVE TO DO!!\nif you need some translation about hydrography name have a look at this thesaurus\nhttp://www.iho.shom.fr/Dhydro/Html/site_edition/consultation.html\nFill in this questionnaire before 1/6/2009: Group 1 without the guideline:\nhttp://www.surveymonkey.com/s.aspx?sm=SgEaEMJxkJJoSNVwA6b2wA_3d_3d\n. Group 2 with the guidelines:\nhttp://www.surveymonkey.com/s.aspx?sm=RvPMaSPPPW_2bVlq9H4G27_2fg_3d_3d\nAssignment III. Fill in this questionnaire before 16/6/2009: Group 1:\nhttp://www.surveymonkey.com/s.aspx?sm=_2f8BieN3Hv6FVcuxLxxkm1A_3d_3d\n; Group 2:\nhttp://www.surveymonkey.com/s.aspx?sm=0qbGr9zOX3yYPNpm4qYmfg_3d_3d\nDeadline: to be decided\n26/5/2009. Presentation of ontology development assignment (Asun)\nToday students will present in groups of two people the work done during the methodological topic. Each group will have 7 minutes maximum for presentation and 3 for questions.\nAssignment:\nA compilation of the methodological assignments covering all the methodological topics and a ppt presentation\nAnswers to questionnaires related to the assignment, to the methodological part of the course, and to the NeOn Toolkit.\nDeadline: A compilation of the methodological assignments, the questionnaires and a ppt presentation must be sent to Asun and Mari Carmen before 24/5/2009 23:00 CET\nQuestionnaires to be filled are:\nNeOn Methodology Questionnaire\n,\nNeOn Toolkit Questionnaire\n2/6/2009.\nThis class is cancelled, due to the following seminar that will be taught the day before, and that we consider that you should attend if possible:\nQuery Answering over Expressive DL Ontologies\n9/6/2009. Application of Natural Language Techniques to Ontology Development (Lupe)\n8/6/2009. NEW\nThe class scheduled for 9/6/2009 will be substituted by the lecture that Prof. Ruslan Mitkov will deliver on MONDAY, June 8t, 2009. Students are highly encouraged to attend this lecture, if possible. Prof. MITKOV's lecture will be at 11:00, H. 1005, Bloque 1. A summary of the lecture can be found in\nProf.MITKOV\nResearch topics",
  "speaker": "SYSTEM",
  "uuid": "a33339c4-747a-49e4-87fd-339c1ab20ef6"
}