{
  "message": "SYSTEM: Poveda_et_al_ISWC_2010_vFinal.pdf: Página 11\nIn this section, we describe a subset of the recurrent pitfalls identified in Section 4 \nfollowing the template shown in Table 3. The pitfalls described in this section have \nbeen selected among the most recurrent ones. We will describe them in the following \norder, which corresponds to the alphabetical order followed in the catalogue (See \nSection 4): “P4. Creating unconnected ontology elements” (Table 4), “P9. Missing \nbasic information (Table 5), “P10. Missing disjointness” (Table 6), “P11. Missing \ndomain or range in properties” (Table 7), and. “P22. Using different naming criteria \nin the ontology” (Table 8).  \nTable 4. Pitfall “P4. Creating unconnected ontology elements” \nName \nP4. Creating unconnected ontology elements \nDescription \nThe pitfall consists in defining a part of the ontology that has no relation with the rest. These unconnected \nparts can be classes, relationships or attributes. \nRecommendation \nSome possible recommendations to avoid this pitfall are: \n \nWhen a new class is created, to verify whether it could be: \no \ndomain or range of at least a relationship, which can have been created or can be created later on. \no \ndomain of at least an attribute, , which can have been created or can be created later on. \no \nsubclass or superclass of another class, which can have been created or can be created later on. \n \nWhen a new relationship is created, to verify whether both its domain and range already exist in the \nontology or there are plans to create them. \n \nWhen a new attribute is created, to verify whether its domain already exists in the ontology or there \nare plans to create it.  \nExample \nIn the not recommended scenario, it is shown an ontology on football. In this case, we can observe that the \nrelationship “memberOfTeam” has been created defining its domain but not its range. Also, it should be \nnoted that there is not  a class that represents teams in the ontology. \nIn the recommended scenario, we have created the class “Team” and defined it as range of the relationship \n“memberOfTeam”. \nNot Recommended \nRecommended \n \n(domain and range of \n“memberOfTeam”) \n \n \nComments \nThis pitfall could be related to pitfall “P11. Missing domain or range in properties”. \n",
  "speaker": "SYSTEM",
  "uuid": "a57d611f-7400-4822-a4a3-e533ed345acb"
}