{
  "message": "SYSTEM: Semantic_Annotation_of_Geospatial_RESTful_Services_Using_External_Resources_v5.pdf: Página 14\nWith respect to the validation of output parameters (see Table 6), our system \nrecognizes 500 outputs that belong to the 39 services whose input parameters have \nbeen validated. This total of output parameters is divided into 264 whose \ncorrespondences can be found and 236 whose correspondences cannot be found.  \nWhile in the context of the input parameters we are interested in determining \nwhether we can call the service or not, in the case of output parameters, we are \ninterested in the precision and recall metrics of the annotation process. Hence, we \nhave generated a gold standard with the studied services in order to assign manually \nthe annotations that have to be produced for all output parameters of these services, \nand we have performed an evaluation of the results obtained from the system for the \nparameters that are found. Regarding the parameters that are found, our system \nannotates 183 of them automatically, from which 126 parameters are annotated \ncorrectly according to the gold standard, while 81 parameters are not annotated. This \nprovides us with an average value for precision and recall equal to 0.69 for both \nmetrics.  \n \nTo the best of our knowledge, there are no available results from existing research \nworks to compare our results against. Likewise, these preliminary results prove the \nfeasibility of our system and highlight that itis possible to carry out an automatic \nsemantic annotation of RESTful services. \n5 Conclusions and Future Work \nIn this paper we have proposed an approach to perform an automatic semantic \nannotation process of RESTful services. This process is implemented in a system that \ntakes into account the DBpedia ontology and its SPARQL Endpoint, for general \nannotation, and GeoNames and its SPARQL Endpoint for geospatial specific results, \nas well as different external resources such as synonyms and suggestion services. We \nuse combinations of these resources to discover meanings for each of the parameters \nof the RESTful services that a user may select and perform semantic annotations of \nthem. \nTo illustrate our work and guide the explanations of the proposed semantic \nannotation process we have used two exemplary RESTful services related to the \ngeospatial domain. Besides, we have presented some preliminary experimental results \nthat prove the feasibility of our approach, at least in the geospatial domain, and show \nthat it is possible to carry out a semantic annotation of RESTful services \nautomatically, again at least in this domain. \nFuture work will focus on the development of a GUI that will ease the introduction \nof existing services by users for their semantic annotation, probably incorporated in \nany existing RESTful semantic annotation tool/utility suite. Furthermore, we also plan \nto make improvements to the proposed system, related to the matching process and \nthe use of similarity metrics, so as to improve the results that have been demonstrated \nin our evaluation. In the same sense, we also aim at improving in the SPARQL \nqueries to DBpedia and other semantic resources that may be associated or not to a \nspecific domain to better explore the knowledge of this resource in the annotation \n",
  "speaker": "SYSTEM",
  "uuid": "a665c792-06df-4a20-a59c-0938faebf868"
}