{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 31\n \n \nPág. 33 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nCompartir infraestructuras y sistemas comunes para su aplicación en el sector \ninvestigador facilitando el desarrollo de nuevos componentes y el análisis de grandes \ncorpus documentales. \n \nCompartir servicios con otras instituciones del sector: Real Academia Española, Instituto \nde España, organismos iberoamericanos. \nMedidas: \n- Medida 1: Elaborar un plan de desarrollo de las plataformas de procesamiento de \nlenguaje natural y traducción automática de las Administraciones Públicas. \n- Medida 2: Clarificar el esquema competencial y de financiación que asegure su \nmantenimiento más allá de la vida del Plan. \n- Medida 3: Creación de una plataforma común de procesamiento del lenguaje natural y de \ntraducción automática para las Administraciones Públicas con los siguientes requisitos \nesenciales: \n \nFacilitar la puesta en marcha de servicios avanzados basados en procesamiento de \nlenguaje natural y traducción automática en la Administración General del Estado  \ny las Comunidades Autónomas.  \n \nDesarrollar una infraestructura escalable basada en componentes para el \nprocesamiento paralelo de grandes corpus documentales. \n \nMantener las garantías de confidencialidad propias de los servicios públicos. \n \nAgregar distintos componentes y recursos lingüísticos al flujo de procesamiento \nlingüístico con diferentes modelos de licenciamiento y  modos de ejecución del \nprocesamiento.  \n \nHerramientas comunes de anonimización, editores, post-edición de traducciones \nautomáticas, etc. \n \nEsta plataforma pondrá a disposición recursos lingüísticos de propósito general (Eje \n1) y específicos de dominio (principalmente aquellos recursos especializados \nnecesarios para el desarrollo de los proyectos verticales potenciados en el Eje 4). \n \nSerá un lugar para la explotación y estandarización de los recursos lingüísticos \ngenerados al amparo de la política de Reutilización de la Información del Sector \nPúblico (RISP). \n \nPermitirá distintos modelos de ejecución y distribución (embebido, cluster local, \nremoto y ejecución en centros de supercomputación). \n \nLínea 2: Recursos lingüísticos de las Administraciones Públicas y política de Reutilización de la \n",
  "speaker": "SYSTEM",
  "uuid": "a9f2fdee-c4a6-4910-b471-f51732643d9a"
}