{
  "message": "SYSTEM: Formulario-consulta-preliminar-mercado-PlanTL.pdf: Página 8\n2.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n2. Solución II\n2.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n2.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n2.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­8­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN II (marque esta casilla para habilitar los campos asociados a la solución II)\nversión 1.1.\n",
  "speaker": "SYSTEM",
  "uuid": "ac3a8476-f8f6-4fd8-b3c5-80b4c5f383ce"
}