{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 8\n \n \nPág. 10 \n \nPlan de Impulso de las Tecnologías del Lenguaje \n \nContexto \n2\n \n2.1 \nIntroducción a las tecnologías del lenguaje \nEl procesamiento del lenguaje natural es el camino hacia una comprensión automática cada vez \nmás profunda de la mayor producción humana: el lenguaje. El lenguaje es la forma más común y \nversátil de comunicación. Los sistemas informáticos procesan fácilmente datos, es decir, \ninformación que tiene una estructura y un significado único y explícito (información \nestructurada). Pueden manejar fácilmente tablas con millones de datos numéricos, por \nejemplo. Pero el lenguaje humano es mucho más complejo, sus significados pueden ser \nvariables según el contexto y hacer referencia a información no explícita. Sin embargo, el \nvolumen de información digital textual no estructurada es abrumador y crece vertiginosamente, \nresultando imperioso contar con ayudas para su explotación automática. \nA pesar de la dificultad, el grado de desarrollo de las tecnologías de procesamiento del lenguaje \nnatural permite hoy multitud de aplicaciones de utilidad, y su rápido desarrollo en la última \ndécada augura resultados cada vez más sorprendentes.  \nLas tecnologías de Procesamiento del Lenguaje Natural (PLN) y Traducción Automática (TA) son \nlas tecnologías que hacen posible analizar textos y facilitar su explotación en aplicaciones \ninformáticas de uso muy común en sectores tan dispares como la Sanidad, la Educación o el \nTurismo. Por ejemplo, la detección de entidades nombradas (nombres propios de personas o \nempresas, marcas de productos o topónimos), filtrado y clasificación de documentos, creación \nde resúmenes automáticos, extracción de información, análisis de sentimientos, minería de \nopinión, seguimiento y monitorización de la reputación en los medios sociales, corrección \nortográfica y gramatical, búsqueda inteligente y optimizada, sistemas de respuesta automática a \npreguntas y asistentes personales, la traducción automática de textos, etc. Todas estas \naplicaciones se pueden resumir como la explotación de información no estructurada que mejora \nla comprensión de textos en corpora documentales.  \nAplicadas de forma adecuada, estas herramientas de análisis textual pueden ayudar a las \nempresas y organizaciones a optimizar muchos de sus procesos productivos y obtener \nconocimiento muy valioso de su propia información y de aquella disponible en un mundo cada \nvez más digitalizado y global. Las tecnologías del lenguaje son una industria habilitadora que \nparticipa de forma horizontal en multitud de aplicaciones y dispositivos.  \n2.2 \nAnálisis de la situación actual \nEl sector de las tecnologías del lenguaje ha sido retratado en profundidad en diversos informes \nrecientes4. Se estima que el mercado mundial de las tecnologías del lenguaje tenía un volumen \naproximado de unos 19.300M € en 2011, y se prevé que en 2015 alcance los 30.000M €5. El \nmismo informe describe el estado actual del mercado en Europa constatando la existencia de \nmás de 500 empresas relacionadas con este sector. Se trata de PyMEs concentradas en el norte \n                                                           \n4 Elaborados por organizaciones como LT-Innovate, Meta-Net, Gartner, CRACKER and LT_Observatory. \n5 “LT2013: Status and Potential of the European Language Technology Markets”, LT-Innovate. \n",
  "speaker": "SYSTEM",
  "uuid": "ac65fe8d-cedf-417c-82d9-39c00b34527c"
}