{
  "message": "SYSTEM: Resoluci%C3%B3n_de_26_de_octubre_de_2009_del_Rector_de_la_Universidad_Polit%C3%A9cnica_de_Madrid.pdf: Página 10\n \n \n10\n    UNIVERSIDAD POLITÉCNICA DE MADRID \nCualquier ausencia del centro de aplicación de la ayuda, por razón de viaje, motivado \npor necesidad o conveniencia formativa, deberá ser solicitada al Vicerrector de \nInvestigación en el impreso al efecto disponible y aprobado previamente. \n10.8. El incumplimiento de cualquiera de estas obligaciones podrá significar la suspensión o \nla retirada de  la ayuda,  cuando  medie causa grave, a criterio del Vicerrectorado de \nInvestigación de la Universidad Politécnica de Madrid. \n10.9. Los beneficiarios tendrán derecho prioritario de acceso al programa propio de ayudas \na  la investigación de esta Universidad, específicamente a las convocatorias de \npresentación de ponencias y comunicaciones en Congresos y otras reuniones \ncientífico-técnicas y de publicación de artículos en revistas. \n10.10. Los beneficiarios, cuyo Director pertenezca a un grupo de investigación reconocido o \nen proceso de consolidación, serán considerados, durante el período de disfrute de la \nayuda, miembros temporales del grupo de investigación de acuerdo con los artículos \n5.1, 5.3 y 7.3 de la normativa de Reconocimiento de Grupos de Investigación \naprobada por el Consejo de Gobierno de 28 de octubre de 2004. \n10.11. El beneficiario de contrato en prácticas disfrutará de los derechos de carácter laboral, \nasí como los de Seguridad Social que se deriven de su contrato. \n \nUNDÉCIMO.- AFECTACIÓN DEL RÉGIMEN DE DERECHOS DE PROPIEDAD \nINTELECTUAL E INDUSTRIAL Y DIVULGACIÓN DE RESULTADOS \n \n11.1. Al beneficiario de estas ayudas le corresponden los derechos de propiedad intelectual \n(incluidos los posibles de propiedad industrial) derivados de su propia actividad \nformativa en la investigación, y de acuerdo con su contribución, establecidos en el \ntexto refundido de la Ley de Propiedad Intelectual, aprobada por Real Decreto \nLegislativo 1/96 de 12 de abril, en la Ley 11/1986 de 20 de marzo, de Patentes y \nmodelos de utilidad, según indica el Art. 25 e) y f) del Estatuto del Personal \nInvestigador en Formación, Real Decreto 63/2006, así como el artículo 103 de los \nEstatutos de esta Universidad.   \n11.2. Los beneficiarios, en el momento de su incorporación, suscribirán un documento de \ncesión de derechos de explotación a favor de la UPM, sin perjuicio de los derechos \neconómicos que les correspondan, según la normativa sobre Propiedad Intelectual \naprobada por el Consejo de Gobierno de esta universidad el 22 de diciembre de \n2005. \n11.3. Las actividades de difusión y divulgación de los resultados de la actividad \ndesarrollada por el beneficiario se ajustarán al tipo de proyectos de I+D asociado a la \nayuda: \na) En el proyecto europeo de I+D deberán estar de acuerdo con las cláusulas y los \nprocedimientos establecidos, en su caso, en el contrato con la Comisión Europea \ny con el acuerdo de consorcio firmados entre los participantes. \nb) Los procedimientos y requisitos que establezcan las convocatorias públicas de los \nprogramas nacionales o regionales de I+D. \nEn todo caso, se citará siempre la condición de beneficiario de esta ayuda para la \nformación de personal investigador del Programa Propio de la UPM. \n",
  "speaker": "SYSTEM",
  "uuid": "ae719b8c-89cd-49bd-ad78-39e82d2cd9dd"
}