{
  "message": "SYSTEM: D5.3.2.pdf: Página 25\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 25 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n\u0001 Four-phase waterfall ontology network life cycle model.  \nThis proposed model represents the stages of an ontology network, starting with the initiation \nphase and going through the design phase, the implementation phase to the maintenance \nphase. \nThe proposed model is shown in Figure 8, and the main purposes and outcomes for each \nphase in the model are the following: \n\u0002 \nInitiation Phase. In this phase it is necessary to produce an ontology requirement \nspecification document (ORSD) [ 11], including the requisites that the ontology network \nshould satisfy and taking into account knowledge about the concrete domain. Also in this \nphase the approval or rejection of the ontology network development should be obtained. \nThis phase has also as requisite to identify the development team and to establish the \nresources, responsibilities and timing (that is, the scheduling for the ontology project). \n\u0002 \nDesign Phase. The output of this phase should be both an informal model and a formal one \nthat satisfy the requirements obtained in the previous phase. The formal model can not be \nused by computers, but it can be reused in other ontology networks.  \n\u0002 \nImplementation Phase. In this phase, the formal model is implemented in an ontology \nlanguage. The output of this phase is an ontology implemented in RDF(S), OWL, or other \nlanguage that can be used by semantic applications or by other ontology networks.  \nIt is worth mentioning that the later two phases (design and implementation ones) are \nnormally performed in parallel when ontology development tools (such as NeOn toolkit, \nProtégé, etc.) are used. \n\u0002 \nMaintenance Phase. If, during the use of the ontology network, errors or missing knowledge \nare detected, then the ontology development team should go back to the design phase, in \nthis case. Additionally, in this phase the generation of new versions for the ontology \nnetwork should be also carried out. \n \nFigure 8. Four-Phase Waterfall Ontology Network Life Cycle Model \n\u0001 Five-phase waterfall ontology network life cycle model.  \nThis model, shown in Figure 9, extends the four-phase model with a new phase in which the \nreuse of already implemented ontological resources is considered. The main purpose in the \nReuse Phase is to obtain one or more ontological resources to be reused in the ontology \nnetwork being developed. The output of this reuse phase could be either an informal model or \na formal one to be used in the modeling phase; or an implemented model (in an ontology \nlanguage) to be used in the implementation phase. \n",
  "speaker": "SYSTEM",
  "uuid": "af27c27e-0e56-4df9-b7dc-e3e19c6d0453"
}