{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual28072011 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n. \nSe ha iniciado el análisis para la implementación del estudio de la semántica que emerge de las palabras claves de las listas de twitter de acuerdo a las relaciones que presentan dichas listas con los usuarios creadores, seguidores y listados. Esta semana se han estado evaluando frameworks para llevar acabo este analisis como: Lucene y jmt.\nCon respecto a la instalación de Sem4Tags:\nLa aplicación demo no funciona. Todo el software lo tengo en mi maquina para que funcione con el puerto 80, es decir tengo configurado el glassfish para que escuche por ese puerto 80.\nEl glassfish de deimos funciona por el puerto 80 (para conexiones externas) pero está configurado para que escuche por el puerto 8080. Intente cambiarlo al puerto 80, pero el servidor web empezó a sacar un error. Lo que me lleva a concluir que hay un servicio usando el puerto 80 y de alguna manera las solicitudes al puerto 8080 se redirigen al puerto 80 (esto ultimo es especulación mia).\nEsto me genera un problema porque los servicios web los desplegué para que usaran el puerto 80; cuando se acceden desde otra maquina funcionan. Cuando se accede a ellos desde la misma maquina de deimos no funcionan porque internamente están en el puerto 8080.\nPor lo tanto, cuando la aplicación web instalada en el servidor de deimos intenta usar uno de los servicios web en el puerto 80, no los encuentra porque internamente estan en el puerto 8080.\nTenemos dos opciones: 1) que configuren el glassfish para que escuche por el puerto 80 y garanticen que el servidor web (glassfish) sigue funcionando, o 2) ponerme a modificar el código para encontrar la forma de que esto funcione.\nGeneración de POIs\n- Con respecto a la obtención de POIs de los lugares seleccionados para el caso de uso (Gran Vía, Tres Cantos y Zaragoza), hemos realizado una nueva pasada sobre los datos de spain.info filtrándolos con estas localizaciones. \n    - Los POIs de alojamientos obtenidos con este filtrado superan los 200.\n    - Georreferenciación de POIs\nAsimismo, se han realizado las siguiente tareas:\n- Análisis de los servicios de catastro a utilizar para completar la infomración de plantas\n    - Incorporación manual de la información de plantas a los nuevos POIs.\n    - Planificación - Adquisición de información de plantas de los servicios de catastro y enriquecimiento de POIs. Prevemos que la automatización de este proceso  nos llevaría entre 1,5 y 2 semanas.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nTarea 2.3\n\n- Se ha definido los modelos de información que dan lugar a las ontologías del sistema.\n- Se ha completado la ontología para recursos EC2, partiendo de la ontología \"\nec2.owl\n\" del proyecto \"\nUnifiedcloud\n\".\nTarea 1.4\n\nTarea 7.1\n\n- Generación de ontología sobre alojamientos\n- Creación de ficheros r2o\n- Generación de RDF alojamientos",
  "speaker": "SYSTEM",
  "uuid": "af410487-a554-46e2-b4b5-110ba03ec5c4"
}