{
  "message": "SYSTEM: D5.3.2.pdf: Página 31\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 31 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n4.  Guidelines for Scheduling: Obtaining the Ontology Network Life \nCycle  \nScheduling [ 12,  13] refers to the activity of identifying the different processes and activities to be \nperformed during the ontology development, their arrangement, and the time and resources \nneeded for their completion. Thus, this activity includes as an important task the establishment of \nthe ontology network life cycle that is the specific ordered sequence of processes and activities \nthat software developers and ontology practitioners carry out during the life of the ontology \nnetwork.  \nThe goal of scheduling is to organize the different processes and activities in time, that is to state a \nconcrete programming or scheduling to guide the ontology network development, including \nprocesses and activities, their order, and time and human resources restrictions.  \nTo establish the concrete schedule for the ontology network development, three important \nquestions have to be answered:  \n1) Which ontology network life cycle model is the most appropriate for the ontology network \ndevelopment?  \n2) Which particular processes and activities should be carried out in the ontology network \ndevelopment?  \n3) How much resources (human and time) are needed for the development of the ontology \nnetwork? \nThe first two questions are related to the establishment of the ontology network life cycle, and their \nresponses would result in a general plan for the ontology network development. The third question \nis related to the inclusion of time and human resources restrictions, and its response would result \nin the concrete schedule for the ontology network development.  \nTo respond to the two first questions, an initial collection of ontology network life cycle models and \nsome guidelines for selecting the most appropriate model and choosing the processes and \nactivities were presented in [ 10,  14]. Once software developers and ontology practitioners have \ntaken these decisions, they obtain (by mapping the selected ontology network life cycle model and \nthe selected processes and activities, and then placing in order such processes and activities) the \nparticular life cycle for their ontology network development. That is, the ordered sequence of \nprocesses and activities to be carried out during the life of the ontology network.  \nAfter that, software developers and ontology practitioners can answer the third question by \nincluding in the ontology network life cycle information about time and people to obtain the \nconcrete scheduling. The information about how many people should be involved in the ontology \nnetwork development can be obtained using the ONTOCOM model [ 7]. This is a cost estimation \nmodel, whose goal is to predict the costs (expressed in person months) arising in typical ontology \nengineering processes.   \nTaking into account the update of the ontology network life cycle models, presented in Section  3.2, \nand the results from preliminary experiments (to be presented in deliverable D5.6.2) in which the \ninitial guidelines presented in [ 10,  14] were used, in this chapter we update the scheduling \nguidelines. We also describe them by including the corresponding filling card and a workflow that \nrepresents the guidelines, following the same style we used in [ 10] for describing activity or \nprocess guidelines. \nIn the context of the NeOn methodology for building ontology network, we propose the filling card, \npresented in Figure 15, for the scheduling activity; the filling card includes the definition, goal, \n",
  "speaker": "SYSTEM",
  "uuid": "b345d0c2-617f-4d76-9895-722f3180fc09"
}