{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/MasterRD11-12 \n\nAll hands-on activities must be submitted by e-mail to ontologies@delicias.dia.fi.upm.es\nThe objective of this hands-on activity will be the design and implementation of a lightweight ontology network to be used for linked data generation, taking into account open and public data in Spanish, the transformation of some of the selected data sources into RDF according to such ontology network, and the linkage of these data sources with resources from the Web of Data (e.g., DBPedia [1], GeoLinkedData [2], GeoNames [3], etc.).\nEach team has to select one of the data sources made available in the following list (those are coming from\nhttps://datospublicos.jottit.com/\n,\nhttp://alarcos.esi.uclm.es/per/fruiz/pobesp/\n,\nhttp://datos.gob.es/\nand\nhttp://eufunds.ftdata.co.uk/\n):\nCenso Nacional de Instalaciones deportivas\n. Students must select at least 10 cities from there, which can be discussed with us, whose data should be transformed.\nOpen data\navailable at this site. Students can select the tables that they want to transform (Muncipios, Islas, Provincias, Population, etc.). At least 5 tables should be transformed by students, who have to discuss this with us, so that we can avoid overlaps between them.\nIncidencias de tráfico\n(traffic issues) in Spain. Students should select 5 tables, which can be discussed with us, so that we can avoid overlaps between them.\nFinancial Times EU Funds Database\n. Students can select one or several cities, companies, organisations, etc., from Spain, and obtain data from this online database. Once taken, as this data can be downloaded in CSV format, it has to be transformed.\nWe will value more those solutions that are more general and that allow regenerating the data without any manual intervention if there is a change in the data sources.\nThe ontology can be implemented with any of the following tools: Jena [4], NOR2O [5] and the NeOn Toolkit [6].\nFinally, once that you have selected the data sources that you want to publish, you must notify them by e-mail to us, so that we record your decision and can avoid overlaps with others.\n[1]\nhttp://dbpedia.org/\n[2]\nhttp://geo.linkeddata.es/\n[3]\nhttp://www.geonames.org/\n[4]\nhttp://jena.sourceforge.net/\n[5]\nhttp://code.google.com/p/nor2o/\n,\nhttp://mayor2.dia.fi.upm.es/index.php/es/technologies/57-nor2o\n[6]\nhttp://www.neon-toolkit.org/\nResearch topics\n\nLinked Data lifecycle\nDistributed SPARQL querying\nSemantic sensor networks\nOWL Debugging\nOntology Design Patterns\nOntology Reuse\nTransformation of Knowledge-aware Resources\nRecommended reading (Ontology Matching):\nJ.Euzenat \"Tutorial on Ontology Matching\" (at least the section titled \"Matching problem\").\n[12]\nJorge Gracia begin_of_the_skype_highlighting     end_of_the_skype_highlighting begin_of_the_skype_highlighting     end_of_the_skype_highlighting and Eduardo Mena, \"Web-based Measure of Semantic Relatedness\", Proc. of 9th International Conference on Web Information Systems Engineering (WISE 2008), Auckland (New Zealand), Springer Verlag LNCS, volume 5175, pp. 136-150, September 2008.\n[13]\nSlides: 2.\nSemantic Measures and Ontology Matching: an Overview and some Examples",
  "speaker": "SYSTEM",
  "uuid": "b61ce381-73b4-4d81-a03c-0b66f73402a1"
}