{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 84\nPage 84 of 124\nNeOn Integrated Project EU-IST-027595\nTable 5.1: Pattern for Re-engineering a term-based thesaurus which follows the\nrecord-based model(continued)\nSlot\nValue\nGeneral\nThe generated ontology will be based on the lightweight ontology architectural pattern\n(AP-LW-01)[SFBG+07]. Each thesaurus term is mapped to a class. A subClassOf relation\nis deﬁned between the new classes for the BT/NT relation. A relatedClass relation is\ndeﬁned between the new classes for the RT relation. A equivalentClass relation is deﬁned\nbetween the new classes for the UF/USE relation.\nGraphical Representation\n(UML) General Solution\nOntology\n(UML) Example Solution\nOntology\nPROCESS: How to Re-engineer\nGeneral\n1. Identify the records which contain thesaurus terms without a broader term.\n2. For each one of the above identiﬁed thesaurus terms ti:\n2.1. Create the corresponding ontology class, Ci class, if it is not created yet.\n2.2. Identify the thesaurus term, tj, which are narrower terms of ti. They are refer-\nenced in the same record which contains ti.\n2.3. For each one of the above identiﬁed thesaurus term tj:\n2.3.1. Create the corresponding ontology class, Cj class, if it is not created yet.\n2.3.2. Set up the subClassOf relation between Cj and Ci\n2.3.3. Repeat from step 2.2 for cj as a new ci\n2.4. Identify the thesaurus term, tr, which are related terms of ti. They are refer-\nenced in the same record which contains ti.\n2.5. For each one of the above identiﬁed thesaurus term tr:\n2.5.1. Create the corresponding ontology class, Cr class, if it is not created yet.\n2.5.2. Set up the relatedClass relation between Cr and Ci\n2.5.3. Repeat from step 2.4 for cr as a new ci\n2.6. Identify the thesaurus term, tq, which are equivalent terms of ti. They are\nreferenced in the same record which contains ti.\n2.7. For each one of the above identiﬁed thesaurus term tq:\n2.7.1. Create the corresponding ontology class, Cq class, if it is not created yet.\n2.7.2. Set up the equivalentClass relation between Cq and Ci\n2.7.3. Repeat from step 2.6 for cq as a new ci.\n",
  "speaker": "SYSTEM",
  "uuid": "b79fd1ef-a6af-4141-ab27-df8d39d94958"
}