{
  "message": "SYSTEM: Ejercicios.pdf: Página 19\nEnunciados de Marcos \n______________________________________________________________________ \n______________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n19 \n \n \nINTELIGENCIA ARTIFICIAL    Plan 96 \nJunio  2007                            Final \nEjercicio nº 1  (3 puntos)   (45 minutos).   \n \nSupóngase que una compañía desea formalizar las tareas implicadas en un plan. Los \ntipos de tareas son: tareas de gestión, tareas de investigación, tareas de marketing y \ntareas de control. Los planes se clasifican en los mismos tipos que se han clasificado las \ntareas. Se sabe que: \n los planes y las tareas son disjuntos. \n un plan de gestión tiene asociado una tarea de gestión, entre otras.   \n las tareas de control son únicamente: tareas de comienzo, de finalización y tareas \nsecuenciales. \n una tarea concreta solo puede estar en una de estas categorías.   \n Un plan de investigación es parte de un proyecto de investigación y que el plan de \ninvestigación está compuesto por un plan teórico y experimental. \n Un plan puede estar en uno de los siguientes estados: aceptado, rechazado, en \nproceso de revisión.  \n \n1. Representar que las tareas son: tareas de gestión, tareas financieras, tareas de \nmarketing y tareas de control.  (0,2 puntos) \n2. Representar que los planes son: planes de gestión, planes financieros, planes de \nmarketing y planes de control. (0,2 puntos) \n3. Representar que los planes y tareas son disjuntos. (0,2 puntos) \n4. Representar  que las tareas de control son únicamente: tareas de comienzo, de \nfinalización y tareas secuenciales y que una tarea concreta solo puede estar en una \nde estas categorías. (0,2 puntos) \n5. Representar que un plan de gestión tiene asociado una tarea de gestión, entre otras.  \n(0,2 puntos) \n6. Representar que el Plan-1 es un plan de marketing y que la tarea Tarea-1 es una \ntarea de marketing, y que el Plan-1 tiene asociado la Tarea-1. (0,2 puntos) \n7. Representar que el departamento financiero lleva a cabo un plan financiero para el \ndepartamento de Marketing.  (0,5 puntos) \n8. Representar que un plan de investigación está compuesto por un plan teórico y otro \nexperimental. (0,2 puntos) \n9. Representar que un plan de investigación es parte de un proyecto de \ninvestigación(0,2 puntos) \n10. Representar que los planes experimentales y teóricos son parte del proyecto de \ninvestigación suponiendo la relación parte-de transitiva y la modelización de los \napartados ocho y nueve. (0,3 puntos) \n11. Representar que los planes experimentales y teóricos son parte del proyecto de \ninvestigación suponiendo la relación parte-de no es transitiva y la modelización de \nlos apartados ocho y nueve. (0,3 puntos) \n12. Representar el estado del plan como propiedades (0,1 puntos) \n13. Representar el estado del plan como marcos. (0,2 puntos) \n  \n \n",
  "speaker": "SYSTEM",
  "uuid": "b8628c5e-a97b-4421-9963-7a91ec7dce2d"
}