{
  "message": "SYSTEM: ORequirementsSpecification.pdf: Página 13\n3   Experimentation  \nBoth the methodological guidelines and the ORSD template presented in this paper \nhave been used in the NeOn project and in the development of ontologies in other \nresearch and educational projects with positive feedback and interesting comments \nfrom the ontology developers involved in each case. In this section we briefly \nsummarize a set of such cases, presenting qualitative results13. \nThe invoice use case, whose main aim is to solve the lack of interoperability \nbetween invoice emitters and receivers; and the nomenclature use case, whose main \nobjectives are to help in the systematization of the creation, maintenance and keeping \nup-to-date drug-related information, and to allow an easy integration of new drug \nresources, within the NeOn project [16, 7]. Ontology developers in both use cases \nprovided positive feedback about the usefulness of the guidelines, the goodness of \nwriting an ORSD prior to the ontology development, and the benefits of using the \nORSD as input to other activities (e.g., reuse of knowledge-aware resources and \nontology verification). Moreover, ontology developers realized the importance of \nhaving guidelines for the ontology requirements specification. However, they \ncommented that examples on how to use the guidelines would be very useful for \nunderstanding and applying such guidelines in a better way. \nThe development of ontologies representing the knowledge related with the \n“Camino de Santiago” (Saint James’s Way) in the Geobuddies14 project. Ontology \ndevelopers included, besides the previous advantages, the usefulness of the pre-\nglossary of terms during the ontology reuse process and the conceptualization \nactivity. \nThe hands-on session during the Sixth Summer School on Ontologies and \nSemantic Web15, in which we tested the combination of the ontology requirements \nspecification activity and the ontology reuse process using Watson with 50 students. \nIn this case, we obtained a very positive feedback from most of the students who \ncarried out the hands-on. They stated that the proposed guidelines were useful, and \nthat they would like to use anew such guidelines in future ontology developments. \nThey also expressed that the writing of the ORSD before going into the ontology \ndevelopment was by no means a waste of time, and that the ORSD was useful in the \nontology development. \nTwo experiments to test the benefits of using the ontology requirements \nspecification guidelines proposed in this paper were carried out with students at UPM \nduring the academic years 2007-2008 and 2008-2009. Such experiments were \nperformed within the “Artificial Intelligence (AI)” master course at Facultad de \nInformática (Universidad Politécnica de Madrid) with master students whose \nbackgrounds included databases, software engineering, and artificial intelligence, but \nnot ontology engineering. One of the experiments was carried out during November \n2007 with 14 master students working in groups of two people; the other was \nperformed during November 2008 with 12 master students working in groups of one \n                                                           \n13 Quantitative results are not provided because to test the same real case using the proposed \nguidelines and without the guidelines is not feasible due to the effort needed.  \n14 http://www.geobuddies.net \n15 http://kmi.open.ac.uk/events/sssw08/ \n",
  "speaker": "SYSTEM",
  "uuid": "b8d34214-d080-4537-8f34-29d134b18ac1"
}