{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 63\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 63 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n4. Scenarios for Building Ontology Networks \nWithin the NeOn project, ontology networks need to be developed in three use cases:  \n In WP7, FAO is building an ontology network for the Fishery use case by means of reusing \nproprietary knowledge resources, such as data bases and thesauri. \n In WP8, iSOCO is building an ontology network for the Invoicing Management use case from \nscratch, but they need to reengineer existing knowledge models into ontologies. \n In WP8, ATOS is building an ontology network for the Nomenclator use case by means of \nreusing non-proprietary ontologies and standards.  \nBased on the analysis of the NeOn use cases, on the different studies carried out to revise the \nstate of the art of ontology development and on the building of ontologies in different international \nand national projects (Esperonto, Knowledge Web, SEEMP, SEKT, etc.), we have detected that \nthere are different ways or paths to build ontologies and ontology networks.  \nIn the most well-known ontology engineering methodologies (METHONTOLOGY, On-To-\nKnowledge and DILIGENT) the scenarios for building ontologies are very rigid. In this chapter, we \nprovide flexibility to the ontology network development by means of presenting different alternative \nways or possibilities for building networks of ontologies. \nFigure 20 presents a set of 8 scenarios for building ontology networks. This set of scenarios is not \nexhaustive, although we think it covers the most plausible ways for building ontology networks. In \nthis figure, activities to be carried out are represented by circles or by rounded boxes. Numbered \ndirected arrows represent the different scenarios presented in this chapter. The figure also shows \n(as dotted boxes) existing resources and possible outputs (implemented ontology networks and \nalignments) following some of the presented scenarios. \nThis chapter includes, as independent sections, the most common scenarios (shown in Figure 20) \nthat may arise during the ontology network development: \n Scenario 1: Building ontology networks from scratch without reusing existing resources. \n Scenario 2: Building ontology networks by reusing non ontological resources. \n Scenario 3: Building ontology networks by reusing ontologies or ontology modules. \n Scenario 4: Building ontology networks by reusing and reengineering ontologies or ontology \nmodules. \n Scenario 5: Building ontology networks by reusing and merging ontology or ontology \nmodules. \n Scenario 6: Building ontology networks by reusing, merging and reengineering ontologies \nor ontology modules. \n Scenario 7: Building ontology networks by restructuring ontologies or ontology modules. \n Scenario 8: Building ontology networks by localizing ontologies or ontology modules. \nThe activities of knowledge acquisition and elicitation, documentation, configuration management, \nevaluation and assessment (as shown at the bottom of Figure 20) should be carried out during the \nwhole ontology network development. \nIt is worth mentioning that scenario 2 can be combined with scenarios 3-7; and that scenario 8 can \nbe carried out or not with scenarios 1-7. \n",
  "speaker": "SYSTEM",
  "uuid": "bcaa697a-a367-463e-b73e-67348f8c4549"
}