{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 30\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11179\n7.  La documentación de las solicitudes desestimadas o denegadas podrá retirarse \npor los interesados en el plazo de tres meses a partir de la publicación en el Boletín Oficial \ndel Estado de la resolución de concesión de las ayudas; pasado ese plazo, aquellas \nsolicitudes que no hayan sido recogidas serán destruidas.\nArtículo 60.  Evaluación y selección de las solicitudes.\n1.  Una vez finalizada la revisión administrativa de las solicitudes, el órgano concedente \ncomunicará a los Tutores de las plazas susceptibles de asignación de ayuda que pueden \nacceder a la base de datos donde se encuentra la información de todos aquellos candidatos \nque han solicitado la plaza que les afecte.\n2.  En el plazo de 15 días naturales desde la fecha de notificación, los Tutores deberán \nremitir al órgano concedente, siguiendo las instrucciones recibidas al efecto, una relación \npriorizada de todos los solicitantes y las razones de dicha priorización, que se justificará \nmediante un breve informe. La elaboración de la relación priorizada deberá basarse en los \nsiguientes criterios:\na)  Expediente académico del candidato (hasta un máximo de 3 puntos).\nb)  Nota media de las calificaciones de las cinco asignaturas que tienen mayor relación \ncon el tema de la beca (hasta un máximo de 3 puntos).\nc)  Experiencia adecuada al tema de la beca, publicaciones, cursos y otros méritos \n(hasta un máximo de 4 puntos) Si alguno o todos los solicitantes se considera inadecuado, \nse hará constar en el informe.\n3.  El Director General del INIA designará una Comisión de Evaluación, presidida por \nla Subdirectora General de Prospectiva y Coordinación de Programas e integrada por \nexpertos y por un funcionario del INIA, que actuará como secretario, que efectuará la \nselección de los candidatos y elevará al Director General la relación de candidatos \nseleccionados y de reserva.\n4.  La Comisión de Evaluación evaluará las solicitudes de acuerdo con los siguientes \ncriterios:\na)  Informe del tutor (hasta un máximo de 5 puntos).\nb)  Adecuación del Currículo Vital del candidato (hasta un máximo de 5 puntos).\nArtículo 61.  Trámite de audiencia y propuesta de resolución.\n1.  De acuerdo con lo establecido en el artículo 7 el órgano concedente publicará en \nla página web del INIA la propuesta de resolución provisional, que contendrá la relación \nde los candidatos seleccionados y de reserva, y los Centros de I+D de adscripción, \nconcediendo a los interesados, un plazo de 10 días hábiles desde la fecha de publicación \nen la página web para que puedan formular las alegaciones que estimen oportunas. \nAdicionalmente, se enviará una copia de este escrito de alegaciones, con el \ncorrespondiente sello de presentación en un registro válido en plazo, al fax 91 3473931 \nen la fecha de presentación del mismo. Los interesados, con propuesta estimatoria, de \nno contestar en dicho plazo, se entenderá que aceptan las condiciones y términos de la \npropuesta de concesión de la ayuda.\n2.  Examinadas en su caso las alegaciones presentadas por los interesados, se \nformulará la propuesta de resolución definitiva, que incluirá la relación de candidatos \nseleccionados y de reserva.\nArtículo 62.  Pago de las ayudas.\n1.  Durante el periodo de beca, el pago de la misma a los investigadores beneficiarios \nse realizará mensualmente, en función del número de días que el personal investigador en \nformación esté de alta, considerándose en todos los casos meses de 30 días, y de acuerdo \ncon el cumplimiento de las instrucciones que establezca en su caso el órgano instructor. \nLa dotación de la beca será abonada directamente por el INIA a los beneficiarios, \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "bd65560a-e902-4175-a48c-1bc683b27e31"
}