{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 28\n26\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nhaps no clarity about what a data scientist is). While linguists, including translators, may not be in short sup‐\nply, there will be increasing need for linguists with technical LT skills. For both mathematics and linguistics,\nthe shortage is, or soon will be, of technical skills that can be deployed in commercial (rather than academ‐\nic) environments. Technology training in translation degrees is focused on last‐century technology such as\nTranslation Memory. The industry should consider developing a certification protocol that covers the range\nof technical skills needed across the range of technologies.\nValuable LT business proposition\nAs already proven several times, having the best product and the right technology is not enough; the prop‐\ner marketing and sales strategy need to be defined and implemented. Cases such as Betamax vs. VHS\ndemonstrated that a deficient technology could become the consumer leader. In the case of language tech‐\nnology, there is little awareness of how LT can be used in organisations to assist in information management\nand decision‐making. Although lately some successful cases have already starting to appear in the market,\nmany IT managers are still relatively unaware of the benefits that LT can provides them.\nIf there is no a clear business case but only technology advantages, companies from the demand side will\nnot buy in. In this way, a classic problem in IT remains: IT suppliers need to speak the language of business.\nMoreover, suppliers also have difficulty reaching the right people at customer organizations, and difficulty\nfinding a common language for communication with business partners.\nSuppliers, LT vendors and IT integrators should work closer and harder to identify killer business cases,\nincrease market awareness and deploy market strategies understanding how economic return affects clients,\ndeveloping modular/incremental products, and forging cross‐industry alliances for to strengthen market\nchannels.\n",
  "speaker": "SYSTEM",
  "uuid": "bd7f393c-356c-4a7f-8367-6d8e1277553f"
}