{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Galmar2011 \n\nProject Research Interns (2 positions)\nThe Digital Enterprise Research Institute (DERI) is among the largest research organisations working in Semantic Web technologies. DERI's mission is to establish semantics as a core pillar of modern computer engineering. DERI offers a timulating, dynamic, multi-cultural research environment with excellent ties to research groups worldwide. This is a unique opportunity to join the efforts within DERI: during this internship you will develop and implement advanced querying technologies based on semantic technologies.\nThe duration of the internships will be for 3 months, commencing some time between June 1st and August 31st 2011.\nThe Topics: \nBoth internship topics will be centred around Semantic Web technologies, in particular (i) the integration of RDF and XML, and (ii) efficient mechanisms for search and querying over Linked Data.\nThe Candidates:\nAbility to work in a team based environment developing state of the art software solutions on time and to specification\nMotivated and proactive attitude to take ownership and initiative in all work assignments\nExcellent analysis and problem solving skills\nStrong design, development & testing skills\nExcellent communication skills, verbal and written\nCreative Thinking\nEssential Skills:\nThird level degree in computer science or related discipline (advanced undergrad students which comply with the skills equirements will also be considered)\nGood knowledge of object-oriented design principles\nStrong background in Java programming\nFamiliarity with Unix/Linux systems\nBonus Skills:\nExperience with Semantic Web technologies, esp. RDF/RDFS/OWL/(X)SPARQL\nFamiliarity with XML and/or SQL\nExperience working with Linked Data\nApplication procedure:\nInformal enquiries about these positions may be made to:\naidan.hogan@deri.org\n(cc:ed) alessandra.mileo@deri.org\nWhen applying, please use the same email addresses and put \"Project\nResearch Intern\" in the subject line of emails.\nCandidates are requested to submit a cover letter and CV (PDF).\nClosing date for receipt of applications is April 30, 2011.**\nAnnouncement available at\nhttp://www.deri.ie/about/jobs/#intern2",
  "speaker": "SYSTEM",
  "uuid": "c0cd9730-f3a9-4260-853e-8149960ef325"
}