{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/SEALS-EvaluatingClassifiers \n\nEl plan de trabajo se ha divido en etapas con el objetivo de ir incrementando gradualmente la complejidad de los procesos que se han de llevar a cabo.  En la primera etapa se va a trabajar con los conjuntos de datos en su versión actual, es decir ficheros csv. En esta primera etapa los clasificadores  no deberán ser modificados. En la segunda etapa se trabajará con conjuntos de datos representados en RDF, y por tanto los clasificadores deberán ser modificados para recibir y producir ficheros en este lenguaje. Además se pretende introducir parámetros que modifiquen el clasificador. Finalmente en una tercera etapa se implementará el proceso de evaluación usando cross-validation. El plan de trabajo se evaluará semanalmente y los objetivos serán revisados de acuerdo al avance semanal.\nLa primera etapa tendrá como objetivo definir la evaluación (proceso, datos de entrada y resultados a obtener) así como añadir un nuevo tipo de herramienta al\nRuntime Evaluation Service\nque de soporte al uso del clasificador. Esta etapa consta de las siguientes fases y actividades:\nDefinir test data sets:\nCrear repositorio local para datos de prueba – (Andrés, Miguel Ángel)\nDefinir estructura de los test data sets y de los metadatos asociados (Andrés, Raúl)\nCrear test data sets siguiendo la estructura definida (Andrés)\nRegistrar los conjuntos de datos de prueba - (Andrés, Miguel Ángel)\nDefinir resultados:\nCrear repositorio local de resultados – (Miguel Ángel)\nDefinir estructura de los resultados así como de los metadatos asociados – (Andrés, Raúl)\nDefinir interpretación de los resultados – (Andrés)\nDefinir nuevo tipo de herramienta para el clasificador:\nDefinir interfaz del clasificador (datos de entrada + parámetros de configuración) (Andrés, Miguel)\nEmpaquetar el clasificador:\nImplementar\ntool wrapper\n(Andrés)\nCrear\ntool package\npara el wrapper (Andrés, Miguel)\nImplementar cliente parar verificar la validez del\ntool package\nusando las utilidades del\nRuntime Evaluation Service\n(Andrés, Miguel)\nIntegrar nuevo tipo de herramienta en\nRES Worker\n:\nDefinir interfaz de servicio para el uso del clasificador en el\nRES Worker\n(Andrés, Miguel)\nImplementar extensión del\nRES Worker\npara el uso del clasificador según la interfaz de servicio anterior (Miguel)\nVerificar funcionamiento del clasificador en\nRES Worker\nlocalmente:\nDesplegar localmente el\nRES Worker\ny la extensión para el uso del clasificador (de manera que se use la instancias locales de los repositorios de datos y resultados) (Andrés, Miguel)\nDesplegar\ntool package\nen el\nRES Worker\nlocal (Andrés, Miguel)\nImplementar pruebas de integración usando\nSoapUI\npara verificar la ejecución del clasificador vía\nRES Worker\n(Andrés, Miguel)\nCrear evaluación:\nDiseñar proceso de evaluación (Andrés)\nImplementar proceso como un workflow\nBPEL\n(Andrés, Miguel)\nValidar el workflow\nBPEL\nusando\nApache ODE 1.3.5\n(Andrés, Miguel)\nCrear\nevauation description\n(Andrés, Miguel)\nIntegrar nuevo tipo de herramienta en\nRES Core\n:\nImplementar extensión del\nRES Core\npara el uso del clasificador según la interfaz de servicio anterior (Miguel)\nVerificar funcionamiento de la evaluación en\nRES Core\nlocalmente:\nDesplegar localmente el\nRES Core\ny la extensión para el uso del clasificador (Andrés, Miguel)\nDesplegar\nevaluation description\nen el\nRES Core\nlocal (Andrés, Miguel)\nImplementar pruebas de integración usando\nSoapUI\npara verificar la ejecución de la clasificador vía\nRES Core\n, mockeando el RES Worker (Andrés, Miguel)\nEjecución local de la evaluación con el clasificador a través del\nRuntime Evaluation Service\n:\nImplementar proyecto\nSoapUI\npara lanzar ejecuciones de la evaluación con el clasificador (Andrés, Miguel)\nPuesta en producción:\nDesplegar repositorio de datos en entorno de preproducción de SEALS (Equipo SEALS)\nDesplegar repositorio de resultados en entorno de preproducción de SEALS (Equipo SEALS)\nDesplegar RES y extensiones para el uso del clasificador en entorno de preproducción de SEALS (Equipo SEALS)\nVerificación del entorno de producción (Andrés, Equipo SEALS)\nDesplegar\ntool package\nen el\nRES Worker\n(Andrés, Equipo SEALS)\nDesplegar\nevaluation description\nen el\nRES Core\n(Andrés, Equipo SEALS)\nRegistrar datos de prueba en el repositorio de datos (Andrés, Equipo SEALS)\nClonar el proyecto\nSoapUI\npara lanzar ejecuciones de la evaluación con el clasificador usando el entorno de producción (Andrés, Miguel)\nLa segunda etapa consistirá en ejecutar las evaluaciones usando el\nSEALS Service Manager\nsin virtualización. Esta etapa consta de las siguientes fases y actividades:\nEmpaquetar evaluación:\nDefinir vocabulario para la evaluación (Andrés, Nandana, Miguel)\nImplementar\nevaluation description descriptor'\nItalic text\n(Andrés, Nandana, Miguel)\nCrear\nevaluation description bundle\n(Andrés, Nandana, Miguel)\nValidar evaluación empaquetada usando el\nSEALS Service Manager\nlocalmente:\nDesplegar localmente el\nSSM ES\n(Andrés, Nandana)\nDesplegar localmente el\nSSM IMS\n(Andrés, Nandana)\nConfigurar\nSSM IMS\npara que no use virtualización (Andrés, Nandana)\nConfigurar el\nSSM ES\npara que use el\nevaluation description bundle\n(Andrés, Nandana)\nImplementar pruebas de integración usando\nSoapUI\npara verificar el uso de la evaluación empaquetada vía\nSSM ES\n, mockeando\nRES Core\ny repositorio de datos (Andrés, Nandana)\nEjecución local de la evaluación con el clasificador a través del\nSEALS Service Manager\n:\nImplementar proyecto\nSoapUI\npara lanzar ejecuciones de la evaluación con el clasificador (Andrés, Nandana)\nPuesta en producción:\nDesplegar el\nSSM ES\nen entorno de preproducción de SEALS (Nandana)\nDesplegar el\nSSM IMS\nen entorno de preproducción de SEALS (Nandana)\nVerificación del entorno de producción (Andrés, Equipo SEALS)\nConfigurar\nSSM IMS\npara que no use virtualización (Andrés, Nandana)\nConfigurar el\nSSM ES\npara que use el\nevaluation description bundle\n(Andrés, Nandana)\nClonar el proyecto\nSoapUI\npara lanzar ejecuciones de la evaluación con el clasificador (Andrés, Nandana)\nLa tercera etapa consistirá en ejecutar las evaluaciones usando el\nSEALS Service Manager\nusando virtualización. Esta etapa consta de las siguientes fases y actividades:\nPreparación de la imagen para el clasificador:\nCreación de una máquina virtual en\nVMWare vSphere\n(Andrés, Alcázar)\nDesplegar\nRES Worker\nen la máquina virtual (Andrés)\nConfigurar\nRES Worker\npara que use los repositorios del entorno de producción (preproducción de SEALS) (Andrés)\nDesplegar\ntool package\nen el\nRES Worker\n(Andrés)\nVerificación de la instalación usando material anterior (Andrés)\nPuesta en producción:\nConfigurar\nSSM IMS\npara que no use la imagen de la herramienta (Andrés, Nandana)\nClonar el proyecto\nSoapUI\npara lanzar ejecuciones de la evaluación con el clasificador desplegado en la imagen (Andrés, Nandana)\nDe manera adicional se proponen la mejora del clasificador para el consumo y generación de datos en RDF en vez de CSV, así como la aplicación del proceso de cross-validation mediante el desarrollo y uso de un mecanismo para el registro automático de datos de prueba así como de generación de peticiones de ejecución que usen dichos datos de prueba. Será necesario así mismo desarrollar de un cliente que se encargue de realizar la agregación de los resultados generados explotando los resultados de las ejecuciones. La planificación y ejecución de estas mejoras está supeditada al progreso en las tres etapas mencionadas anteriormente.\nEjecución\n\nPreliminares",
  "speaker": "SYSTEM",
  "uuid": "c284512d-4864-4b8a-92d6-3acf17fb5822"
}