{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Propuestas \n\nShort CV Asun\nDña.  Asunción Gómez Pérez es catedrática de universidad en la Facultad de Informática de la Universidad Politécnica de Madrid y Directora del Grupo de Ingeniería Ontológica. Actualmente es Directora del Departamento de Inteligencia Artificial de la Facultad de Informática. Es Doctora en Ciencias de la Computación e Inteligencia Artificial (1993) y\nMáster en Dirección y Administración de Empresas (1994). Fue visitante en el Laboratorio de Sistemas de Conocimiento de la Universidad de Stanford (1994-1995). En la UPM ha dirigido numerosos proyectos europeos (MKBEEM, Ontoweb, Esperonto, Knowledge Web, NeOn, SEEMP, OntoGrid, Admire, SemsorGrid4Env, SEALS, DynaLearn, Monnet, LÍDER, etc) y del Plan Nacional (España Virtual, Plata, Geobuddies, BabeLData, etc.). Ha publicado más de 150 artículos y es autora de un libro sobre Ingeniería Ontológica y coautora de un libro sobre Ingeniería de conocimiento. Ha sido codirectora de la escuela de verano sobre Ingeniería Ontológica y Web Semántica desde 2003 hasta la fecha. Fue program chair de ASWC'09, ESWC’05 y EKAW’02 y coorganizadora de workshops y conferencias sobre ontologías.\nShort CV Oscar\nD. Óscar Corcho es Profesor Titular de Universidad en la Facultad de Informática de la Universidad Politécnica de Madrid, y forma parte del Grupo de Ingeniería Ontológica de esta facultad. Es Doctor en Ciencias de la Computación e Inteligencia Artificial (2004) por la UPM. Recibió el Tercer Premio Nacional Fin de Carrera por el Ministerio de Educación y Ciencia (2001) y el Premio Extraordinario de Doctorado por la UPM (2005). Sus actividades de investigación se centran en la e-Ciencia Semántica, la Web Semántica y la Ingeniería Ontológica. Ha participado en varios proyectos europeos en estas áreas: PlanetData, Wf4Ever, SemsorGrid4Env, ADMIRE, OntoGrid, Esperonto, DIP, HOPS, SWWS, Knowledge Web, OntoWeb y MKBEEM. También ha participado en el proyecto HALO, financiado por Vulcan Inc. Ha publicado los libros “Ontological Engineering\" y \"A layered declarative approach to ontology translation with knowledge preservation\", más de 50 artículos en revistas y conferencias, y realiza revisiones de artículos en diversas conferencias, workshops y revistas.\nShort CV de Raul García\nBreve CV de Mariano Rico\nMariano Rico Almodóvar es doctor en Ingeniería Informática y Telecomunicación por la Universidad Autónoma de Madrid (UAM, 2009) y\nlicenciado en CC. Físicas (UAM-1992, especialidad en Física Fundamental). De 1992 a 2003 fue ingeniero de\nI+D y jefe de proyectos en prestigiosos centros de investigación públicos y privados. Durante 8 años (en el periodo 2003-2013) fue\nprofesor ayudante en la Escuela Politécnica Superior (UAM). Sus intereses de investigación principales incluyen\nLinked Open Data, tecnologías de la Web Semántica y lenguaje natural. Ha realizado dos estancias en el centro de investigación Digital Enterprise\nResearch Institute (DERI), en Galway, Irlanda, referente mundial en Web Semántica, mundial donde ha trabajado en interacción con servicios, tecnologías de la Web Semántica, y wikis. En la universidad ha participado en varios proyectos de investigación europeos (e.g. Wf4Ever, LIDER) y nacionales (e.g. e-Madrid, Upgrid, S5T).\nFoto de 200x200 (cambia el parámetro\ns\npara obtener otros tamaños)\nSus cinco publicaciones más relevantes:\n\"A Semantically Enhanced UPnP Control Point to Enhance Multimedia Content\";M. Rico,Ó. Corcho, V. Méndez, JM Gómez-Pérez; IEEE Internet Computing 15(6); 2011; Impacto (JCR 2011)= 2.000 (Q1).\n\"A Contribution-based Framework for the Creation of Semantically-enabled Web Applications\"; Mariano Rico, David Camacho, Óscar Corcho; Information Sciences 180(10), pp. 1850-1854; 2010; Impacto (JCR 2010): 2.833 (Q1).\n\"A Tool Suite to Enable Web Designers,Web Application Developers and End-users to Handle Semantic Data\"; M. Rico, J.A. Macías, D. Camacho, and O. Corcho; International Journal On Semantic Web and Information Systems (IJSWIS); 2010; Impacto (JCR 2010):1.678 (Q2).\n\"Symplifying Semantic Web Application Development and Semantic Data Usage\"; Mariano Rico; AI Communications 23(1), pp. 65-66; 2010; Impacto (JCR 2010): 0.824 (Q3).\n\"A Programming Experience of High School Students in a Virtual World Platform\"; Mariano Rico, Gonzalo Martínez-Muñoz, Xavier Alaman, David Camacho and Estrella Pulido; International Journal of Engineering Education; 2011; Impact (JCR 2011): 0.418 (Q3).\nBreve CV de Maria S. Perez\nMaría S. Pérez es Catedrática de Universidad en la Universidad Politécnica de Madrid. Sus principales\náreas de investigación de interés incluyen Big Data, Machine Learning, Cloud, Edge Computing, HPC y\nSistemas de Almacenamiento. Es co-autora de 4 libros, 7 capítulos de libro y ha publicado más de 100\nartículos en revistas y conferencias internacionales. Ha organizado más de 30 ediciones de conferencias y\nworkshops internacionales, entre los que destaca la conferencia IEEE Cluster. Ha participado en 6 proyectos\neuropeos (coordinando uno de ellos) y en más de 15 proyectos nacionales. Es miembro del Board of\nDirectors de BDVA y miembro del Research and Innovation Advisory Group of EuroHPC.\nBreve CV Mari Carmen\nMª del Carmen Suárez de Figueroa Baonza es Profesora Ayudante en el Departamento de Inteligencia Artificial de la Facultad de Informática de la Universidad Politécnica de Madrid, y forma parte del Grupo de Ingeniería Ontológica de esta facultad. Anteriormente ha trabajado como Profesora Asociada (2002) en la Facultad de Informática.\nEs Licenciada en Informática por la Universidad Politécnica de Madrid (UPM) desde el año 2001, y obtendrá el grado de Doctora en Ciencias de la Computación e Inteligencia Artificial por la UPM en junio del año 2010.\nSus actividades de investigación se centran en la Ingeniería Ontológica y la Web Semántica. Concretamente, sus líneas de investigación incluyen metodologías para el desarrollo de redes de ontologías, desarrollo de ontologías en diferentes dominios, y evaluación de ontologías. Ha participado en los siguientes proyectos europeos y nacionales relacionados con su línea de investigación: BuscaMedia, mIO!, NeOn, SEEMP, REIMDOC, OntoGrid, Knowledge Web, PIKON, Esperonto y OntoWeb.\nHa sido investigadora visitante en el KMi en la Open University (Inglaterra) en el 2007 y en el Departamento de Informática de la Universidad de Liverpool (Inglaterra) en el 2004.\nHa co-organizado el EON 2006 Workshop en  WWW’06, el KRRSW 2008 Workshop en ESWC 2008, el tutorial titulado “NeOn Methodology: how to build ontology networks?” en EKAW 2008, y el tutorial titulado “Ontology Engineering: the NeOn Methodology through the NeOn Toolkit” en ISWC 2009.\nBreve CV Elena\nElena Montiel-Ponsoda es miembro del “Ontology Engineering Group” de la Facultad de Informática de la Universidad Politécnica de Madrid (UPM), y doctoranda del Dpto. de Lingüística Aplicada a la Ciencia y a la Tecnología de la misma universidad. Desde 2006 ha trabajado en diversos proyectos relacionados con ontologías, localización y procesamiento de lenguaje natural (PLN), entre otros: NeOn, Lifecycle support for networked ontologies (FP6-027595), ICPS – International Classification for Patient Safety, un proyecto de la Organización Mundial de la Salud, o el recién estrenado Monnet, Multilingual Ontologies for Networked Knowledge (FP7-248458). En el año 2000 se licenció en Traducción e Interpretación por la Universidad de Alicante, y en 2003 obtuvo el grado de Bachelor of Arts en Interpretación técnica por la Hochschule Magdeburg-Stendal, en Magdeburgo, Alemania. Ha realizado estancias de investigación en el centro de investigación DFKI, en Saarbrücken, Alemania (2008) y en el Grupo de Procesamiento de Lenguaje Natural de la Universidad de Sheffield (2009). Ha co-organizado el workshop “Multilingual Semantic Web” en la conferencia WWW2010. Los resultados de su investigación se han publicado en conferencias de Lingüística aplicada, Web Semántica y PLN, tales como OntoLex (2007), AELFE (2007 y 2008), Coling (2008), EKAW (2008), ESWC (2009), K-CAP (2009), o TIA (2009).\nBreve CV María Poveda",
  "speaker": "SYSTEM",
  "uuid": "c46c736f-18c8-401e-a878-d4a2dfe6de8c"
}