{
  "message": "SYSTEM: Reusing_Human_Resources_Management_Standards.pdf: Página 11\nit is stored in an ORACLE database table. The resultant Skill Ontology has 2 \nconcepts: Skill concept with its subclass ICT Skill. For every skill element \nspecified in the European Dynamic classification a different instance of the ICT \nSkill concept is defined. An example instance of the ICT Skill concept is \nHardware programming. The Skill concept has two relations: ‘Skill \nis associated with Job Vacancy’ (with the Job Vacancy concept from the \nJob Offer Ontology) and ‘Skill is skill of Job Seeker’ (with the Job \nSeeker concept from the Job Seeker Ontology).  \n• Competence Ontology. This ontology defines a concept called Competence as a \nsuper class of the imported concepts Skill, Language Proficiency and \nDriving License. The Competence concept has three binary relations: \n‘Competence is associated with Vacancy’ (with the Vacancy concept from \nthe Job Offer Ontology); ‘Competence is competence of Candidacy’ (with \nthe Candidacy concept from the Job Seeker Ontology) and ‘Competence \nrequires Education’ (with the Education concept from the Education \nOntology).  \n• Time Ontology. This ontology is based on DAML ontology13  and it is expressed in \nOWL format. The main concepts of this ontology are Instant and Interval, \nwhich are subclasses of Temporal Entity. Instant is linked to \nInterval through the properties of begins, ends, inside and begins \nor in. Instant is also linked to an instant temporal description, which is a \nconcept with the properties of second, minute, hour, day, month, year \nand time zone. Interval has the subclass proper interval, which is \nrelated with itself through the relations ‘interval equals’, ‘interval before’, \n‘interval starts or finishes’, etc. Proper intervals can be concatenated through the \nrelation ‘concatenation’. \n \nFinally we present the Reference Ontology statistics. The Reference Ontology is \ncomposed of thirteen modular ontologies. The Reference Ontology has 1609 \nconcepts, 6727 class attributes, 60 instance attributes, 94 ad hoc relationships, 1674 \ninstances and 20 axioms. \n5 Local ontologies building process \nIn this section we provide some guidelines for the building process of the local \nontologies, each ES uses its own Local Ontology, which describes the employment \nmarket in its own terms. Based on the proposed SEEMP architecture, the possible \noptions for building the local ontologies are: building local ontologies from the RO, \nand building local ontologies as a reverse engineering process from ES schema \nsources. Next, these options will be explained. \n                                                           \n13 http://cs.yale.edu/homes/dvm/daml/time-page.html \n",
  "speaker": "SYSTEM",
  "uuid": "c58f3464-9dc1-47a7-8707-d83e760ab037"
}