{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/STI2010 \n\nplease forward to potential candidates ** Junior Researcher in Large-scale Data Management and Semantic Technology ========================================================================\nSTI International Consultancy and Research GmbH (STI Research), a research centre based in Vienna, Austria which contributes to the international semantic technology community, seeks applications for a junior research position starting in October/November 2010.\nThe position is part of the European Union Network of Excellence PlanetData.\nThe goal of the network is to establish a sustainable European community of researchers that supports organizations in exposing their data in new and useful ways. For further information:\nhttp://www.planet-data.eu\nThe candidate will also support the activities of STI Research in a number of European and national research projects in the areas of semantic technology, Internet of Services and Future Internet: SEALS (\nhttp://www.seals-project.eu\n), SOFI (\nhttp://www.sofi-project.eu\n) and FI Austria (\nhttp://www.fi-austria.at\n). \nAs part of the projects, the candidate will be involved in community building, workshop and symposium organization, contributing to roadmaps and white papers, as well as supporting the provision of semantic and service infrastructures to the wider research community.\nThe position will offer an opportunity to network with major European institutes active in semantics and service technology research and perform PhD research in a relevant topic such as:\n* representing and processing stream-like data\n* scalable techniques to integrate, publish and access data on the Web\n* capturing the context in which data is produced and understood\n* assessing the quality of data and recording, preserving and where possible repairing it\n* maintaining access control and privacy for data published on the Web Through the PlanetData network, the researcher will have access to a highly scalable data infrastructure, supporting relational, RDF and stream processing, as well as novel large data sets from a broad range of vertical domains.\nThe candidate should have a Bachelor or MSc degree in Computer Science, and good knowledge of one or more of the following fields: databases, data management, data processing, streaming data, semantic technologies, Linked Data.\nProficiency in English and Java programming are expected. Strong system skills as well as professional experience, especially with real-life deployments, are a definite plus.\nSTI Research offers a dynamic research environment with opportunities for international collaboration and personal advancement. Salary is based on the Austrian government research tariff.\nApplicants should e-mail a curriculum vitae with list of publications and the names and email addresses of at least two professional references, under the subject of “STI Junior Researcher”, respecting the application deadline of 31 August 2010, to:\nDr Lyndon J B Nixon\nSTI International, Amerlingstrasse 19/35, 1060 Vienna, Austria lyndon.nixon@sti2.org",
  "speaker": "SYSTEM",
  "uuid": "c6390916-dafa-4e65-9d9a-4037e6a0c942"
}