{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 31\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 31 de 42 \n7. Demazeau Y, Franco Zambonelli, Juan M. Corchado, Javier Bajo, (Eds.). Advances in \nPractical Applications of Heterogeneous Multi-Agent Systems - The PAAMS Collection. \nISBN: 978-3-319-07550-1. Lecture Notes in Artificial Intelligence Series, Vol 8473. \nISSN: 0302-9743. Springer Verlag. June 2014. \n8. De Paz Santana JF, Gabriel Villarrubia, Javier Bajo,  Gabriel Sirvent, Tiancheng Li. \nIndoor Location System for Security Guards in Subway Stations. ISBN: 978-3-319-\n07475-7, Advances in Intelligent Systems and Computing Vol. 293, pp 111-119. ISSN: \n2194-5357. Trends in Practical Applications of Heterogeneous Multi-Agent Systems. \nThe PAAMS Collection. June 2014. \n9. Esteban-Gutiérrez M, Mihindukulasooriya N, García-Castro R. LDP4j: A framework for \nthe Development of interoperable read-write Linked Data applications. 1st International \nISWC Developers Workshop. Riva del Garda, Italia. Octubre 2014. \n10. Fernández JD, Llaves A, Corcho O. Efficient RDF Interchange (ERI) Format for RDF \nData Streams. International Semantic Web Conferecne (ISWC 2014). Riva del Garda, \nItalia. 2014. \n11. Fernández-García N, Arias Fisteus J, Sánchez Fernández L, Fuentes-Lorenzo D, \nCorcho O. RDSZ: An approach for lossless RDF stream compression. ESWC 2014. \nISBN: 978-3-319-07442-9. Creta, Grecia. Mayo 2014. \n12. Fraile JA, Yanira de Paz, Javier Bajo, Juan F. de Paz and Belén Pérez-Lancho. \nContext-aware multiagent system: Planning Home Care Tasks. Vol. 40 (1), pp. 171-\n203. ISSN: 0219-1377. Knowledge and Information Systems, An International Journal. \nJuly 2014. \n13. García E, Juan Francisco De Paz, Sara Rodríguez, Javier Bajo. Intelligent Ligthing \ncontrol System. ISBN: 978-3-319-07592-1, Advances in Intelligent Systems and \nComputing Vol. 290, pp 195-207. ISSN: 2194-5357. Distributed Computing and Artificial \nIntelligence, 11th International Conference. June 2014. \n14. García-Silva A, Cargía-Castro J, García A, Corcho O. Social Tags and Linked Data for \nOntology Development: A Case Study in the Financial Domain. WIMS’14. ISBN: 978-1-\n4503-2358-7. Tesalonica, Grecia. Junio 2014. \n15. Garijo D, Corcho O, Gil Y, Gutman B, Dinov I, Thompson P, Toga A. FragFlow: \nAutomated Fragment Detection in Scientific Workflows. The 10th IEEE International \nConference on e-Science (e-Science 2014). Guarujá, Brasil. Octubre 2014. \n16. Garijo D, Corcho O, Gil Y, Braskie M, Hibar D, Hua X, Jahanshad N, Thompson P, \nToga A. Workflow reuse in Practice: A Study of Neuroimaging Pipeline Users. The 10th \nIEEE International Conference on e-Science (e-Science 2014). Guarujá, Brasil. Octubre \n2014. \n17. Garijo D, Gil Y, Corcho O. Towards Workflow Ecosystems Through Semantic and \nStandard Representations In Proceedings of the Ninth Workshop on Workflows in \nSupport of Large-Scale Science (WORKS), held in conjunction with the IEEE ACM \nInternational Conference on High-Performance Computing (SC), New Orleans, LA, \n2014. \n18. Giraldo O, García A, Corcho O. SMART Protocols: SeMAntic RepresenTation for \nExperimental Protrocols. EUON. Amsterdan, Holanda. Septiembre 2014. \n19. Giraldo O, García A, Corcho O. SMART Protocols: SeMAntic RepresenTation for \nExperimental Protrocols. LISC2014. Riva del Garda, Italia. Octubre 2014. \n20. Gracia J, Labra J. Best Practices for Multilingual Linked Open Data: a Community \nEffort. W3C Multilingual Web Workshop New Horizonts for the Multilingual Web. \nMadrid, España. Mayo 2014. \n21. Gracia J, Montiel-Ponsoda E, Vila-suero D, Aguado G. Enabling Language Resources \nto Expose Translations as Linked Data on the Web. 9th Language Resources and \nEvaluation Conference (LREC’14). Reykjavic, Iceland, May 2014. \n22. Hervalejo E, Martínez-Prieto MA, Fernández J, Corcho O. HD Tourist: Exploring Urban \nData on Android. ISWC2014 – The 13th International Semantic Web Conference (ISWC \n2014). Riva del Garda, Italia. Octubre 2014. \n23. Hettne K, Dharuri H, Zhao J, Wolstencroft K, Belhajjame K, Soiland-Reyes S, Mina E, \nThompson M, Cruickshank D, Verdes-Montenegro L, Garrido J, de Roure D, Corcho O, \nKlyne G, van Schouwen R, A’t Hoen P, Bechhofer S, Goble C, Roos M. Structuring \nresearch methods and data with the research object model: genomics workflos as a \ncase study. Journal of Biomedical Semantics. ISSN 2192-5283. Vol 5(41). 2014. \n",
  "speaker": "SYSTEM",
  "uuid": "ca784772-1164-471a-8409-8033911275ac"
}