{
  "message": "SYSTEM: IJMSO_Corcho_OntologyBasedAnnotation.pdf: Página 1\nInt. J. Metadata, Semantics and Ontologies, Vol. 1, No. 1, 2006 \n47 \nCopyright © 2006 Inderscience Enterprises Ltd. \nOntology based document annotation: trends and \nopen research problems \nOscar Corcho \nIntelligent Software Components (iSOCO), \nPedro de Valdivia, 10 – 28006 Madrid, Spain \nE-mail: ocorcho@isoco.com \nAbstract: Metadata is used to describe documents and applications, improving information \nseeking and retrieval and its understanding and use. Metadata can be expressed in a wide variety \nof vocabularies and languages, and can be created and maintained with a variety of tools. \nOntology based annotation refers to the process of creating metadata using ontologies as their \nvocabularies. We present similarities and differences with respect to other approaches for \nmetadata creation, and describe languages and tools that can be used to implement these \nannotations. \nKeywords: ontology; metadata; annotation. \nReference to this paper should be made as follows: Corcho, O. (2006) ‘Ontology based \ndocument annotation: trends and open research problems’, Int. J. Metadata, Semantics and \nOntologies, Vol. 1, No. 1, pp.47–57. \nBiographical notes: Oscar Corcho is working as a Marie Curie Fellow at the Information \nManagement Group, University of Manchester. Previously, he has worked at iSOCO  \nas a Research Manager and at the Ontological Engineering Group of Universidad Politécnica  \nde \nMadrid \n(UPM). \nHe \ngraduated \nin \nComputer \nScience \nfrom \nUPM \nin \n2000,  \nand received the third Spanish award in computer science from the Spanish Government. He \nobtained his MSc in Software Engineering from UPM in 2001, and his PhD in Artificial \nIntelligence in 2004. His research activities include ontology languages and tools, the Semantic \nWeb and the Semantic Grid. \n \n1 \nIntroduction \nMetadata is usually defined as ‘data about data’, which aims \nat expressing the ‘semantics’ of information, hence \nimproving information seeking, retrieval, understanding  \nand use. \nMetadata can be attached to a wide range of documents. \nThese documents may be available electronically in the \nform of HTML, PDF, Latex, etc., in the Web or in our hard \ndisks or on paper in a library, among others. Not only can \nmetadata be applied to documents, but also to applications \nrunning in our computers or available in the web in the form \nof web services. \nMetadata can be expressed in a wide range of languages \n(from natural to formal ones) and with a wide range of \nvocabularies (from simple ones, based on a set of agreed \nkeywords, to complex ones, with agreed taxonomies and \nformal axioms). It may be available in different formats: \nelectronically or even physically (written down in the  \nmargins of a textbook). And it can be created and \nmaintained, using different types of tools (from text editors \nto metadata generation tools), either manually or \nautomatically. \nIn this paper we will only deal with the management of \nmetadata attached to electronic documents, expressed with \nformal languages and using ontologies as vocabularies.  \nWe will neither deal with the management of metadata  \nfor applications, nor with the creation of metadata  \nbased on other types of vocabularies. We will describe  \nthe advantages and disadvantages of using ontologies  \nas the vocabularies on which the metadata is based  \n(Section 2); we will describe some of the formal languages \nthat can be used to express metadata (Section 3);  \nand we will describe the tools currently available for \nontology \nbased \ndocument \nannotation \n(Section \n4).  \nFinally, we will present the conclusions to this paper and \nsome open research problems in ontology based document \nannotation. \n2 \nOntologies as vocabularies for metadata \nannotation \nOntologies appeared first as the backbone of document \nmetadata annotation in preSemantic Web applications like \nthe SHOE project (Luke et al., 1997), the (KA)2 initiative \n(Benjamins et al., 1999), and the Planet-Onto project \n(Domingue and Motta, 2000), among others. With the \nemergence of the Semantic Web, ontology based document \nannotation has been the focus of many projects and \napplications, since the availability of annotated content is \none of the key challenges to overcome in order to make the \n",
  "speaker": "SYSTEM",
  "uuid": "cb56bdc2-eb30-4bca-b1fc-b1789fec46ba"
}