{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 12\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11161\nArtículo 25.  Régimen de incompatibilidades.\n1.  El disfrute de una subvención objeto de esta convocatoria es incompatible con \ncualquier otra beca o ayuda de análoga naturaleza y, con carácter general, con la percepción \nde cualquier cuantía que tenga naturaleza salarial, cuando ello perjudique a la finalidad \ninvestigadora y formativa de la ayuda y/o se produzca en su mismo horario.\n2.  No obstante lo anterior, las ayudas de los subprogramas objeto de esta convocatoria \nsí serán compatibles con las percepciones que procedan de tareas docentes o investigadoras \ndirectamente asociadas con la actividad de investigación desarrollada por el personal \ninvestigador en formación y con los complementos provenientes de su proyecto de I+D, de \ncontratos realizados en aplicación de la Ley Orgánica 6/2001, de 21 de diciembre, de \nUniversidades y de la Ley 13/1986, de 14 de abril, de Fomento y Coordinación General de \nla Investigación Científica y Técnica y de las ayudas complementarias financiadas por la \nComisión Europea para fomentar la formación y movilidad de investigadores.\n3.  Los beneficiarios deberán comunicar al órgano concedente, si se produce el caso, \nla obtención de otras ayudas, subvenciones, ingresos o recursos que financien las \nactividades subvencionadas, tan pronto como tengan conocimiento de ello y, cuando \nproceda, con anterioridad a la justificación de la aplicación dada a los fondos percibidos, lo \nque podrá originar las correspondientes minoraciones en el importe de la ayuda \nconcedida.\nCAPÍTULO III\nDisposiciones específicas de las ayudas para la formación de personal investigador \ndel Subprograma FPI-MICINN\nArtículo 26.  Requisitos de los beneficiarios.\n1.  Podrán ser beneficiarios de estas ayudas durante el periodo de beca, al que se refiere \nel artículo 19, las personas físicas que, como norma general, en la fecha de incorporación a su \ncentro de adscripción, cumplan los requisitos recogidos en el artículo 17.\nNo obstante, aquellos beneficiarios que adquieran dicha condición tras ser candidatos \nreservas o les sea autorizado un aplazamiento en su incorporación, deberán cumplir dichos \nrequisitos en las fechas indicadas en los correspondientes artículos 38 y 29.1, \nrespectivamente.\nLas fechas que se establecen para el cumplimiento de los requisitos del beneficiario \nserán inaplazables.\n2.  Podrán ser beneficiarios de estas ayudas durante el periodo de contrato al que se \nrefiere el artículo 19 los Centros de I+D, que tengan capacidad de contratación laboral, y \nque, con carácter general, hayan obtenido un proyecto de investigación fundamental no \norientada del Ministerio de Ciencia e Innovación, en el marco del Plan Nacional de \nInvestigación Científica, Desarrollo e Innovación Tecnológica 2008-2011, escogido como \nsusceptible de tener asociada una o más ayudas para la formación del personal investigador \na través de la realización de la tesis doctoral, de acuerdo con el artículo 31.\n3.  A los efectos de este subprograma se entiende por Centro de I+D:\na)  Las universidades públicas, los organismos públicos de investigación reconocidos \npor la Ley 13/1986, de 14 de abril, de Fomento y Coordinación de la Investigación Científica \ny Técnica, los centros de I+D con personalidad jurídica propia y diferenciada vinculados o \ndependientes de la Administración General del Estado y los centros de I+D vinculados o \ndependientes de Administraciones públicas territoriales, independientemente de su \npersonalidad jurídica.\nb)  Las universidades privadas y entidades públicas y privadas sin ánimo de lucro, \ncon capacidad y actividad demostrada en I+D.\nc)  Centros tecnológicos: entendiéndose por tales, los Centros Tecnológicos a que se \nrefiere el artículo 2.1 del Real Decreto 2093/2008, de 19 de diciembre, por el que se \nregulan los Centros Tecnológicos y los Centros de Apoyo a la Innovación Tecnológica de \ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "cc2ab74e-a171-4fb6-b8a2-641165f2b25c"
}