{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 21\n \n \nPág. 23 \n \nPlan de Impulso de las Tecnologías del Lenguaje \npublicaciones, …), terminologías, corpus paralelos de traducción, etc. Se propone el apoyo para \nla creación y explotación de datos abiertos de interés lingüístico. \nEje IV: Proyectos Faro \nLos proyectos faro son proyectos emprendidos por las Administraciones Públicas o por el sector \nprivado de aplicación de las tecnologías del lenguaje en sectores estratégicos que pretenden \nservir de demostración de sus capacidades y beneficios, generar industria y generar recursos \nreutilizables en otros proyectos. También servirán de aprendizaje para futuros proyectos en \notros sectores. \nLos proyectos faro buscan una sinergia con las demás medidas del Plan de Impulso de las \nTecnologías del Lenguaje, que son de naturaleza horizontal, transversal (infraestructuras \nlingüísticas generales, reutilización de información del sector público de interés lingüístico, \nplataformas de procesamiento de lenguaje natural y traducción automática de las \nAdministraciones Públicas), con actuaciones en sectores concretos que abarquen toda la cadena \nde valor y den lugar a productos y servicios acabados. \nLos requisitos empleados para seleccionar los primeros proyectos faro del sector público han \nsido: \n• \nSinergia con sectores estratégicos de la economía o los servicios públicos españoles. \n• \nElevado impacto económico y social. \n• \nDesarrollo de la industria del lenguaje nacional. \n• \nConcreción y compromiso de los órganos competentes. \n• \nGeneración de recursos reutilizables. \n• \nSinergias con las demás medidas del Plan de Impulso de las Tecnologías del \nLenguaje, y en particular, con la de generación de recursos lingüísticos. \n• \nAdquisición de experiencia para futuros proyectos. Carácter demostrador de las \ncapacidades y beneficios de las tecnologías del lenguaje. \nEntre los sectores verticales en los que se empezará a trabajar en los próximos meses se \nencuentran Sanidad, Turismo y Educación. En el espíritu del Plan está el conseguir la máxima \ndifusión y reutilización de los desarrollos realizados, por lo que se prevé la próxima \nincorporación de otros proyectos verticales en áreas estratégicas. \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "cccd4291-29b2-4299-94fc-4433a8120a3f"
}