{
  "message": "SYSTEM: 2216-LT2013_Report_20130408.pdf: Página 102\n100\nwww.lt‐innovate.eu ‐ contact@lt‐innovate.eu\nGlobal megatrends\nSocial Media\nSocial media networks (such as Facebook or Twitter)\nand social business initiatives yields social data,\nwhere customer, partners and employees conversa-\ntions create an insight-rich goldmine for businesses.\nNew unstructured data (in the form of text, audio and\nvideo) analysis are required to generate profound\ninsights.\nHigh\nShort-term\nAccelerator\n\n\nE-commerce\nThe progressive increment of e-commerce and m-\ncommerce transactions generate more data to be\nanalysed. This information is mostly unstructured. On\ntop of that, new customers ask for more personalized\nservices.\nHigh\nShort-term\nAccelerator\n\n\nAnalytics\nFrequently linked to Big Data, analytics will play a\nfundamental role transforming traditional industries to\nsmart industries. In this context, text mining technolo-\ngies will be fundamental to understand customer\nbehaviour and sentiment.\nHigh\nShort-term\nAccelerator\n\n\nBig Data\nThe data growth is pushing the need for storage,\nanalysis and big data technologies. The latter has\nintersection with LT technologies and its growth will\npush new developments and  revenues for Lt ven-\ndors.\nHigh\nShort-term\nAccelerator\n\n\nMobile\nSpending on mobile devices will grow 23%, driving\n43% of IT growth; a mobile strategy is priority number\none for all industry players in 2012. Consumers are\ninterested in personalised services which could be\nenabled through LT technologies.\nHigh\nShort-term\nAccelerator\n\n\nOpen Source\nOpen source has already had a major impact on\nintelligent content. There are mature and actively\nused open source platforms such as R or K-nime.\nLow\nShort-term\nAccelerator\n\n\nInternet of Things\nAlthough the IoT deployment is getting slower than\nexpected, the machine to machine and machine to\nperson data is continuously increasing and pushing\nthe boundaries of IT systems. In the following years,\nindustries such as energy, automotive and healthcare\nwill deploy data-based services that will require an\naccurate data management\nModerate\nMedium-\nterm\nAccelerator\n\n\nPrivacy and security\nAs text analytics, new services and data insights\nincrease, new concerns about the privacy and securi-\nty of such data appears. Organizations must not only\nprotect against new threats but to respect the limits of\nthe private lives of their employees, partners and\ncustomers.\nHigh\nMedium-\nterm\nInhibitor\n\n\nSmart Verticals\nCloud, mobile, social and big data / analytics are the\nbase for the vertical industry evolution. Many organi-\nzations have started the path to become a smart ver-\ntical: industries generating new competitive advan-\ntages based on the third platform pillars.\nModerate\nLong-term\nAccelerator\n\n\nCloud Computing\nCloud as a new paradigm of computing that is\nreshaping IT will help to evolve speech technologies.\nThe key advantage to cloud services should be the\nability of IT organizations to shift IT resources from\nmaintenance to new initiatives. IDC estimates that\ncloud services (public cloud) increased 34% in 2010\nto nearly $22 billion, or about 1.6% of IT spending,\nand that percentage should increase to 3% by 2014.\nModerate\nShort-term\nAccelerator\n\n\n",
  "speaker": "SYSTEM",
  "uuid": "cd2079b3-30ec-457b-8659-6cd5a2f3299a"
}