{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 33\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11182\na)  El Centro de I+D deberá solicitar por escrito al órgano concedente la sustitución \ndel investigador que ha renunciado a la ayuda por el candidato reserva situado en primer \nlugar para el proyecto de I+D en cuestión, adjuntando al escrito la aceptación del candidato \nreserva a la ayuda y la renuncia del titular.\nb)  En el caso de que el primer reserva no acepte, se podrá solicitar la sustitución por \nel siguiente o siguientes reservas, en el caso de que existan y respetando el orden de \nprelación de los mismos.\nDisposición adicional primera.  Carta Europea del Investigador y Código de Conducta \npara la contratación de investigadores.\n1.  La Recomendación de la Comisión Europea (2005/251/CE) de 11/03/2005 (DOUE \nL75 de 22/03/2005), relativa a la Carta Europea del Investigador y Código de Conducta \npara la contratación de investigadores, se aplicará en el subprograma incluido en esta \nResolución.\n2.  Los investigadores que reciban una ayuda con cargo al subprograma incluido en \nesta Resolución deberán cumplir los principios y exigencias generales aplicables a los \ninvestigadores.\n3.  Las entidades a las que estén adscritos los investigadores en el ámbito del \nsubprograma incluido en esta Resolución, así como los departamentos o entidades que \nfinancian las ayudas deberán cumplir los principios y exigencias generales de las entidades \nempleadoras y financiadoras.\nDisposición adicional segunda.  Adecuación del régimen de justificación económica y \ncomprobación de las ayudas concedidas al amparo de convocatorias anteriores.\n1.  Al objeto de uniformizar el régimen de justificación económica y comprobación, las \nreferencias a dichos aspectos recogidas en los artículos 36, y siguientes (subprograma \nFPI-MICINN) resultarán aplicables a las ayudas concedidas al amparo de la Resolución de \n29 de diciembre de 2008, de la Secretaría de Estado de Universidades, por la que se hace \npública la convocatoria correspondiente al año 2009 de concesión de ayudas del Programa \nNacional de Formación de Recursos Humanos de Investigación, en el marco del Plan \nNacional de Investigación Científica, Desarrollo e Innovación 2008-2011 (publicada en el \nBoletín Oficial del Estado número. 4, de 5 de enero de 2009).\n2.  De conformidad con el apartado 2 de la Disposición adicional segunda de la Orden \nECI/266/2008, de 6 de febrero, por la que se establecen las bases reguladoras de la concesión \nde subvenciones públicas en el marco de la línea instrumental de actuación en recursos \nhumanos del Plan Nacional de Investigación Científica, Desarrollo e Innovación Tecnológica \n(I+D+i) 2008-2011, las referencias al régimen de justificación económica y comprobación \nrecogidas en la presente resolución, también resultarán de aplicación a las ayudas concedidas \nal amparo de las convocatorias anteriores a la reseñada en el apartado 1, para el mencionado \nsubprograma.\nDisposición final primera.  Habilitación competencial.\nLa presente resolución se dicta al amparo de lo establecido en el artículo 149.1.15.ª de \nla Constitución, que asigna al Estado la competencia exclusiva en el fomento y coordinación \ngeneral de la investigación científica y técnica.\nDisposición final segunda.  Entrada en vigor.\nLa presente Resolución entrará en vigor el día siguiente al de su publicación en el \nBoletín Oficial del Estado.\nMadrid, 4 de febrero de 2010.–El Secretario de Estado de Investigación, Felipe Petriz \nCalvo.\ncve: BOE-A-2010-1944\nhttp://www.boe.es\t\nBOLETÍN OFICIAL DEL ESTADO\t\nD. L.: M-1/1958 - ISSN: 0212-033X\n",
  "speaker": "SYSTEM",
  "uuid": "cee15e96-a3cb-4190-95ec-9263037af0a0"
}