{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Large-scale_data_integration \n\nComposed by\n:\nAcademic staff\n: Oscar Corcho\nPostdocs\n: Luis M. Vilches, Jean Paul Calbimonte,\nPhD Students\n: Víctor Saquicela,\nJosé Mora\n, Freddy Priyatna\nCollaborators\n: Carlos Buil\ne-mail address\n: dataintegration@delicias.dia.fi.upm.es\nContents\n[\nhide\n]\n1\nDescripción general\n2\nProyectos\n3\nTasks (out of the scope of specific R&D projects where each member is working)\n4\nData Integration WG Calendar\n5\nNext meetings and presentations\n6\nIndividual Meetings\n7\nCurrent projects\n8\nPast projects\n9\nProposals of MSc and Bachelor thesis\n10\nGeneral Roadmap\n11\nMiscellaneous\n12\nTools\n13\nResources\n14\nReferences\n14.1\nData Quality\n14.2\nSemantic Grid\n14.3\nGeospatial Semantics\n14.4\nSemantic e-Science\n14.5\nIntroduction, integration process\n14.6\nGaV and LaV approaches\n14.7\nQuery rewriting\n14.8\nTechnologies (EII, EAI, ETL, CTF)\n14.9\nData Integration - Web 2.0 (Mashups) - Ontology\n14.10\nSensor Networks Data Management\n14.11\nSemantic Sensor Web\n14.12\nContinuous queries\n15\nReading list\nDescripción general\n\nEn términos de soporte gráfico para R2RML, la verdad es que no hay mucho hecho por el momento. Espero que en un par de meses tengamos disponible un sistema muy sencillo para dar soporte a la creación gráfica de mappings R2RML, de tipo standalone y que será similar al plugin ODEMapster de NeOn Toolkit. Lo anunciaré en la lista cuando esté disponible. Estará disponible como open source en github.\nEn cuanto a la evolución de ODEMapster para dar soporte a R2RML, tenemos varias líneas abiertas en el grupo, que no sé si te resultarán interesantes o no, pero que te pueden servir para continuar explorando el área.\nMorph (\nhttps://github.com/jpcik/morph/\n), desarrollado por Jean Paul Calbimonte. Su soporte para SPARQL es limitado, pero podría valer para hacer alguna prueba. Está basado en el algoritmo de Elliot y está implementado en Scala.\nAcceso a streams de datos mediante SPARQL-Stream (\nhttps://github.com/jpcik/morph-streams\n), también desarrollado por Jean Paul Calbimonte como resultado de su tesis doctoral, que defendió hace dos semanas (\nhttp://www.slideshare.net/jpcik/phd-19957460\n). Este sistema hace query rewriting de consultas en SPARQL-Stream, una extensión de SPARQL para streams de datos, utilizando mappings R2RML, y puede utilizar complex event processors, data stream management systems o sensor middleware (COSM, GSN).\nAcceso a Google Fusion Tables basado en R2RML [1], desarrollado por Freddy Priyatna. En dos o tres semanas lo haremos disponible como servicio en la Web para que cualquiera lo pueda utilizar para crear SPARQL endpoints virtuales con autenticación y autorización a partir de Google Fusion Tables privadas. También, gracias a otro de mis antiguos estudiantes de doctorado, Carlos Buil, podemos también hacer consultas federadas que combinan datos públicos y privados, utilizando SPARQL-DQP (\nhttp://www.oeg-upm.net/index.php/es/technologies/166-sparql-dqp\n).\nOptimización de reescritura de consultas basada en R2RML a bases de datos mySQL y Postgres, también realizado por Freddy Priyatna, que nos permite ejecutar consultas reescritas con un overhead muy pequeño, y que también se puede utilizar para la generación en modo ETL. Estamos ahora mismo preparando un artículo para el evaluation track de ISWC2013, así que cuando terminemos de escribir y ejecutar todos los tests que estamos haciendo ahora mismo, lo haremos disponible para la comunidad.\n[1] Freddy Priyatna, Carlos Buil-Aranda and Oscar Corcho. Applying SPARQL-DQP for federated SPARQL querying over Google Fusion Tables. ESWC2013 Demo&Poster session. May 2013\nProyectos\n\nQuery rewriting work from José Mora.\nODEMapster for relational DBs\nNOR2O for spreadsheets\nSemantic SEO (including sitemap4rdf, CKAN registration, Google registration, etc.)\nQuery federation over distributed endpoints. It would be great to have access not only to SPARQL endpoints, but also to wrapped sources with ODEMapster, NOR2O, etc.\nMappingpedia\nDISPEL usage and OGSA-DAI usage\nCarlos: Distributed SPARQL querying. In my PhD thesis I work in accessing and optimising different and distributed RDF repositories. Currently there is a repid increase of RDF repositories which are queriable using the SPARQL query language. Most of these RDF repositories offer access to them via SPARQL Endpoints which receive as an input a SPARQL query and the results are then presented to the users. In this PhD work I propose a way for accessing and optimising the queries to a set of SPARQL endpoints using SQL optimisation techniques.\nCarlos' Tasks\nJean Paul: Semantic Integration of Streaming Data from Heterogeneous Sensor Networks. I work on data access and integration of streaming data sources, using an ontology-based approach. User applications access a unified view of the streaming data sources, that is represented through a global domain-ontology. Using a stream-to-ontology mapping the system is able to rewrite the queries in terms of the original sources. The result is thrown as a continuous stream of annotated rdf triples, windowed subsets of triples or spaqrl result sets. We deal with time constraints, heterogeneity of data, integration with stored traditional data, noise and data uncertainty, common in sensor network deployments.\nJosé Mora:\nlink to description\nFreddy: Large scale ontology based data integration using MapReduce. In my PhD thesis, I will study the properties of data intensive science and explore the possibilities to employ Map Reduce concepts into large scale Ontology Based Data Integration in order to solve computational problems. That study involves using MapReduce concept to solve memory problem of ODEMapster and bulding formal logical foundation for this Map Reduce + Ontology Based Data Integration, and the possibility to attach weight in data integration elements, where this weight value may represent time or hierarchy in order to deal with inconsistency. I am also interested in using Answer Set Programming for Query plan generation, and dealing with impendance mismatch problem of R2O+ODEMapster, from the point of view of the language, processor, and interface.\nTasks & Progress\nTasks (out of the scope of specific R&D projects where each member is working)\n\nVideo explicando de manera intuitiva el funcionamiento de ODEMapster (responsables: I need a champion!!)\nShould be similar to\nhttp://weblog.clarkparsia.com/2011/03/07/sdq-information-integration-in-the-real-world/\nReplicate the content of this article (\nhttp://www.devx.com/semantic/Article/38700\n) with our tools.\nDownload and check\nhttp://trinity.datagraph.org/\nfor the provision of a Linked Data Web server (responsable: Alex)\nCheck out the following sites:\nhttp://infochimps.org/\n,\nhttp://kaggle.com/\n,\nhttp://datamarket.com/\nData Integration WG Calendar\n\n<googlecalendar>obe7c6ro0qlt8tqnedjgrdo4n4%40group.calendar.google.com&ctz=Europe/Madrid</googlecalendar>\nNext meetings and presentations\n\nEach week one of the members of the group should present briefly his status.\n2010-01-22 --> Oscar (on the planning of IGN database linked data generation). Details\nhere\n2010-02-04 --> Freddy (ODEMapster - Lessons learned so far). Details\nhere\n2010-02-25 --> Details\nhere\n2010-03-10 --> Freddy on ODEMapster 2 Architecture.\nSlides\nIndividual Meetings\n\n2010-02-09 --> Carlos, Freddy. General discussion about architecture of (proposed) our data integration system.\nMinutes\nCurrent projects\n\nSemantic Grid / Semantic e-Science\n:\nADMIRE\n,\nSemsorGrid4Env\nGeospatial Semantics\n:\nEspañaVirtual\nOther\n:\nWebN+1\n,\nPlanetData\nPast projects\n\nWS-DAIOnt-OWL, RSSGRID,\nOntoGrid\n,\nGeoBuddies\nProposals of MSc and Bachelor thesis\n\n---\nGeneral Roadmap",
  "speaker": "SYSTEM",
  "uuid": "d1cbd159-3329-48f9-9020-1b9dcc217f16"
}