{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Sentiment_Analysis \n\nContents\n[\nhide\n]\n1\nAnálisis de sentimientos\n1.1\nIntroducción\n1.2\nDefinición del problema\n1.3\nEnfoques existentes\n1.4\nLa visión del OEG\n1.5\nMás información\n1.6\nPresentación\nAnálisis de sentimientos\n\nIntroducción\n\nLos usuarios de Internet publican opiniones y comentarios sobre asuntos de toda índole que a menudo no están exentos de carga emocional.\nSe posicionan frente a una idea, producto, marca, servicio u opción política, y lo hacen a través de una miríada de medios: Twitter, Facebook, blogs, fórums especializados, el comentario a una noticia en un periódico, etc.\nA disposición de todo el mundo existe un torrente de información tan valiosa como heterogénea, y contiene los sentimientos de una masa que son del máximo interés para empresas de publicidad y estudiosos de las ciencias sociales. Aunque el volumen de esta información es tan grande que una persona navegando en internet no puede evaluar de manera precisa la imagen de una entidad dada, las técnicas de\nminería de datos\ny de\nprocesamiento del lenguaje natural\n(dos campos de la Inteligencia Artificial) pueden realizar este análisis de forma automática y dar resultados cuantitativos. El análisis de sentimientos es también asunto de interés del Ontology Engineering Group, de la Universidad Politécnica de Madrid, que cuenta con especialistas en ambas ramas.\nDefinición del problema\n\nEl análisis de los sentimientos de los usuarios de internet hacia una determinada entidad es un problema tan complejo que es necesario acotarlo para hacerlo tratable. Piénsese que Internet acoge actos comunicativos muy heterogéneos, porque engloba muchos canales que lo son. Hay fotos y textos, diálogos y monólogos, textos largos y mensajes breves, comentarios especializados y expresiones coloquiales, opiniones cualificadas y reacciones vulgares, frases en inglés y en español, emoticonos...\nNada reemplaza al análisis de una persona, capaz de reconocer el contexto, el tamaño del tipo de letra o simplemente entender una ironía. Pero el resultado de un análisis computerizado, a nivel estadístico, sí puede ser suficientemente representativo si el número de participantes es suficientemente elevado.\nEl OEG trabaja con\ntextos en castellano\n, procedentes de usuarios de\nTwitter\n,\nFacebook\n,\nsitios especializados\n,\nforums\ny\nblogs\n, y que se refieren a marcas pertenecientes a\n12 diferentes sectores\n(automoción, telecomunicaciones, cervezas, televisión, etc.) y realiza un análisis para determinar si a cada texto se puede atribuir una de las 8 emociones que hemos considerado como básicas (confianza/temor, amor/odio, satisfacción/insatisfacción, felicidad/tristeza).\nEnfoques existentes\n\nEl\nsentiment analysis\n, o el problema de clasificar los sentimientos de un texto hacia una entidad, es un tema de investigación activo que ha sido abordado siguiendo dos estrategias diferentes:\naprendizaje automático\ny\nsistemas de reglas\n.\nLas técnicas de aprendizaje automático parten de un\ncorpus\nde textos donde cada ejemplar ha sido asignado a una de las categorías predefinidas (habitualmente en clave de polaridad positiva / negativa / neutra). Esta asignación ha podido hacerse de manera manual (\nsupervisada\n), donde uno o más anotadores humano han ido decidiendo la naturaleza de cada texto o ha podido hacerse de manera automática (\nno supervisada\n), por ejemplo partiendo de las críticas de cine de los usuarios, que constan de un texto y un valor numérico. Puede leerse un resumen muy completo en [1]\nLos sistemas de reglas compendian las estructuras lingüísticas más habituales con carga emocional, y rastrean la aparición de estas expresiones en las frases. La equiparación de una regla (\n\"Me gusta X\"\n) no se hace con el texto directamente, sino con el resultado de un análisis lingüístico previo, que también incluiría por ejemplo otras personas u otros tiempos verbales (\n\"nos gustó X\"\n).\nLa visión del OEG\n\nLas técnicas de aprendizaje automático tienen la ventaja de que los mismos algoritmos funcionan en contextos muy heterogéneos, independientemente del idioma con una cobertura muy amplia. Los sistemas de reglas atribuyen un sentimiento a un texto de manera más cautelosa y ofrecen más precisión al precio de tener menor cobertura.\nEl OEG cuenta con recursos lingüísticos propios (Badele3000 [2], Calíope [3]) que han acelerado la redacción y exactitud de las reglas, y que han probado resultados explotables comerciales (precisión en torno al 70%, cobertura).\nBadele es una base de datos de colocaciones lingüísticas, y Calíope una herramienta de gestión de corpus lingüísticos, que junto con el analizador sintático Freeling de la UPC y la base de datos Eurowordnet constituyen la base de nuestro\nsoftware propio\nde análisis de sentimientos.\nMás información\n\nhttp://www.oeg-upm.net\n[1] Pang, B y Lee, L. Opinion mining and sentiment analysis. Foundations and Trends in Information Retrieval, Vol. 2, No 1-2 (2008) 1–135.\n[2] Bernardos, Mª S. y Barrios, M.A. Data model for a lexical resource based on lexical functions. Research in Computing Science, vol. 27. (2008)\n[3] Aguado de Cea, G., Bernardos, Mª S.: Calíope: herramienta para gestionar un corpus y un glosario de términos informáticos. In Proceedings of the 6th Annual Conference of the European Association of Languages for Specific Purposes (AELFE 2007). Lisbon (Portugal) (2007).\nPresentación\n\n[\n[1]\n]",
  "speaker": "SYSTEM",
  "uuid": "d1e87b5e-e5cd-4af2-a43e-48a0845efe69"
}