{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 105\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 105 of 111 \nthem and the Spanish models. More detailed analysis of the resources is described in [30] and \nin [31].  \n¾ Non Ontological Resource Reengineering. Many of the selected standards and medical \nvocabularies are not described in ontologies; therefore, these resources have to be \nreengineered and enriched into OWL ontologies before reusing them in the Nomenclature \nontology network. \n¾ Ontology Reuse. According to the needs recognized in the CQs, ontologies about general \ndomain as Time, Measures, and Geography are identified, analyzed, evaluated and selected in \norder to be integrated in the Nomenclature ontology network. \n¾ Ontology Conceptualization, Ontology Formalization and Ontology Evaluation of the \nPharma Reference and the Laboratory ontologies. \n¾ Ontology Implementation and Ontology Integration. The Phama Reference and the \nLaboratory ontologies are implemented with the first versions of the NeOn Toolkit provided by \nthe consortium. The language selected for this implementation is OWL. Later on, the different \nontologies implemented (reused and/or reengineered) are integrated in the implemented \nnetwork.   \n¾ Ontology Localization. The Nomenclature ontology network is located in Spain and created in \nSpanish but it will be provided in English, too to internationalize the ontology and to link it to the \nmain medical and pharmaceutical vocabularies of the world.  \nThe Nomenclature ontology network should be maintained and supported at present and in the \nfuture. The network should evolve according to the changes and suggestions given by the Spanish \npharmaceutical sector and by professionals. \n6.3.5. Lessons learned \nAs mentioned before, this building process of the Nomenclature ontology network follows the \nmethodological guidelines given by WP5. Such building process follows an incremental approach. \nThe first version of the reference Nomenclature ontology network is based on the ATC \nclassification and has been enriched by connecting it to general ontologies (e.g., time or \ngeographical ontologies) to describe some properties and add more knowledge. Finally, some \ndifferent ontologies about health vocabularies or new drug ontologies that have recently appeared \nin the web have been added to the network to increase and complete the knowledge of the \ndomain. \nThe main reasons for following the methodological guidelines of WP5 are that they allow a good \nreuse of the pharmaceutical resources available and that they enrich the Nomenclator network \nontology with ontology reuse of general ontologies (time, geographical) and non ontological reused \nstandards (ATC classification).   \nAdditionally, the approach proposed by WP5 for the Nomenclature ontologies permits modeling \nontologies that are more focused on achieving goals to the Semantic Nomenclature application. \nWith this network of ontologies it is easier to map the different ontologies and populate them. Other \nissue to take into account is the profit gained by carrying out Ontology Support activities that helps \nto develop successfully the Nomenclature ontology network. \n \n \n \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n",
  "speaker": "SYSTEM",
  "uuid": "d2e2df71-2b1c-464f-bd66-7107948b7198"
}