{
  "message": "SYSTEM: YouAndYourResearch.pdf: Página 8\nwhen you open a journal, as you turn the pages, you ask why you read some articles and not others. You\n\nhad better write your report so when it is published in the Physical Review, or wherever else you want it, as\nthe readers are turning the pages they won't just turn your pages but they will stop and read yours. If they\n\f\ndon't stop and read it, you won't get credit.\n \nThere are three things you have to do in selling. You have to learn to write clearly and well so that people\nwill read it, you must learn to give reasonably formal talks, and you also must learn to give informal talks.\n\nWe had a lot of so-called `back room scientists.' In a conference, they would keep quiet. Three weeks later\n\u0019\nafter a decision was made they filed a report saying why you should do so and so. Well, it was too late.\n\t\nThey would not stand up right in the middle of a hot conference, in the middle of activity, and say, ``We\nshould do this for these reasons.'' You need to master that form of communication as well as prepared\n\u0006\nspeeches.\n\u0006\nWhen I first started, I got practically physically ill while giving a speech, and I was very, very nervous. I\n\u0019\nrealized I either had to learn to give speeches smoothly or I would essentially partially cripple my whole\ncareer. The first time IBM asked me to give a speech in New York one evening, I decided I was going to\n\u0007\ngive a really good speech, a speech that was wanted, not a technical one but a broad one, and at the end if\n\u0017\nthey liked it, I'd quietly say, ``Any time you want one I'll come in and give you one.'' As a result, I got a\n\f\ngreat deal of practice giving speeches to a limited audience and I got over being afraid. Furthermore, I\n\u0017\ncould also then study what methods were effective and what were ineffective.\n\u0007\nWhile going to meetings I had already been studying why some papers are remembered and most are not.\n\u0019\nThe technical person wants to give a highly limited technical talk. Most of the time the audience wants a\nbroad general talk and wants much more survey and background than the speaker is willing to give. As a\n\u001d\nresult, many talks are ineffective. The speaker names a topic and suddenly plunges into the details he's\n\u0018\nsolved. Few people in the audience may follow. You should paint a general picture to say why it's\n\u0006\nimportant, and then slowly give a sketch of what was done. Then a larger number of people will say, ``Yes,\nJoe has done that,'' or ``Mary has done that; I really see where it is; yes, Mary really gave a good talk; I\n\u0001\nunderstand what Mary has done.'' The tendency is to give a highly restricted, safe talk; this is usually\n-\nineffective. Furthermore, many talks are filled with far too much information. So I say this idea of selling is\n\u001e\nobvious.\n\u000e\nLet me summarize. You've got to work on important problems. I deny that it is all luck, but I admit there is\n\u001f\na fair element of luck. I subscribe to Pasteur's ``Luck favors the prepared mind.'' I favor heavily what I did.\n\t\nFriday afternoons for years - great thoughts only - means that I committed 10% of my time trying to\nunderstand the bigger problems in the field, i.e. what was and what was not important. I found in the early\n-\ndays I had believed `this' and yet had spent all week marching in `that' direction. It was kind of foolish. If I\n \nreally believe the action is over there, why do I march in this direction? I either had to change my goal or\n\u0018\nchange what I did. So I changed something I did and I marched in the direction I thought was important. It's\n\u0007\nthat easy.\n\f\nNow you might tell me you haven't got control over what you have to work on. Well, when you first begin,\n\u0011\nyou may not. But once you're moderately successful, there are more people asking for results than you can\n!\ndeliver and you have some power of choice, but not completely. I'll tell you a story about that, and it bears\n \non the subject of educating your boss. I had a boss named Schelkunoff; he was, and still is, a very good\n\u000e\nfriend of mine. Some military person came to me and demanded some answers by Friday. Well, I had\n+\nalready dedicated my computing resources to reducing data on the fly for a group of scientists; I was knee\n\t\ndeep in short, small, important problems. This military person wanted me to solve his problem by the end\n \nof the day on Friday. I said, ``No, I'll give it to you Monday. I can work on it over the weekend. I'm not\n\u000e\ngoing to do it now.'' He goes down to my boss, Schelkunoff, and Schelkunoff says, ``You must run this for\n\u0017\nhim; he's got to have it by Friday.'' I tell him, ``Why do I?''; he says, ``You have to.'' I said, ``Fine, Sergei,\n\u001a\nbut you're sitting in your office Friday afternoon catching the late bus home to watch as this fellow walks\n\u001d\nout that door.'' I gave the military person the answers late Friday afternoon. I then went to Schelkunoff's\n\u000e\noffice and sat down; as the man goes out I say, ``You see Schelkunoff, this fellow has nothing under his\n\u000e\narm; but I gave him the answers.'' On Monday morning Schelkunoff called him up and said, ``Did you\n\t\ncome in to work over the weekend?'' I could hear, as it were, a pause as the fellow ran through his mind of\n\u0007\nwhat was going to happen; but he knew he would have had to sign in, and he'd better not say he had when\n\n",
  "speaker": "SYSTEM",
  "uuid": "d3786b5c-1226-4899-a20e-c5622832b233"
}