{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Uso_de_DBpedia_en_OEG \n\nTitle: AragoDBpedia (done by LocaliData)\nDescription (no more than 3 lines): We are using DBpedia to generate links to it from every municipality, and at the same time to alert the Aragonese Government of errors in Wikipedia, according to the comparisons that they can make with their official data, such as that one of population.\nProject Name: AragoDBpedia\nPerson to contact: Oscar Corcho\nTitle: First place at Jacathon 2014 [\nwebsite\n]\nDescription (no more than 3 lines): We are using DBpedia to create relations between geo resources avaliables at Aragon Open Data (AragoDBpedia) and Wikipedia or Cube Statistics information each them.\nProject Name: GeoDisplay-Finder of land information\nPerson to contact: Alejandro F. Carrera\nTitle:\nhttp://smartcity.linkeddata.es/\nDescription (no more than 3 lines): The ontology and dataset catalogues use DBpedia in order to specify the domains coverd by the resources (ontologies or datasets), and providing URIs for those licenses, formats and ontology languages for which an oficial URI hasn't been found. For the former use (specify domains) the grounding software from DynaLearn is used. That is, from tags in natural language representing domains, DBpedia entities are retrieved.\nProject Name: READY4SmartCities\nPerson to contact: María Poveda [\nslide\n]\nTitle: Supporting material for grade students\nDescription (no more than 3 lines): DBpedia is used by grade students in their practical work during the semester.\nProject Name: Semantic Web and Linked Data\nPerson to contact: Oscar Corcho / Raúl García\nTitle: datos.bne.es (\nhttp://datos.bne.es\n)\nDescription (no more than 3 lines): We have more than 20.000 links from BNE authors to DBpedia and we are currently exploiting these links to extract two properties: abstract in Spanish and thumbnail. We extract these information from DBpedia data dumps and add it to the datos.bne.es data set to display it later in the end-user portal (e.g.,\nhttp://datos.bne.es/autor/XX960938.html\n). The plan is to start a controlled mechanism to extract and add other properties such as for example place of birth or occupation/roles (novelist, painter, composer, etc. ).\nProject Name: datos.bne.es\nPerson to contact: Daniel Vila-Suero\nTitle: Grounding and alignment of QR models\nDescription (no more than 3 lines): DBpedia is used as a source of background knowledge for linking the concepts represented in QR models, thus making explicit their semantics and easing the later alignment among different QR models.\nProject Name: DynaLearn (\nhttp://dynalearn.eu\n)\nPerson to contact: Esther Lozano [\nslide\n]\nTitle:\nDescription (no more than 3 lines):\nProject Name:\nPerson to contact:",
  "speaker": "SYSTEM",
  "uuid": "d3c440cf-48ab-4e18-899e-709856be5477"
}