{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 25\nGu´ıa de orientaci´on para investigadores noveles\n25\nque B ha realizado, le ha permitido adem´as escribir varios art´ıculos que han\nsido publicados en un par de congresos internacionales. “A”, sin embargo,\nest´a haciendo un buen trabajo y est´a muy contento porque le apasiona el\ntema de su investigaci´on, pero los resultados de su investigaci´on s´olo le han\npermitido escribir un art´ıculo que ha sido aceptado en un congreso nacional\ny debido al tiempo que le consume la investigaci´on, no se ve con fuerzas de\nbuscarse un trabajo adicional, porque eso le impedir´ıa centrarse en su in-\nvestigaci´on. Durante los a˜nos previos a la presentaci´on de la tesis, B decide\nmarcharse de nuevo a otro centro para realizar otra estancia de tres meses,\nesta vez a Estados Unidos, a la Universidad de Berkeley en California. Por el\ncontrario, el departamento de A convoca plazas de t´ecnico para un proyecto\ny como la investigaci´on de A est´a relacionada con dicho proyecto, solicita\nuna de esas plazas y ﬁnalmente se la conceden. En el tiempo que le queda\na “A” para presentar la tesis, se esfuerza mucho en publicar en congresos\nde prestigio o en revistas, pero no siempre elige los congresos adecuados,\nﬁj´andose m´as en los lugares en los que se celebran que en lo que le pueden\nvaler para el curriculum. Por otro lado, B sigue con su investigaci´on, envian-\ndo publicaciones a congresos internacionales de prestigio, preferentemente,\ny ha intentado publicar un art´ıculo en una revista pero sin ´exito. Adem´as,\nal estar en la fase de contrato de la beca FPU, su departamento le propone\ndar unas cuantas clases de pr´acticas, no muchas, en una de las asignaturas\nque ´este imparte. El tiempo pasa muy deprisa y llega el momento en que A\ny B presentan sus respectivas tesis, B opta para la menci´on de doctorado\neuropeo, ya que ha hecho una estancia de tres meses en Inglaterra y durante\ntodos este tiempo se ha esforzado por aprender y mejorar su ingl´es. Es m´as,\ndurante su estancia en California y gracias al trabajo realizado all´ı con-\nsigui´o publicar un art´ıculo en la revista “Journal of the ACM” indexada por\nSCI y con un factor de impacto de 2,917. Finalmente, los dos obtienen la\ntesis con sobresaliente “cum laude” y ya tienen la m´axima titulaci´on que\nofrece la universidad: el t´ıtulo de Doctor. Ahora, una vez conseguido, ambos\npretenden enviar a la ANECA la solicitud para la evaluaci´on del profesorado\npara la contrataci´on para la ﬁgura de Profesor Ayudante Doctor, para que\nen caso de que se convoquen plazas de Ayudante Doctor en alguna Univer-\nsidad, puedan optar a las mismas.8\nDe acuerdo a los criterios establecidos por la ANECA, la puntuaci´on\nobtenida (esta puntuaci´on es orientativa, ya que se desconoce cu´al es el\ncriterio exacto que aplica la ANECA) para cada aspirante ser´ıa la que se\nmuestra en el cuadro 4.\n8La carrera investigadora de este supuesto anterior ha sido descrita muy brevemente y\na grandes rasgos, con pocos ejemplos para que se pueda entender de la forma m´as clara\nposible, pero en la realidad se deber´ıa proporcionar una descripci´on m´as detallada de los\nrespectivos historiales acad´emicos e investigadores de cada una de estas personas.\n",
  "speaker": "SYSTEM",
  "uuid": "d48261bb-aa18-4405-b5b1-c798e2e846fe"
}