{
  "message": "SYSTEM: Instrucciones_para_rellenar_el_curriculum_abreviado_CVA.pdf: Página 2\n \n2 de 2 / Instrucciones para rellenar el currículum abreviado \n \nCURRÍCULUM ABREVIADO (CVA) \n \n \nParte C. MÉRITOS MÁS RELEVANTES (ordenados por tipología) \n \nTeniendo en cuenta las limitaciones de espacio, detalle los méritos más relevantes \nordenados por la tipología que mejor se adapte a su perfil científico. Los méritos aportados \ndeben describirse de una forma concreta y detallada, evitando ambigüedades.  \n \nLos méritos aportados se pondrán en orden cronológico inverso dentro de cada apartado. \nSalvo en casos de especial importancia para valorar su CV, se incluirán únicamente los \nméritos de los últimos 10 años.  \n \nC.1. Publicaciones \n \nIncluya una reseña completa de las 5-10 publicaciones más relevantes. \n  \nSi es un artículo, incluya autores por orden de firma, año de publicación, título del artículo, \nnombre de la revista, volumen: pág. inicial-pág. final. \n \nSi se trata de un libro o de capítulo de un libro, incluya, además, la editorial y el ISBN. \n \nSi hay muchos autores, indique el número total de firmantes y la posición del investigador \nque presenta esta solicitud (p. ej., 95/18). \n \nC.2. Participación en proyectos de I+D+i \n \nIndique los proyectos más destacados en los que ha participado (máximo 5-7), incluyendo: \nreferencia, título, entidad financiadora y convocatoria, nombre del investigador principal y \nentidad de afiliación, fecha de inicio y de finalización, cuantía de la subvención, tipo de \nparticipación (investigador principal, investigador, coordinador de proyecto europeo, etc.) y si \nel proyecto está en evaluación o pendiente de resolución.  \n \nC.3. Participación en contratos, méritos tecnológicos o de transferencia \n \nIndique los contratos más relevantes en los que ha participado, así como los méritos \ntecnológicos o de transferencia (máximo 5-7), incluyendo título, empresa o entidad, nombre \ndel investigador principal y entidad de afiliación, fecha de inicio y de finalización, cuantía y \notros datos que considere de interés. \n \nC.4. Patentes \n \nRelacione las patentes más destacadas, indicando los autores por orden de firma, \nreferencia, título, países de prioridad, fecha, entidad titular y empresas que las estén \nexplotando. \n \nC.5, C.6, C.7… Otros \n \nMediante una numeración secuencial (C.5, C.6, C.7...), incluya los apartados que considere \nnecesarios para recoger sus principales méritos científicos-técnicos: dirección de trabajos, \nparticipación en tareas de evaluación, miembro de comités internacionales, gestión de la \nactividad científica, comités editoriales, premios, etc. \n \nRecuerde que todos los méritos presentados deberán presentarse de forma concreta, \nincluyendo las fechas o período de fechas de cada actuación.  \n \nEl currículum abreviado pretende facilitar, ordenar y agilizar el proceso de evaluación. \nMediante el número de identificación individual del investigador es posible acceder a los \ntrabajos científicos publicados y a información sobre el impacto de cada uno de ellos. Si \nconsidera que este currículum abreviado no recoge una parte importante de su trayectoria, \npuede incluir voluntariamente el currículum en extenso en la documentación aportada \n(siempre que esté previsto en la convocatoria), que será facilitado también a los evaluadores \nde su solicitud.    \n",
  "speaker": "SYSTEM",
  "uuid": "d51989df-4dcd-4852-9ad5-f4eefc0cd2ef"
}