{
  "message": "SYSTEM: ISWC2010_Andres_SemGroCrosLingFol.pdf: Página 5\nSemantic Grounding of Cross-Lingual Folksonomies\n5\nthe tag and use the Yahoo spelling service to ﬁnd alternative representations of\nthe tag. Simultaneously, the tags in the context are ﬁltered to select their active\ncontext [12], that is, the set of tags in the context that are most related to the\nanalyzed tag.\nNext we query our multilingual sense repository to ﬁnd the possible senses\nfor the tag. Then in case of an ambiguous tag, a sense disambiguation activity\nis executed to select the sense that best represents the tag. This disambiguation\nactivity may use the active context, as we will see in the evaluation section.\nFinally, the output of this process is a DBpedia resource that represents the\nintended meaning of the input tag. In the following section, we describe each\nof the activities, providing details of the technique and resources that are used,\nand giving some examples and intermediate results.\n3.1\nTag Preprocessing\nEven though tags used in folksonomies tend to converge [11], tags are written\nfreely by users. Thus, several slightly modiﬁed tags can refer to the same concept.\nFor instance, tags such as nyc, newyork, and New york might refer to New York\nCity. Therefore, our ﬁrst activity is focused on ﬁnding a tag normalized version\nthat can lead us to better identify the main concept they refer to8. Our approach\ngrounds tags to Wikipedia article titles as ﬁrst step towards their normalization.\nTo achieve our task, ﬁrst we attempt to beneﬁt from Wikipedia redirection\npages9 in those cases where the tag has been considered as an alternative to an\narticle title by Wikipedia users (e.g., this is the case of the nyc that has been\nconsidered in Wikipedia as an alternative to the New York City article). We also\nmodify the tags to transform them to the standard notation of Wikipedia article\ntitles: the initial letter of each word is in upper case except for in-between words\nsuch as the, for, and in English and el, la, los, por in Spanish, and words are\nseparated using the ’ ’ character. Finally, if after those modiﬁcations we have\nnot found a Wikipedia article title we use the Yahoo! spelling service10 to split\nconcatenated words and detect misspellings. Then we transform the spelling\nsuggestions into valid Wikipedia article titles.\nIn the set of tags that we handle in our evaluation, and which is described\nlater, from the set of tags that evaluators were able to identify their meaning\nand language, we were capable of associate the 86.9% of tags in English, and\n86.7% in Spanish to Wikipedia articles, 76.4% of the tags in English and 76.6%\nin Spanish required modiﬁcations to ﬁnd the Wikipedia article.\n3.2\nActive Context Selection\nAs we are interested in the tag meaning in each tagging activity (i.e., the action\nof tagging a resource), we deﬁne the context of a tag in a resource as the set\n8 Please note that the result of this pre-processing is not necessarily the sense that we\nmaybe looking for in all cases.\n9 http://en.wikipedia.org/wiki/Redirects_on_wikipedia\n10 http://developer.yahoo.com/search/boss/\n",
  "speaker": "SYSTEM",
  "uuid": "d59f0de8-bf83-47e8-8c87-4157bcc7b7cc"
}