{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 13\nGu´ıa de orientaci´on para investigadores noveles\n13\ncriterios que se valoran cuando se solicita la evaluaci´on para Profesor\nContratado Doctor (ﬁgura 2). Como ya mencionamos en su momento,\nla ANECA proporciona unos principios y orientaciones y nos da un\nm´aximo de puntuaci´on para cada apartado y bloque, pero no propor-\nciona detalles concretos respecto a lo que vale cada publicaci´on, o el\nvalor que tiene un tipo de publicaci´on sobre otro.\nPROFESOR AYUDANTE DOCTOR\nPara poder optar a la evaluaci´on positiva por parte de la ANECA para\nla ﬁgura de Profesor Ayudante Doctor es necesario estar en posesi´on\ndel t´ıtulo de Doctor. Adem´as, se valorar´an los siguientes criterios de\nla manera indicada en cada uno de ellos.\nA. Experiencia investigadora\nA.1. Publicaciones cient´ıﬁcas con proceso an´onimo de revisi´on por\npares\nLas publicaciones que se valoran principalmente son los art´ıculos publi-\ncados en revistas de prestigio reconocido. Para conocer c´omo de presti-\ngiosa es una revista, podemos recurrir al factor de impacto de dicha re-\nvista. Para ello, existen una serie de bases de datos, como por ejemplo,\nel Science Citation Index (SCI) o publicaciones anuales como el Jour-\nnal Citation Reports (JCR) producidas por una empresa de car´acter\nprivado, denominada Institute for Scientiﬁc Information (ISI), donde\nse recogen los respectivos factores de impacto6 de las revistas de una\ndeterminada ´area de conocimiento. Estas bases de datos son confec-\ncionadas por empresas privadas y s´olo son accesibles previo pago. Des-\nde la Universidad de Alicante, por ejemplo s´ı que podremos consultar\nestas bases de datos y estos r´ankings, puesto que tiene subscrito el\nservicio a trav´es de la FECYT (Federaci´on Espa˜nola de Ciencia y Tec-\nnolog´ıa). Para conseguir la m´axima puntuaci´on en este apartado (35\npuntos sobre 100), es necesario que se aporten como m´ınimo 4 publi-\ncaciones cient´ıﬁcas recogidas en SCI, pudi´endose sustituir un art´ıculo\npor una patente internacional. Sin embargo, se puede considerar un\nmenor n´umero de trabajos si corresponden a publicaciones de eleva-\nda calidad en sus ´areas (como por ejemplo, publicaciones en revistas\nsituadas en el primer tercio del listado de su especialidad en el Science\nCitation Index). Ejemplos de revistas citadas por el SCI en el campo\n6El factor de impacto es una medida de la importancia de una publicaci´on cient´ıﬁca,\ncalculada por el ISI de forma anual.\n",
  "speaker": "SYSTEM",
  "uuid": "d5a3bf43-b15e-4734-8b3b-ea543e709430"
}