{
  "message": "SYSTEM: QRVocabulary.pdf: Página 3\nProject No. 004074                                 NATURNET-REDIME                                                           D.6.1 \n85 / 103 \nRemarks: \nAttributes are often used as conditions in model fragments to indicate that a specific \nprocess is only active when certain attributes have certain values. \nA.2.4 Agents  \nAgents are used to model entities outside of the modelled system. Agents can have \nquantities influencing the rest of the system, which are sometimes called exogenous or \nexternal influences.  \n \nExamples: \n• James fishing in a pond, decreasing the number of fish within that ecosystem. \n• John filling one of the tubes in the communicating vessels system \n• A manager setting a Brazilian Cerrado forest on fire. \nA.2.5 Assumptions \nAssumptions are labels that are used to indicate that certain conditions are presumed to \nbe true. They are often used to constrain the possible behaviour of a model.  Because \nthey describe neither structural nor behavioural aspects of a system, they belong to \nneither the structural building blocks nor the behavioural building blocks categories.  \n \nExamples: \n• The height of water in each of the fluid containers in the communicating vessels \nsystem is greater than zero. \n• The populations within an ecological system are closed (no migration). \n• Adhesion and cohesion are assumed to have no effect on the height of a fluid in \na container.  \n \nRemarks: \nAssumptions can only be used as a condition and are often combined with an inequality \nrelation as a consequence. \nA.3: Behavioural Building Blocks: Features \nThe behavioural modelling ingredients are further distinguished into features and \ndependencies. The behavioural features describe the variable aspects of entities of a \nsystem. \nA.3.1 Quantities \nQuantities represent changeable features of entities and agents.  Each quantity has two \nassociated quantity spaces: a definable one for the magnitude, and the default quantity \nspace {Min, Zero, Plus} for the derivative of the quantity. \n \nExamples: \n• A contained liquid has the quantities of: volume, height and pressure. \n• The temperature of an object. \n• The size of a population. \nA.3.2 Magnitude \nThe magnitude indicates the current value of a quantity. \n \nExample: \n• The magnitude of the temperature of the water is its boiling-point.  \n",
  "speaker": "SYSTEM",
  "uuid": "d747bac5-736c-447b-abdd-e658e613017a"
}