{
  "message": "SYSTEM: FormularioCPM_asun.pdf: Página 11\n3.4. Indicar los ámbitos/retos a los que aplica la solución: *\nReto 1: Recuperación automática de documentos similares a uno propuesto en una\ncolección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nÁmbito 1: Inteligencia competitiva, control y diseño de políticas públicas: aplicación a la I+D+i\n3. Solución III\n3.1. Breve resumen de la propuesta de solución: especificación funcional (máx. 6.000 caracteres) *\n3.2. En caso de que se trate de una solución de SW\ncomercial, indique las licencias de uso\n3.3. En base a su solución propuesta, indique entre las siguientes opciones:\n­ SECCIÓN B: DESCRIPCIÓN DE SOLUCIONES (PRODUCTOS O SERVICIOS) ­\nReto 2: Recuperación automática de documentos a partir de consultas en texto libre sobre\nuna colección amplia de documentos (patentes, publicaciones científicas, ayudas I+D+i, etc).\nReto 3: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Visión de conjunto.\nReto 4: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Análisis de la evolución temporal y descubrimiento de temáticas emergentes.\nReto 5: Herramientas automáticas para el análisis y visualización de grandes fondos\ndocumentales: Comparación entre conjuntos a partir de los contenidos textuales.\nReto 6: Perfilado automático de expertos, investigadores, centros de investigación y\nempresas a partir de los proyectos subvencionados, patentes registradas, publicaciones\ncientíficas, etc.\nReto 7: Extracción terminológica automatizada. Asistencia automatizada a la construcción de\ntaxonomías y recursos semánticos multilingües.\nReto 8: Desambiguación de nombre de autores de publicaciones científicas, patentes, etc.\nSecretaría de Estado para la Sociedad de la Información y la Agenda Digital\nCalle del Capitán Haya, 41, 28020 Madrid\nLa solución propuesta no existe en el mercado\nLa solución propuesta existe en el mercado, pero nunca se ha usado en los siguientes ámbitos\nsectoriales en que se propone aplicar:\nLa solución propuesta existe y se comercializa en el mercado\nInteligencia Competitiva\nSanidad\nJusticia\nOtro(s) ámbitos(s):\n­11­\n(*) Campos obligatorios\nAÑADIR SOLUCIÓN III (marque esta casilla para habilitar los campos asociados a la solución III)\nversión 1.2.\n#\nLas ontologías proporcionan la capa semántica   en el procesamiento de lenguaje natural, y \nfacilitan el desarrollo de aplicaciones complejas mediante la integración de fuentes de \ndatos heterogéneas. A día de hoy, la mayor parte de las ontologías tienen sus términos \netiquetados y están comentadas en inglés.   Existen también   ontologías   en otros idiomas \ncomo castellano, francés,   italiano, por mencionar algunos; sin embargo, el número   de \ndichas ontologías   está   muy lejos del número   de ontologías   existentes en inglés.   Además,   \nes difícil encontrar ontologías en las lenguas autonómicas   co-oficiales en España.   Esto \nlimita enormemente el potencial de las ontologías para ser utilizadas en aplicaciones que \nestán dirigidas a determinadas comunidades de hablantes. Además,   coarta las \nposibilidades de integración   de recursos en diferentes idiomas en el desarrollo de \naplicaciones.  \nPor otro lado, es necesario tener en cuenta que las conceptualizaciones de la realidad no \nsiempre son válidas   independientemente de la lengua y, sin embargo, la interoperabilidad \nentre dichas conceptualizaciones es necesaria en el marco de la globalización. \n \nEn consecuencia, es necesario desarrollar ontologías localizadas. La localización de \nontologías se define como el proceso que consiste en adaptar una ontología a las \nnecesidades específicas de un grupo (una comunidad), que pueden estar caracterizadas \npor una lengua común, una cultura común   o un entorno geopolítico   específico.   Para dar \nsoporte a dicha localización   es necesario disponer tanto de metodologías    como de \nherramientas que soporten la localización   de ontologías.  \n \nEl desarrollo de ontologías   multilingües   se perfila como un campo en el que los \ntraductores intervienen junto con los ingenieros del conocimiento para que esas ontologías \npuedan gestionar información   en distintas lenguas, ya que el proceso de localización   es \nfundamental para reutilizar ontologías ya existentes en lugar de construirlas desde cero. \nPor otro lado, es necesario tener en cuenta que las conceptualizaciones de la realidad no \nsiempre son válidas   independientemente de la lengua y, sin embargo, la interoperabilidad \nentre dichas conceptualizaciones es necesaria en el marco de la globalización. \n \nUn enfoque “naïve para desarrollar este tipo de ontologías localizadas consiste en aplicar \ntraducción   automática   tanto a las ontologías ya existentes como a otras que se vayan \ndesarrollando después.   Sin embargo, el lenguaje forma un todo con el entendimiento y \ncategorización   que las personas hacen de la realidad. Éste,   de hecho, es uno de los \nprincipios básicos   de la tradición cognitiva-funcional. El propio desarrollo de ontologías ha \nde estar guiado, incluso en su nivel conceptual, por una serie de técnicas,   patrones de \ndiseño y guías metodológicas   con el propósito   de que dichas ontologías   sean multilingües.   \nComo consecuencia, el desarrollar una ontología (o reutilizar una ya desarrollada) y \ntraducirla a diferentes idiomas de forma automática   no es un enfoque totalmente válido   \nporque se requiere además   de una reorganización de los conceptos y sus relaciones.  \n \nLa disponibilidad de ontologías multilingües, como resultado de la actividad de localización, \n#\n#\n#\n#\n",
  "speaker": "SYSTEM",
  "uuid": "d7ae8988-7e73-4465-a4ab-c31dfe6aea72"
}