{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/RedECiencia \n\n3ª Reunión Plenaria\n\nFechas: 29-30 de Septiembre de 2009\nUbicación: Universidad Politénica de Valencia\nResumen:\nLa reunión se estructuró en un conjunto de sesiones plenarias (para poner en \ncontexto el estado de la Red, para planificar las actividades para el\naño 2010 y presentar temas de interés para la red) y sesiones paralelas para\nlás áreas de Infraestructura (tanto Grid como de Supercomputación) y de Aplicaciones.\nEn concreto, en la sesión de Aplicacion se realizaron 15 presentaciones cortas \nde 20 aplicaciones y pilotos. Como resumen, todas las áreas de científicas representadas \nestaban más preocupadas por el uso de recursos computacionales de forma masiva y \neficiente que en la explotación de los datos en sí. Incluso en las aplicaciones\nen las que se hacía especial énfasis en el tamaño de los datos que manejaban\n(ver más abajo), el aspecto de storage management prevalecía frente\na los mecanismos para la explotación a posteriori de esos datos. Hubo gente\nque habló de anotaciones, pero para mi decepción descubrí charlando con ellos\nque no había nada de semántica detrás. En el caso que más me llamó la atención,\nlos proyectos que presentó Raúl Ramos de CETA/CIEMAT en el área de Archivos,\nresulta que las anotaciones se representaban en XML, que era el archivo de \nHibernate que utilizaban para representar el modelo de la base de datos en el que\nguardaban la información que les era relevante. Las anotaciones se hacían \nmanualmente y no preveían a corto plazo su uso.\nLas aplicaciones/pilotos a los que mejor les podría interesar nuestro trabajo\nserían las siguientes:\nFusión (Francisco Castejón, CIEMAT)\nFísica de altas energías\nCMS (Gonzálo Merino, PIC/CIEMAT)\nBiomedicina\nCD-HIT (Jose María Fernández González, CNIO)\nAstrofísica\nMAGIC (Christian Neissner, PIC)\nArchivos (Raúl Ramos, CETA/CIEMAT)\nCon respecto a la sesión de Planes y Renovación de la red para 2010, parece ser\nque con la formación de la NGI española, su alineamiento con EGI.eu y demás, se \nvan a reajustar los objetivos de la Red. Así, la NGI asumirá el área\nde operaciones, mientras que la Red se quedará con la parte de Usuarios y Aplicaciones.\nPor cierto, el área de Middleware se integrará dentro del área de Aplicaciones.\nCon respecto al área de soporte a las comunidades de usuarios, decir que se crearán\ngrupos de trabajo temáticos, y ahí posiblemente sea más fácil dirigir nuestro trabajo.\nEsta división también se hará en la parte de aplicaciones, pero esta vez no sólo teniendo \nen cuénta el área temática, sino también a factores tecnológicos –básicamente los requisitos\nque tengan: repositorios, cloud…-.\nDos apuntes más. Primero que se van a comenzar diversas actividades en el plano formativo.\nFundamentalmente, se va a poner en marcha una plataforma de formación, se recopilará\ntanto material como ejemplos de infraestructura y aplicaciones, y se organizarán cursos tanto\npresenciales como online. Segundo, se está en proceso de crear un área de repositorios\ndigitales. Si bien no se dieron detalles en ningún momento, parece ser que en el área estará\norientada tanto a en su vertiente tecnológica como de contenidos.\nFinalmente, Ruben Santiago de la UCM (del grupo de Nacho Martín Llorente) hizo una \npresentación sobre Grid y Clouds, que estuvo pero que muy bien. Las transparencias están disponibles \nen el portal de la Red y también en la página de\nRubén\n.",
  "speaker": "SYSTEM",
  "uuid": "d8d8f229-a036-4c41-a56d-9b52ffe722d7"
}