{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 28\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97753\nGeneral de Política Universitaria, cuando se trate de países sin concierto con la Seguridad \nSocial española o cuando las coberturas de este concierto fueran insuficientes. La cobertura \nde este seguro alcanzará única y exclusivamente hasta el límite de la póliza contratada por \nel Ministerio de Educación y para el período para el que fuera concedido el traslado.\nArtículo 47.  Requisitos de los solicitantes.\n1.  Podrán solicitar el traslado temporal, los beneficiarios de ayudas en régimen de \ncontrato en prácticas o que se encuentren en posesión del Diploma de Estudios Avanzados \no mediante el correspondiente certificado académico acreditativo de que se encuentra en \nel período de investigación del Programa de Doctorado y hayan obtenido informe favorable \na la memoria de seguimiento del año anterior.\n2.  Todo el período de traslado temporal deberá superponerse con el período de \nactividad de la ayuda de FPU, bien de beca o de contrato en prácticas, no pudiendo por \nesta causa superarse los 48 meses de duración máxima de la misma, establecido en el \nartículo 6 de esta convocatoria.\nArtículo 48.  Presentación de solicitudes.\n1.  El formulario de solicitud, en el impreso normalizado o aplicación informática \ndisponible en la página Web http://web.educación.es/, deberá presentarse por los \ninteresados en los órganos competentes de los organismos o entidades de adscripción de \nbeneficiarios de ayuda de FPU.\n2.  El formulario de solicitud deberá acompañarse de la siguiente documentación:\na)  Solicitud del interesado informada favorablemente por el director de tesis y, según \ncorresponda, por el Vicerrector o responsable legal del centro de adscripción del beneficiario \nde la ayuda de FPU.\nb)  Programa detallado de los estudios e investigación que pretende realizar durante \nsu estancia.\nc)  Carta de admisión del centro extranjero e informe del investigador receptor que \navale el trabajo que realizará el becario durante el traslado temporal.\n3.  La presentación de solicitudes para realizar el traslado temporal al extranjero, \npodrá cursarse durante el mes de marzo o de septiembre de 2010, para los traslados que \nse inicien en julio de 2010 y enero de 2011 respectivamente.\n4.  Los organismos y entidades de los centros de adscripción que hayan recibido \nsolicitudes de traslado temporal, remitirán los formularios de solicitud y toda la \ndocumentación original presentada a la Dirección General de Política Universitaria, antes \ndel 15 de abril de 2010 y el 15 de octubre de 2010, para las solicitudes presentadas en \nmarzo de 2010 y septiembre de 2010 respectivamente.\nArtículo 49.  Evaluación y selección de solicitudes.\n1.  Las solicitudes serán evaluadas por una Comisión de evaluación integrada por al \nmenos un experto de cada área en la que se presenten solicitudes, que será designada \npor la Director General de Universidades y estará presidida por el titular de la unidad \ninstructora del procedimiento.\n2.  La evaluación de solicitudes tendrá como criterios de valoración el objeto del \ntraslado temporal, la duración, la idoneidad del centro de destino con relación a la mejora \nde la formación de los beneficiarios, el plan de trabajo y del desarrollo del proyecto de \ntesis.\n3.  La unidad instructora del procedimiento, podrá solicitar información complementaria \na la vista de los informes de evaluación de las solicitudes.\n4.  La Comisión de selección compuesta conforme a lo establecido en el artículo 32 \nde esta convocatoria, elevará el correspondiente informe y el órgano instructor elevará la \npropuesta al Director General de Política Universitaria, que adoptará la resolución que \ncorresponda de acuerdo con las disponibilidades presupuestarias.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "d9057d15-c143-40a9-86c1-3b60a650b8bf"
}