{
  "message": "SYSTEM: Enunciados-SP.pdf: Página 9\nEjercicios de Sistemas de Producción \n_____________________________________________________________________________________ \n_____________________________________________________________________________________ \nAsunción Gómez Pérez.  Facultad de Informática. Universidad Politécnica de Madrid. \n9 \n Ejercicio 7: Ejercicio de descuento en trenes \nSupóngase una agencia de viajes que ofrece viajes de trenes a sus clientes.  Los  viajes tienen unos \natributos como son: el lugar de origen y el lugar de destino y una tarifa inicial que se utilizará para \ncalcular el precio final del viaje. Los viajes en tren se caracterizan por el tipo de tren (ave, talgo) utilizado \nen el viaje, por la clase en la que se viaja (turista o preferente),  por el periodo de salida (blanco o azul), el \ntipo de cliente (asiduo o esporádico)  y el tipo de reducción, que puede tomar los valores siguientes \n(tarifa-pensionista y tarifa-estudiante).  \n \nLos precios de un viaje en clase turista, entre dos ciudades, son los siguientes, y dependen del tipo de tren \nen el que se viaja: \n \nCiudad-1 \nCiudad-2 \nAVE \nTalgo \nMadrid \nCórdoba \n4000 \n3.500 \nMadrid \nSevilla \n5000 \n4000 \nBarcelona \nMadrid \n----- \n5000 \n.... \n..... \n...... \n..... \n \nSe sabe que existen las siguientes reglas para calcular el precio final:.  \n• \nSi el viajero en clase preferente, los precios de la tabla se ven incrementados en un 30%. \n• \nSi el periodo de salida es de color azul, los precios de la tabla se reducen un 10%. Si es blanco se \nmantienen. \n• \nSi  el cliente usa normalmente el tren como medio de transporte en sus desplazamientos, los precios \nde la tabla se reducen un 10%, y se mantienen si el cliente no es asiduo. \n• \nSi el viajero es menor de 22 años se le aplica la tarifa de  estudiante. \n• \nSi el viajero es mayor de 65 años, la tarifa que se le aplica es la de pensionista. \n• \nSi el viajero compra un billete de ida y vuelta, existe un descuento adicional del 10% siempre que \nviaje en el mismo tipo de tren y no tenga tarifa estudiante o pensionista. \n• \nSi el viajero compra un billete de ida y vuelta, existe un descuento adicional del 5% si no viaja en el \nmismo tipo de tren y no tenga tarifa estudiante o pensionista. \n• \nSi el viajero tiene una tarifa de estudiante  paga el 60% del billete en cada viaje de ida y de vuelta. \n• \nSi el viajero tiene una tarifa de pensionista paga el 70% del billete en cada viaje de ida y de vuelta. \n \nLos descuentos y suplementos se aplican en el siguiente orden. Primero se analiza si existe un suplemento \npor viajar en clase preferente, después, y en el siguiente orden se analizan: el periodo de salida, si el viaje \nes de ida y vuelta,  el tipo de cliente, y los descuentos por tarifa. \n \nRepresentar  utilizando el formalismo de sistemas de producción: \na) Indicar detalladamente los elementos que forman parte de la base de hechos inicial del sistema. \nb) Indicar el formato de los elementos de condición que se utilizan en las reglas e indicar para qué sirve \ncada uno. \nc) Representar, utilizando el menor numero de reglas posible, la parte del enunciado que permite \ncalcular el precio final de los billetes de tren. El conjunto de reglas debe realizarse de tal forma que \nsea fácil añadir y borrar reglas en el sistema. \nd) Identificar y justificar la estrategia de control . \ne) Supóngase que un viajero  de 68 años, cliente asiduo de la compañía de tren, que compra un billete \nde  Madrid a Córdoba en el ave, en clase preferente, en un día de color azul.  Describir \ndetalladamente cada uno de los ciclos de funcionamiento de la estrategia de control en el cálculo del \nprecio final del billete. \nf) \nSupóngase que un viajero  de 68 años, cliente asiduo de la compañía de tren, que compra un billete \nde ida y vuelta de Madrid a Córdoba en el ave, en clase preferente, en un día de color azul. Describir \ndetalladamente cada uno de los ciclos de funcionamiento de la estrategia de control en el cálculo del \nprecio final del billete. \ng) Supóngase que un viajero  de 50 años, cliente asiduo de la compañía de tren, que quiere comprar un \nbillete de ida y vuelta de Madrid a Córdoba y le da igual el tipo de tren, en clase preferente, en un día \nde color azul.  Indíquese  detalladamente los pasos que daría el sistema de producción para calcular el \nprecio final  del billete.  \n",
  "speaker": "SYSTEM",
  "uuid": "d9fd9b55-a965-47e3-8647-9f71031b165f"
}