{
  "message": "SYSTEM: Descripcion-OEG.pdf: Página 10\nOntology Engineering Group. Universidad Politécnica de Madrid \nPágina 10 de 42 \nmás actuales, tales como desarrollo ágil, sistemas de configuración de software, repositorios de \ncódigo compartido, pruebas automáticas, etc. Para soportar los citados entornos y proporcionar \nla agilidad necesaria en los ciclos de desarrollo de cada proyecto, cada uno de los equipos y \nmateriales que se describen a continuación cumple distintos roles. \n• \nEn cuanto a los sistemas cliente, se dispone de equipos de sobremesa y portátiles \nque se asignan a cada usuario según sus necesidades y preferencias (Windows, Linux, \nMac OS) así como el software de trabajo y desarrollo que necesiten. Se dispone de 27 \nordenadores de sobremesa y  14 portátiles que son utilizados por los investigadores \npara sus desarrollos y pruebas locales.  \n \n• \nEn cuanto a los sistemas servidor, se cuenta con dos ramas, los que usan versiones \nde Windows Server y los que usan Linux (la gran mayoría Ubuntu Server Edition). Se \ncuenta  con 8 ordenadores de sobremesa que se usan en distintos proyectos con \nfunciones de servidor de desarrollo y  pruebas, así como para repositorios de código \n(repositorios Maven, Git, SVN, etc.). \nPor otro lado, hay disponibles 17 servidores que cubren principalmente las funciones \ndedicadas a los entornos de desarrollo, pre-producción y producción, servidor de correo y \nsistemas de configuración del software y gestión de proyectos. Asimismo, se cuenta con 1 \nNetwork Attached Storage (NAS), 1 Storage Area Network (SAN) y una impresora. \nFinalmente, el grupo OEG posee dos  racks ubicados en un CPD en la Escuela Técnica \nSuperior de Ingenieros Informáticos (hasta ahora, Facultad de Informática). Tiene la \nrefrigeración necesaria, control de acceso restringido y sistema de extinción de incendios por \nCO2. \nEl OEG también presta varios servicios a la comunidad científica, así como al tejido empresarial \nespañol, tales como el capítulo español de la DBpedia (http://es.dbpedia.org/), servidores de \ndatos en Linked Data en diversos dominios (Geografía, Cultura, Transporte, Medios de \nComunicación, etc.) junto con un sandbox que puede ser utilizado por cualquier organización \ninteresada en la publicación de Linked Data. \nEl Ontology Engineering Group dispone de suficientes medios materiales hardware y \nsoftware para el desarrollo de este proyecto.  \n",
  "speaker": "SYSTEM",
  "uuid": "da496c6c-79aa-4805-aa00-037670ba6576"
}