{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/OU2010 \n\nFull-time PhD studentship in Social Semantics\nKnowledge Media Institute\nBased in Milton Keynes\nThree-year PhD studentship\nApplication deadline: 8 November 2010\nThe PhD studentship will provide a tax-free stipend of £13,590 (increases on an annual basis) and covers all fees, and is available to any suitably qualified UK, EU and International student.\nStart Date: January 2011 (or later by agreement).\nThe explosive growth of online communities continues in all areas of society, and their use is now widespread in social, business, scientific and public service domains, enabling community members to collaborate through shared ideas, knowledge and opinion. Online communities now generate major economic value to business and can form pivotal parts of corporate expertise management, corporate marketing, product support, customer relationship management, product innovation and targeted advertising.\nHowever, the micro and macro dynamics of online communities in terms of structure, information, behaviour and economics are not well understood. \nThere is a real need for far better real-time tracking of individuals, sub-communities, interests, and behaviours, all supported by in-depth analytics and a framework for automated, speedy generation of rich user profiles.\nThis PhD project will focus on designing and developing tools to monitor and process users’ activities in online communities to identify and evaluate their interests and behaviour over time, using a combination of syntactical, statistical, and semantic analysis techniques. Semantic technologies will be used to model, structure, integrate, and process user profiles.\nThis studentship is funded by both the Open University and an EU project that involves several academic and industrial partners from various European countries. The aim of this project is to design and develop a platform for real-time monitoring and analysis of business online communities.\nAcademic Requirements: You should have a first or upper second-class honours undergraduate degree or a relevant Masters Degree or equivalent experience in a relevant computer science discipline. Knowledge of semantic web technologies is a clear advantage.\nHow to Apply: Be sure to refer to the online prospectus at\nhttp://www3.open.ac.uk/study/research-degrees/computing.htm\nand download and complete the 10-page MPhil/PhD application form. Applications should be sent by email to Miss Ortenz Rose, including a covering letter, a research proposal (a maximum of 2,000 words) and a full CV, giving contact details for two academic referees.\nApplication deadline: 8 November 2010\nInterviews: week commencing 22 November 2010",
  "speaker": "SYSTEM",
  "uuid": "dbbd7b1a-571c-436d-8c0b-59081d756372"
}