{
  "message": "SYSTEM: Compromiso_Tarjeta_OTT.pdf: Página 1\nOntology Engineering Group \nLaboratorio de Inteligencia Artificial \nDept. Inteligencia Artificial, Facultad de Informática – UPM \nAvda. Montepríncipe, s/n – Boadilla del Monte – 28660 Madrid \nPhone: +34 91 336 74 39 – Fax: +34 91 352 48 19 \n \n \n \n \n \n \nYo D./Dña.……………………………………………………………., como miembro del OEG, y en virtud de \nla frecuencia con la que viajo, afirmo que: \n \n  \nSolicito disponer de tarjeta OTT, (o seguir disponiendo de la misma en el caso de ya poseerla) con el \nfin de pagar con ella los gastos derivados de viajes del grupo en los que pudiera participar, \ncomprometiéndome a no usarla para hacer frente al pago de gastos:  \n \n- De carácter personal (no derivados estrictamente de la realización del viaje). \n- Gastos cuyo anticipo hubiera solicitado con carácter previo. \n- Gastos comunes de viaje, de dos o más miembros. Si excepcionalmente fuera necesario pagarlos con \neste medio, solicitaré facturas individuales para cada uno de los miembros que hubieran dado lugar a \ndicho gasto. \n \nOptando por otro lado, por una de las siguientes alternativas:    \n \n \nAsumo el compromiso de consultar personalmente el extracto de movimientos de la tarjeta en \nel plazo máximo de una semana desde la conclusión de cada viaje, facilitando al equipo de \ngestión el importe exacto cargado por los distintos gastos, de forma que si incumplo en tres \nocasiones con este compromiso mi tarjeta será cancelada.  \n \n*  \nEn caso de que, a fecha de hoy haya extraviado u olvidado mi código PIN, o me \nsuceda en el futuro, me comprometo a dirigirme físicamente a la sucursal correspondiente del \nBBVA a solicitarlo de nuevo (como exige el protocolo de esta entidad bancaria). \n \n \nDelego en el equipo de gestión la anterior obligación, autorizándoles mediante la entrega del \ncódigo PIN de mi tarjeta OTT a consultar el extracto de movimientos de mi tarjeta, a fin de \nque puedan tramitar mis declaraciones de gastos cada vez que realice un viaje.  \n \n*   \nEn caso de que a día de hoy posea la tarjeta,  pero desconozca mi código PIN, y desee \ndelegar la consulta de los saldos, me comprometo igualmente a dirigirme físicamente a la \nsucursal correspondiente del BBVA a solicitarlo de nuevo (como exige el protocolo de esta \nentidad bancaria) para posteriormente entregarlo al equipo de gestión, en un plazo máximo de \n15 días desde hoy, o en caso contrario mi tarjeta será cancelada. \n \n \n  \nDeclino disponer de tarjeta OTT, o de seguir disponiendo de la misma en caso de poseerla a día de \nhoy.  \n \n \n \n \n \n \n \n \nFecha y Firma:………………… \n",
  "speaker": "SYSTEM",
  "uuid": "de399994-8b2d-4701-ba70-e325e68f807c"
}