{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 14\nLA ADMINISTRACIÓN GENERAL DEL ESTADO\nY SUS BASES DE DATOS\nDra. Concepción Mendo\ncmendo@ccdoc.ucm.es\nUna vez abordado el marco de la reutilización de información, y con carácter previo a\nla exposición de la metodología seguida en la ejecución de nuestra investigación, creemos\nconveniente definir el objeto de nuestro trabajo: la Administración General del Estado\n(AGE) y sus bases de datos. \nAunque todo parece indicar que no es necesario explicar qué es la Administración\nGeneral del Estado, existen razones muy poderosas para que nos veamos obligados a\nexponer lo que parece obvio: la extensión y la complejidad de los organismos que integran\nla AGE.\nAnte la imposibilidad de abarcar su totalidad en este estudio, nos hemos visto en la\nnecesidad de clarificar su estructura y organización con el objeto de determinar qué orga-\nnismos de todos los existentes hemos tomado en consideración en esta investigación. \nAmbos motivos son la causa de los epígrafes que forman parte de esta introducción.\nADMINISTRACIÓN GENERAL DEL ESTADO\nLa Administración General del Estado constituye una parte de las Administraciones\nPúblicas. Se identifica con el poder ejecutivo, con el Gobierno del Estado, que ejerce y\ngestiona en todo el territorio nacional las funciones y servicios fundamentales para la exis-\ntencia misma de la comunidad nacional15. La Administración Pública se ha ido desarro-\nllando en la medida en que ha evolucionado la sociedad. En sus orígenes su misión fue\nauxiliar al Poder Ejecutivo en el desempeño de sus funciones. Esa primera Administración\ndel Estado de Derecho se fundamentaba en el principio de igualdad, es decir, en la garan-\ntía de los derechos de los ciudadanos y de la igualdad de ambos ante la ley, en caso de\ndirimir sus diferencias ante los tribunales. \nEn la actualidad la Administración General del Estado se caracteriza por ser interven-\ncionista y reguladora del sistema socioeconómico del país. Este último aparece con la lle-\ngada del Estado de Bienestar; lo ha hecho en la medida en que ha ido desplegando su acti-\nvidad en un número cada vez mayor de ámbitos y se ha convertido en un actor social más.\nEl intervencionismo comporta una mayor presencia del sector público para mantener el\ncontrol sobre una gran variedad de actividades que podrían poner en peligro el principio\nbásico de igualdad. \n15 PARADA, Ramón. Derecho Administrativo. II. Organización y empleo público. Madrid: Marcial Pons, 2000, p. 88.\nBASES DE DATOS  1/1/04  03:39  Página 19\n",
  "speaker": "SYSTEM",
  "uuid": "e0372f01-2e22-4347-b2ea-58b1f6bfbd45"
}