{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual12082010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n1) Finalización y ejecución del proceso de poblamiento del repositorio de etiquetas: Inicialmente se tuvieron algunos problemas debido a que los servicios web de Flickr tienen la limitación de que se debe hacer llamadas con un tiempo mínimo de espera de 1 segundo, o de otra manera Flickr bloquea las llamadas que venga del mismo equipo. Además, algunas veces los servicios web no responden a la velocidad adecuada y se producen excepciones por las esperas. Después de adecuar el código para que tuviera en cuenta estas limitantes se procedió a su ejecución. En este momento el proceso se está ejecutando. \n2) En una revisión inicial de las etiquetas más utilizadas en los tópicos que se han definido como importantes para E.V se ha encontrado que se traen muchas etiquetas que están poco o nada relacionadas con el tópico principal. Por lo tanto, es posible que haya que implementar un proceso de selección sobre estas etiquetas.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Revision de algoritmos de inducción.\nTarea 3. Modelo de anotación híbrido\n.\n- Locuciones. Personal en vacaciones.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se ha completado el informe del H6 tras añadir los resultados obtenidos durante la evaluación.\nTarea 1.4\n\nIGNMapDiscover 2.0\nLocalización y revisión de bibliografía sobre mappings multilingues:\n- Trojahn et al., 2008\t\"A Framework for Multilingual Ontology Mapping\"\n- Kawase et al., 200X\t\"On the Development of Geospatial Clearinghouse for Multilingual Retrieval and Processing of Metadata Written in Multibytes Characters\"\n- Buitelaar et al., 2006\t\"A Multilingual/Multimedia Lexicon Model for Ontologies\"\nTarea 7.1\n\n- RDF\n· Revisión de la ontología de GeoLinked Data (español/inglés) \n      · Re-generación de RDF con URI definitivas\n      · Continuación de desarrollo para la generación de RDF procedente de shapefiles\n- Linked Data\n· Link de recursos de GeoLinked Data (fenómeno Río) con NOMGEO y NGCE utilizando SILK - Análisis de resultados.\n      . Implementación de huerísticas para detección de instancias duplicadas y generación de owl:SameAs",
  "speaker": "SYSTEM",
  "uuid": "e042a64c-8539-42b1-807e-2293754ab244"
}