{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 99\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 99 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \n \nFigure 40. General View of the Invoice Management Ontology Network [31]  \n6.2.5. Lessons learned \nThe methodological proposal presented in this deliverable (Section 5.3) aims to establish the life \ncycle for a particular ontology network. This proposal has been an excellent guideline at the \nbeginning of the developing process because it has permitted the iSOCO team to organize the \ndevelopment of the ontology network for the Invoice Management use case. The guidelines \nproposed in this deliverable have also helped the iSOCO team to select the activities to be carried \nout and to put them in order. \nFurthermore, the meetings held between the UPM team and iSOCO have been extremely useful \nbecause in such meetings the UPM team provided iSOCO with methodological guidelines for some \nof activities to be carried out when developing the invoice management ontology network. \nConcretely, the use of the competency questions in the ontology specification activity helped the \niSOCO team to identify the need to use a time ontology. Besides, the competency questions have \nshown the iSOCO team that the requirements specified in [30] were correct at the time of \ndesigning the whole ontology network. The requirements were firstly identified in [30] and then \nvalidated with the competency questions. \n6.3. Nomenclature Ontology Network Life Cycle \n6.3.1. Use case description \nSectors that use knowledge intensively such as the pharmaceutical, have typically to deal with \nheterogeneous and vast amounts of information. The Semantic Nomenclature case study is \nfocused on integration of different and heterogeneous pharmaceutical repositories [30]. Information \nabout medicine, medical and regulatory knowledge is highly distributed and, in some cases, \ninconsistent with the government regulation and its databases. As a solution to these problems, the \nATOS team proposes a global Vademecum represented as a reference ontology, where the \n",
  "speaker": "SYSTEM",
  "uuid": "e1524d26-ac5e-425f-a10e-276c3f75ffe5"
}