{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 20\nPage 20 of 124\nNeOn Integrated Project EU-IST-027595\nThis method manages several ontologies and the ontology components generated are instances.\nThe method does not use any speciﬁc ontology language, but light weight ontologies instead.\n• Maala et al.’s method [MDA07a] depicts a conversion process from Flickr9 tags to RDF descriptions.\nThe authors present a method to automatically convert a set of tags into a RDF description in the\ncontext of photos on Flickr. However, it must be noted that they do not mention at all the implementation\nof the Flickr tags.\nIn this method the authors analyze the tagging habits and the tagging content of the photos. To ac-\ncomplish this, they rely on additional resources for the conversion such as (1) WordNet, which has\nbeen completed with extra information, and (2) place resources, a database containing geographical\nlocations and an ontology of things. This method follows the approach to transforming the resource\ncontent into ontology instances, an automatic method; however, not a single speciﬁc tool is men-\ntioned. The method uses a formal speciﬁcation of the conversion between entities of the resource\nand the ontology. It does not tackle the internal data model of the folksonomy, and nor does\nit describe how the resource data is represented and accessed for the transformation. This method\ndoes not keep the resource provenance information, so the resultant ontology does not keep the\nreference to the non-ontological resource. The method takes into account syntactic transformation\naspects, and considers how symbols are structured in the non-ontological resource and ontology for-\nmats, but it does not consider fully semantic transformation aspects, it only considers a small\nset of the semantic interpretation of the resource elements when deﬁning transformations to ontology\nelements. The steps of the method are the following:\n– A tag is transformed into its non inﬂectional form using a stemmer.\n– Then, each tag is categorized in one of the following six categories: location, time, event, people,\ncamera, and activity.\n– All tags grouped in the aforementioned categories are ordered from the smallest to the largest, a\nprecise order measure is not provided.\n– For each tag a triple (r,category,e) is created; where the photo is denoted by r, the category can\nbe one the six aforementioned categories, and the tag is denoted by e.\nThis method generates a single ontology and the ontology components generated are instances;\nthese are expressed in RDF.\nMethods for Transforming Lexica into Ontologies\nThe two main methods for transforming lexica are presented in [vAGS06] and [GNV03, GGMO03] and both\nof them are focused in WordNet. In the following both methods are described.\n• van Assem et al.’s method [vAGS06] proposes a standard conversion of WordNet [Fel98] into the\nRDF/OWL representation language. WordNet is used mainly for annotation and retrieval in different\ndomains and it is also used to ground other vocabularies such as FOAF10. The three core concepts\nin WordNet are the following: (1) the synset, which groups word senses with a synonymous meaning\nand has four disjoint types of synset: nouns, verbs, adjectives and adverbs; (2) the word sense, which\ngives a speciﬁc sense to a word when it is used; and the word. WordNet deﬁnes seventeen relations,\nof which ten deﬁne relations between synsets, ﬁve between word senses, one between a synset and\na sentence, and one between a sysnset and a verb construction pattern.\nThis method is based on version 2.0 of Princenton’s WordNet Prolog distribution11. The version con-\ntains documentation of the source ﬁles, of which there are eighteen: one ﬁle represents synsets, word\n9http://www.flickr.com/\n10http://xmlns.com/foaf/0.1/\n11http://wordnet.princeton.edu/obtain\n",
  "speaker": "SYSTEM",
  "uuid": "e190c45a-8cc8-4479-95c0-5c61fc313b6b"
}