{
  "message": "SYSTEM: Neonglossaryofactivities.pdf: Página 4\n\u0001\u0002 Scheduling refers to the activity of identifying the tasks to be performed during \nthe ontology development, their arrangement, and the time and resources \nneeded for their completion. \n\u0001\u0002 Ontology Search refers to the activity of finding candidate ontologies or ontology \nmodules to be reused. \n\u0001\u0002 Ontology Selection refers to the activity of choosing the most suitable \nontologies or ontology modules among those available in an ontology repository \nor library, for a concrete domain of interest and associated tasks. \n\u0001\u0002 Ontology Specialization is an ontology enrichment activity for extending the \nontology in depth. \n\u0001\u0002 Ontology Specification is a collection of requirements that the ontology should \nfulfill, e.g. reasons to build the ontology, target group, intended uses, possibly \nreached through a consensus process.  \n\u0001\u0002 Ontology Summarization refers to the activity of providing an abstract or \nsummary of the ontology content. \nNote: The summary can include, for example, a couple of top levels in the \nontology class hierarchy (perhaps a graphical representation of these top-level \nconcepts and links between them). \n\u0001\u0002 Ontology Translation refers to the activity of changing the representation \nformalism or language of an ontology from one to another.  \nNote: Ontology Translation can be part of an ontology reengineering process. \n\u0001\u0002 Ontology Update refers to minor changes carried out in an ontology that could \nnot be considered an upgrade. \n\u0001\u0002 Ontology Upgrade refers to the activity of replacing an existing ontology with a \nnew version. \n\u0001\u0002 Ontology Validation is the ontology evaluation that compares the meaning of \nthe ontology definitions against the intended model of the world aiming to \nconceptualize. \nNote: It answers the question: Are you producing the right ontology?.  \n\u0001\u0002 Ontology Verification is the ontology evaluation which compares the ontology \nagainst the ontology specification document (ontology requirements and \ncompetency questions), thus ensuring that the ontology is built correctly (in \ncompliance with the ontology specification). \nNote: It answers the question: Are you producing the ontology right?. \n\u0001\u0002 Ontology Versioning refers to the activity of handling ontology changes by \ncreating and managing different versions of the ontology. \n",
  "speaker": "SYSTEM",
  "uuid": "e303df89-e31f-405f-a1a2-93b6219cf469"
}