{
  "message": "SYSTEM: D5.3.1-v1.0.pdf: Página 85\nD5.3.1 NeOn Development Process and Ontology Life Cycle \nPage 85 of 111 \n2006–2007 © Copyright lies with the respective authors and their institutions. \n \nsoftware developers and ontology practitioners responses (to the proposed questions), “if \napplicable” activities are selected in the table of selected activities. If a response of a \nconcrete question is positive, then the corresponding activity is selected; and on the \ncontrary the activity is not selected.  \nThe possibility that the users can not response yes or not to the proposed natural language \nquestions will be analysed within WP5 and such work will be included in the next version of \nthis deliverable (that is, D5.3.2). \nTable 5 presents the list of proposed questions. \nTable 5. Proposed “Yes/No” Natural Language Questions \nActivity \nNatural Language Questions \nOntology Aligning  \n(or Ontology \nMapping)  \nDo you have two or more ontologies at your disposal that you want \nto examine to find correspondences and to take advantage of \nthem? \nDo you want to find out correspondences among ontologies to use \nthem? \nOntology \nCustomization \nDo you want to adapt the ontology network to a specific user \nprofile? \nDo you want to modify the ontology network to meet specific user \nneeds? \nOntology Enrichment \nDo you want to widen/extend your current ontology network with \nadditional elements (e.g., concepts, roles, axioms, etc.)? \nOntology Extension \nDo you want to stretch, widen, broaden or expand your current \nontology network by adding new concepts “in a horizontal \nway/direction” with the aim of widenning its sphere of action? \nsc\nsc\nsc\nsc\nsc\nsc\nsc\nsc\n \n(cf. Ontology Specialization) \nOntology Forward \nEngineering \nAre you going to carry out a new implementation for a previously \nmodified conceptual model? \nAre you going to produce a new implementation for a modified \nconceptual model, whose previous version had already been \nimplemented? \nOntology Learning \nDo you want to transform (semi)-automatically the knowledge \ncontained in unstructured, semi-structured or structured data \nsources into an ontology network? \nDo you want to use in a (semi)-automatic way the knowledge \ncontained in unstructured, semi-structured or structured data \nsources to build your ontology network? \n",
  "speaker": "SYSTEM",
  "uuid": "e60ddb67-4550-47c7-bc58-70213896e404"
}