{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Master09-10 \n\nLa práctica comienza el 25 de noviembre 2009. \nLa información y recursos necesarios estarán disponible en el wiki.\nLos estudiantes que no figuran en la lista del Ejercicio 3.1 o 3.2, por favor enviar un mail a bvillazon at fi dot upm dot es, haciendo conocer su elección (si desean realizar 3.1 o 3.2)\nRecommended reading:\nD5.4.1. NeOn Methodology for Building Contextualized Ontology Networks\n[16]\nChapter 6: Non-Ontological Resource Reuse and Re-engineering.\nD2.2.2. Methods and Tools Supporting Re-engineering\n[17]\nChapter 2: State of the Art.\nChapter 3: NeOn Method for Re-engineering Non-ontological Resources.\nChapter 4: Methods for Re-engineering Classification Schemes.\nChapter 5: Methods for Re-engineering Thesauri.\nEjercicio 3.1\nSe proporciona a los estudiantes  un\nclassification scheme\n, de un determinado dominio, implementado en una base de datos\nLos estudiantes crean manualmente el modelo conceptual utilizando el classification scheme.\nLos estudiantes entregan el modelo conceputal creado (30 de Noviembre de 2009).\nSe proporciona a los estudiantes de la librería de software (\nNota: es indispensable entregar primero el modelo conceptual\n).\nLos estudiantes generan la ontología utilizando la librería de software y el classification scheme.\nLos estudiantes rellenan dos cuestionarios.\nLos estudiantes entregan la ontología generada, y los cuestionarios (2 de Diciembre 2009).\nEstudiantes:\nJavier Campo Trapero\nJavier Sánchez Soriano\nEvaristo\nAntonio Roque\nIgnacio López Viesca\nJacobo Enríquez Gabeiras\nEjercicio 3.2\nSe proporciona a los estudiantes un\ntesauro\n, de un determinado dominio, implementado en un xml.\nLos estudiantes crean manualmente el modelo conceptual utilizando el tesauro.\nLos estudiantes entregan el modelo conceputal creado (30 de Noviembre de 2009).\nSe proporciona a los estudiantes de la librería de software (\nNota: es indispensable entregar primero el modelo conceptual\n).\nLos estudiantes generan la ontología utilizando la librería de software y el tesauro.\nLos estudiantes rellenan dos cuestionarios.\nLos estudiantes entregan la ontología generada, y los cuestionarios (2 de Diciembre 2009).\nEstudiantes:\nRaphael Alexánder Alvear Abello\nSergio Yébenes Moreno\nCamilo\nRubén Alvarez Ochoa\nMiguel Villeta Espada\nYovan Íñiguez del Río\nSjoerd\nLas instrucciones para la descarga del software se encuentran\naqui\nPor favor rellenar los cuestionarios sobre esta práctica. Los cuestionarios se encuentran\naqui\n.\nEnviar los cuestionarios a bvillazon at fi dot upm dot es\nPráctica 3. Entrega 3 (A determinar la fecha)\n\nEl objeto de esta entrega es realizar la conceptualización de la ontología que se va a desarrollar indicando:\nComentar si es necesario la reutilización y reingeniería de otras ontologías. Justificar los criterios utilizados a la hora de seleccionar una ontología entre varias disponibles.\nClasificar en la \"pirámide de ontologías\" donde se incluyen cada una de las ontologías que se necesitan para la aplicación.\nModelo Conceptual de alto nivel de la ontología, indicando si las ontologías se obtienen de otros recursos ontológicos o de otras ontologías.\nConstruir el modelo Conceptual detallado de la ontología, identificando cuáles son los conceptos principales involucrados y las relaciones entre ellos.\nImplementar una parte de la ontología con el NeOn Toolkit , incluyendo propiedades en los conceptos e identificando algún axioma.\nOpcionalmente, si el plugin RADON está disponible, se realizará la evaluación de la ontología.\nRellenar el siguiente\ncuestionario\nsobre la parte metodológica del curso.\nPráctica 4 (Miércoles 13/01/2010)\n\nDesarrollo de ontologías en OWL, basado en el desarrollo que se ha realizado con RDF Schema y los comentarios recibidos para la práctica anterior. Se debe hacer el desarrollo con herramientas de edición de OWL (herramientas recomendadas: Protégé 4\n[18]\ny SWOOP). Las ontologías deben contar al menos con 40 clases y 20 relaciones (ObjectProperties), y de las clases representadas al menos 10 deben ser definidas. Asimismo, la taxonomía escrita y la inferida deben ser distintas. También se deben incluir ejemplos de definiciones de clases que harían la ontología inconsistente y definiciones de instancias inconsistentes, y describir por qué.\nTrabajo Final Recopilatorio (entrega: día del examen)\n\nCada grupo realizará un trabajo final en el que unificará y resumirá las prácticas realizadas a lo largo del curso. El objetivo del trabajo es mejorar los trabajos individuales y agruparlos en un único documento. Se pide:\nPresentar con un enfoque metodológico la ontología construída, justificando aspectos como: la planificación de la ontología, la especificación de requisitos, los recursos no ontológicos reutilizados para su construcción, la conceptualización obtenida y la evaluación realizada a la ontología.\nImplementar la ontología en OWL con los métodos, técnicas y herramientas presentados a lo largo del curso.\nValorar  los contenidos de la asignatura, los contenidos aprendidos y los métodos docentes empleados\nLas prácticas se presentarán oralmente ese mismo día. Cada grupo hará una breve presentación de 10 minutos y se le harán preguntas durante otros cinco minutos.\nEl examen es el día 11 a las 10 de la mañana en el aula 3202\nNota\n: Rellenar el siguiente\ncuestionario\nsobre la parte metodológica del curso y enviarlo por correo electrónico a\nmasterTI09@delicias.dia.fi.upm.es\nantes del día del examen.\nOfertas de trabajo relacionadas",
  "speaker": "SYSTEM",
  "uuid": "e6ab58bb-3e31-4f00-9263-c693447ed6e7"
}