{
  "message": "SYSTEM: Meaningtool_Pruebas.pdf: Página 1\n1 \n \nMeaningtool: http://www.meaningtool.com/ \nMeaningTool es una herramienta diseñada para categoriza el contenido de la URL o del \ntexto introducido.  Es capaz de extraer los términos para analizarlos y categorizarlos. Las \ncategorías se obtienen gracias a los árboles de categorías. Si no existe un árbol que satisfaga \nlas necesidades de un usuario, éste puede crear uno nuevo. De esta manera las categorías se \nbasan en los gustos del usuario, es decir, se personalizan.  Una vez que se tienen los árboles es \nnecesario entrenar al sistema para que aprenda mediante la introducción de contenido \ncategorizado. \nActualmente puede procesar textos en varias lenguas como por ejemplo, inglés, español, \nportugués, etcétera.  \n• \nTratamiento relativo de los términos en español. Muy buenos resultados para inglés. \nPero errores en la categorización en español (como siempre), la verdad es que \nintroduce como categorías de personas, lugares e incluso instituciones.  \n• \nTrabaja tan bien, dicen, como uno quiera siempre que le introduzca el árbol de \nterminología.   \n• \nPara trabajar como desarrollador todavía no están todas las APIs. \nDesventajas: \n• \n5 árboles de categorías, 50 categorías, 500 clasificadores. \n• \nLos gráficos en forma de tartas en español no existen porque cada quesito de la tarta \nes una categoría y actualmente no hay categorías creadas. \n• \nHay que crear los árboles y entrenar el sistema \nLugares donde se habla de: \n• \nhttp://blog.gomox.com.ar/2009/09/meaning-tool.html \n• \nhttp://www.readwriteweb.es/novedades/meaning-tool-un-nuevo-buscador-semantico/ \n• \nhttp://wwwhatsnew.com/2009/12/27/meaningtool-com-buscador-semantico-que-extrae-\nconceptos-clave/ \n• \nhttp://twitter.com/meaningtool -> hablan de Endeca \n \nPruebas: son las mismas URL que usamos nosotros. \nEntrada www.fi.upm.es salida la query es demasiado pequeña  Es decir, requiere que esté la \nURL completa \n",
  "speaker": "SYSTEM",
  "uuid": "e7914408-eaa6-40fc-a790-be38f31690dc"
}