{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 14\n \n \nPág. 16 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nDEBILIDADES \n Falta de mayor cultura RISP en los diferentes colectivos. \n \nOPORTUNIDADES \n Gran momento en Europa para el desarrollo del procesamiento de lenguaje natural y \ntraducción automática con la última incorporación de nuevos países. Infraestructura, \nasociaciones, fundaciones y distribuidores han trabajado ya de forma colaborativa los \naspectos formales: estándares, licencias y modelos de negocio. En la actualidad, existen \nmodelos europeos e internacionales de oferta de datos lingüísticos en portales de datos \nabiertos a los que sumarse. \n Demanda urgente de aplicaciones relacionadas con social media, big data y los datos abiertos, \ncreando objetivos a corto plazo que ya pueden ser satisfechos en consorcios mixtos de \ndesarrollo, lo que proporcionará gran visibilidad al área.  \n Disponibilidad de múltiples áreas de aplicación: Turismo, Sanidad, Justicia, Educación, etc. \ndonde optimizar y sistematizar procesos horizontales que pueden servir de efecto \ndemostrador y aprendizaje para proyectos futuros, por su posibilidad de generar recursos \nreutilizables.  \n Es posible generar valor mediante la definición de conjuntos de datos abiertos de interés \nlingüístico dentro de la estrategia RISP. \n Existencia de más de 300 investigadores en Iberoamérica, la mayoría en Méjico, con los que \npoder colaborar para el desarrollo de infraestructuras en la región. \n Auge de las redes sociales junto al procesamiento del Big Data que sitúan las industrias de la \nlengua en una excelente posición para, por un lado, explorar nuevos ámbitos de actuación y, \npor otro, obtener recursos básicos para avanzar en la mejora de los sistemas. \n Gran número de agentes implicados en el sector. De manera específica, se identifican \nnecesidades horizontales y globales de esta industria para todas las Administraciones \nPúblicas. \n Existencia de programas de doctorado en España con temáticas de procesamiento de \nlenguaje natural. \n Existencia de programas de I+D+i de la UE que pueden ayudar a financiar nuevos proyectos \nen este campo.  \n Posibilidad de mejorar la accesibilidad de colectivos con limitaciones funcionales.  \n Existencia del Centro de Interoperabilidad Semántica y disponibilidad en el Centro de \nTransferencia Tecnológica de material para definir soluciones comunes en la Administración. \n \nAMENAZAS \n Pérdida de competitividad frente a terceros países, como EEUU, en el desarrollo de recursos y \nherramientas para el procesamiento de lenguaje natural y traducción automática para el \n",
  "speaker": "SYSTEM",
  "uuid": "e7dd8b7d-9e7f-41a8-b621-46e14b10aa95"
}