{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 6\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97731\nb)  Cumplir con aprovechamiento las distintas etapas del proceso de formación, de \nrealización de la tesis y de participación en proyectos de investigación en los que se \nencuentre incorporado.\nc)  Ajustarse a las normas propias de funcionamiento del centro de adscripción, en \ncuanto a la dedicación, función que debe desempeñar, horarios y vacaciones.\nd)  Realizar su labor en el centro de adscripción de la ayuda y conocer y cumplir las \nnormas de seguridad y salud laboral del centro en el marco de la Ley 31/1995, de 8 de \nnoviembre, de Prevención de Riesgos Laborales.\ne)  Solicitar autorización al centro de adscripción de la ayuda para cualquier ausencia \ntemporal.\nf)  Cumplimentar los informes, formularios y demás documentos que, en relación con \nel disfrute de la ayuda, le sean requeridos por la Dirección General de Política Universitaria \no las entidades que colaboran en la gestión del Programa.\ng)  Comunicar a la Dirección General de Política Universitaria, a través del centro de \nadscripción, la renuncia a la ayuda o a las ayudas que le hayan sido concedidas, así como \ncualquier incidencia que se oponga o menoscabe la obtención de los objetivos de la \nbeca.\nh)  Hacer referencia al Programa de FPU del Ministerio de Educación, en las \npublicaciones y otros resultados que puedan derivarse de las actividades e investigación \nrealizadas durante el período de disfrute de la ayuda.\ni)  Someterse a las actuaciones de comprobación y control financiero que puedan \nrealizar los órganos competentes, tanto nacionales como comunitarios, aportando cuanta \ninformación le sea requerida en el ejercicio de las actuaciones anteriores.\nj)  Cumplir los requisitos recogidos en el artículo 13 de la Ley 38/2003, de 17 de \nnoviembre, General de Subvenciones, y las obligaciones que para los perceptores de \nayudas y subvenciones establece el artículo 14 de la citada Ley y las instrucciones \nespecíficas del Ministerio de Educación.\nk)  Colaborar en las campañas de difusión de la ciencia en el marco de las políticas \nde comunicación de la entidad de adscripción.\nl)  El personal investigador en formación en régimen de contrato en prácticas deberá \ncolaborar con fines formativos hasta un máximo de 60 horas anuales, en las tareas \ndocentes de un departamento de la universidad en la que se encuentre adscrito, previo \nacuerdo entre el director de la tesis doctoral y el departamento implicado y sin que en \nningún caso pueda desvirtuarse la finalidad investigadora y formativa de las ayudas. La \ndocencia impartida les será reconocida por la correspondiente certificación.\nLa autorización para la realización de actividades de formación docente será emitida \npor el Departamento correspondiente y enviada copia al órgano gestor de la convocatoria \na efectos de comprobación del cumplimiento de tal obligación por parte del beneficiario. La \ndocencia impartida le será reconocida por la correspondiente certificación.\nEn el caso de los beneficiarios de ayudas con adscripción a centros no universitarios, \nrealizarán dichas tareas en la Universidad con la que el centro tenga la vinculación a la que \nse refiere el artículo 5.3 de esta convocatoria.\nm)  Comunicar a su Organismo de adscripción la obtención del DEA, título de Máster, \ncertificado acreditativo del inicio del período de investigación que expidan las universidades \nde conformidad con el apartado 4 del artículo 20 del Real Decreto 1393/2007, o el grado \nde doctor en el plazo máximo de 15 días naturales desde la fecha de obtención.\nn)  En caso de renuncia a la ayuda, deberá comunicarla a su Organismo de adscripción \ncon una antelación mínima de 15 días naturales.\n2.  La aceptación de la ayuda por parte del beneficiario implica el respeto de las \nnormas fijadas en esta convocatoria, así como las que la Dirección General de Política \nUniversitaria y los centros de adscripción de las ayudas determinen, en el ámbito de sus \ncompetencias, para supervisar y evaluar el desarrollo de su trabajo, así como al las \nrestantes obligaciones establecidas en el artículo sexto del Real Decreto 63/2006, por el \nque se aprueba el Estatuto del personal investigador en formación.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "e8232ad5-5681-4ebd-a920-a12102757014"
}