{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/ProyectosPropios \n\nEn el grupo de investigación se realizan actividades que no siempre suelen estar financiadas por proyectos FP7, H2020 y del Plan Nacional. Son para estas actividades y para los servicios que se realizan que son de utilidad para el propio grupo de investigación, la Escuela Técnica Superior de Ingenieros Informáticos, la UPM,  la comunidad docente universitaria española, otros investigadores nacionales e internacionales, así como para la sociedad en general, para las cuales se solicita este proyecto.\nPara favorecer el adecuado crecimiento de cada línea, para garantizar el impacto de los resultados de las investigaciones, para favorecer el intercambio de conocimientos entre los integrantes del grupo, y para crear interrelaciones entre las líneas de investigación de forma que los resultados de unas líneas puedan ser utilizados en otras, se plantea el presente proyecto con las siguientes tareas:\nTarea 1:\tIdentificación de nuevos temas estratégicos de investigación y desarrollo de los mismos.\n1.\tAsignación de personal contratado y becarios\n2.\tSupervisión de los nuevos temas [Perez, RaulG]\nTarea 2: Actividades internas del grupo para fomentar la investigación e innovación:\n1.\tReuniones de grupo con periodicidad semanal [RicoM]\n2.\tReading clubs con periodicidad quincenal [Jorge (puedo impulsar esto, pero mejor con menor periodicidad, ¿mensual?)]\n3.\tReunión de trabajo, si es posible, con periodicidad anual, para revisar los objetivos científicos y tecnológicos del grupo. [Todos]\n4.\tSesiones de formación tecnológica interna, con periodicidad a determinar.\nTarea 3: Diseño e implantación de un Plan de Comunicación completo para difundir todas las actividades del grupo:\nEl plan se revisará con periodicidad anual.\nTarea 4:\tDiseminación científica y tecnológica hacia el exterior\n1.\tEscritura y revisión de publicaciones científicas en revistas indexadas y no indexadas [Todos]\n2.\tEscritura y revisión de publicaciones científicas en conferencias internacionales de reconocido prestigio internacional [Todos]\n3.   Escritura y revisión de libros\n4.\tAsistencia a conferencias, Escuelas de verano, Workshops, Tutoriales, etc. [Todos]\n5.\tOrganización de eventos nacionales e internacionales de tipo científico o docente [Todos]\n6.   Participación en congresos internacionales de carácter transversal con el fin de difundir los resultados de nuestras investigaciones\n7.\tOrganización de Dagstuhl seminars [Oscar]\n8.\tParticipación en eventos que no tienen artículos científicos asociados, como pueden ser: eventos organizados por la comunidad europea,  Dagstuhl seminars, organismos de estandarización nacionales e internacionales, otras instituciones [RaulG]\n.\nTarea 5:\tServicios científicos a la comunidad investigadora nacional e internacional.\n1.\tOrganización de conferencias, Escuelas de verano, Workshops, Tutoriales, Datathons, Hackathons, etc. [Perez, Oscar, RaulG, RicoM, Jorge, Elena]\n2.\tParticipación en comités editoriales de revistas, comités de programas en conferencias y Workshops. [Perez, Oscar, RaulG, RicoM, Jorge, Elena]\nTarea 6:\tServicios tecnológicos a la comunidad investigadora nacional e internacional.\n1.\tMantenimiento de la infraestructura lógica y física de la DBpedia del español, que se está utilizando a nivel mundial [RicoM]\n2.\tMantenimiento de la infraestructura lógica y física asociado a todos los portales verticales que se crean bajo el dominio linkeddata.es [Vila, MariaP]\nTarea 7:\tParticipación en organismos de estandarización.\n1.    Se seguirá trabajando, al menos, con los siguientes organismos de estandarización: W3C, ISO, Europeana, OASIS, IFLA, AENOR, OKF, así como con cualquier otro que sea relevante y que se encuentre alineado con las líneas de investigación del grupo. [RaulG, Jorge, Elena]\n2.   Escritura y revisión de estándares y especificaciones técnicas [RaulG, Jorge]\nTarea 8:\tParticipación en retos científicos y tecnológicos asociados a conferencias internacionales y nacionales, así como a instituciones de carácter público o privado.\nTarea 9:\tEscritura de propuestas de investigación e innovación en convocatorias y licitaciones internacionales, nacionales y para empresas.\n[Perez, RaulG, RicoM, Jorge, Elena]\nTarea 10:\tCreación y gestión de actividades docentes asociadas a títulos no oficiales.\n1.\tDefinición de contenidos de interés para la creación de cursos y actividades [Idafen]\n2.\tPreparación de material docente (MOOCs, COOCs, SPOCs, transparencias, entre otros) relacionado con las líneas de investigación cubiertas por el grupo [Idafen, Socorro]\n3.     Cursos de formación internos al grupo\n4.     Mantenimiento de la infraestructura necesaria para gestionar de manera adecuada todo el material docente generado\nTarea 11:\tCrear y gestionar material audio-visual\n1.\tDiseño y grabación de vídeos cortos relacionados con las líneas de investigación descritas y con los resultados de investigación de dichas líneas. [Esteban]\n2.\tDiseño de logos, posters, etc. [Idafen]\n3.    Diseño de contenidos específicos para ayuda a la difusión de las líneas de investigación\n4.   Preparación de materiales audiovisuales de divulgación docente e investigadora\nTarea 12:\tGestión del nodo del Open Data Institute en Madrid: ODI-Madrid\n1.\tParticipación en reuniones y cursos de formación de ODI  [MariaP]\n2.     Puesta en marcha y gestión de la infraestructura asociada con ODI (website, listas de correo, Twitter, LinkedIn, wiki, google drive)\n3.    Generación de material publicitario y contenidos para presentación del nodo, escritura de blog posts y difusión de los mismos\n4.    Reuniones y eventos de difusión del nodo [MariaP]\n5.     Benchmarking de actividades de ODI para adecuación al nodo de Madrid\nTarea 13:\tActividades para acercar la Ciencia a la Ciudadanía\n1.\tRedacción de artículos de divulgación general en blogs, prensa, etc. [RicoM]\n2.\tParticipación en hackathones y datathones [Esteban, Idafen]\n3.\tOrganización de los investigadores hackathones y datathones [Idafen]\n4.\tParticipación en jornadas de puertas abiertas, ferias y sesiones para atraer nuevos alumnos a la UPM o a la ETSII, o al grupo de investigación\n5.  Participación en actividades organizadas por terceros: Noche de, actividades de medialab-prado, entrevistas de radio y televisión, participación en el programa actuaUPM, etc.\nTarea 14:\tActividades de gestión\n1. Preparación de reportes científico-técnicos para proyectos del Plan Nacional\n2. Preparación de material para auditorías de proyectos del Plan Nacional y de la Comunidad Europea  [Perez]\n3. Gestión de CVs de miembros del grupo en las distintas plataformas online existentes (FECYT CVN, ResearchGate, Google Scholar, ORCID, etc.)\nTarea 15:\tColaboración con investigadores visitantes y otras instituciones\n1. Reuniones y análisis de líneas de colaboración  [Perez, RaulG, Elena]\n2. Escritura de artículos y propuestas  [Perez, RaulG]\n3. Seminarios con profesores visitantes para encontrar puntos comunes y proyectar mejor la investigación conjunta hacia el exterior\n4. Visitas a centros de investigación y a empresas para iniciar proyectos de colaboración [Perez, RaulG]\nTarea 16:\tTransferencia\n1 Participación en actuaUPM\n2 Participación en programa INNOVATECH\n3 Participación en actuaLoop\nTarea 17:\tGestión de las infraestructura software y hardware\n1.\tGestión de la Web del OEG, en español e inglés\n2.\tGestión de la infraestructura hardware:  [Perez]\nAdministración y mantenimiento de servidores (incluye backup, actualizaciones y mantenimiento, planes de contingencia y disaster recovery)\nAdministración y mantenimiento de equipos informáticos de usuarios y soporte técnico\nGestión administrativa de recursos adquiridos (compras, altas de inventario, control de material)\nAnálisis proactivo de nuevas soluciones asi como mantenimiento y viabilidad de la infraestructura actual\n3.  Gestión de la infraestructura lógica y física de servicios, entre otros: OOPS!, Loupe, OnToology, Vocab.linkeddata.es y vocab.linkeddata.es/datosabiertos, licensius, AR2DTool, así como cualquier producto resultante de los proyectos de investigación.\n4. Mantenimiento de modelos y ontologías desarrolladas en el grupo",
  "speaker": "SYSTEM",
  "uuid": "e839b25b-ae99-4797-b067-8326137927a1"
}