{
  "message": "SYSTEM: Plan-Impulso-Tecnologias-Lenguaje.pdf: Página 12\n \n \nPág. 14 \n \nPlan de Impulso de las Tecnologías del Lenguaje \nFORTALEZAS \nsusceptible de convertirse en recursos lingüísticos.  \n Disponibilidad de investigadores españoles que participan en proyectos, asociaciones y \ngrupos de estandarización europeos e internacionales. Existen más de 30 grupos de \ninvestigación consolidados y organizados en asociaciones y redes, que han sido el origen de 9 \nspin-off que abarcan casi todos los ámbitos en los que se trabaja actualmente a nivel \ninternacional.  \n Posibilidad de establecer modelos de colaboración con centros investigadores de forma \nrápida gracias a los programas nacionales de transferencia (CENIT, CIEN, Doctorados \nindustriales). \n Gran experiencia en gestión del multilingüismo de las empresas españolas y las \nAdministraciones Públicas, lo que puede ser un modelo exportable.  \n Posición de liderazgo de España en el mercado potencial del español con cerca de 470 \nmillones de hablantes, 54 en EEUU, por su situación económica. Se han abierto oficinas en \nEEUU e Iberoamérica por parte de varias empresas españolas, demostrando que la \ninternacionalización de la tecnología desarrollada en España es viable y que existe un sector \nTIC español potente que está demostrando su capacidad para competir globalmente.  \n España pertenece a las redes Iberoamericanas, con prestigio en la sociedad, de las \ninstituciones relacionadas con las lenguas españolas (RAE, IEC, etc.) que colaboran \ninternacionalmente en la labor de regulación del lenguaje. \n Bajo coste de reutilizar y visibilizar todos los materiales existentes para los lenguajes de \nespecialidad, dada la estructura y organización ya existente y demostrada eficacia de la \nexperiencia en acciones estratégicas en los planes nacionales. \n Existencia de bases de datos terminológicas, sinónimos, thesaurus y topónimos, exportables \nglobalmente. Existencia de un tejido industrial en traducción automática con experiencia que \ntiene como clientes prioritarios las Administraciones Públicas. \n Existencia de iniciativas de traducción automática ya en marcha, como la plataforma Plata11.   \n Adhesión de España a la directiva europea de reutilización de datos de las Administraciones \nPúblicas (RISP). \n Experiencia en la participación en iniciativas europeas como Meta-Share, Clarin-Eric, ELRA, \netc. y en proyectos europeos como OPENER, NEWSREADER, QT-Leap, etc. \n \nDEBILIDADES \n Insuficiente colaboración entre empresas y entre empresas y grupos de investigación \nimpidiendo la reutilización de datos y herramientas y multiplicando la inversión que realizan \nlas empresas, restándole efectividad en otros ámbitos como la promoción comercial. Falta de \nconocimiento e inversión coordinada y escasa compartición de herramientas de amplia \n                                                           \n11 http://administracionelectronica.gob.es/ctt/plata \n",
  "speaker": "SYSTEM",
  "uuid": "e87627f2-ee59-4273-88e5-66f73ff506c3"
}