{
  "message": "SYSTEM: The_Return_of_the_Entity-Relationship_Model_-_Ontological_Query_Answering.pdf: Página 15\n1 The Return of the Entity-Relationship Model: Ontological Query Answering\n15\nmember[1]\nphd student[1]\nprofessor[1]\nleads[1]\nleads[2]\nworks in[2]\nworks in[1]\ngroup[1]\nFig. 1.2 CD-graph for Example 1.5; k-nodes are shaded and special edges are represented using\nbroken lines.\nDeﬁnition 1.4. Consider a set Σ of CDs over a schema R, and let G be the CD-\ngraph of Σ. Σ is non-conﬂicting if for each path v↷\n1 v↷\n2 ...↷vm, for m ⩾2, in G such\nthat v1 is an e-node, v2,...,vm−1 are r-nodes, and vm is a k-node, the following two\nconditions are satisﬁed: (i) for each cycle C of only r-nodes in G going through vm,\nπG(C) = idn, where n is the arity of the predicate of vm, and (ii) if m ⩾3 and the\nedge v↷\n1 v2 is non-special, then there exists a path of only r-nodes from vm to v2.\nObserve that if only the identity permutation is allowed on is-a among relation-\nships, then the ﬁrst condition stated above is satisﬁed trivially. Thus, given a set of\nIPCDs, to decide whether is non-conﬂicting it sufﬁces to check only the validity of\nthe second condition.\nExample 1.5. Consider the ER+ schema C given in Example 1.2; for simplicity we\nignore the attributes. The set Σ of CDs associated to C is given in Example 1.4. The\nCD-graph of Σ is depicted in Figure 1.2 (edge labels are omitted for brevity). It is\nimmediate to see that Σ is non-conﬂicting.\nIn what follows we give a more involved example of non-conﬂicting CDs, where\na cycle of only r-nodes going through a k-node occurs in the underlying CD-graph,\nand also arbitrary permutations (other than the identity one) are used in is-a con-\nstraints among relationships.\nExample 1.6. Consider the ER+ schema C depicted in Figure 1.3; the formal deﬁ-\nnition of C is omitted. The set Σ of CDs over R = {e1,...,e9,r1,r2,r3} associated\nto C is the following:\nkey(r1) = {1},\nr2(X,Y,Z) →e5(Y),\ne9(X) →∃Y∃Z r3(Y,Z,X),\nr2(X,Y,Z) →e6(Z),\nr1(X,Y,Z) →e1(X),\nr2(X,Y,Z) →r1(Z,Y,X),\nr1(X,Y,Z) →e2(Y),\nr3(X,Y,Z) →e7(X),\nr1(X,Y,Z) →e3(Z),\nr3(X,Y,Z) →e8(Y),\nr1(X,Y,Z) →r3(Y,Z,X),\nr3(X,Y,Z) →e9(Z),\nr2(X,Y,Z) →e4(X),\nr3(X,Y,Z) →r2(Y,X,Z).\nObserve that the path e9[1]↷r3[3]↷r2[3]↷r1[1], where the edge e9[1]↷r3[3] is non-\nspecial, occurs in the CD-graph G of Σ. Moreover, the edge r1[1]↷r3[3] occurs in\nG, and thus the cycle C = r1[1]↷r3[3]↷r2[3]↷r1[1] occurs in G; in fact, C is the only\ncycle of r-nodes in G going through the k-node r1[1]. Clearly,\n",
  "speaker": "SYSTEM",
  "uuid": "e9c61090-f51a-46f8-a8fb-60ce86bf6e8c"
}