{
  "message": "SYSTEM: DynaLearn_exersises.pdf: Página 4\nDynaLearn exercises  \n4 \n \n• Is the number of states similar to the expected amount mentioned in Step 6? \n• Do all quantities have their expected values in all states? \nSuggestions: \n• If Shade does get values in each of the states, but if those values are different \ncompared to the values generated for Size, maybe a correspondence should be \ndefined between the two quantities in the model fragment ‘Tree with shade’. \n• If Size does not increase in the first state, check whether the influence between \nthe Growth rate and the Size is defined appropriately. Also check whether the \nvalue assigned to the Growth rate is actually positive (that is: Growth rate >0). \n• If Shade does not increase in the first state, check whether the proportionality \nbetween Size and Shade is defined appropriately. Also check whether Size is \nactually increasing, because it should before Shade can increase. Also check \nwhether Shade has a value, because it should have a value defined in the \nscenario before it can increase. \nDo the following: \n• Discuss which of the debugging options is needed to improve the model. \n \n \nStep 8: Fixing the Model \nDo the following: \n• Open the ‘Tree with shade’ model fragment in the model fragment editor. \n• Create a ‘directed quantity space correspondence’ from the quantity space of \nSize to the quantity space of Shade. Notice that a quantity space \ncorrespondence is created between the names of the involved quantity spaces. \n \nStep 9: Interpreting the Results, Debugging, and further Issues \nIn each of the following step, try to understand what is shown, and discuss this with your \npartner. \n• Select the Path from the start state to the end state (mind the order). \n• Look at the Value history View. \n• Choose one of the states. \n• Open the Entity-Relations View, and look at the structural model. \n• Open the Model Fragments View and look at the active model fragments. \n• Open the Dependencies View and make it show only the quantities and the \ncausal relations (I's and P's). \n• While being in the Dependencies View: make all ‘the context’ appears. \nAnswer question: \n• What is the relationship between the contents of the model fragments in the build \nenvironment, and the contents of the Dependencies View mentioned above? \n \n \n \n",
  "speaker": "SYSTEM",
  "uuid": "ea01b9d1-de61-4694-913d-3944ba77ace3"
}