{
  "message": "SYSTEM: Gu%C3%ADaInvestigadoresNoveles.pdf: Página 6\nGu´ıa de orientaci´on para investigadores noveles\n6\nal menos 20 cr´editos (de los cuales, 15 deber´an ser cr´editos de materias fun-\ndamentales) para que pueda solicitar el “Certiﬁcado de Docencia en Tercer\nCiclo”. Este certiﬁcado es homologable en todas las universidades espa˜nolas.\nDurante el segundo curso, denominado periodo de investigaci´on, el alumno\nse deber´a matricular de un trabajo de investigaci´on (12 cr´editos) de los ofer-\ntados dentro del programa de doctorado del que est´e matriculado. Una vez\nﬁnalizados los dos primeros cursos (el de docencia y el de investigaci´on), el\ndoctorando realizar´a una exposici´on p´ublica ante el Tribunal de Suﬁciencia\nInvestigadora del programa de doctorado que est´e realizando, para valo-\nrar los conocimientos adquiridos por el doctorando. Esto le conducir´a a la\nobtenci´on del “Diploma de Estudios Avanzados”, tambi´en conocido como\nDEA. Una vez conseguido el DEA, el doctorando continuar´a con su inves-\ntigaci´on bajo la tutela de su director o directores de tesis hasta el momento\nde presentar la tesis doctoral. Para la presentaci´on de las tesis se puede op-\ntar por exponer los resultados de la investigaci´on llevada a cabo y de los\nelementos originales en alguna de las dos lenguas oﬁciales de la Comunidad\nValenciana (para el caso de tesis defendidas en la Universidad de Alicante),\no bien presentar la tesis para obtener la menci´on de “Doctor Europeo” (los\nrequisitos para poder obtener el doctorado europeo incluyen: haber realiza-\ndo como m´ınimo una estancia de tres meses en otro pa´ıs europeo y defender\nparte de la tesis en la lengua oﬁcial de otro pa´ıs europeo). Tambi´en, desde\nque el Pleno de la Comisi´on de Doctorado de la Universidad de Alicante lo\naprobara el 2 de marzo de 2005, se puede realizar la tesis por compendio de\npublicaciones.\nPara m´as informaci´on sobre los estudios de tercer ciclo y los programas\nde doctorado, v´ease las referencias del anexo A.\n3.\nLa universidad\nDurante nuestra etapa estudiantil en la universidad, la mayor´ıa de nosotros\nhabremos prestado, posiblemente, poca atenci´on a c´omo est´a organizada la\nuniversidad, qu´e son los ´organos de gobierno de la universidad, cu´ales son\nlos derechos y obligaciones de los profesores y de los alumnos, qu´e servicios\nnos ofrece nuestra universidad, etc. Nos habremos centrado, sin embargo,\nen lo que m´as directamente nos afecta o est´a relacionado con los estudios\nque hayamos cursado, y por tanto, desconoceremos mucha informaci´on que\nnos puede ser de gran utilidad si en un futuro queremos formar parte de la\nuniversidad como personal docente e investigador. En esta secci´on, se ex-\npondr´an brevemente algunas pinceladas sobre conceptos o informaci´on que\nconsideramos que es ´util conocer y se invitar´a al lector a echar un vistazo\na la secci´on correspondiente del anexo A, en caso de que se desee obtener\ninformaci´on de una manera m´as detallada.\nLa Ley Org´anica 4/2007 de 12 de abril, que modiﬁca a la Ley Org´anica\n",
  "speaker": "SYSTEM",
  "uuid": "ea814e19-94f2-4095-b35b-4c1b70f5ee6e"
}