{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual05082010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nTarea 2.3\n3\nTarea 1.4\n4\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción de semántica a partir de anotaciones\n.\n- Corpus (servicios, ocio y transporte).\nSe ha empezado el desarrollo de la aplicación para la extracción de la información de la red social. Como es un nuevo desarrollo se quiere utilizar el Java Persistence API para almacenar la información. Debido a esto, antes del desarrollo fue necesario invertir tiempo en el entrenamiento de cómo manejar el API y hacer la integración con la base de datos.\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\n- Refactorización del codigo de asignacion semantica a servicios REST\nTarea 3. Modelo de anotación híbrido\n.\n- Locuciones. Se descarta la generación de un nuevo conjunto de parámetros para TreeTagger a partir del entrenamiento con un corpus más centrado en el dominio objeto de estudio. La precisión de TreeTagger depende fuertemente del tamaño del corpus y del conjunto de casos anotados manualmente, lo que obligaría a un exhaustivo proceso de anotación manual que queda fuera de los plazos y recursos disponibles para esta tarea.\nSe ha analizado la herramientoa tOKo como alternativa a las reglas JAPE de GATE. A pesar de que la sintaxis de los patrones tOKo ofrece una alternativa a las reglas JAPE, el hecho de que tOKo está codificado en Prolog resulta en un problema de integración con las aplicaciones Java. Aunque existen herramientas que permiten la comunicación entre Prolog y Java, las dificultadas detectadas desaconsejan el uso de tOKo. Los creadores de tOKo están desarrollando un mecanismo de comunicaión mediante llamadas HTTP, por lo que se podría reevaluar la conveniencia de tOKo  cuando dicho mecanismo esté terminado.\nTarea 2.3\n\nImplementación del primer prototipo usando Fura\n- Se han ejecutado las pruebas tomando como entrada las imágenes modificadas para reducirlas a un tamaño asimilable para los trabajos.\n- Las pruebas se han efectuado sobre 1, 2 y 4 nodos, comprobando la reducción en el tiempo de ejecución de los trabajos.\n- Se esta procediendo a completar el informa de estado añadiendo los resultados obtenidos.\nTarea 1.4\n\nIGNMapDiscover 2.0\nRevisión del diseño de la aplicación stand-alone IGNMapDiscover 2.0.\nAnálisis interno de usabilidad hipotética tras la inclusión de las ampliaciones futuras previstas dentro del desarrollo del proyecto:\n- Técnica 4 (EWN)\n- Técnica 5 (EWN)\n- Técnica 6 (EWN)\n- Técnica 12 (Multilingüismo)\nTarea 7.1\n\n- RDF\n· Re-generación de RDF con URI definitivas\n      · Limpieza de datos (URI con link no válido)\n      · Inicio de generación de RDF procedente de shapefiles\n- Linked Data\n· Link de recursos de GeoLinked Data con Geonames y DBpedia\n      . Implementación de huerísticas para detección de instancias duplicadas y generación de owl:SameAs",
  "speaker": "SYSTEM",
  "uuid": "eb3b9e18-71f9-42f4-ac26-bebd65b952bc"
}