{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 118\nFICHAS DESCRIPTIVAS DE LAS BASES DE DATOS DEL LIBRE ACCESO EN INTERNET…\n124\n132.- Bibliografía española de publicaciones periódicas. Biblioteca Nacional\n(BNE)\nDirección Web: http://www.bne.es/esp/servicios/bibliografiaesppp.htm\nOrganismo editor: Biblioteca Nacional.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Bibliotecas. Bibliografía. Edición.\nDescripción y comentarios: Registros bibliográficos de los primeros números de publi-\ncaciones periódicas impresas en España, así como los cambios de título de revistas ya\npublicadas, que se reciben en la Biblioteca Nacional gracias al Depósito Legal. El suple-\nmento de Publicaciones Periódicas de Bibliografía Española se ha venido editando, bajo\ndistintos títulos, desde 1971. Recoge títulos en cualquier soporte de publicación (papel,\nmicroforma o recursos electrónicos de acceso directo) y de distinto tipo (publicaciones\nperiódicas o revistas, prensa diaria, memorias e informes anuales de entidades). Quedan\nexcluidas las publicaciones de congresos y las series monográficas. Se actualiza de forma\ntrimestral.\n133.- Bibliografía española en línea. Biblioteca Nacional (BNE)\nDirección Web: http://www.bne.es/esp/servicios/bibliografiaesplinea.htm\nOrganismo editor: Biblioteca Nacional.\nClase de información:\nFormato de presentación:\nCatálogos\nTexto\nTipo de información: \nTipos de consulta: \nReferencial\nAvanzada\nMateria: Bibliotecas. Bibliografía. Edición.\nDescripción y comentarios: Recoge los registros bibliográficos de los libros que ingre-\nsan en la Biblioteca Nacional a través del Depósito Legal. La versión en línea mantiene la\nperiodicidad mensual con 12 números anuales. Contiene los registros bibliográficos de las\nmonografías impresas y desde 2001 los recursos electrónicos que son objeto de depósito\nlegal. No incluye los libros de texto de educación infantil y primaria, mientras que los de\nenseñanza secundaria y formación profesional tienen un nivel de descripción abreviado;\nlas tesis doctorales de ciencia y tecnología no llevan encabezamiento de materia y la nota-\nción CDU es abreviada. \nBASES DE DATOS  1/1/04  03:39  Página 124\n",
  "speaker": "SYSTEM",
  "uuid": "eba92417-9e03-4348-b5b7-97cb5619980c"
}