{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Curricula \n\nAñadir las descripciones en su apartado y ordenadas alfabéticamente.\nContents\n[\nhide\n]\n1\nEn español\n1.1\nGuadalupe Aguado de Cea\n1.2\nOscar Corcho\n1.3\nAsunción Gómez Pérez\n2\nEn inglés\n2.1\nJean-Paul Calbimonte\n2.2\nJose Ángel Ramos Gargantilla\n2.3\nMaría del Carmen Suárez de Figueroa Baonza\nEn español\n\nGuadalupe Aguado de Cea\n\nDr. Aguado es profesora titular de la  Facultad de Informática en la Universidad Politécnica de Madrid y Coordinadora del Programa de Doctorado del Departamento de Lingüística Aplicada de dicho Departamento. Diploma de Traductor Superior. Especialidad en Lengua Inglesa. Instituto de Lenguas Modernas y Traductores, Universidad Complutense de Madrid. (1984) Doctora por la Universidad Complutense de Madrid  (1992)\nSus actuales líneas de investigación están orientadas hacia la interdisciplinariedad entre el ámbito lingüístico y el informático: terminología y ontologías, terminología y traducción, el procesamiento de lenguaje natural, tanto en el ámbito de generación como de anotación, y las aplicaciones de estos campos para la Web semántica. Es miembro del grupo Ontology Engineering Group y responsable del campo de Procesamiento de Lenguaje natural. Ha participado en diferentes proyectos, entre los que cabe destacar. Servicios semánticos, (TIN2004-02660), CONTENTWEB, (Plataforma tecnológica para la Web semántica: Ontologías, Análisis del lenguaje natural y comercio electrónico); ESPERONTO (IST-2001-34373), financiado por la Unión Europea; (AMUSEMENT) An International Virtual Space for Individual and Collective Presence and Interaction  (ESPRIT IV nº 25197); Ontogeneration (Sistema de consulta y recuperación de información mediante la generación de textos en español en el dominio de las sustencias químicas) (A 9706), POINTER (Proposals for Operational Infrastructure for Terminology in Europe. )\nEs autora de un libro sobre los problemas de la traducción de la terminología informática y editora de do volúmenes sobre los lenguajes de especialidad. Ha publicado también diferentes artículos sobre generación de lenguaje y sobre anotación semántica Es miembro del Comité de Terminología del Instituto de Ingeniería de España. Ha participado en la organización y coordinación de diferentes congresos y paneles temáticos en el ámbito de los lenguajes de especialidad. Participa regularmente como revisora en diferentes publicaciones y como evaluadora de proyectos de investigación. Actualmente participa también en el Master de Traducción impartido por la Universidad Complutense y ha sido conferenciante invitada en diferentes universidades\nOscar Corcho\n\nEs profesor titular interino en la Facultad de Informática de la Universidad Politécnica de Madrid, y forma parte del Grupo de Ingeniería Ontológica de esta facultad. Es Doctor en Ciencias de la Computación e Inteligencia Artificial (2004) por la UPM. Recibió el Tercer Premio Nacional Fin de Carrera por el Ministerio de Educación y Ciencia (2001) y el Premio Extraordinario de Doctorado por la UPM (2005).\nSus actividades de investigación se centran en el Grid Semántico, la Web Semántica y la Ingeniería Ontológica. Ha participado en varios proyectos europeos en estas áreas: SemsorGrid4Env, ADMIRE, OntoGrid, Esperonto, DIP, HOPS, SWWS, Knowledge Web, OntoWeb and MKBEEM. También ha participado en el proyecto HALO, financiado por Vulcan Inc. Ha publicado los libros “Ontological Engineering\" y \"A layered declarative approach to ontology translation with knowledge preservation\", más de 40 artículos en revistas, conferencias y workshops, y realiza revisiones de artículos en diversas conferencias, workshops y revistas. Lidera el grupo de trabajo sobre Ontologías y Grid Semántico de la unidad de tecnologías Grid de la Comisión Europea.\nAsunción Gómez Pérez\n\nEs Catedrática en la Facultad de Informática de la UPM y Directora del Ontological Engineering Group (1995) desde su creación. Es Doctora en Informática (1993) por la UPM. Estuvo visitando (1994-1995) el Knowledge Systems Laboratory en la Universidad de Stanford. También fue la Directora (1995-1998) del Laboratorio de Inteligencia Artificial en dicha facultad. Actualmente, es asesora de investigación en dicho laboratorio desde 1999 y directora del Departamento de Inteligencia Artificial desde 2008.\nHa sido pionera introduciendo el área de las ontologías y la Web Semántica en España, publicando más de 150 artículos en dicha área. Ha dirigido 7 tesis doctorales y varios proyectos nacionales e internacionales relacionados con ontologías y financiados por instituciones y/o empresas. Es autora del libro Ontological Engineering y coautora de un libro sobre Ingeniería del Conocimiento. Ha sido codirectora de la escuela de verano en Ingeniería Ontológica y la Web Semántica desde 2003 hasta la actualidad. Ha sido Presidenta de Programa en las conferencias ESWC’05 y EKAW’02. Ha sido coorganizadora de talleres y conferencias sobre ontologías en las conferencias ECAI-04, IJCAI-03, ECAI-02, IJCAI-01, ECAI-00, IJCAI-99, ECAI-98, SSS-97 y ECAI-96 Es revisora en multitud de conferencias y revistas.\nEn inglés\n\nJean-Paul Calbimonte\n\nIs a PhD student at the Computer Science School of the Universidad Politécnica de Madrid (UPM). He is part of the Ontological Engineering Group of the Artificial Intelligence Department of the UPM. He is MSc in Computer Science at the École Polytechnique Fédérale de Lausanne (Swiss Federal Institute of Technology EPFL 2007).\nHe currently works on the SemsorGrid4Env european project, in the area of sensor stream data integration.\nHe has worked at the Database Laboratory at EPFL, about inlcuding database concepts into ontologies. He has also worked in the industry, as software architect for medical systems and applications.\nJose Ángel Ramos Gargantilla\n\nJosé Ángel Ramos Gargantilla is a member of Ontological Engineering Group (OEG) at UPM. He is a MsC of Computer Science at UPM (2001) and, nearly, is a PhD in Artificial Inteligent.\nHis research is in Merging and Mapping in the field of Ontologies. He participates in differents European and Spanish projects: OntoWeb (IST-2000-29243), Knowledge Web (FP6-507482), Infraestructura tecnológica de servicios semánticos para la web semántica (TIN-2004-02660), NeOn (FP6-027595), GeoBuddies (TSI 2007-65677), España Virtual (CENIT2008-1030).\nHe’d participated in the organization on differents international events: EKAW02 Conference and the SSSW from 2003, and he participates in the OEG Managing.\nMaría del Carmen Suárez de Figueroa Baonza\n\nBA Mari Carmen Suárez-Figueroa (mcsuarez@fi.upm.es) belongs to the Ontological Engineering Group of the Artificial Intelligence Department of the Computer Science School (\nhttp://www.fi.upm.es\n) at Universidad Politécnica de Madrid (UPM). She graduated in Computer Science from UPM in 2001. She was Associate Professor (January-March 2002) and she is Teaching Assistant from 1st September 2008 at the Computer Science School at UPM. She is also a PhD student in Artificial Intelligence in UPM.\nHer research activities include methodologies for ontology (network) development, ontology (network) development, ontology development tools, ontology evaluation, and the Semantic Web. She has participated or is currently participating at different European and national projects: OntoWeb (IST-2000-29243), Esperonto (IST-2001-34373), PIKON (IST-2001-33487), Knowledge Web (FP6-507482), OntoGrid (FP6-511513), REIMDOC (FIT-340100-2004-22), SEEMP (IST-4-027347-STP) and NeOn (FP6-027595). She has been research visitor at Department of Computer Science (University of Liverpool) in 2004 and at KMi at the Open University in 2007.\nShe co-organized the EON 2006 Workshop at WWW’06, the KRRSW 2008 Workshop at ESWC 2008, and the tutorial called “NeOn Methodology: how to build ontology networks?” at EKAW 2008.",
  "speaker": "SYSTEM",
  "uuid": "ef86e97a-211e-4908-b48f-0f389b8e6f62"
}