{
  "message": "SYSTEM: OfertaTrabajoFujitsu_Jan09.pdf: Página 1\nContact: David.Snelling@UK.Fujitsu.com \nOpen Position Description \nServices and Solutions Research Division \nFujitsu Laboratories of Europe Limited \nFriday, 19 December 2008 \nServices and Solutions Research Division (SSR) is a small, dynamic team \nproviding novel solutions to the problems of service development and \nmanagement. Our outputs are prototype products and services, technical \nstrategies, standards, and patents aimed at improving the quality and \ncompetiveness of Fujitsu products and services. Our current research and \ndevelopment activities include green technology for data centers, Web 2 based \nservice design, information modeling and analysis, and systems management. \nPhD or MSC qualified Candidates should have a strong interest in service \narchitecture, development, and software. They should be comfortable working in \na research environment and be prepared to change and adapt on both short and \nlong-term timescales. The generation of new ideas and their presentation inside \nand outside the group should come naturally on technical and non-technical \nlevels. These interactions are usually across international and cultural \nboundaries in the context of international projects or work in standards bodies. \nCandidates are expected to be self-motivated and goal focused with excellent \ninterpersonal, time management and presentational skills.   The ideal candidate \nwould be keen to learn about new technologies and able to turn ideas into \nservices and products: knowledge/experience of any of the following would also \nbe an advantage: \n Numerical analysis and related software systems \n Service and solution creation and delivery \n Software architecture and design, using tools, e.g. UML \n Project management and report writing \n Java design and development \n XML schema, processing, and design \n Web Services, SOAP and WSDL \n Service Oriented Architecture (SOA) \n Software engineering processes \n Ontology engineering and the Semantic Web \n Use of IDEs, versioning systems, testing theory and frameworks \n Web application programming frameworks \n Technical expertise in a particular area, e.g. security, networking, etc. \n",
  "speaker": "SYSTEM",
  "uuid": "f1ab8fc7-36c7-41a7-9fb2-8d8c1dd1dcc9"
}