{
  "message": "SYSTEM: D5.3.2.pdf: Página 29\nD5.3.2 Revision and Extension of the NeOn Development Process and Ontology Life Cycle \nPage 29 of 48 \n2006–2009 © Copyright lies with the respective authors and their institutions. \n \n3.3. Relation between Scenarios and Life Cycle Models \nThe set of nine flexible scenarios for collaboratively building ontologies and ontology networks, \npresented in Section  3.1 and previously in D5.3.1 [ 10], and the proposed ontology network life \ncycle models (waterfall and iterative-incremental), presented in Section  3.2, are intrinsically related \nbecause both (scenarios and life cycle models) have been created taking into account the \nimportance of reusing and reengineering knowledge-aware resources (ontological and non-\nontological).  \nThis implicit relation facilitates the selection of a concrete ontology network life cycle model when a \nparticular ontology network project is being scheduled. \nAs we explained in Section  3.2.1, the waterfall model has five significantly different versions and \nsuch versions have been created incrementally (that is, four-phase is the basis for five-phase, five-\nphase is the basis for six-phase, etc.), as Figure 14 shows. \nSix-Phase + Merging \nPhase Model  \n \nSix-Phase Model \nFive-Phase + Merging \nPhase Model \nFive-Phase Model \nFour-Phase Model \nFigure 14. Pyramid of the Versions of the Waterfall Ontology Network Life Cycle Model  \nTable 2 summarizes the relationships between scenarios for building ontology networks and \nontology network life cycle models. Scenario 1 is related to all the ontology networks life cycle \nmodels, because as explained in Section  3.1  it is an obligatory one. If a scenario is related to a \nconcrete model version, then such a scenario is also related to the model version created on top of \nit. Table 2 does not show scenarios 8 and 9, because such scenarios are not directly related to any \nmodel, but to all of them. Such scenarios can be optionally related to all the life cycle models, \nconcretely in the modeling phase. \nTable 2. Relation between Scenarios and Life Cycle Models \n \nFour-Phase \nModel \nFive-Phase \nModel \nFive-Phase + \nMerging \nPhase Model \nSix-Phase \nModel \nSix-Phase + \nMerging \nPhase Model \nScenario 1 \nX \nX \nX \nX \nX \nScenario 2 \n \n \n \nX \nX \nScenario 3 \n \nX \nX \nX \nX \nScenario 4 \n \n \n \nX \nX \nScenario 5 \n \n \nX \n \nX \nScenario 6 \n \n \n \n \nX \nScenario 7 \n \nX \nX \nX \nX \n",
  "speaker": "SYSTEM",
  "uuid": "f252b1b7-23cf-42c5-8716-86fbde8d7314"
}