{
  "message": "SYSTEM: Libro_BD_AGE.pdf: Página 237\nMINISTERIO DE ECONOMÍA Y HACIENDA\n243\n365.- Criterios de supervisión de entidades aseguradoras\nDirección Web: http://www.dgsfp.meh.es/profesionales/CriteriosEntidades.asp\nOrganismo editor: Dirección General de Seguros y Fondos de Pensiones. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nDatos producidos por el organismo\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Fondos de pensiones.\nDescripción y comentarios: Criterios, consultas e instrucciones de la Dirección General\nde Seguros y Fondos de Pensiones. La herramienta permite buscar por texto libre o acotar\nlas búsquedas según los siguientes elementos: presuntas de contabilidad de Entidades\nAseguradoras (principio contables, cuentas y relaciones contables; normas de elaboración\nde las cuentas anuales; normas de valoración, consolidación de cuentas, y otras cuestio-\nnes); ordenación y supervisión de Entidades Aseguradoras (provisiones técnicas; cobertu-\nra de provisiones técnicas; margen de solvencia y fondo de garantía; libros y registros de\nentidades aseguradoras). A su vez algunos de estos elementos se concretan en otros sobre\nlos que también se puede interrogar: bases técnicas, pólizas y tarifas.\n366.- Registros públicos de Corredores de Seguros\nDirección Web: http://www.dgsfp.meh.es/sector/Corredores.asp\nOrganismo editor: Dirección General de Seguros y Fondos de Pensiones. Ministerio de\nEconomía y Hacienda.\nClase de información:\nFormato de presentación:\nCensos y directorios\nTexto\nTipo de información: \nTipos de consulta: \nEnlace a contenidos\nAvanzada\nMateria: Seguros.\nDescripción y comentarios: La consulta puede realizarse atendiendo a los siguientes ele-\nmentos: clave del corredor, denominación, Cif, comunidad, provincia, país y ámbito de\nactuación (autonómico, espacio económico europeo, local, nacional, provincial, terceros\npaíses). \nBASES DE DATOS  1/1/04  03:39  Página 243\n",
  "speaker": "SYSTEM",
  "uuid": "f3189332-8412-4d7c-b66d-37f98ed20446"
}