{
  "message": "SYSTEM: Orden_EDU_3083_2009%2C_de_6_de_noviembre%2C_por_la_que_se_convocan_ayudas_para_becas_y_contratos_de_Formaci%C3%B3n_de_Profesorado_Universitario.pdf: Página 21\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 277\t\nMartes 17 de noviembre de 2009\t\nSec. III.   Pág. 97746\nb)  Currículum vitae del solicitante, hasta 1 punto. Los candidatos que acrediten haber \nobtenido el Premio Extraordinario de Fin de Carrera concedido por el Ministerio de \nEducación y Ciencia obtendrán, en todo caso, 1 punto.\nc)  Participación en estudios de doctorado distinguidos con la Mención de Calidad en \nla convocatoria de 2008 y continúe vigente, hasta 0,50 puntos, siempre que se acredite la \nadmisión en un programa de tales características.\nd)  Currículum vitae del director de la tesis doctoral, hasta 2 puntos, de los que hasta \n1 punto podrá corresponder a la relación entre el número de períodos de actividad \ninvestigadora valorados positivamente por la Comisión Nacional de Evaluación de la \nActividad Investigadora (CNEAI) y su antigüedad como doctor. En el caso de los directores \nque no puedan participar en la valoración de sexenios, se valorará el currículum relacionando \nlos méritos y la antigüedad como doctor. La CNEAI facilitará a la Comisión de Selección \nlos períodos valorados positivamente a los Directores. Tendrá especial consideración la \ncapacidad formativa medida en número de tesis dirigidas.\ne)  Actividad investigadora en los últimos cinco años del grupo en el que se integraría \nel doctorando, hasta 1 punto. A tal efecto, interesan los proyectos de investigación \nfinanciados mediante convocatorias públicas competitivas, así como las publicaciones, \nponencias, comunicaciones y patentes, y la capacidad formativa medida por las tesis \ndoctorales dirigidas por los profesores e investigadores, de plantilla o contratados, que \ncomponen el grupo de investigación. El grupo de investigación se entenderá en los términos \ndescritos en el artículo 30.3.e) de la presente convocatoria.\n3.  Durante el proceso de evaluación, la Comisión de evaluación podrá proponer la \nadscripción de las solicitudes a un área científica diferente a la señalada por el solicitante, \ncuando así se deduzca de los estudios de doctorado a cursar y del proyecto formativo \npresentado.\nArtículo 32.  Selección de candidatos.\n1.  La selección de candidatos se llevará a cabo en concurrencia competitiva dentro \nde cada área científica; para ello, sólo se considerará la documentación aportada en la \nsolicitud, por lo que se prescindirá del tramite de audiencia, de conformidad con lo dispuesto \nen el artículo 84.4 de la Ley 30/1992, de 26 de noviembre.\n2.  La selección de candidatos se llevará a cabo en un procedimiento único de \nevaluación de los méritos a la vista de la documentación aportada en las solicitudes.\n3.  La Comisión de Selección elaborará una relación priorizada de candidatos por \náreas científicas, para lo que tendrá en cuenta la evaluación obtenida por los candidatos \nen cada uno de los criterios evaluados, a las que sumará las correspondientes a:\na)  La nota media del expediente académico ponderada hasta 4 puntos. La ponderación \nse realizará teniendo en cuenta la calificación media de cada titulación en la universidad \ndonde la obtuvo y la correspondiente a la misma titulación de todas las universidades \nespañolas y la calificación media de las titulaciones de los candidatos que se presentan a \nla misma área científica. En el caso de los que acrediten estudios realizados en el extranjero, \nla Comisión de selección ponderará el expediente atendiendo a la información disponible \nen el órgano gestor sobre las calificaciones de los distintos sistemas universitarios y las \ncalificaciones medias de las titulaciones de las universidades españolas.\nCon el objeto de un tratamiento homogéneo y objetivo de la nota media del expediente \nacadémico en el proceso de concurrencia competitiva, en la configuración de la misma se \ntendrá en cuenta que entre los estudios de grado o posgrado se completen los 300 créditos, \nrealizándose las adaptaciones necesarias en los casos de planes de estudios configurados \nen asignaturas.\nb)  El fomento de la cohesión universitaria, la política científica en el ámbito de la \npotenciación de recursos humanos en I+D+I y el equilibrio interregional e interuniversitario, \nhasta 1 punto. Esta puntuación será otorgada por la Comisión de selección con carácter \nexcepcional, cuando la distribución resultante de las becas propuestas para concesión \nhiciera necesario la aplicación de los principios enunciados.\ncve: BOE-A-2009-18342\n",
  "speaker": "SYSTEM",
  "uuid": "f32612bf-2fdf-41a2-82f9-c7189ed74676"
}