{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 41\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 41 of 124\nresource that follow: ISO15926-249, Flickr50, WordNet51, UMLS52, IPSV53, GTAA54, MeSH55, AAT56,\nYSA57, AGROVOC58, and EDI X1259, and eight methods that deal with any non-ontological resource.\n• According to the data model information. Nine methods tackle information about the internal data\nmodel of the non-ontological resource, and nine methods do not include information about the internal\ndata model of the resource.\n• According to the provenance information. Two methods keep the reference to the non-ontological\nresource, and sixteen methods do not provide the provenance information about the resource after the\ntransformation.\nTools\n• According to the type of non-ontological resource. One tool deals with classiﬁcation schemes and\nthesauri, one tool tackles folksonomies. The remaining ten tools are not focused on the non-ontological\nresource type since they are independent of the resource type.\n• According to the implementation of the non-ontological resource. One tool takes on resources imple-\nmented in SKOS RDF; three tools operated on resources implemented in databases; one tool deals\nwith resources implemented in databases, XML, ﬂat ﬁles, and spreadsheets; three tools tackle re-\nsource implemented in ﬂat ﬁles; one tool deals with XML implementation; two tools deal with resources\nimplemented in spreadsheets. The remaining tool is not focused on the non-ontological resource im-\nplementation.\n• According to the ability to transform a speciﬁc non-ontological resource or to transform any non-\nontological resource. Two tools have the ability to transform a speciﬁc non-ontological resource, e.g.\nUnix text ﬁles and Bibtex ﬁles. The remaining ten tools deal with any non-ontological resource.\n• According to the data model information. Two tools take into account information about the internal\ndata model of the non-ontological resource. The remaining ten tools do not take information about the\ninternal data model of the resource.\n• According to the provenance information.\nAll of the tools do not keep the reference to the non-\nontological resource, they not provide the provenance information about the resource after the trans-\nformation.\nWe can conclude that most of the methods and tools presented are based on ad-hoc transformations for\nthe resource type, the resource implementation or a speciﬁc resource. Only a few provide the provenance\ninformation of the resource, and also a few take advantage of the resource data model, an important artifact\nin the re-engineering process. In conclusion, we can state that there is a clear need for some sort of re-\nengineering methods and tools that\n• deal with the overall non-ontological resources, i.e. classiﬁcation schemes, thesauri, and lexica,\n• take into account the internal data model of the resource,\n49http://www.iso.org/iso/iso_catalogue/catalogue_tc/catalogue_detail.htm?csnumber=29557\n50http://www.flickr.com/\n51http://wordnet.princeton.edu/\n52http://www.nlm.nih.gov/research/umls/\n53Integrated Public Sector Vocabulary http://www.esd.org.uk/standards/ipsv/\n54Common Thesaurus for Audiovisual Archives http://informatieprofessional.googlepages.com/gtaa\n55Medical Subject Headings http://www.nlm.nih.gov/mesh/\n56http://www.getty.edu/research/conducting_research/vocabularies/aat/\n57http://vesa.lib.helsinki.fi/\n58http://www.fao.org/agrovoc/\n59http://www.ifla.org/VI/5/reports/rep4/42.htm#chap2\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "f3f46279-9866-4175-9ba2-2c0adecc23b2"
}