{
  "message": "SYSTEM: NeOn-Methodology-OntologySpecificationGuidelines.pdf: Página 15\nNeOn Methodology for Building Ontology Networks: Ontology Specification \nPage 15 of 18 \nOperator \nAdministration \nGreek \nElectronic Equipment \nOperator \nOperating \nSystems \n \nGreek \nPublishing of Software \nHungarian \nImage Equipment \nOperator \nInformatics \n \nHungarian \nMaintenance of \ncomputing machinery \nIrish \nSoftware Engineer \nProgramming \nLanguage \n \nIrish \nGovernment \nItalian \nComputer code recorder \nSports \n \nItalian \nCulture, Media, Design \nTable 5. Examples of Objects  \nAfter following these tasks, the output of the Ontology Specification activity is the Ontology \nRequirements Specification Document. An excerpt of this document is shown in Table 6. \n  \nSEEMP Reference Ontology Requirements Specification \n1 Purpose \n  The purpose of building the Reference Ontology is to provide a consensual knowledge model of the \nemployment domain that could be used by public e-Employment services (PES). \n2 Scope \n  The ontology has to focus just on the ICT (Information and Communication Technology) domain. \nThe level of granularity is directly related to the competency questions and terms identified. \n3 Level of Formality \n  The ontology has to be implemented in WSML language \n4 Intended Users \n  \nUser 1. Candidate who is unemployed and searching for a job or searching another occupation for \nimmediate or future purposes \nUser 2. Employer who needs more human resources. \nUser 3. Public or private employment search service which offers services to gather CVs or job postings \nand to prepare some data and statistics. \nUser 4. National and Local Governments which want to analyze the situation on the employment market \nin their countries and prepare documents on employment, social and educational policy. \nUser 5. European Commission and the governments of EU countries which want to analyze the statistics \nand prepare international agreements and documents on the employment, social and educational \npolicy. \n5 Intended Uses \n  \nUse 1. Publish CV. Job seeker places his/her CV on the PES Portal.  \nUse 2. Publish Job Offer. An Employer places a Job Offer on the PES Portal. \nUse 3. Search for Job Offers. The Employer looks for candidates for the Job Offer through PES Portal. \nUse 4. Search for Employment information. Job Seeker looks for of general information about \nemployment in a given location at the PES Portal. \nUse 5. Provide Job Statistics. The PES Portal provides employment statistics to the Job Seeker and \nEmployer. \n6 Groups of Competency Questions  \n",
  "speaker": "SYSTEM",
  "uuid": "f4fadaeb-8f33-4e97-a207-7501210b5475"
}