{
  "message": "SYSTEM: BUSQUEDA.pdf: Página 72\nBÚSQUEDA \n \n72 \nJ. Rubio / P.R. Muro / J. Bañares \n \nOctubre 2004 - Curso 2004-2005 \nárbol de búsqueda es mayor que dicho límite. Véase en la figura 10 el árbol de \nbúsqueda correspondiente al grafo de la figura 8, con expansión de derecha a \nizquierda, búsqueda en profundidad en árbol y límite de profundidad 3. La \nprofundidad de cada nodo ha sido escrita al lado de cada estado, separada con una \ncoma. Nótese que el nivel de profundidad está asociado al nodo y no al estado, pues \nun mismo estado puede reaparecer en varios niveles (compruébese en el ejemplo si \nel límite de profundidad es 4 o mayor). Obsérvese también que si el límite de \nprofundidad es 1, en ese ejemplo, no se encontrará solución (esto sucederá siempre \nque el límite de profundidad sea estrictamente menor que la profundidad del estado \nobjetivo menos profundo).  En la figura 5, donde se recogía el árbol de búsqueda en \nprofundidad (en grafo) para el 8-puzzle, el límite de profundidad fijado era 5. \nEjercicios. Estúdiese cuál es el estado objetivo encontrado en el espacio de la \nfigura 8 por la búsqueda en profundidad en árbol, si la expansión se realiza de \nizquierda a derecha y el límite de profundidad es 3. ¿Y si el límite de profundidad es \n2?  \nI,0 \nA,1 \nO2,2\nD,1 \nE,2 \nF,3 \n1 \n2 \n3 \n4 \n5 \n \nFigura 10 \nEn cuanto a la puesta en práctica de la idea anteriormente expuesta es necesario \ndisponer de una función profundidad-de-nodo que, tomando un nodo como \nargumento, nos indique en que nivel de profundidad ha sido generado. Una vez se \ndispone de una función tal, no es difícil modificar expandir-nodo para que, si \nhemos alcanzado el límite de profundidad, devuelva siempre la lista vacía, con lo \nque se consigue el efecto deseado. \nPara poder implementar profundidad-de-nodo pueden emplearse diversas \nestrategias. Por ejemplo, si el nodo tiene información sobre su \"padre\" puede \nencontrarse su profundidad calculando la longitud del camino que lo une con el nodo \n",
  "speaker": "SYSTEM",
  "uuid": "f8a4be3a-7032-4ab8-ab13-8a9023977cc2"
}