{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 87\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 87 of 124\nTable 5.2: Pattern for Re-engineering a Thesaurus(continued)\nSlot\nValue\nGeneral\n1. Identify the records which contain thesaurus terms without a broader term, within the\nterm-term relationship entity.\n2. For each one of the above identiﬁed thesaurus terms ti:\n2.1. Obtain the thesaurus term within the term entity.\n2.2. Create the corresponding ontology class, Ci class, if it is not created yet.\n2.3. Identify the thesaurus term, tj, which are narrower terms of ti, within the term-\nterm relationship entity.\n2.4. For each one of the above identiﬁed thesaurus terms tj:\n2.4.1. Obtain the thesaurus term within the term entity.\n2.4.2. Create the corresponding ontology class, Cj class, if it is not created yet.\n2.4.3. Set up the subClassOf relation between Cj and Ci\n2.4.4. Repeat from step 2.2 for cj as a new ci\n2.5. Identify the thesaurus term, tr, which are related terms of ti, within the term-\nterm relationship entity.\n2.6. For each one of the above identiﬁed thesaurus term tr:\n2.6.1. Obtain the thesaurus term within the term entity.\n2.6.2. Create the corresponding ontology class, Cr class, if it is not created yet.\n2.6.3. Set up the relatedClass relation between Cr and Ci\n2.6.4. Repeat from step 2.4 for cr as a new ci\n2.7. Identify the thesaurus term, tq, which are equivalent terms of ti, within the\nterm-term relationship entity.\n2.8. For each one of the above identiﬁed thesaurus term tq:\n2.8.1. Obtain the thesaurus term within the term entity.\n2.8.2. Create the corresponding ontology class, Cq class, if it is not created yet.\n2.8.3. Set up the equivalentClass relation between Cq and Ci\n2.8.4. Repeat from step 2.6 for cq as a new ci\nExample\n1. Create the Poaceae class.\n1.1. Create the Oryza class and assert that Oryza is subClassOf Poaceae.\n1.1.1. Create the Rice class and assert that Rice is relatedClass of Oryza.\n2. Create the Cereals class.\n2.1. Assert that Rice is subClassOf Cereals.\n2.2. Create the Paddy class and assert that Paddy is equivalentClass of Rice.\nRelationships\nRelations to other\nmodelling components\nUse the Architectural Pattern: AP-LW-01 [SFBG+07]\nPR-NOR-TSLO-03. Pattern for re-engineering a concept-based thesaurus which follows the record-\nbased data model\nThe pattern for re-engineering thesaurus shown in Table 5.3 suggests a guide to transform a thesaurus into\na lightweight ontology. The thesaurus is a concept-based one and it is modeled with a record-based data\nmodel. This pattern aims at creating a lightweight ontology from the thesaurus, being the semantics of the\nBT/NT relations between terms the subClassOf relationship.\nTable 5.3: Pattern for Re-engineering a concept-based thesaurus which follows\nthe record-based model\nSlot\nValue\nGeneral Information\nName\nConcept-based Thesaurus to Lightweight Ontology (record-based model)\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "f8c678cc-00ef-4b67-95ee-f37a6a3a0333"
}