{
  "message": "SYSTEM: Neon_2008_d2.2.2.pdf: Página 103\nD2.2.2 Methods and Tools Supporting Re-engineering\nPage 103 of 124\nChapter 7\nMethods and tools for extracting entities\nfrom unstructured text\n7.1\nIntroduction\nNamed entity recognition (NE) from textual sources has been the subject of research for the last two decades,\nand is crucial for many Natural Language Processing (NLP) tasks as well as other applications.\nNE is\nthe cornerstone of tasks such as information extraction, which rely on the initial extraction of entities be-\nfore identifying relations, co-reference etc. Traditional methods and tools for NE have been described and\ndiscussed widely in the past, so we shall not reiterate here – the interested reader can see for example\n[MLP08]. Both rule-based methods such as [MBC, MTB+03, AM99, Chi98] and statistical methods such as\n[BON03, Col02, IK02] have proved very successful. For a closed and concise set of named entities, both\napproaches are much easier, not only because ambiguity is less and the task is more constrained, but also\nbecause for rule-based approaches, only a relatively small number of rules needs to be written, while for\nmachine learning approaches, it is relatively easy to create sufﬁcient annotated data for training.\nIn recent years, research has turned towards a more ﬁne grained classiﬁcation of named entities, generally\nin the form of Ontology-based Information Extraction (OBIE), where the task requires annotating text on the\nbasis of a much wider ranger of concepts, according to an ontology. So instead of just identifying entitled\nthat fall into the category \"Organisation\", the system must distinguish between different types of Organisation\nsuch as Religious Organisation, Charity, Company, Financial Institution, and so on. Early work on this began\nwith an attempt simply to subcategorise the standard named entities further [FH02] or to involve a more\nsemantically-based decision process [MBC03], and progressed towards a full ontology-based approach -\neither with standard types of named entities [PEK03] or in a more conﬁned scenario [MYKK05, MSY+07].\nThe work described here combines aspects from both traditional named entity recognition and ontology-\nbased information extraction, in order to identify patterns for the extraction of a variety of entity types and\nrelations between them, and to re-engineer them into concepts and instances via ontology creation and\npopulation.\nThe entities extracted include both traditional named entities such as Person, Location and\nOrganisation, and single or multi-word terms such as \"Paciﬁc ﬂounder\" and \"shark\". In the following chapter,\nwe investigate the identiﬁcation of patterns in text for entity and relation extraction. We then look at the\nprocess of ontology population and creation using a modiﬁed version of the CLONE technology in GATE\n[CMBT02]. The system is embodied in an application called SPRAT (Semantic Pattern Recognition and\nAnnotation Tool) which takes as input a set of texts and optionally an existing ontology, and outputs an\nannotated version of the texts and either a new ontology or a modiﬁed version of the existing ontology, as\nappropriate. SPRAT will be available in the Neon Toolkit as part of the SAFE web services plugin.\n2006–2008 c⃝Copyright lies with the respective authors and their institutions.\n",
  "speaker": "SYSTEM",
  "uuid": "fba8baa2-ca02-4b7d-b74b-45ae40a3a16d"
}