{
  "message": "SYSTEM: Wiki: https://delicias.dia.fi.upm.es/wiki/index.php/Espa%C3%B1aVirtual07012010 \n\nContents\n[\nhide\n]\n1\nTareas 7.2\n2\nInterfaz Anotación Híbrida\n3\nTarea 2.4\n4\nTarea 1.4\n5\nTarea 7.1\nTareas 7.2\n\nTarea 1. Mecanismo de extracción semántica a partir de anotaciones\n.\nPersonal en vacaciones\nTarea 2. Procesado de fuentes de información no semántica ya existentes\n.\nDemo del registro de fuentes.\nCorreccion de errores de la aplicación.\nTarea 3. Modelo de anotación híbrido\n.\n-\tContinuación del estudio de las reglas Jape: Se ha trabajado sobre el esquema de las reglas. En primer lugar se ha están las macros, a continuación las anotaciones base de la herramienta y seguidamente las nuevas anotaciones. Estas nueva anotaciones pueden ser combinación de las anteriores y etiquetar con un nuevo marcador o introducir código java con las combinaciones de signos/palanbras y etiquetas necesarias para la anotación.\n-\tSe ha ampliado la memoria del entorno en el que se trabaja  ya que el trabajo con algunas páginas web es costoso.\n-\tSe sigue trabajando en los problemas de los anotadores para español pero todavía no está terminada esta tarea.\n-\tEl trabajo realizado durante el día 5 de diciembre se trabajó sobre una versión antigua del repositorio y lo ejecutado no es correcto. Esto fue debido a que la versión de la máquina no era la última versión del servidor porque estaba apagado debido al corte por parte de Iberdrola. Es decir,  no es posible contabilizarlo y conlleva un retraso en la planificación.\nInterfaz Anotación Híbrida\n\n- Prueba de Servicio Web de GATE exitosas, falta conexion con aplicación PHP, se trabaja en ello, se realizan pruebas.\n- Codificación nueva versión en PHP aun no terminada, se trabaja en ello.\n- Testeo de nuevos Widgets AJAX para añadir mayor funcionalidad a las ventanas y el drag and drop.\nTarea 2.4\n\nEspecificación de los requisitos del metaplanificador y el adaptador semántico. Se está procediendo a llevar a cabo un refinado de dichos requisitos.\nTarea 1.4\n\nPersonal de baja por enfermedad.\nTarea 7.1",
  "speaker": "SYSTEM",
  "uuid": "fbe72028-9368-4935-bf09-cca04f14a587"
}