{
  "message": "SYSTEM: NeOn_2007_D5.3.1.pdf: Página 100\nPage 100 of 111 \nNeOn Integrated Project EU-IST-027595 \ndistributed databases can be integrated and kept up-to-date with the government databases that \nprovide the official and approved medicines information.  \nIn the Semantic Nomenclature case study [30], semantics is used to classify meaningfully the \ninformation and to ease the integration of the distributed knowledge. This case study proposes the \nuse of networks of ontologies against a large and unmanageable unique ontology to solve this \nintegration problem. The main objective of the ontology network developed in the use case is to \nprovide a model in several meaningful pieces and to bind them together, representing and \nmanaging relations between multiples ontologies that correspond to the main pharmaceutical \ndatabases in the Spanish market; another goal of this ontology network is to connect to the main \ninternational medical vocabularies. \nIn the last few years, several international bodies and organizations have provided a number of \nclassifying systems, such as thesauri, taxonomical classifications and even ontologies about \ndescription and classification of medicines. However, in the current scenario there is no a unified \nway of dealing with and naming drug-related information [30]. \nThe main actors in the Spanish pharmaceutical domain provide different databases with broad \ninformation about the drugs in the market [30]. Thus, the Ministry of Health along with the Spanish \nGeneral Agency of Drugs and Sanitary Products edit and provide two official databases (Digitalis, \nIntegra) with information on pharmaceutical products in Spain every month. Digitalis is the \nNomenclature officially used for invoicing prescriptions and contains data such as the identification \nof the pharmaceutical product, prices, composition of the medicine, etc. Integra stores diverse \ninformation about pharmaceutical products consumed (and assimilated) in the hospital field.  \nThe General Spanish Council of Pharmacists (GSCoP) provides its members with the Health \nInformation Data Base (BOTPlus), which permits the access to harmonized, updated information \non medicines, patients, diseases, treatments, etc. It includes up to 140.000 pharmaceutical \nproducts. This resource together with the two official vademecum of the government are the main \nsources of knowledge on drugs available in Spain [30]. \nThere are also other international bodies providing several vocabularies and classification that \nshould be taken into account. All the Spanish official pharmaceutical entities and companies \nclassify drugs in their databases following the ATC (Anatomical Therapeutic Chemical) \nclassification suggested by WHO22. Medicinal products are classified according to the main \ntherapeutic use of the main active ingredient, following the basic principle of only one ATC code for \neach pharmaceutical formulation (i.e. similar ingredients, strength and pharmaceutical form) [30]. \nSNOMED (Systematized Nomenclature of Medicine) is a systematically organized computer \nprocessable collection of medical terminology that covers most areas of clinical information, such \nas diseases, findings, procedures, microorganisms and pharmaceuticals. SNOMED CT is used in \nthe U.S. Federal Government systems for the electronic exchange of clinical health information. \nOther resource is MeSH (Medical Subject Headings), which is a huge controlled vocabulary (or \nmetadata system) whose purpose is to index journal articles and books in the life sciences that \ndeal with drugs and pharmaceutical preparations. MeSH contains around 23.000 subject headings \narranged in a hierarchy and which can be viewed as a thesaurus [30]. \nMoreover, different medical thesauri, classifications and languages used by the international health \ncommunity were identified in [30]. UMLS (a controlled compedium of medical vocabularies), \nLOINC, HL7, NCI, ATC classification, etc., are some examples of the several vocabularies that try \nto classify the different medical topics in the drug and pharmaceutical domains. \nBesides, ontologies as Galen, OpenCyC or the NCI thesaurus try to define the concept of \npharmaceutical product and classify different categories of a drug. However, up to now, there are \nnot ontologies that describe the characteristics of the pharmaceutical products in detail. All these \n                                                 \n22 WHO: World Health Organization \n \n",
  "speaker": "SYSTEM",
  "uuid": "fd206c64-4d03-4f54-b02d-a73b7da533fa"
}