{
  "message": "SYSTEM: Resoluci%C3%B3n_de_4_de_febrero_de_2010%2C_de_la_Secretar%C3%ADa_de_Estado_de_Investigaci%C3%B3n.pdf: Página 24\nBOLETÍN OFICIAL DEL ESTADO\nNúm. 33\t\nSábado 6 de febrero de 2010\t\nSec. III.   Pág. 11173\n3.  El gasto resultante será imputado a las aplicaciones presupuestarias indicadas en \nel artículo 4.2 para el subprograma FPI-MICINN.\n4.  La justificación de las ayudas se realizará por los Centros de I+D de adscripción \ndel personal investigador en formación, de acuerdo con lo establecido en el artículo 30 de \nla Ley 38/2003, General de Subvenciones, según las disposiciones que sobre seguimiento \ny justificación económica se establecen en esta resolución y en la resolución de concesión \nasí como a las instrucciones que establezca la Subdirección General de Formación e \nIncorporación de Investigadores y, en su caso, según lo establecido en la normativa \naplicable a la cofinanciación de los fondos estructurales de la Unión Europea.\nLa justificación final de las ayudas se realizará mediante cuenta justificativa que, \nhaciendo uso de la facultad otorgada por el artículo 72.3 de la Ley General de Subvenciones \npara limitar el contenido de la cuenta justificativa en virtud de la naturaleza de estas ayudas, \ncontendrá con carácter general la siguiente documentación:\na)  Memoria de actuación científico–técnica, justificativa del cumplimiento de las \ncondiciones impuestas en la concesión de la ayuda, con indicación de las actividades \nrealizadas y de los resultados obtenidos.\nb)  Memoria económica justificativa del coste de las actividades realizadas, que \ncontendrá:\n1.º  Fichas justificativas normalizadas, o cualquier otro medio que se habilite al efecto, \ny certificación de los gastos y pagos realizados. Los documentos acreditativos del gasto y \ndel pago quedarán en poder de los beneficiarios, a disposición de los órganos de \ncomprobación y control.\n2.º  En su caso, justificación de los costes indirectos imputados, con base en los \ncriterios de reparto de los mismos que se establezcan en las instrucciones de ejecución y \njustificación, que se encontrarán disponibles en la página web del órgano concedente.\n3.º  En su caso, relación detallada de otros ingresos o ayudas percibidas que hayan \nfinanciado la actividad incentivada, con indicación de su importe y procedencia.\n4.º  En su caso, acreditación del reintegro de remanentes no aplicados.\nLos plazos y la forma de presentación de la memoria de actuación científico-técnica se \nespecifican en el artículo siguiente.\nLos Centros de I+D deberán presentar la memoria económica justificativa de las \nestancias realizadas el personal investigador en formación que tengan adscrito, dirigida al \nórgano concedente y Gestión del Plan Nacional de I+D+i y antes del 1 de abril de 2012, \nutilizando los modelos y medios telemáticos habilitados para ello en la página web http://\nwww.micinn.es.\nLa comprobación formal para la liquidación de la subvención se realizará de modo \nexhaustivo sobre las cuentas justificativas presentadas. Las facturas o documentos de valor \nprobatorio análogo que sustenten dichos informes serán objeto de comprobación en los \ncuatro años siguientes sobre la base de una muestra representativa, a cuyo fin el órgano \nconcedente podrá requerir a los beneficiarios la remisión de los justificantes que compongan \ndicha muestra, así como realizar los controles recogidos en cada uno de los planes anuales \nde actuación mencionados en el artículo 85 de la Ley General de Subvenciones.\n5.  El beneficiario de la ayuda deberá reintegrar, en su caso, la parte correspondiente \na los días de ausencia del personal investigador en formación si no hubiera permanecido \nen el centro receptor durante todo el período concedido, así como el exceso entre la \ncantidad concedida en concepto de viaje y la realmente utilizada para tal fin\nArtículo 47.  Seguimiento y control.\n1.  El seguimiento científico-técnico del trabajo realizado por el personal investigador \nen formación corresponde al órgano concedente, que establecerá los procedimientos \nadecuados para ello y que podrá designar los órganos, comisiones o expertos que estime \nnecesarios para realizar las oportunas actuaciones de seguimiento y comprobación de la \naplicación de la ayuda y recabar la presentación de la información complementaria que \nconsidere oportuna.\ncve: BOE-A-2010-1944\n",
  "speaker": "SYSTEM",
  "uuid": "fdb96412-3f08-43ad-b317-cc0c111ae3d9"
}